{
    "source": "3VYj__vmm6Y",
    "youtubelink": "https://www.youtube.com/watch?v=3VYj__vmm6Y",
    "t_english": "- Hi, everyone, Sal here from Khan Academy. And as some of y'all know, I have released my second book, \"Brave New Words\" about the future of AI in education and work. It's available wherever you might buy your books. But as part of the research for that book, I did some interviews with some fascinating people, which you are about to watch. I'm very excited to introduce you to our guest who probably needs no introduction, Bill Gates. Bill, thanks for joining us. - Great to see you. - So I know AI is very front of mind for you. Obviously, all of us at Khan Academy have been thinking a lot about AI in education, and the focus of this is AI in education and work. And I'll start with a question that I'm getting from a lot of teenagers and folks in college and their parents is, given what you know about what's happening in artificial intelligence and maybe in other technology as well, like what advice would you give to someone who's trying to figure out what skills should they focus on or not focus on? What should they major in? What are the jobs gonna look like or not look like? - Well, the AI will make people more productive. And in some cases, like writing software, there's a lot of unmet demand for good software. You can make it higher quality software. Exactly what the job market looks like is very hard to predict, but the deeper skillset, whether it's medical consultation or scientific thinking or customer support, the more value that's gonna have, even in a world where your productivity will be enhanced by having this sort of almost free worker, is looking over your shoulder, giving you advice, giving you lots of feedback on what it is that you're doing. So I don't think there's anything like don't become a barber or a radiologist that we have in mind because the new capabilities are very horizontal in nature. It's not a topic-specific set of advances. - So it's kind of like everyone's gonna have an intern or a research assistant or an analyst. So maybe the answer is don't be the research assistant or the intern or the analyst. Learn to manage them. - Yeah, and of course jobs like helping handicapped, elderly, helping to motivate students, there's such an infinite demand for those things, even in the rich world, but even more dramatically so in developing countries that jobs that require deep human connection and empathy, we'd say it's a long ways off before there's a substitute for those things. We have two revolutions kind of in parallel. We have this ChatGPT-enabled sort of reading and writing white collar enhancement, but in the meantime, people shouldn't underestimate that the blue collar sort of robotics, eventually leading to a humanoid robot, that's quite general purpose in terms of the physical skills, arms, legs, things that it can do, that's also happening. And so the good news is that we're gonna have more leisure time, that a lot of the shortages that we have on medical advice or when we get confused being able to be straightened out. We have this supply of these new capabilities and the unique roles that humans take on or how they'll take their extra spare time and make that fulfilling, those are our challenges. - What you just touched on is interesting, 'cause I think people have always theorized that, hey, we're gonna get more productive, we're gonna be able to do more with less time, and so we'll have more leisure is I think utopian for a lot of folks. But it looks like the patterns of the past, of productivity improvements, or if anything, that the hyper productive are working harder, because they get so much leverage from from every minute that it's not necessarily leading to that. Do you think something's different about this wave where maybe things like the four-day or maybe even eventually a three-day work week will become common? Or do you think people are just gonna be able to do more with less and hire fewer people than they do today? - The analogies from the past are worth understanding, but the changes in the past were generational in nature. So the mechanization of the primary occupation, which was growing food, that happens gradually. And so grandpa was a farmer and your parents less so, and then now, I don't know many rich world farmers. I know a few but not many. And so you didn't have to change mid-career. It is true that demand for things that we wouldn't have expected emerged. And so it's comforting to look at that history, but the total level of capability here and the speed at which it's going to suffuse into the economy and change job markets, five years, the effect will be very substantial. I'd say in 10 years, it's going to be quite dramatic. And so I don't think we can completely dismiss the idea of this change will finally get us to the point where the trade off between labor and leisure actually becomes important. And instead of taxing labor, like with payroll taxes, I called it a robot tax when I talked about it and people thought it was strange, but we'll shift to where we essentially subsidize labor and tax completely on the capital and profit side, which that alone is a pretty big shift that government will need to make. - It's a fascinating idea and it makes a ton of sense, because obviously, if we have a more abundant society, more productive society, but let's take an investment bank or consulting firm. A lot of the traditional work that people are billing and the size of the organization are analysts doing spreadsheets and making PowerPoint presentations. And a lot of that stuff's gonna get automated very fast. And so this is a world where you subsidize these firms to say, \"No, keep hiring interns. Keep hiring these junior analysts.\" So have a sense of purpose as opposed to these young people not having something to do, not building their skillset, and never being able to become the manager. - Yeah, if you get to the extreme where the purpose that jobs provide isn't the central organizing principle of society, then you get into some deep philosophical questions about what should priorities and what is the purpose. In an abstruse way, the Bostrom book \"Superintelligence\" touched on that. I don't really think that's been written about all that well. \"Life 3.0\" did a good job of saying, okay, what is the role of the intelligence in these futuristic scenarios? A lot of new books coming out right now, I've been able to catch up to them all. Probably some of those will be helpful. - I'm interviewing you right now for one of them. (both laughing) - That's right. - And just going back to I guess more basics, so to speak, obviously, a lot of the folk, we talked a little bit about work, but now going back to the core of education, which I know you care deeply about, we've chatted many times about education, right now, there's a bit of an emergency going on in education. People like kids are gonna cheat using this technology. Do you have an answer for, and we're hearing this from every faculty across grade levels. What would you do if you were a history professor or a writing professor at a high school or a college right now? - Well, to have a pure test of somebody's ability to write on their own or calculate on their own, you'll need to create an environment where they don't have access to the software tools. Our efforts to detect whether software has helped you write something will catch the sloppiest sort of the equivalent of cut and paste from Wikipedia. But in the end, we won't be able to tell, because there'll be such a variety of tools and the variety of prompts will make that quite difficult. So the good news here is that for the first time, if you write on a topic, the AI can give you feedback. It can help you with the first draft. It can help compare what you've done to something else. It can create a program of study of things that you might try to write about. And so the level of engagement, where it can help you whenever you're stuck, really is something new. It goes even beyond the fact that there's great YouTube videos about all the sciences and history. This gets into the realm of custom to tutors and feedback on reading and writing. So the paradox that now we have this tool that if you want to learn, it makes it easier, but testing somebody's capability, we're gonna have to use new techniques. And sadly, in some cases, it might make people feel like, \"Wow, if it's so good, do I still need to push myself as hard?\" You and I are saying, both for personal fulfillment and to play a role in contribution in a job market, the higher level your skills are, the more it will retain a substantial value. So helping kids learn how to get feedback on their writing, I think that's imperative, because we do a very poor job of that today. - So what I'm hearing is that not only is there not less of a reason, there's more of a reason to accelerate per the earlier part of our conversation, which is those intern level, entry level things are quickly going to expect you to be more of the architect, more of the editor, more of the manager. And if you can't make that leap sooner than later, the good news is these same tools can be used to do that, which I agree with as well. And obviously, we're working on a lot of that. So if there was a professor, I mean, we get emails from folks, maybe you do too, of like, \"What do I do this fall?\" And it sounds like you would do more in class proctored things for assessment, and would you still do the traditional term paper or would you change the rules of engagement on that? - Well, yes, in the workplace, people are gonna be encouraged to come up with the best product they can where it's them plus the AI. And there's no reason not to have that be one of the skills that you practice is, hey, let's do a business plan. And sure, learn how to use the very best AI tools. But I will view the, if I just have the AI do it without any of your value added, that's gonna be like a C-minus or worse. You have to get in there and bring in a little more accuracy, different sources of knowledge and have unique value add. I mean, you understand the audience that it's going to, it's even hard still for the computer to understand all those different contexts. So yes, you're gonna have two kinds of writing, writing you do completely without the help of the computer and writing you do where you're encouraged to make it be the best assistant possible. - No, that makes sense. We talked to Kevin Roose, who writes for the New York Times, also famously wrote about his interactions with Sydney and all of that. And his point is there's writing and there's journalism. The writing, the AIs are getting very good at, but the journalism, making the contacts, being able to interview people, form bonds, et cetera. And that there's an analog to everything. If you're an entrepreneur, doing user testing, although the AI might be able to do pieces of that. Related to this whole practice feedback, you touched on the word \"assessment.\" I'm curious where you think assessment is going. Obviously, for many years, scalable assessment was fairly limited. Scantron, multiple choice, that's what we did. Because we couldn't do richer assessment, it started to drive what does or does not happen in the classroom. Do you think that's about to change? - Well, there's a controversy over assessment independent of the AI. Should SAP scores be part of college admissions? I do think proving that your math skills and your basic understanding of history and science is strong, that's pretty important. And that when you wanna consolidate knowledge, the fact that you'll be asked very broad questions about it is very motivational to making it accessible. Not just, \"Okay, tomorrow, I'll know it' in a simplistic form, but rather, I know how to access it and combine it with my other knowledge. So I'm still somebody who thinks that tests can help you know where you are in a subject area and it's a meritocratic thing that you really wanna be able to prove that you have some capability. Certainly, when I go to a doctor, I'm glad they've been subject to some examination and test of their competence. Now, dealing with the fact that if you have a disadvantaged background, even if you're on a slope to get really good, that looking at you just at that moment in time maybe shouldn't be directly comparable. That's an interesting challenge. Partly, that's why I love the idea of the computer tutor because it can be encouraging, it can understand what your misconceptions are, and if we can make it available very broadly, it means that the sophistication that, say, my parents provided to me as college graduates is less unique in a world where the AI tutor is super helpful in a huge variety of subjects. But I'll stick up, in many cases, having a objective assessment of your skills, I think it once you move away from that, you're in a very difficult place, even in terms of your own discipline of, do I understand this topic or not? - Yeah, no, I agree. And whenever someone says, \"Oh, I'm against standardized assessment,\" I'm like, \"Which part are you against, the standardized part or the assessment part?\" And it's usually hard for them to be against either of those. But I think what they are implicitly saying is they feel like it's maybe not fully capturing where the student is. There's only certain things you can measure. Maybe it's not capturing their slope. To your point, it's a snapshot in time. Do you think that AI, in the next five years, 10 years might solve this by being able to give richer assessment? And assessment could be where you are in math, it could be where you are in writing. It could even be things like job interviews. That's a form of assessment, career progression. Do you think it's gonna play a big role there? - Well, I think given that we still have certain imperfections in the AI, people can still be skeptical when we say that a interactive assessment with the AI discussing a topic like your understanding of history or economics, that that we can make that equivalent to the very best sort of professor who would engage you deeply. And I think we will get to that level, and that is superior to just a set of standardized questions that you have to have sort of a straightforward answer and your richness of understanding the topic. There are people who are better at multiple choice type questions and test things. I think you and I probably would've done well educationally, but I think partly, we are good at tests, and I felt bad for kids who the test, I could tell they were intimidated when that multiple choice, you have to answer all of these in an hour would come out. So by accommodating a more flexible dialogue, I think different styles of learning will be appreciated. A broader set of skills will be appreciated. But we still have to prove that to people. We're not at that level of matching a great professor discussing a topic with you yet. - And then being able to actually give a good assessment of it. - Exactly. - What we've seen, we can emulate the actual discussion part quite good already. But the strong assessment, I think there's, but probably gonna happen, my guess. - Oh yes, it's gonna happen. I mean, when you have experts who are good at something that's linguistic in nature, and as you gather those data sets and constantly give feedback to them, even with today's mechanisms, which can be improved, but even just with this, we can develop something like a human expert. - And I mean with that, it's funny. I mean, this conversation, as you know, even a year ago would've all seemed like science fiction. And this is all changing so quickly. I feel this way and I feel like I'm in the middle of it, but still, things are changing so fast. You also are probably seeing even more. I wanna ask you a long-term question, 'cause who knows what the world's gonna be like in even 20 years? But let's say five years, which is I think what most people should be kind of planning for in their lives, whether they run a company, whether they're a young person for their career. What do you think the world of education and work is gonna look like? Like paint a picture. Are we gonna be able to have a video conference with, I mean, I don't wanna cloud you, but what would it look like? How's it gonna be dramatically different or not than the world we're in right now? - Well, there'll be a certain set of jobs where just moving documents around and looking at documents, say, accounting or medical claims, where the depth of understanding in those jobs is pretty straightforward. And some of those jobs will just be purely automated. Then there'll be a ton of jobs, where they're still being done by humans, like making greeting cards. And I went back and watched the movie \"Her\" because it raises in a pretty- - I thought greeting cards were definitely gonna be automated, 'cause now you can have mass customization of greeting cards, but anyway. - Yeah, you probably can do it by yourself. Take Dolly 10 and say, \"Hey, here's how I wanna make fun of my sister. Remind her about this thing from the past, and here's some photos to stick in that.\" So yeah, you might eliminate the professional there because you and the AI can do it in a very bespoke way. But there'll be a lot of jobs left that are just more productive, where you have this kind of co-pilot that's taking the, okay, convert the PowerPoint to a Word document, and boom, that draft is available for you to have as the starting point. And so that extra productivity will create new opportunity to take things like medical care and make it better, education and make it better, care of the elderly and make it better. Productivity is a good thing, and people have been bemoaning and there's many books about, oh, we have electricity. And then since then, everything hasn't been quite, at least the way it reflects in economic figures, as dramatic as what happened there. This you will see in the economic figures in a big way, both the robotic side of it and the LLM reading and writing part of it as well. So in five years, we will be in a different space. Hopefully, elections will still be uncontested and deepfakes won't make the problems we already have there even more difficult. It is interesting that government at a time, when it's not as trusted as we'd like, will have to step forward and change tax policies and have retraining policies and be part of the dialogue of setting rules. The entire industry is saying, there's a role for government here, but at a time where trust in that and the divisiveness is very challenging. So I hope that we haven't suffered that much from the negatives in the five-year time period, and by then, society will have reoriented itself and say, \"Okay, how do we avoid this being used as an attack vehicle? How do we make sure it's used in an equitable way?\" Certainly, the dreams I have about health and education in poor countries, I think it'll take us five years to kind of get it out and get into widespread use. Five years is a very short period of time, but it lays a foundation where I hope by being more productive as a society, many of the challenges of aging or climate, people expecting government to do more than it's capable of doing, that we'll say, \"Wow, we're making obesity drugs better. We're making Alzheimer's drugs better.\" And you'll get this sort of positive view of the current system and not making it work better in an incremental way versus the divisiveness or even considering radical alternatives that I think would be pretty scary. So innovation here, because it will surprise people, it's not expected, does have a lot of positive upside. - Yeah, I mean, that leads to the last question, which is, how are you feeling? My view on AI changes almost daily, as I read more and I think more and have conversations like this. Are you feeling net positive? Are you really worried about certain things within your positivity? Are you net negative? How are you feeling about it, and what are the things you're thinking most about? - I'm thrilled that when I sit with the malaria team and we talk about how we're gonna have better ways of killing mosquitoes that these software things can help with, or we sit and talk about kids who've decided they're not good at math, that we haven't made much progress for those kids, just having all the ability to try out their knowledge, that wasn't enough to draw them in. And so that issue of motivation and the fact that AI tutor, one of its excellent things will be understanding the right level, the right encouragement, to make somebody feel like, \"Yeah, this mathematical understanding of the world is something that can work for me and make my life better, even beyond what sort of job opportunities it enables.\" So I'm very thrilled about that. The world that we're delivering it into and its ability to have complex factual debates and different countries try out different regulations, I would say that the political challenge where everyone says government has this big, big role to play, to take advantage of the positives, for example, changing the tax structure, and to mitigate negatives, deepfakes, bias, AI-enabled cyber attacks. Is our governance structures mature enough, agile enough, and can they come to consensus enough that we'll manage this opportunity in a good way? And there are definitely days that I worry the government side of this thing won't step up to what's necessary. - Yeah, well, I could talk to you for several more hours, maybe days about this. But Bill, thanks for taking your time out for this. This is super valuable. - No, it's fun to be on this journey together, and we'll be a great partner and help you realize your vision. - Great, well, we appreciate that so much. It is exciting times. Let's see what happens. (laughs) - All right, thanks. - All right, thanks, Bill.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، سب، سال\nیہاں خان اکیڈمی سے۔ اور جیسا کہ آپ سب جانتے ہیں، میں نے تعلیم اور کام میں\n AI کے مستقبل کے بارے میں اپنی دوسری کتاب \"Brave New Words\" جاری کی ہے۔ یہ دستیاب ہے جہاں سے بھی\nآپ اپنی کتابیں خرید سکتے ہیں۔ لیکن اس کتاب کی تحقیق کے حصے کے طور پر، میں نے کچھ دلچسپ لوگوں کے ساتھ کچھ انٹرویوز کیے\n، جنہیں آپ دیکھنے والے ہیں۔ میں\nآپ کو اپنے مہمان سے متعارف کرانے کے لیے بہت پرجوش ہوں جو شاید کسی\nتعارف کا محتاج نہیں، بل گیٹس۔ بل، ہمارے ساتھ شامل ہونے کا شکریہ۔ - آپ سے مل کر خوشی ہوئی۔ - تو میں جانتا ہوں کہ AI\nآپ کے ذہن کے سامنے ہے۔ ظاہر ہے، خان اکیڈمی میں ہم سب \nتعلیم میں AI کے بارے میں بہت کچھ سوچ رہے ہیں، اور اس کا مرکز\nتعلیم اور کام میں AI ہے۔ اور میں ایک سوال کے ساتھ شروع کروں گا\nجو مجھے کالج میں بہت سے نوعمروں اور لوگوں سے حاصل ہو رہا ہے اور ان کے والدین یہ ہیں کہ آپ کو کیا معلوم ہے کہ مصنوعی ذہانت میں کیا ہو رہا ہے اور شاید دوسری ٹیکنالوجی میں بھی، جیسا کہ آپ کیا مشورہ دیں گے۔  کسی ایسے شخص کو دیں جو یہ جاننے کی کوشش کر رہا ہو کہ انہیں کن مہارتوں پر توجہ مرکوز کرنی چاہیے یا نہیں؟ انہیں کس چیز میں اہم ہونا چاہئے؟ نوکریاں کیسی\nنظر آئیں گی یا نہیں؟ - ٹھیک ہے، AI\nلوگوں کو زیادہ پیداواری بنائے گا۔ اور کچھ معاملات میں، سافٹ ویئر لکھنے کی طرح، \nاچھے سافٹ ویئر کی بہت زیادہ مانگ ہے۔ آپ اسے اعلیٰ معیار کا سافٹ ویئر بنا سکتے ہیں۔ ملازمت کا بازار بالکل کیسا لگتا ہے اس کا اندازہ لگانا بہت مشکل ہے،\nلیکن گہری مہارت، چاہے وہ طبی مشاورت ہو یا سائنسی سوچ ہو\nیا کسٹمر سپورٹ، اس کی اتنی ہی زیادہ اہمیت ہوگی، یہاں تک کہ ایسی دنیا میں بھی جہاں\n اس قسم کے ہونے سے آپ کی پیداواری صلاحیت میں اضافہ ہوگا۔  تقریباً مفت کارکن، آپ کے\nکندھے کو دیکھ رہا ہے، آپ کو مشورہ دے رہا ہے، آپ کو بہت سارے تاثرات دے رہا ہے کہ\nآپ کیا کر رہے ہیں۔ تو مجھے نہیں لگتا کہ\nحجام یا ریڈیولوجسٹ نہ بنو جیسا کچھ بھی ہے جو ہمارے ذہن میں ہے کیونکہ نئی صلاحیتیں\nفطرت میں بہت افقی ہیں۔ یہ پیشرفت کا موضوع کے لحاظ سے مخصوص سیٹ نہیں ہے۔ - تو یہ اس طرح ہے جیسے\nہر ایک کے پاس انٹرن یا ریسرچ اسسٹنٹ یا تجزیہ کار ہوگا۔ تو شاید جواب یہ ہے کہ ریسرچ اسسٹنٹ یا\nانٹرن یا تجزیہ کار نہ بنیں۔ ان کا انتظام کرنا سیکھیں۔ - ہاں، اور یقیناً ملازمتیں\nجیسے معذوروں، بوڑھوں کی مدد کرنا، طلباء کی حوصلہ افزائی میں مدد کرنا، \nان چیزوں کی اتنی لامحدود مانگ ہے، یہاں تک کہ امیر دنیا میں، لیکن اس سے بھی زیادہ ڈرامائی طور پر\n ترقی پذیر ممالک میں ایسی\nملازمتیں جن کے لیے گہرے انسانی تعلق اور ہمدردی کی ضرورت ہوتی ہے۔  ، ہم کہیں گے کہ ان چیزوں کا متبادل موجود ہونے سے پہلے یہ بہت دور ہے۔ \n ہمارے پاس متوازی طرح کے دو انقلابات ہیں۔\n ہمارے پاس یہ چیٹ جی پی ٹی کے ذریعے پڑھنے اور لکھنے کی\nوائٹ کالر انہینسمنٹ ہے، لیکن اس دوران، لوگوں کو اس بات کو\nکم نہیں سمجھنا چاہیے کہ بلیو کالر قسم کی روبوٹکس، جو بالآخر ایک ہیومنائیڈ روبوٹ کی طرف لے جاتی ہے، یہ جسمانی مہارتوں کے لحاظ سے بالکل عمومی مقصد ہے۔ بازو، ٹانگیں، وہ چیزیں جو یہ کر سکتی ہیں، یہ بھی ہو رہا ہے۔ اور اس لیے اچھی خبر یہ ہے\nکہ ہمارے پاس فرصت کا زیادہ وقت ہوگا، وہ\nبہت سی کمی جو ہمارے پاس طبی\nمشورے پر ہے یا جب ہم الجھن میں پڑ جاتے ہیں تو سیدھا کیا جا سکتا ہے۔ ہمارے پاس\nان نئی صلاحیتوں اور منفرد کرداروں کی فراہمی ہے جو انسان ادا کرتے ہیں یا وہ اپنا اضافی وقت کیسے نکالیں گے اور اس کو پورا کریں گے،\nیہ ہمارے چیلنجز ہیں۔ - آپ نے ابھی جس چیز کو چھوا ہے وہ دلچسپ ہے، 'کیونکہ میرے خیال میں لوگوں نے\nہمیشہ یہ نظریہ پیش کیا ہے کہ، ارے، ہم زیادہ پیداواری ہونے والے ہیں، ہم\nکم وقت میں زیادہ کام کرنے کے قابل ہو جائیں گے، اور اس طرح ہمارے پاس زیادہ فرصت ہوگی۔  کیا میں بہت سے لوگوں کے لیے یوٹوپیائی سمجھتا ہوں۔ لیکن یہ\nماضی کے نمونوں کی طرح لگتا ہے، پیداوار میں\nبہتری، یا اگر کچھ بھی ہے، کہ ہائپر پروڈکٹیو زیادہ محنت کر رہے ہیں،\n کیونکہ انہیں\nہر منٹ سے اتنا فائدہ ملتا ہے کہ یہ ضروری نہیں کہ اس کی طرف لے جائے۔ کیا آپ کو لگتا ہے کہ\nاس لہر کے بارے میں کچھ مختلف ہے جہاں شاید چار دن یا آخر کار\nتین دن کا کام کا ہفتہ جیسی چیزیں عام ہو جائیں گی؟ یا کیا آپ کو لگتا ہے کہ لوگ\nصرف کم کے ساتھ زیادہ کرنے کے قابل ہوں گے اور آج کے مقابلے میں کم لوگوں کی خدمات حاصل کریں گے ؟ -\nماضی کی مشابہتیں سمجھنے کے قابل ہیں، لیکن ماضی میں ہونے والی تبدیلیاں\nنسلی نوعیت کی تھیں۔ لہذا بنیادی پیشے کی میکانائزیشن،\n جو خوراک کو بڑھا رہی تھی،\nیہ آہستہ آہستہ ہوتا ہے۔ اور اس لیے دادا ایک کسان تھے\nاور آپ کے والدین کم، اور اب، میں\nدنیا کے بہت سے امیر کسانوں کو نہیں جانتا۔ میں چند کو جانتا ہوں لیکن بہت سے نہیں۔ اور اس لیے آپ کو\nدرمیانی کیریئر کو تبدیل کرنے کی ضرورت نہیں تھی۔ یہ سچ ہے کہ ایسی چیزوں کی مانگ ابھری جس کی ہمیں توقع نہیں تھی۔ اور اس لیے\nاس تاریخ کو دیکھنا تسلی بخش ہے، لیکن یہاں صلاحیت کی کل سطح اور جس رفتار سے یہ معیشت میں گھسنے والی ہے اور ملازمت کی منڈیوں کو تبدیل کرنے جا رہی ہے، پانچ سال، اس کا اثر بہت زیادہ ہوگا۔ میں 10 سالوں میں کہوں گا، یہ\nکافی ڈرامائی ہونے والا ہے۔ اور اس لیے مجھے نہیں لگتا کہ ہم اس تبدیلی کے خیال کو\nمکمل طور پر مسترد کر سکتے ہیں \nآخر کار ہمیں اس مقام پر لے جائے گا جہاں\nمزدوری اور تفریح ​​کے درمیان تجارت درحقیقت اہم ہو جاتی ہے۔ اور لیبر پر ٹیکس لگانے کے بجائے،\nجیسے پے رول ٹیکس کے ساتھ، میں نے اسے روبوٹ ٹیکس کہا\nجب میں نے اس کے بارے میں بات کی اور لوگوں نے سوچا کہ یہ عجیب ہے، لیکن ہم وہاں منتقل ہو جائیں گے جہاں\nہم بنیادی طور پر لیبر کو سبسڈی دیتے ہیں اور\nسرمایہ اور منافع کی طرف مکمل طور پر ٹیکس دیتے ہیں، جو کہ اکیلے ایک بہت بڑی تبدیلی ہے جسے حکومت کو بنانے کی ضرورت ہوگی۔ - یہ ایک دلچسپ خیال ہے\nاور یہ بہت معنی رکھتا ہے، کیونکہ ظاہر ہے، اگر ہمارے\nپاس زیادہ پرچر معاشرہ ہے، زیادہ پیداواری معاشرہ ہے، لیکن آئیے ایک سرمایہ کاری\nبینک یا مشاورتی فرم لیں۔ بہت سارے روایتی\nکام جن کا لوگ بلنگ کر رہے ہیں اور تنظیم کا سائز تجزیہ کار اسپریڈ شیٹ کر رہے ہیں اور پاورپوائنٹ پریزنٹیشنز بنا رہے ہیں۔ اور اس میں سے بہت ساری چیزیں\nبہت تیزی سے خودکار ہو جائیں گی۔ اور اس لیے یہ ایک ایسی دنیا ہے جہاں\nآپ ان فرموں کو یہ کہنے کے لیے سبسڈی دیتے ہیں، \"نہیں، انٹرنز کی خدمات حاصل کرتے رہیں۔ ان جونیئر تجزیہ کاروں کی خدمات حاصل کرتے رہیں۔\" لہذا مقصد کا احساس رکھیں کیونکہ ان نوجوانوں کے پاس\nکرنے کے لیے کچھ نہیں ہے، اپنی مہارت کی تعمیر نہیں ہے، اور کبھی بھی\nمینیجر بننے کے قابل نہیں ہے۔ - ہاں، اگر آپ اس حد تک پہنچ جاتے ہیں جہاں ملازمتیں فراہم کرنے کا مقصد معاشرے کا مرکزی تنظیمی اصول نہیں ہے،\n تو آپ کچھ گہرے\nفلسفیانہ سوالات میں پڑ جائیں گے کہ ترجیحات کیا ہونی چاہئیں\nاور مقصد کیا ہے۔ ایک غیر واضح انداز میں، بوسٹرم کی کتاب\n\"سپر انٹیلیجنس\" نے اس کو چھوا۔ مجھے نہیں لگتا\nکہ اس سب کے بارے میں اچھی طرح سے لکھا گیا ہے۔ \"Life 3.0\" نے یہ کہہ کر اچھا کام کیا، ٹھیک ہے، ان مستقبل کے منظرناموں میں ذہانت کا کیا کردار ہے؟ ابھی بہت ساری نئی کتابیں سامنے آ رہی ہیں، میں ان سب کو پکڑنے میں کامیاب رہا ہوں۔ شاید ان میں سے کچھ مددگار ثابت ہوں گے۔ - میں\nابھی ان میں سے ایک کے لیے آپ کا انٹرویو کر رہا ہوں۔ (دونوں ہنستے ہوئے)\n- یہ ٹھیک ہے۔ - اور صرف واپس جا کر مجھے\nمزید بنیادی باتوں کا اندازہ ہے، تو ظاہر ہے کہ بہت سارے لوگوں نے، ہم نے کام کے بارے میں تھوڑی سی بات کی، لیکن اب\nتعلیم کے بنیادی حصے کی طرف واپس جا رہے ہیں، جس کے بارے میں میں جانتا ہوں کہ آپ کو بہت زیادہ خیال ہے، ہم  'تعلیم کے بارے میں کئی بار بات چیت کی ہے، ابھی، تعلیم میں ایک ہنگامی صورتحال چل رہی ہے۔ بچوں جیسے لوگ\nاس ٹیکنالوجی کا استعمال کرتے ہوئے دھوکہ دینے والے ہیں۔ کیا آپ کے پاس اس کا جواب ہے، اور ہم اسے گریڈ لیول کے ہر فیکلٹی سے سن رہے ہیں۔ اگر آپ ابھی\n کسی ہائی اسکول یا کالج میں تاریخ کے پروفیسر یا رائٹنگ کے پروفیسر ہوتے تو آپ کیا کریں گے ؟ - ٹھیک ہے،\nکسی کی خود سے لکھنے یا\nخود ہی حساب لگانے کی صلاحیت کا خالص امتحان لینے کے لیے، آپ کو ایسا ماحول بنانا ہوگا جہاں انہیں\nسافٹ ویئر ٹولز تک رسائی حاصل نہ ہو۔  اس بات کا پتہ لگانے کی ہماری کوششیں کہ آیا سافٹ ویئر نے آپ کو کچھ لکھنے میں مدد کی ہے وہ\n \nویکیپیڈیا سے کٹ اور پیسٹ کے مساوی ترین قسم کو پکڑے گی۔ لیکن آخر میں، ہم بتانے کے قابل نہیں ہوں گے، کیونکہ\nاس طرح کے بہت سے ٹولز ہوں گے اور پرامپٹ کی مختلف قسمیں\nاسے کافی مشکل بنا دیں گی۔ تو یہاں اچھی خبر یہ ہے کہ\nپہلی بار، اگر آپ کسی موضوع پر لکھتے ہیں، تو\nAI آپ کو رائے دے سکتا ہے۔ یہ پہلے مسودے میں آپ کی مدد کر سکتا ہے۔ یہ آپ نے جو کچھ کیا ہے اس کا موازنہ کسی اور چیز سے کرنے میں مدد کر سکتا ہے۔\n یہ ان چیزوں کے مطالعہ کا پروگرام بنا سکتا ہے جن کے\nبارے میں آپ لکھنے کی کوشش کر سکتے ہیں۔ اور اس طرح مصروفیت کی سطح، جہاں یہ آپ کی مدد کر سکتی ہے\nجب بھی آپ پھنس جاتے ہیں، واقعی کچھ نیا ہے۔ یہ اس حقیقت سے بھی آگے ہے کہ تمام علوم اور تاریخ کے بارے میں زبردست YouTube ویڈیوز موجود ہیں۔ یہ ٹیوٹرز کو اپنی مرضی کے مطابق کرنے اور\nپڑھنے اور لکھنے کے بارے میں تاثرات کے دائرے میں آتا ہے۔ تو یہ تضاد کہ اب ہمارے پاس یہ ٹول ہے کہ اگر آپ\nسیکھنا چاہتے ہیں تو یہ آسان بناتا ہے، لیکن کسی کی صلاحیت کو جانچنے کے لیے ہمیں نئی ​​تکنیکوں کا استعمال کرنا پڑے گا۔ اور افسوس کی بات ہے، کچھ معاملات میں، یہ\nلوگوں کو ایسا محسوس کر سکتا ہے، \"واہ، اگر یہ بہت اچھا ہے، تو کیا مجھے اب بھی خود کو اتنا ہی سخت کرنے کی ضرورت ہے؟\" آپ اور میں کہہ رہے ہیں، دونوں\nذاتی تکمیل کے لیے اور\nملازمت کے بازار میں شراکت میں کردار ادا کرنے کے لیے، آپ کی مہارتیں جتنی بلند ہوں گی، اتنی ہی زیادہ اس کی اہمیت برقرار رہے گی۔\n لہذا بچوں کو\nان کی تحریر پر رائے حاصل کرنے کا طریقہ سیکھنے میں مدد کرنا، میرے خیال میں یہ ضروری ہے، کیونکہ\nآج ہم اس کا بہت ہی ناقص کام کر رہے ہیں۔ - تو جو میں سن رہا ہوں وہ یہ ہے\nکہ نہ صرف اس کی کوئی وجہ کم نہیں ہے بلکہ\n ہماری گفتگو کے پہلے حصے کے مطابق تیز ہونے کی اور بھی ایک وجہ ہے، جو کہ وہ انٹرن\nلیول ہے، داخلے کی سطح کی چیزیں جلد ہی آپ سے توقع کرنے والی ہیں۔\nمعمار زیادہ، ایڈیٹر زیادہ، مینیجر زیادہ۔ اور اگر آپ اس\nچھلانگ کو جلد از جلد نہیں بنا سکتے تو اچھی خبر یہ ہے کہ انہی\nٹولز کو ایسا کرنے کے لیے استعمال کیا جا سکتا ہے، جس سے میں بھی متفق ہوں۔ اور ظاہر ہے، ہم اس میں سے\nبہت کچھ پر کام کر رہے ہیں۔ تو اگر کوئی پروفیسر تھا، میرا مطلب ہے، ہمیں لوگوں کی طرف سے ای میلز موصول ہوتی ہیں،\nشاید آپ بھی ایسا کریں، جیسے، \"میں اس موسم خزاں میں کیا کروں؟\" اور ایسا لگتا ہے کہ آپ\n تشخیص کے لیے کلاس پراکٹرڈ چیزوں میں زیادہ کام کریں گے، اور کیا آپ اب بھی\nروایتی ٹرم پیپر کریں گے یا\nاس پر مصروفیت کے اصولوں کو تبدیل کریں گے؟ - ٹھیک ہے، ہاں، کام کی جگہ پر، لوگوں کی حوصلہ افزائی کی جائے گی کہ وہ بہترین پروڈکٹ لے کر آئیں جہاں وہ ان کے علاوہ AI بھی ہو سکتے ہیں۔ اور اس کی کوئی وجہ نہیں ہے کہ یہ ان مہارتوں میں سے ایک ہے\nجس پر آپ مشق کرتے ہیں، ارے، آئیے ایک کاروباری منصوبہ بنائیں۔ اور یقینی طور پر، بہترین AI ٹولز استعمال کرنے کا طریقہ سیکھیں۔\n لیکن میں دیکھوں گا، اگر\nمیرے پاس صرف AI ہے تو آپ کی کوئی ویلیو ایڈڈ کیے بغیر، یہ سی مائنس یا اس سے بھی بدتر ہوگا۔ آپ کو وہاں جانا ہوگا اور تھوڑی زیادہ درستگی، علم کے مختلف ذرائع اور منفرد ویلیو ایڈ لانا ہوگا۔ میرا مطلب ہے، آپ\nسامعین کو سمجھتے ہیں کہ یہ جا رہا ہے، کمپیوٹر کے لیے ان تمام\nمختلف سیاق و سباق کو سمجھنا اب بھی مشکل ہے۔ تو ہاں، آپ کے پاس\nدو قسم کی تحریریں ہوں گی، لکھنا آپ مکمل طور پر\nکمپیوٹر کی مدد کے بغیر کرتے ہیں اور لکھنا جہاں آپ کو بہترین اسسٹنٹ بنانے کی ترغیب دی جاتی ہے۔ - نہیں، یہ سمجھ میں آتا ہے. ہم نے کیون روز سے بات کی، جو نیویارک ٹائمز کے لیے لکھتے ہیں، سڈنی کے ساتھ اپنی بات چیت\nاور ان سب کے بارے میں بھی مشہور لکھا۔ اور اس کی بات یہ ہے کہ\nلکھنا ہے اور صحافت ہے۔ تحریر، AIs\nمیں بہت اچھا ہو رہا ہے، لیکن صحافت، رابطے بنانا، لوگوں سے انٹرویو کرنے کے قابل ہونا\n، بانڈز بنانا، وغیرہ۔ اور یہ کہ ہر چیز کا ایک ینالاگ ہوتا ہے۔ اگر آپ ایک کاروباری ہیں،\nصارف کی جانچ کر رہے ہیں، حالانکہ AI\nاس کے ٹکڑے کرنے کے قابل ہو سکتا ہے۔ اس پورے مشق کے تاثرات سے متعلق، آپ نے لفظ \"تشخیص\" کو چھوا ہے۔ میں متجسس ہوں کہ آپ کے\nخیال میں تشخیص کہاں جا رہا ہے۔ ظاہر ہے، کئی سالوں سے، توسیع پذیر تشخیص کافی حد تک محدود تھا۔ سکینٹرون، ایک سے زیادہ انتخاب،\nہم نے یہی کیا۔ چونکہ ہم بہتر تشخیص نہیں کر سکتے تھے، اس نے \nکلاس روم میں کیا ہوتا ہے اور کیا نہیں ہوتا اس کو چلانا شروع کر دیا۔ کیا آپ کو لگتا ہے کہ یہ تبدیل ہونے والا ہے؟ - ٹھیک ہے، AI سے آزاد\nتشخیص پر ایک تنازعہ ہے۔  کیا SAP اسکورز کو\nکالج کے داخلوں کا حصہ ہونا چاہیے؟ میرے خیال میں یہ ثابت کرنا کہ آپ کی ریاضی کی مہارت اور تاریخ اور سائنس کے بارے میں آپ کی بنیادی سمجھ مضبوط ہے، یہ بہت اہم ہے۔ اور یہ کہ جب آپ\nعلم کو مستحکم کرنا چاہتے ہیں، تو یہ حقیقت کہ آپ سے\nاس کے بارے میں بہت وسیع سوالات پوچھے جائیں گے، یہ \nاسے قابل رسائی بنانے کے لیے بہت محرک ہے۔ نہ صرف، \"ٹھیک ہے، کل، میں اسے ایک سادہ شکل میں جان لوں گا،\nبلکہ، میں جانتا ہوں کہ اس تک کیسے رسائی حاصل کرنا ہے اور اسے اپنے دوسرے علم کے ساتھ جوڑنا ہے۔ اس لیے میں اب بھی کوئی ایسا شخص ہوں جو یہ سمجھتا ہے کہ ٹیسٹ آپ کو جاننے میں مدد کر سکتے ہیں۔\nجہاں آپ سبجیکٹ کے شعبے میں ہیں اور یہ ایک قابل قدر چیز ہے کہ آپ واقعی یہ ثابت کرنا چاہتے ہیں کہ آپ میں کچھ صلاحیت ہے، جب میں ڈاکٹر کے پاس جاتا ہوں، تو مجھے خوشی ہوتی ہے کہ وہ\nکچھ امتحان اور ٹیسٹ کے تابع رہے ہیں۔  اب ان کی قابلیت، اس حقیقت سے نمٹنا کہ اگر آپ کا\nپس منظر خراب ہے، یہاں تک کہ اگر آپ\nواقعی اچھے ہونے کے لیے ہیں، تو اس وقت آپ کی طرف دیکھنا\n شاید اس کا براہ راست موازنہ نہیں ہونا چاہیے۔ دلچسپ چیلنج جزوی طور پر، اسی لیے مجھے\nکمپیوٹر ٹیوٹر کا آئیڈیا پسند ہے کیونکہ یہ حوصلہ افزا ہو سکتا ہے، یہ سمجھ سکتا ہے کہ\nآپ کی غلط فہمیاں کیا ہیں، اور اگر ہم اسے\nبہت وسیع پیمانے پر دستیاب کر سکتے ہیں، تو اس کا مطلب یہ ہے کہ میرے والدین کا\nکہنا ہے کہ نفاست۔ \nکالج کے فارغ التحصیل ہونے کے ناطے مجھے فراہم کردہ دنیا میں کم منفرد ہے\nجہاں AI ٹیوٹر مضامین کی ایک بہت بڑی قسم میں بہت مددگار ہے۔\n لیکن میں قائم رہوں گا، بہت سے معاملات میں، \nآپ کی مہارتوں کا معروضی جائزہ لینے کے بعد، مجھے لگتا ہے کہ ایک بار جب آپ اس سے ہٹ جائیں گے، تو آپ ایک بہت مشکل جگہ پر ہیں، یہاں تک کہ آپ کے اپنے نظم و ضبط کے لحاظ سے بھی، کیا میں سمجھتا ہوں  یہ موضوع ہے یا نہیں؟ - ہاں، نہیں، میں اتفاق کرتا ہوں۔ اور جب بھی کوئی کہتا ہے، \"اوہ، میں معیاری تشخیص کے خلاف ہوں،\" میں اس طرح ہوں، \"آپ کس حصے کے خلاف ہیں، معیاری حصہ\nیا تشخیصی حصہ؟\" اور عام طور پر ان کے لیے ان میں سے کسی ایک کے خلاف ہونا مشکل ہوتا ہے۔ لیکن مجھے لگتا ہے کہ وہ جو\nواضح طور پر کہہ رہے ہیں وہ یہ ہے کہ وہ ایسا محسوس کر رہے ہیں کہ\nشاید یہ پوری طرح سے گرفت نہیں کر رہا ہے کہ طالب علم کہاں ہے۔ صرف کچھ\nچیزیں ہیں جن کی آپ پیمائش کر سکتے ہیں۔ شاید یہ ان کی ڈھلوان پر قبضہ نہیں کر رہا ہے۔ آپ کی بات کے مطابق، یہ وقت کا ایک سنیپ شاٹ ہے۔ کیا آپ کو لگتا ہے کہ AI،\nاگلے پانچ سالوں میں، 10 سالوں میں اس کو بہتر تشخیص دینے کے قابل ہو کر حل کر سکتا ہے؟ اور اندازہ ہو سکتا ہے کہ\nآپ ریاضی میں کہاں ہیں، یہ وہ جگہ ہو سکتا ہے جہاں آپ تحریری طور پر ہیں۔ یہ نوکری کے انٹرویو جیسی چیزیں بھی ہوسکتی ہیں۔\n یہ تشخیص کی ایک شکل ہے،\nکیریئر کی ترقی۔ کیا آپ کو لگتا ہے کہ یہ\nوہاں ایک بڑا کردار ادا کرے گا؟ - ٹھیک ہے، مجھے لگتا ہے کہ ہمارے پاس اب بھی AI میں کچھ خامیاں ہیں، لوگ اب بھی شکوک کا شکار ہو سکتے ہیں جب ہم کہتے ہیں کہ AI کے ساتھ ایک انٹرایکٹو تشخیص کسی موضوع پر بحث کرتا ہے جیسے آپ کی\nتاریخ یا معاشیات کی سمجھ، کہ ہم اسے اس کے برابر بنا سکتے ہیں۔  ایک بہترین قسم کا پروفیسر جو آپ کو گہرائی سے منسلک کرے گا۔ اور مجھے لگتا ہے کہ ہم اس سطح تک پہنچ جائیں گے، اور یہ صرف معیاری سوالات کے ایک سیٹ سے بہتر ہے\n جس کا آپ کے پاس سیدھا\nسادا جواب اور موضوع کو سمجھنے کی آپ کی بھرپور صلاحیت ہے۔  ایسے\n لوگ ہیں جو ایک سے زیادہ پسند کے\nسوالات اور جانچ کی چیزوں میں بہتر ہیں۔ مجھے لگتا ہے کہ آپ اور میں نے شاید\nتعلیمی طور پر اچھی کارکردگی کا مظاہرہ کیا ہوگا، لیکن مجھے لگتا ہے کہ جزوی طور پر، ہم ٹیسٹوں میں اچھے ہیں، اور میں نے ان بچوں کے لیے برا محسوس کیا جو ٹیسٹ کرتے ہیں، میں بتا سکتا ہوں کہ جب وہ ایک سے زیادہ انتخاب کرتے ہیں، تو آپ کو سب کا جواب دینا ہوگا۔  ان میں سے\nایک گھنٹے میں باہر آجائے گا۔ لہذا\nزیادہ لچکدار مکالمے کو ایڈجسٹ کرنے سے، میرے خیال میں سیکھنے کے مختلف انداز کو\nسراہا جائے گا۔ مہارت کے ایک وسیع سیٹ کو\nسراہا جائے گا۔ لیکن ہمیں اب بھی لوگوں کے سامنے یہ ثابت کرنا ہے۔ ہم ابھی تک آپ کے ساتھ کسی موضوع پر گفتگو کرنے والے ایک عظیم پروفیسر سے مماثل نہیں ہیں۔\n - اور پھر حقیقت میں اس کا ایک اچھا اندازہ دینے کے قابل ہونا۔ - بالکل\n- جو ہم نے دیکھا ہے، ہم اصل بحث کے حصے کو پہلے ہی بہت اچھے طریقے سے نقل کر سکتے ہیں۔ لیکن مضبوط تشخیص،\nمجھے لگتا ہے کہ وہاں ہے، لیکن شاید ہونے والا ہے، میرا اندازہ ہے۔ - اوہ ہاں، یہ ہونے والا ہے۔ میرا مطلب ہے، جب آپ کے پاس ایسے ماہرین ہوں\nجو لسانی نوعیت کی کسی چیز میں اچھے ہوں، اور جیسا کہ آپ ان ڈیٹا سیٹس کو اکٹھا کرتے ہیں اور انہیں مسلسل فیڈ بیک دیتے ہیں، یہاں تک کہ آج کے میکانزم کے ساتھ، جس میں\nبہتری لائی جا سکتی ہے، لیکن صرف اس کے ساتھ، ہم ترقی کر سکتے ہیں۔\nایک انسانی ماہر کی طرح کچھ. - اور میرا مطلب ہے کہ یہ مضحکہ خیز ہے۔ میرا مطلب ہے، یہ گفتگو، جیسا کہ آپ جانتے ہیں، یہاں تک کہ ایک سال پہلے بھی\nسائنس فکشن کی طرح لگتا تھا۔ اور یہ سب اتنی تیزی سے بدل رہا ہے۔ میں اس طرح محسوس کرتا ہوں اور مجھے ایسا لگتا ہے\nجیسے میں اس کے بیچ میں ہوں، لیکن پھر بھی، چیزیں اتنی تیزی سے بدل رہی ہیں۔ آپ شاید اس سے بھی زیادہ دیکھ رہے ہیں۔ میں آپ سے ایک طویل مدتی سوال پوچھنا چاہتا ہوں، 'کیونکہ کون جانتا ہے کہ\n 20 سالوں میں بھی دنیا کیسی ہونے والی ہے؟ لیکن آئیے پانچ سال کہتے ہیں،\nمیرے خیال میں زیادہ تر لوگوں کو اپنی زندگی میں کس طرح کی منصوبہ بندی کرنی چاہیے،\n چاہے وہ کمپنی چلا رہے ہوں، چاہے وہ\nاپنے کیریئر کے لیے نوجوان ہوں۔ آپ کے خیال میں تعلیم اور کام کی دنیا کیسی نظر آئے گی؟ جیسے تصویر پینٹ کریں۔ کیا ہم اس کے\nساتھ ویڈیو کانفرنس کرنے کے قابل ہو جائیں گے، میرا مطلب ہے، میں آپ کو بادل نہیں بنانا چاہتا، لیکن یہ کیسا نظر آئے گا؟ یہ کس طرح\nڈرامائی طور پر مختلف ہوگا یا اس دنیا سے نہیں جس میں ہم ابھی ہیں؟ - ٹھیک ہے، نوکریوں کا ایک مخصوص سیٹ ہوگا جہاں صرف دستاویزات کو ادھر\nادھر گھومنا اور دستاویزات کو دیکھنا، کہتے ہیں، اکاؤنٹنگ یا طبی دعوے، جہاں\nان ملازمتوں میں تفہیم کی گہرائی بہت سیدھی ہے۔ اور ان میں سے کچھ ملازمتیں\nمکمل طور پر خودکار ہوں گی۔  اس کے بعد ایک ٹن نوکریاں ہوں گی، جہاں وہ اب بھی انسان کر رہے ہیں، جیسے گریٹنگ کارڈ بنانا۔ اور میں نے واپس جا کر\nفلم \"Her\" دیکھی کیونکہ یہ ایک خوبصورت انداز میں ابھرتی ہے- میں نے سوچا کہ گریٹنگ کارڈز یقینی طور پر خودکار ہونے والے ہیں، کیونکہ اب آپ گریٹنگ کارڈز کی بڑے پیمانے پر تخصیص کر سکتے ہیں، لیکن بہرحال۔ - ہاں، آپ شاید یہ\nخود کر سکتے ہیں۔ ڈولی 10 لیں اور بولیں، \"ارے، یہاں میں\nاپنی بہن کا مذاق اڑانا چاہتا ہوں۔ اسے ماضی کی اس چیز کے بارے میں یاد دلائیں، اور اس پر قائم رہنے کے لیے کچھ تصاویر یہ ہیں۔\" تو ہاں، ہو سکتا ہے کہ آپ\nوہاں کے پروفیشنل کو ختم کر دیں کیونکہ آپ اور AI\nاسے بہت بہتر انداز میں کر سکتے ہیں۔ لیکن بہت ساری ملازمتیں باقی رہ جائیں گی جو کہ زیادہ نتیجہ خیز ہیں، جہاں آپ کے پاس اس قسم کا کو-پائلٹ ہے جو لے رہا ہے، ٹھیک ہے،\nپاورپوائنٹ کو ورڈ دستاویز میں تبدیل کریں، اور\nبوم، وہ مسودہ آپ کے لیے دستیاب ہے۔ نقطہ آغاز کے طور پر. اور اس طرح اضافی پیداواریت طبی دیکھ بھال اور اسے بہتر بنانے، تعلیم اور اسے بہتر بنانے، بزرگوں کی دیکھ بھال اور اسے بہتر بنانے جیسی چیزوں کو لینے کے نئے مواقع پیدا کرے گی۔ پیداواریت ایک اچھی چیز ہے، اور لوگ ماتم کر رہے ہیں اور اس بارے میں بہت سی کتابیں ہیں، اوہ، ہمارے پاس بجلی ہے۔ اور پھر اس کے بعد سے،\nسب کچھ بالکل ٹھیک نہیں ہے، کم از کم جس طرح سے یہ\nمعاشی اعداد و شمار میں جھلکتا ہے، اتنا ہی ڈرامائی ہے جتنا وہاں ہوا تھا۔ یہ آپ\nمعاشی اعداد و شمار میں بڑے پیمانے پر دیکھیں گے، اس کا روبوٹک پہلو اور ایل ایل ایم پڑھنا اور لکھنا بھی۔ تو پانچ سالوں میں، ہم\nایک مختلف جگہ پر ہوں گے۔ امید ہے کہ انتخابات\nاب بھی بلا مقابلہ ہوں گے اور ڈیپ فیکس ان مسائل کو مزید مشکل نہیں بنائیں گے جو\nہمارے پاس پہلے سے موجود ہیں۔ یہ دلچسپ بات ہے کہ\nحکومت کو ایک ایسے وقت میں، جب اس پر اتنا بھروسہ نہیں ہے جتنا ہم چاہتے ہیں، اسے آگے بڑھنا ہوگا\nاور ٹیکس کی پالیسیوں کو تبدیل کرنا ہوگا اور اسے دوبارہ تربیت دینے والی پالیسیاں بنانا ہوں گی اور\nقواعد طے کرنے کے مکالمے کا حصہ بننا ہوگا۔ پوری انڈسٹری کہہ رہی ہے، یہاں حکومت کا کردار ہے، لیکن ایک ایسے وقت میں جہاں اس پر بھروسہ اور تفرقہ بازی بہت مشکل ہے۔ لہذا میں امید کرتا ہوں کہ پانچ سال کے عرصے میں ہمیں منفی اثرات سے\nاتنا نقصان نہیں اٹھانا پڑا ہے، \n اور اس وقت تک، معاشرہ\nخود کو نئے سرے سے ترتیب دے چکا ہو گا اور کہے گا، \"ٹھیک ہے، ہم اسے\nحملے کی گاڑی کے طور پر استعمال ہونے سے کیسے بچ سکتے ہیں؟  کیا ہم اس بات کو یقینی بناتے ہیں کہ اسے\nمساوی طریقے سے استعمال کیا جائے؟\" یقینی طور پر، غریب ممالک میں صحت اور تعلیم کے بارے میں میرے جو خواب ہیں، میرے خیال میں اسے پورا کرنے اور\nوسیع پیمانے پر استعمال میں لانے میں ہمیں پانچ سال لگیں گے۔ پانچ سال ایک بہت ہی مختصر عرصہ ہوتا ہے، لیکن یہ ایک ایسی بنیاد رکھتا ہے جہاں میں امید کرتا ہوں کہ ایک معاشرے کے طور پر زیادہ پیداواری ہو کر، \nعمر رسیدہ یا آب و ہوا کے بہت سے چیلنجز، لوگ حکومت سے توقع کرتے ہیں کہ وہ اس کی صلاحیت سے کہیں زیادہ کام کرے گی،\nکہ ہم'  کہیں گے، \"واہ، ہم موٹاپے کی دوائیں بہتر بنا رہے ہیں۔ ہم الزائمر کی دوائیوں کو بہتر بنا رہے ہیں۔\" اور آپ کو موجودہ نظام کے بارے میں اس طرح کا مثبت نظریہ ملے گا اور\nاس کو تفرقہ بازی کے مقابلے میں بڑھتے ہوئے انداز میں بہتر طریقے سے کام نہ کرنا\n یا یہاں تک کہ بنیاد پرست متبادلات پر غور کرنا جو میرے خیال میں بہت خوفناک ہوگا۔ اس لیے یہاں کی جدت، کیونکہ\nیہ لوگوں کو حیران کر دے گی، اس کی توقع نہیں ہے، اس میں بہت زیادہ\nمثبت پہلو ہے۔ - ہاں، میرا مطلب ہے، یہ آخری سوال کی طرف لے جاتا ہے،\n جو کہ، آپ کیسا محسوس کر رہے ہیں؟ AI پر میرا نظریہ تقریباً روزانہ بدلتا ہے، کیونکہ میں زیادہ پڑھتا ہوں اور میں زیادہ سوچتا ہوں اور اس طرح کی گفتگو کرتا ہوں۔  کیا آپ خالص مثبت محسوس کر رہے ہیں؟  کیا آپ واقعی\n اپنی مثبتیت کے اندر کچھ چیزوں کے بارے میں فکر مند ہیں؟  کیا آپ خالص منفی ہیں؟ آپ اس کے بارے میں کیسا محسوس کر رہے ہیں، اور کن چیزوں کے\nبارے میں آپ سب سے زیادہ سوچ رہے ہیں؟ - مجھے خوشی ہوتی ہے کہ جب میں\nملیریا ٹیم کے ساتھ بیٹھتا ہوں اور ہم اس بارے میں بات کرتے ہیں کہ ہمارے پاس مچھروں کو مارنے کے بہتر طریقے کیسے ہوں گے جن سے یہ سافٹ ویئر مدد کر سکتے ہیں، یا ہم بیٹھ کر ان بچوں کے بارے میں بات کرتے ہیں جنہوں نے فیصلہ کیا ہے کہ وہ  ریاضی میں اچھا نہیں ہے، کہ ہم نے\nان بچوں کے لیے زیادہ ترقی نہیں کی ہے، صرف\nان کے علم کو آزمانے کی پوری صلاحیت رکھتے ہیں، جو انھیں اپنی طرف متوجہ کرنے کے لیے کافی نہیں تھا۔ \nاس کی بہترین چیزوں میں سے ایک صحیح سطح کو سمجھنا، صحیح حوصلہ افزائی کرنا،\nکسی کو یہ محسوس کرنا ہو گا کہ \"جی ہاں،\nدنیا کی یہ ریاضیاتی سمجھ ایک ایسی چیز ہے جو میرے لیے کام کر سکتی ہے\nاور میری زندگی کو بہتر بنا سکتی ہے، یہاں تک کہ کس قسم کی  ملازمت کے\nمواقع یہ قابل بناتا ہے۔\" تو میں اس کے بارے میں بہت پرجوش ہوں۔ جس دنیا میں ہم اسے پہنچا رہے ہیں اور اس کی\nپیچیدہ حقائق پر مبنی بحثیں کرنے کی صلاحیت اور مختلف ممالک\nمختلف ضوابط کو آزماتے ہیں، میں یہ کہوں گا کہ سیاسی چیلنج جہاں ہر کوئی کہتا ہے کہ حکومت کو یہ بڑا، بڑا کردار ادا کرنا ہے، اس سے فائدہ اٹھانا۔  مثبت، مثال کے طور پر، ٹیکس کے ڈھانچے کو تبدیل کرنا، اور منفی، ڈیپ فیکس، تعصب، AI سے چلنے والے سائبر حملوں کو کم کرنا۔ کیا ہمارے حکمرانی کے ڈھانچے\nکافی پختہ، کافی چست ہیں، اور کیا وہ اس بات پر اتفاق رائے پر پہنچ سکتے ہیں کہ ہم اس\nموقع کو اچھے طریقے سے سنبھالیں گے؟ اور یقینی طور پر ایسے دن ہیں جب مجھے خدشہ ہے کہ اس چیز کا حکومتی پہلو اس چیز کی طرف نہیں بڑھے گا جو ضروری ہے۔ - ہاں، ٹھیک ہے، میں\nآپ سے مزید کئی گھنٹے بات کر سکتا ہوں، شاید کچھ دن اس بارے میں۔ لیکن بل،\nاس کے لیے اپنا وقت نکالنے کا شکریہ۔ یہ انتہائی قیمتی ہے۔ - نہیں، اس سفر پر اکٹھے رہنا مزہ ہے،\n اور ہم ایک بہترین پارٹنر بنیں گے اور آپ کے وژن کو سمجھنے میں آپ کی مدد کریں گے۔ - بہت اچھا، ٹھیک ہے، ہم اس کی بہت تعریف کرتے ہیں۔ یہ دلچسپ اوقات ہے۔ آئیے دیکھیں کیا ہوتا ہے۔  (ہنستا ہے) - ٹھیک ہے، شکریہ۔ - ٹھیک ہے، شکریہ، بل.",
    "t_spanish": "- Hola a todos,\naquí Sal de Khan Academy. Y como algunos de ustedes saben,\npubliqué mi segundo libro, \"Brave New Words\" sobre el futuro de la IA en la educación y el trabajo. Está disponible dondequiera que\npueda comprar sus libros. Pero como parte de la investigación para ese libro, hice algunas entrevistas con\npersonas fascinantes, que estás a punto de ver. Estoy muy emocionado de\npresentarles a nuestro invitado que probablemente no necesita\npresentación, Bill Gates. Bill, gracias por acompañarnos. - Qué bueno verte. - Entonces sé que la IA es una\nprioridad para ti. Obviamente, todos nosotros en Khan Academy hemos estado pensando mucho\nen la IA en la educación, y el enfoque de esto es la\nIA en la educación y el trabajo. Y comenzaré con una\npregunta que me hacen muchos adolescentes y personas en la universidad y sus padres: dado lo que saben sobre lo que está sucediendo en la inteligencia artificial y tal vez también en otras tecnologías, ¿ qué consejo les darían?  ¿Darle a alguien que está tratando de descubrir en qué habilidades debería concentrarse o no?  ¿En qué deberían especializarse?  ¿Cómo serán\no no serán los trabajos? - Bueno, la IA hará que\nla gente sea más productiva. Y en algunos casos, como escribir software, hay mucha\ndemanda insatisfecha de buen software. Puedes convertirlo en un software de mayor calidad. Es muy difícil predecir exactamente cómo será el mercado laboral,\npero cuanto más profundo sea el conjunto de habilidades, ya sea consulta médica, pensamiento científico\no atención al cliente, más valor tendrá, incluso en un mundo donde su\nproductividad mejorará al tener este tipo.  de trabajador casi libre, está mirando por encima de tu\nhombro, dándote consejos, dándote mucha retroalimentación sobre\nlo que estás haciendo. Así que no creo que tengamos en mente algo\ncomo no convertirnos en barbero o radiólogo porque las nuevas capacidades\nson de naturaleza muy horizontal. No es un conjunto de avances específicos de un tema. - Entonces es como si\ntodos tuvieran un pasante, un asistente de investigación o un analista. Así que tal vez la respuesta sea no ser el asistente de investigación,\nel interno o el analista. Aprende a gestionarlos. - Sí, y por supuesto, trabajos\ncomo ayudar a discapacitados, ancianos, ayudar a motivar a los estudiantes, hay una demanda tan infinita\nde esas cosas, incluso en el mundo rico, pero\naún más dramáticamente en los países en desarrollo que los\ntrabajos que requieren una profunda conexión humana y empatía.  , diríamos que aún queda un largo camino por recorrer antes de que haya un sustituto\npara esas cosas. Tenemos dos revoluciones\nen paralelo. Tenemos este tipo de mejora de lectura y escritura habilitada para ChatGPT\n, pero mientras tanto, la gente\nno debería subestimar que el tipo de robótica de cuello azul, que eventualmente conduce a un robot humanoide, tiene un propósito bastante general en términos de habilidades físicas.  , brazos, piernas, cosas que puede hacer, eso también está sucediendo. Entonces, la buena noticia es\nque vamos a tener más tiempo libre, que\nmuchas de las carencias que tenemos por\nconsejo médico o cuando nos confundimos se podrán solucionar. Tenemos este suministro de\nestas nuevas capacidades y los roles únicos que asumen los humanos o cómo aprovecharán su tiempo libre extra y lo harán satisfactorio,\nesos son nuestros desafíos. - Lo que acabas de mencionar es interesante, porque creo que la gente\nsiempre ha teorizado que, bueno, seremos más productivos, podremos\nhacer más con menos tiempo y, por lo tanto, tendremos más tiempo libre. Creo que es una utopía para mucha gente. Pero parece que los\npatrones del pasado, de\nmejoras de productividad, o en todo caso, que los hiperproductivos\nestán trabajando más duro, porque obtienen tanta\nventaja de cada minuto que no necesariamente conduce a eso.  ¿ Crees que hay algo\ndiferente en esta ola en la que tal vez cosas como la semana laboral de cuatro días o incluso eventualmente\nuna semana laboral de tres días se vuelvan comunes?  ¿ O crees que la gente\npodrá hacer más con menos y contratar a menos personas que hoy? -\nVale la pena entender las analogías del pasado, pero los cambios en el pasado\nfueron de naturaleza generacional. Entonces, la mecanización de\nla ocupación principal, que era cultivar alimentos,\nse produce de forma gradual. Entonces el abuelo era agricultor\ny tus padres no tanto, y ahora no conozco a\nmuchos agricultores del mundo rico. Conozco algunos pero no muchos. Y así no tuviste que\ncambiar a mitad de carrera. Es cierto que surgió una demanda de cosas que no hubiéramos esperado.  Por eso es reconfortante\nmirar esa historia, pero el nivel total de capacidad aquí y la velocidad a la que se impregnará en la economía y cambiará los mercados laborales, en cinco años, el efecto será muy sustancial. Yo diría que dentro de 10 años\nserá bastante dramático.  Por eso no creo que\npodamos descartar por completo la idea de que este cambio\nfinalmente nos llevará al punto en el que el equilibrio\nentre trabajo y ocio realmente se vuelva importante. Y en lugar de gravar el trabajo,\ncomo con los impuestos sobre la nómina, lo llamé impuesto a los robots\ncuando hablé de ello y la gente pensó que era extraño, pero pasaremos a donde\nesencialmente subsidiamos el trabajo y gravamos completamente el\nlado del capital y las ganancias. lo cual por sí solo es un cambio bastante grande que el gobierno deberá hacer. - Es una idea fascinante\ny tiene mucho sentido, porque obviamente, si\ntenemos una sociedad más abundante, una sociedad más productiva, pero tomemos un\nbanco de inversión o una empresa de consultoría. Gran parte del\ntrabajo tradicional que facturan las personas y el tamaño de la organización son analistas que realizan hojas de cálculo y presentaciones de PowerPoint. Y muchas de esas cosas se\nautomatizarán muy rápidamente. Así que este es un mundo en el que se\nsubsidia a estas empresas para que digan: \"No, sigan contratando pasantes. Sigan contratando a estos analistas junior\". Así que tenga un sentido de propósito en lugar de que estos jóvenes\nno tengan algo que hacer, no desarrollen sus habilidades y nunca puedan\nconvertirse en gerentes. - Sí, si se llega al extremo en el que el propósito que proporcionan los empleos no es el principio organizativo central\nde la sociedad, entonces se entra en algunas\ncuestiones filosóficas profundas sobre cuáles deberían ser las prioridades\ny cuál es el propósito. De manera abstrusa, el libro de Bostrom\n\"Superinteligencia\" toca esto. Realmente no creo\nque se haya escrito tan bien sobre eso. \"Life 3.0\" hizo un buen trabajo al decir: ¿ cuál es el papel de la inteligencia en estos escenarios futuristas? Muchos libros nuevos están saliendo ahora mismo, he podido ponerme al día con todos ellos. Probablemente algunos de ellos serán útiles. - Te estoy entrevistando\nahora mismo para una de ellas. (ambos riendo)\n- Así es. - Y volviendo a,\nsupongo, más conceptos básicos, por así decirlo, obviamente mucha gente, hablamos un poco sobre el trabajo, pero ahora, volviendo al\nnúcleo de la educación, que sé que les importa profundamente, He conversado muchas veces sobre educación, en este momento hay una especie de emergencia en la educación. La gente como los niños hará\ntrampa usando esta tecnología.  ¿ Tiene una respuesta? Estamos escuchando esto de todos los profesores de todos los niveles de grado.  ¿ Qué harías si\nfueras profesor de historia o profesor de escritura en una escuela secundaria o en una universidad en este momento? - Bueno, para tener una\nprueba pura de la capacidad de alguien para escribir o\ncalcular por sí solo, necesitarás crear un entorno donde no tenga acceso\na las herramientas de software. Nuestros esfuerzos por detectar si el software le ha ayudado a escribir algo\ndetectarán el equivalente más descuidado de\ncortar y pegar de Wikipedia. Pero al final, no podremos saberlo, porque habrá una\ngran variedad de herramientas y la variedad de indicaciones\nlo hará bastante difícil. Entonces, la buena noticia aquí es\nque, por primera vez, si escribes sobre un tema, la\nIA puede darte retroalimentación. Puede ayudarte con el primer borrador. Puede ayudar a comparar lo que\nhas hecho con otra cosa. Puede crear un programa de estudio de cosas sobre las que podría\nintentar escribir. Y entonces, el nivel de compromiso, que puede ayudarte\ncuando estés estancado, es realmente algo nuevo. Va incluso más allá del hecho de que hay excelentes vídeos en YouTube sobre todas las ciencias y la historia. Esto entra en el ámbito de la costumbre para los tutores y la retroalimentación\nsobre lectura y escritura. Entonces, la paradoja de que ahora tenemos esta herramienta es que si quieres\naprender, lo hace más fácil, pero para probar la capacidad de alguien, tendremos que usar nuevas técnicas. Y, lamentablemente, en algunos casos,\npuede hacer que la gente se sienta como: \"Vaya, si es tan bueno, ¿ todavía tengo que esforzarme tanto?\". Usted y yo decimos que, tanto\npara la realización personal como para desempeñar un papel de\ncontribución en el mercado laboral, cuanto más alto sea su nivel de habilidades, mayor será su\nvalor sustancial. Entonces, ayudar a los niños a aprender cómo\nobtener retroalimentación sobre sus escritos, creo que es imperativo, porque\nhoy en día hacemos un muy mal trabajo en ese sentido. - Entonces, lo que estoy escuchando es\nque no solo no hay menos razones, sino que hay\nmás razones para acelerar según la parte anterior de nuestra conversación, que son esas cosas de\nnivel interno, nivel de entrada que rápidamente esperarás que hagas.\nSea más arquitecto, más editor, más gerente. Y si no puedes dar ese\nsalto más temprano que tarde, la buena noticia es que estas mismas\nherramientas pueden usarse para hacerlo, con lo cual también estoy de acuerdo. Y obviamente, estamos\ntrabajando en mucho de eso. Entonces, si hubiera un profesor, quiero decir, recibimos correos electrónicos de\npersonas, tal vez tú también, que dicen: \"¿Qué hago este otoño?\" Y parece que\nharías más cosas supervisadas en clase para la evaluación, ¿ seguirías haciendo\nel trabajo final tradicional o cambiarías las\nreglas de participación al respecto? - Bueno, sí, en el lugar de trabajo, se alentará a las personas a crear el mejor producto posible donde estén ellos más la IA. Y no hay razón para que esa sea una de las habilidades\nque practiques: oye, hagamos un plan de negocios. Y claro, aprenda a utilizar\nlas mejores herramientas de inteligencia artificial. Pero lo veré, si\nsolo hago que la IA lo haga sin su valor agregado, será como una C-menos o peor. Tienes que entrar allí y aportar un poco más de precisión, diferentes fuentes de conocimiento y tener un valor agregado único. Quiero decir, entiendes la\naudiencia a la que se dirige, incluso es difícil para la computadora entender todos esos\ncontextos diferentes. Así que sí, tendrás\ndos tipos de escritura: la que haces completamente\nsin la ayuda de la computadora y la que haces donde te animan a que sea el mejor asistente posible. - No, eso tiene sentido. Hablamos con Kevin Roose, que escribe para el New York Times y que también escribió sobre sus interacciones con\nSydney y todo eso. Y lo que quiere decir es que hay\nescritura y hay periodismo. Las IA se están\nvolviendo muy buenas en la escritura, pero también en el periodismo, en hacer contactos, en poder entrevistar a\npersonas, formar vínculos, etcétera. Y que todo tiene una analogía. Si eres un emprendedor,\nrealiza pruebas de usuario, aunque la IA\npodría hacer partes de eso. En relación con toda esta retroalimentación sobre la práctica, usted mencionó la palabra \"evaluación\". Tengo curiosidad por saber hacia dónde\ncree que va la evaluación. Obviamente, durante muchos años la evaluación escalable fue bastante limitada. Scantron, opción múltiple,\neso es lo que hicimos. Como no pudimos hacer una evaluación más completa, comenzó a determinar lo que sucede o no\nen el aula.  ¿ Crees que eso está a punto de cambiar? - Bueno, existe una\ncontroversia sobre la evaluación independiente de la IA.  ¿ Deberían los puntajes SAP ser parte\nde las admisiones universitarias? Creo que demostrar que tus habilidades matemáticas y tu comprensión básica de historia y ciencia son sólidas es bastante importante. Y que cuando quieres\nconsolidar conocimientos, el hecho de que te hagan\npreguntas muy amplias al respecto es muy motivador para\nhacerlo accesible. No solo: \"Está bien, mañana lo sabré\" de forma simplista, sino que\nsé cómo acceder a él y combinarlo con mis otros conocimientos. Así que sigo siendo alguien que piensa que las pruebas pueden ayudarte a saberlo.\ndonde estás en un área temática y es algo meritocrático que realmente quieras poder demostrar que tienes alguna capacidad. Ciertamente, cuando voy a un médico, me alegro de que haya sido\nsometido a algún examen y prueba. Ahora, teniendo en cuenta el hecho de que si tienes\nantecedentes desfavorecidos, incluso si estás en\ncamino de ser realmente bueno, mirarte justo\nen ese momento tal vez no debería ser directamente comparable. En parte, es por eso que me encanta la\nidea del tutor informático porque puede ser alentador, puede comprender cuáles\nson tus conceptos erróneos y, si podemos hacerlo\ndisponible de manera muy amplia, significa que la\nsofisticación que, digamos, mis padres.  que\nme brindaron como graduado universitario es menos singular en un\nmundo donde el tutor de IA es muy útil en una\ngran variedad de temas. Pero me mantendré firme, en muchos casos, teniendo una\nevaluación objetiva de tus habilidades, creo que una vez que te alejas de eso, estás en un lugar muy difícil, incluso en términos de tu propia disciplina, ¿ entiendo?  este tema o no? - Sí, no, estoy de acuerdo. Y cada vez que alguien dice: \"Oh, estoy en contra de la evaluación estandarizada\", digo: \"¿A qué parte estás en contra, la parte estandarizada\no la parte de evaluación?\" Y normalmente les resulta difícil estar en contra de cualquiera de ellas. Pero creo que lo que\nestán diciendo implícitamente es que sienten que\ntal vez no se esté captando completamente dónde está el estudiante. Sólo hay ciertas\ncosas que puedes medir. Quizás no esté captando su pendiente. Según su punto, es una instantánea en el tiempo.  ¿ Cree que la IA,\nen los próximos cinco o diez años, podría resolver este problema al poder ofrecer evaluaciones más completas? Y la evaluación podría ser\ndónde estás en matemáticas, o podría ser dónde estás en escritura. Incluso podrían ser cosas\ncomo entrevistas de trabajo. Esa es una forma de evaluación, de\nprogresión profesional.  ¿ Crees que\njugará un papel importante allí? - Bueno, creo que dado que todavía tenemos ciertas imperfecciones en la IA, la gente aún puede ser escéptica cuando decimos que una evaluación interactiva con la IA discutiendo un tema como su comprensión\nde la historia o la economía, podemos hacer que eso sea equivalente a  el mejor tipo de profesor que te involucraría profundamente. Y creo que llegaremos a ese nivel, y eso es superior a solo un\nconjunto de preguntas estandarizadas que deben tener\nuna respuesta sencilla y su riqueza de\ncomprensión del tema. Hay personas que son mejores en preguntas de opción múltiple\ny en exámenes. Creo que a ti y a mí probablemente nos\nhabría ido bien en el ámbito educativo, pero creo que en parte somos buenos en los exámenes, y me sentí mal por los niños que tomaron los exámenes, me di cuenta de que se sintieron intimidados cuando esa opción múltiple, tienes que responder todas.  de estos\nen una hora saldrían. Entonces, al permitir un\ndiálogo más flexible, creo que se apreciarán diferentes estilos de\naprendizaje.  Se apreciará un conjunto más amplio de habilidades\n. Pero todavía tenemos que demostrárselo a la gente.  Todavía no estamos en ese nivel de emparejar a un gran profesor que discuta\nun tema con usted. - Y luego poder dar una buena valoración del mismo. - Exactamente.\n- Lo que hemos visto, ya podemos emular bastante bien la parte de discusión real . Pero creo que la evaluación fuerte\nexiste, pero supongo que probablemente sucederá. - Oh, sí, va a suceder. Quiero decir, cuando tienes expertos\nque son buenos en algo que es de naturaleza lingüística, y cuando reúnes esos conjuntos de datos y les das retroalimentación constantemente, incluso con los mecanismos actuales,\nque se pueden mejorar, pero incluso solo con esto, podemos desarrollar  algo así\ncomo un experto humano. - Y con eso quiero decir, es gracioso. Quiero decir, esta conversación, como saben, incluso hace un año habría\nparecido ciencia ficción. Y todo esto está cambiando muy rápidamente. Me siento así y siento que\nestoy en medio de esto, pero aún así, las cosas están cambiando muy rápido. Probablemente también estés viendo aún más. Quiero hacerte una pregunta a largo plazo, porque ¿quién sabe cómo\nserá el mundo dentro de 20 años? Pero digamos cinco años, que\nes lo que creo que la mayoría de las personas deberían planificar\nen sus vidas, ya sea que dirijan una empresa o sean jóvenes\npara su carrera.  ¿ Cómo crees que será el mundo de la educación y el trabajo? Como pintar un cuadro.  ¿ Podremos tener\nuna videoconferencia con, quiero decir, no quiero confundirte, pero cómo sería?  ¿ Cómo va a ser\ndramáticamente diferente o no al mundo en el que estamos ahora? - Bueno, habrá un cierto conjunto de trabajos en los que simplemente se mueven documentos\ny se miran documentos, por ejemplo, contabilidad o reclamaciones médicas, donde la profundidad de\ncomprensión en esos trabajos es bastante sencilla. Y algunos de esos trabajos\nserán puramente automatizados. Luego habrá un montón de trabajos que todavía los realizan humanos, como hacer tarjetas de felicitación. Y volví y\nvi la película \"Ella\" porque plantea una bonita... Pensé que las tarjetas de felicitación definitivamente iban a ser automatizadas, porque ahora puedes tener una personalización masiva de las tarjetas de felicitación, pero de todos modos. - Sí, probablemente\npuedas hacerlo tú mismo. Tome Dolly 10 y diga: \"Oye, así es como quiero\nburlarme de mi hermana. Recuérdale esto del pasado y aquí tienes algunas fotos para pegar\". Así que sí, puedes eliminar\nal profesional porque tú y la IA podéis\nhacerlo de una forma muy personalizada. Pero quedarán muchos trabajos que son simplemente más productivos, en los que tienes este tipo de copiloto que toma, está bien,\nconvierte el PowerPoint a un documento de Word, y\nboom, ese borrador está disponible para que lo tengas.  como punto de partida. Y esa productividad adicional creará nuevas oportunidades para tomar cosas como la atención médica y mejorarla, la educación y mejorarla, el cuidado de las personas mayores y mejorarla. La productividad es algo bueno y la gente se ha quejado y hay muchos libros que dicen: \" Oh, tenemos electricidad\". Y desde entonces no\ntodo ha sido tan dramático, al menos como lo reflejan las\ncifras económicas, como lo que ocurrió allí. Esto lo verá en las\ncifras económicas en gran medida, tanto en el lado robótico como en la parte de lectura y escritura del LLM. Entonces, dentro de cinco años\nestaremos en un espacio diferente. Con suerte, las elecciones\nseguirán siendo indiscutibles y los deepfakes no complicarán aún más los\nproblemas que ya tenemos allí . Es interesante que el\ngobierno, en un momento en el que no se confía tanto en él como nos gustaría, tendrá que dar un paso adelante\ny cambiar las políticas fiscales y tener políticas de reentrenamiento y ser parte del\ndiálogo para establecer reglas. Toda la industria dice que el gobierno tiene un papel aquí, pero en un momento en el que la confianza en eso y la división son muy desafiantes. Así que espero que no hayamos\nsufrido tanto por los aspectos negativos en el\nperíodo de cinco años, y para entonces, la sociedad\nse habrá reorientado y dirá: \"Está bien, ¿cómo podemos evitar que esto se\nutilice como vehículo de ataque?  ¿ Nos aseguramos de que se\nutilice de manera equitativa?\" Ciertamente, creo que nos llevará cinco años sacar a la luz y generalizar el uso de los sueños que tengo sobre la salud y la educación en los países pobres. \n Cinco años es un período de tiempo muy corto, pero sienta las bases donde espero que al ser más productivo como sociedad, muchos de los desafíos\ndel envejecimiento o el clima, la gente espera que el gobierno haga más de lo que es capaz\nde hacer, que  Diré: \"Vaya, estamos mejorando los medicamentos para la obesidad. Estamos mejorando los medicamentos para el Alzheimer\". Y obtendrás este tipo de visión positiva del sistema actual y\nno lograr que funcione mejor de manera incremental\nfrente a las divisiones o incluso considerar alternativas radicales que creo que darían bastante miedo. Entonces, la innovación aquí, porque\nsorprenderá a la gente, no es lo que se espera, tiene\nmuchas ventajas positivas. - Sí, quiero decir, eso lleva\na la última pregunta, que es, ¿cómo te sientes? Mi visión sobre la IA cambia casi a diario a medida que leo más, pienso más y tengo conversaciones como esta.  ¿ Se siente netamente positivo?  ¿ Estás realmente preocupado\npor ciertas cosas dentro de tu positividad?  ¿ Eres neto negativo?  ¿ Cómo te sientes al respecto y en qué cosas\nestás pensando más? - Me emociona cuando me\nsiento con el equipo de malaria y hablamos sobre cómo vamos a tener mejores formas de matar mosquitos con las que estos programas pueden ayudar, o nos sentamos y hablamos sobre niños que han decidido que  No somos buenos en matemáticas, que no hemos logrado mucho\nprogreso para esos niños, simplemente tener toda la capacidad\npara probar sus conocimientos, eso no fue suficiente para atraerlos. Y entonces, esa cuestión de la motivación y el hecho de que el tutor de IA  ,\nuna de sus cosas excelentes será comprender el nivel correcto, el estímulo adecuado,\npara hacer que alguien sienta: \"Sí, esta\ncomprensión matemática del mundo es algo que puede funcionar para\nmí y mejorar mi vida, incluso más allá de lo que sea\".\noportunidades laborales que permite.\" Así que estoy muy emocionado por eso. El mundo en el que lo estamos entregando y su capacidad para tener\ndebates fácticos complejos y diferentes países\nprueban diferentes regulaciones, yo diría que el desafío político en el que todos dicen que el gobierno tiene un papel muy, muy importante que desempeñar, para aprovechar las  aspectos positivos, por ejemplo, cambiar la estructura fiscal, y mitigar los aspectos negativos, las falsificaciones profundas, los sesgos y los ciberataques habilitados por IA.  ¿ Nuestras estructuras de gobernanza son lo\nsuficientemente maduras, lo suficientemente ágiles y pueden llegar a un consenso suficiente para que podamos gestionar esta\noportunidad de buena manera? Y definitivamente hay días en los que me preocupa que el lado gubernamental en este asunto no dé los pasos necesarios. - Sí, bueno, podría hablar\ncontigo varias horas más, tal vez días sobre esto. Pero Bill, gracias por tomarte\ntu tiempo para esto. Esto es muy valioso. - No, es divertido estar\njuntos en este viaje y seremos un gran socio y lo ayudaremos a hacer realidad su visión. - Genial, bueno, eso lo apreciamos mucho. Son tiempos emocionantes. Veamos qué pasa.  (risas) - Muy bien, gracias. - Está bien, gracias, Bill.",
    "t_arabic": "- مرحباً بالجميع، سال\nهنا من أكاديمية خان. وكما يعلم البعض منكم، فقد\nأصدرت كتابي الثاني، \"كلمات جديدة شجاعة\" حول مستقبل الذكاء الاصطناعي في التعليم والعمل. إنه متاح أينما\nيمكنك شراء كتبك. ولكن كجزء من البحث لهذا الكتاب، أجريت بعض المقابلات مع\nبعض الأشخاص الرائعين، والتي أنت على وشك مشاهدتها. يسعدني جدًا أن\nأقدم لكم ضيفنا الذي ربما لا يحتاج إلى\nتعريف، بيل جيتس. بيل، شكرا لانضمامك إلينا. - رائع أن أراك. - أعلم أن الذكاء الاصطناعي هو في\nمقدمة اهتماماتك. من الواضح أننا جميعًا في أكاديمية خان نفكر كثيرًا\nفي الذكاء الاصطناعي في التعليم، وينصب تركيز ذلك على\nالذكاء الاصطناعي في التعليم والعمل. وسأبدأ بسؤال\nأتلقاه من الكثير من المراهقين والأشخاص في الكلية وأولياء أمورهم، في ضوء ما تعرفه عما يحدث في الذكاء الاصطناعي وربما في التكنولوجيا الأخرى أيضًا، ما هي النصيحة التي تود تقديمها؟  أعطه لشخص يحاول معرفة ما هي المهارات التي يجب عليه التركيز عليها أو عدم التركيز عليها؟ ما الذي يجب أن يتخصصوا فيه؟ كيف ستبدو الوظائف\nأو لا تبدو؟ - حسنًا، الذكاء الاصطناعي سيجعل\nالناس أكثر إنتاجية. وفي بعض الحالات، مثل كتابة البرامج، هناك الكثير من الطلب غير الملباة\nعلى البرامج الجيدة. يمكنك جعله برنامجًا عالي الجودة.  من الصعب للغاية التنبؤ بما يبدو عليه سوق العمل بالضبط، \nولكن كلما زادت المهارات الأعمق، سواء كانت استشارة طبية أو تفكير علمي\nأو دعم العملاء، زادت القيمة التي ستحصل عليها، حتى في عالم حيث\nسيتم تعزيز إنتاجيتك من خلال وجود هذا النوع.  العامل الحر تقريبًا، يراقبك،\nويقدم لك النصائح، ويعطيك الكثير من التعليقات حول\nما تفعله. لذلك لا أعتقد أن هناك ما يدور في ذهننا\nمثل ألا تصبح حلاقًا أو أخصائي أشعة لأن القدرات الجديدة ذات\nطبيعة أفقية للغاية. إنها ليست مجموعة من التطورات الخاصة بموضوع معين. - يبدو الأمر كما لو أن\nالجميع سيكون لديهم متدرب أو مساعد باحث أو محلل. لذلك ربما يكون الجواب هو ألا تكون مساعدًا للباحث أو\nمتدربًا أو محللًا. تعلم كيفية إدارتها. - نعم، وبالطبع وظائف\nمثل مساعدة المعاقين وكبار السن والمساعدة في تحفيز الطلاب، هناك طلب لا نهائي\nعلى هذه الأشياء، حتى في العالم الغني، ولكن بشكل\nأكثر دراماتيكية في البلدان النامية\nحيث الوظائف التي تتطلب تواصلًا إنسانيًا عميقًا وتعاطفًا  ، قد نقول إنه لا يزال هناك طريق طويل قبل أن يكون هناك بديل\nلهذه الأشياء. لدينا ثورتان\nمتوازيتان نوعًا ما. لدينا هذا النوع من تحسين القراءة والكتابة\nللياقات البيضاء المدعوم من ChatGPT، ولكن في هذه الأثناء،\nلا ينبغي للناس أن يقللوا من شأن هذا النوع من الروبوتات من ذوي الياقات الزرقاء، مما يؤدي في النهاية إلى روبوت يشبه الإنسان، وهذا غرض عام تمامًا من حيث المهارات البدنية والذراعين والساقين، والأشياء التي يمكنه القيام بها، وهذا يحدث أيضًا. لذا فإن الخبر السار هو\nأنه سيكون لدينا المزيد من وقت الفراغ، وذلك بسبب\nالكثير من النقص الذي لدينا في\nالنصائح الطبية أو عندما نشعر بالارتباك بشأن القدرة على تصحيح الأمر. لدينا هذا العرض من\nهذه القدرات الجديدة والأدوار الفريدة التي يتولىها البشر أو كيف سيأخذون أوقات فراغهم الإضافية ويحققون ذلك،\nهذه هي تحدياتنا. - ما تطرقت إليه للتو مثير للاهتمام، لأنني أعتقد أن الناس\nدائمًا ما وضعوا نظرية مفادها أننا سنصبح أكثر إنتاجية، وسنكون قادرين على\nالقيام بالمزيد في وقت أقل، وبالتالي سيكون لدينا المزيد من أوقات الفراغ أعتقد أن المدينة الفاضلة لكثير من الناس. ولكن يبدو أن\nأنماط الماضي، \nلتحسين الإنتاجية، أو إذا كان هناك أي شيء، فإن أصحاب الإنتاجية المفرطة\nيعملون بجدية أكبر، لأنهم يحصلون على الكثير من\nالنفوذ من كل دقيقة بحيث لا يؤدي ذلك بالضرورة إلى ذلك. هل تعتقد أن هناك شيئًا\nمختلفًا في هذه الموجة حيث ربما تصبح أشياء مثل أسبوع العمل لمدة أربعة أيام أو ربما حتى في نهاية المطاف\nأسبوع عمل لمدة ثلاثة أيام أمرًا شائعًا؟ أو هل تعتقد أن الناس\nسيكونون قادرين على فعل المزيد بموارد أقل وتوظيف عدد أقل من الأشخاص عما يفعلونه اليوم؟ - إن التشبيهات\nبالماضي تستحق الفهم، لكن التغيرات في الماضي\nكانت ذات طبيعة أجيالية. لذا فإن ميكنة\nالمهنة الأساسية، وهي زراعة الغذاء،\nتحدث تدريجيًا. وهكذا كان الجد مزارعًا\nوكان والداك أقل من ذلك، والآن، لا أعرف\nالكثير من المزارعين الأثرياء في العالم. أعرف القليل ولكن ليس الكثير. ولذا لم يكن عليك\nتغيير منتصف حياتك المهنية. صحيح أن الطلب على الأشياء التي لم نكن نتوقعها قد ظهر. ولذا فمن المريح\nأن ننظر إلى ذلك التاريخ، ولكن المستوى الإجمالي للقدرة هنا والسرعة التي ستنتشر بها في الاقتصاد وتغير أسواق العمل، لمدة خمس سنوات، سيكون التأثير كبيرًا جدًا. أود أن أقول أنه في غضون 10 سنوات،\nسيكون الأمر دراماتيكيًا للغاية. ولذلك لا أعتقد أننا\nنستطيع أن نرفض تمامًا فكرة أن هذا التغيير\nسيوصلنا أخيرًا إلى النقطة التي تصبح فيها المقايضة\nبين العمل والترفيه مهمة بالفعل. وبدلاً من فرض ضرائب على العمالة،\nكما هو الحال مع الضرائب على الرواتب، أطلقت عليها اسم ضريبة الروبوتات\nعندما تحدثت عنها واعتقد الناس أنها غريبة، لكننا سننتقل إلى حيث\nندعم العمالة ونفرض الضرائب بشكل كامل على\nجانب رأس المال والأرباح. وهذا وحده يمثل تحولًا كبيرًا جدًا ستحتاج الحكومة إلى تحقيقه. - إنها فكرة رائعة\nولها معنى كبير، لأنه من الواضح أنه إذا كان\nلدينا مجتمع أكثر وفرة، مجتمع أكثر إنتاجية، ولكن دعونا نأخذ\nبنكًا استثماريًا أو شركة استشارية. الكثير من\nالأعمال التقليدية التي يقوم بها الأشخاص وحجم المؤسسة هم من المحللين الذين يقومون بجداول البيانات ويقدمون عروض PowerPoint التقديمية. والكثير من هذه الأشياء\nستصبح آلية بسرعة كبيرة. ولذا فإن هذا هو العالم الذي\nتقوم فيه بدعم هذه الشركات لتقول، \"لا، استمر في توظيف المتدربين. استمر في توظيف هؤلاء المحللين المبتدئين.\" لذلك، يجب أن يكون لديك إحساس بالهدف بدلاً من عدم وجود هؤلاء الشباب الذين\nليس لديهم ما يفعلونه، أو بناء مجموعة مهاراتهم، أو عدم قدرتهم\nعلى أن يصبحوا مديرين أبدًا. - نعم، إذا وصلت إلى الحد الأقصى حيث لا يكون الغرض الذي توفره الوظائف هو المبدأ التنظيمي المركزي\nللمجتمع، فإنك تدخل في بعض\nالأسئلة الفلسفية العميقة حول ما يجب أن تكون الأولويات\nوما هو الغرض. وبطريقة مبهمة، تطرق كتاب بوستروم\n\"الذكاء الفائق\" إلى ذلك. لا أعتقد حقًا أن هذا قد\nتمت كتابته جيدًا.  لقد قام \"الحياة 3.0\" بعمل جيد عندما قال، حسنًا، ما هو دور الذكاء في هذه السيناريوهات المستقبلية؟  هناك الكثير من الكتب الجديدة الصادرة حاليًا، وقد تمكنت من اللحاق بها جميعًا. ربما بعض تلك سوف تكون مفيدة. - أنا أقوم بإجراء مقابلة معك\nالآن من أجل واحد منهم. (كلاهما يضحك)\n- هذا صحيح. - وبالعودة إلى\nأعتقد المزيد من الأساسيات، إذا جاز التعبير، من الواضح أن الكثير من الناس، تحدثنا قليلاً عن العمل، ولكن الآن بالعودة إلى\nجوهر التعليم، الذي أعلم أنك تهتم به بشدة، نحن  لقد تحدثت عدة مرات عن التعليم، في الوقت الحالي، هناك حالة طوارئ طفيفة تحدث في التعليم. الناس مثل الأطفال سوف\nيغشون باستخدام هذه التكنولوجيا. هل لديك إجابة لهذا السؤال، ونحن نسمع ذلك من كل أعضاء هيئة التدريس عبر المستويات الدراسية. ماذا ستفعل لو\nكنت أستاذًا للتاريخ أو أستاذًا للكتابة في مدرسة ثانوية أو كلية في الوقت الحالي؟ - حسنًا، لإجراء\nاختبار خالص لقدرة شخص ما على الكتابة بمفرده أو\nالحساب بنفسه، ستحتاج إلى إنشاء بيئة لا يمكنهم فيها الوصول\nإلى أدوات البرنامج. جهودنا لاكتشاف ما إذا كانت البرامج قد ساعدتك على كتابة شيء ما\nستكتشف النوع الأكثر إهمالًا مما يعادل\nالقص واللصق من ويكيبيديا. لكن في النهاية، لن نتمكن من معرفة ذلك، لأنه سيكون هناك\nمجموعة متنوعة من الأدوات وتنوع المطالبات\nسيجعل ذلك صعبًا للغاية. لذا فإن الخبر السار هنا هو\nأنه لأول مرة، إذا كتبت عن موضوع ما،\nيمكن للذكاء الاصطناعي أن يقدم لك تعليقات. يمكن أن تساعدك في المسودة الأولى. يمكن أن يساعد في مقارنة ما\nقمت به بشيء آخر. يمكنه إنشاء برنامج لدراسة الأشياء التي قد تحاول\nالكتابة عنها. وبالتالي فإن مستوى المشاركة، حيث يمكن أن يساعدك\nعندما تكون عالقًا، هو حقًا شيء جديد.  بل إن الأمر يتجاوز حقيقة وجود مقاطع فيديو رائعة على YouTube حول جميع العلوم والتاريخ. يدخل هذا في عالم مخصص للمدرسين وردود الفعل\nعلى القراءة والكتابة. لذا فإن المفارقة هي أن لدينا الآن هذه الأداة التي إذا كنت تريد\nالتعلم، فإنها تجعل الأمر أسهل، ولكن اختبار قدرة شخص ما، سيتعين علينا استخدام تقنيات جديدة. وللأسف، في بعض الحالات،\nقد يجعل الناس يشعرون، \"واو، إذا كان الأمر جيدًا جدًا، فهل ما زلت بحاجة إلى دفع نفسي بنفس القوة؟\" أنا وأنت نقول،\nمن أجل تحقيق الذات ولعب دور في\nالمساهمة في سوق العمل، كلما ارتفع مستوى مهاراتك، كلما احتفظت\nبقيمة كبيرة. لذا فإن مساعدة الأطفال على تعلم كيفية\nالحصول على تعليقات حول كتاباتهم، أعتقد أن هذا أمر ضروري، لأننا نقوم\nبعمل سيء للغاية في هذا الشأن اليوم. - إذن ما أسمعه هو\nأنه ليس هناك سبب أقل فحسب، بل هناك\nسبب أكثر للتسريع في الجزء السابق من محادثتنا، وهو أن\nالأمور على مستوى المتدربين والمستوى المبتدئ ستتوقع منك بسرعة أن تفعل ذلك\nكن أكثر من المهندس المعماري، وأكثر من المحرر، وأكثر من المدير. وإذا لم تتمكن من تحقيق هذه\nالقفزة عاجلاً وليس آجلاً، فالخبر السار هو أنه\nيمكن استخدام نفس الأدوات للقيام بذلك، وهو ما أتفق معه أيضًا. ومن الواضح أننا\nنعمل على الكثير من ذلك. لذا، إذا كان هناك أستاذ، أعني أننا نتلقى رسائل بريد إلكتروني من\nالأشخاص، وربما أنتم أيضًا، مثل، \"ماذا سأفعل هذا الخريف؟\" ويبدو أنك\nستفعل المزيد من الأشياء الخاضعة للمراقبة في الفصل من أجل التقييم، وهل ستستمر في أداء\nورقة الفصل الدراسي التقليدية أم هل ستغير\nقواعد المشاركة في ذلك؟ - حسنًا، نعم، في مكان العمل، سيتم تشجيع الأشخاص على التوصل إلى أفضل منتج يمكنهم الحصول عليه بالإضافة إلى الذكاء الاصطناعي. وليس هناك سبب لعدم جعل هذه إحدى المهارات\nالتي تمارسها، هيا بنا نضع خطة عمل. وبالتأكيد، تعلم كيفية استخدام\nأفضل أدوات الذكاء الاصطناعي. لكنني سأرى، إذا\nطلبت من الذكاء الاصطناعي القيام بذلك دون أي قيمة مضافة، فسيكون ذلك مثل C-ناقص أو ما هو أسوأ. يجب عليك الوصول إلى هناك والحصول على قدر أكبر من الدقة ومصادر مختلفة للمعرفة والحصول على قيمة مضافة فريدة. أعني أنك تفهم\nالجمهور الذي سيفعله، ولا يزال من الصعب على الكمبيوتر أن يفهم كل تلك\nالسياقات المختلفة. لذا، نعم، سيكون لديك\nنوعان من الكتابة، الكتابة التي تقوم بها تمامًا\nدون مساعدة الكمبيوتر والكتابة التي تقوم بها حيث يتم تشجيعك لجعلها أفضل مساعد ممكن. - لا، هذا منطقي. تحدثنا إلى كيفن روز، الذي يكتب لصحيفة نيويورك تايمز، والذي كتب أيضًا بشكل مشهور عن تفاعلاته مع\nسيدني وكل ذلك. ووجهة نظره هي أن هناك\nكتابة وهناك صحافة.  في الكتابة، أصبح الذكاء الاصطناعي\nجيدًا جدًا، لكن في الصحافة، وإجراء الاتصالات، والقدرة على إجراء مقابلات مع\nالأشخاص، وتكوين الروابط، وما إلى ذلك. وأن هناك نظيرًا لكل شيء. إذا كنت رائد أعمال،\nتقوم بإجراء اختبار المستخدم، على الرغم من أن الذكاء الاصطناعي قد يكون\nقادرًا على القيام بأجزاء من ذلك. فيما يتعلق بملاحظات الممارسة بأكملها، لقد تطرقت إلى كلمة \"التقييم\". أشعر بالفضول إلى أين\nتعتقد أن التقييم يتجه.  ومن الواضح أن التقييم القابل للتطوير كان محدودًا إلى حد ما لسنوات عديدة. سكانترون، الاختيار من متعدد،\nهذا ما فعلناه.  نظرًا لأننا لم نتمكن من إجراء تقييم أكثر ثراءً، فقد بدأنا في توجيه ما يحدث أو لا\nيحدث في الفصل الدراسي. هل تعتقد أن هذا على وشك التغيير؟ - حسنًا، هناك\nجدل حول التقييم المستقل عن الذكاء الاصطناعي.  هل يجب أن تكون نتائج SAP جزءًا\nمن القبول في الكلية؟ أعتقد أن إثبات أن مهاراتك في الرياضيات وفهمك الأساسي للتاريخ والعلوم قوي، هذا أمر مهم جدًا. وعندما تريد\nتعزيز المعرفة، فإن حقيقة أنه سيتم طرح عليك\nأسئلة واسعة جدًا حولها هو أمر تحفيزي للغاية\nلجعلها في متناول الجميع. ليس فقط، \"حسنًا، غدًا، سأعرف ذلك\" في شكل مبسط، ولكن\nبدلاً من ذلك، أعرف كيفية الوصول إليه ودمجه مع معرفتي الأخرى. لذلك ما زلت شخصًا يعتقد أن الاختبارات يمكن أن تساعدك في معرفة ذلك.\nحيث تكون في مجال موضوع ما، ومن الأمور الجدارة أنك تريد حقًا أن تكون قادرًا على إثبات أن لديك بعض القدرات. وبالتأكيد، عندما أذهب إلى الطبيب، يسعدني أنهم\nخضعوا لبعض الفحص والاختبار الآن، التعامل مع حقيقة أنه إذا كانت لديك\nخلفية محرومة، حتى لو كنت على\nمنحدر لتصبح جيدًا حقًا، فإن النظر إليك\nفي تلك اللحظة من الزمن ربما لا ينبغي أن يكون قابلاً للمقارنة بشكل مباشر تحدي مثير للاهتمام، جزئيًا، ولهذا السبب أحب\nفكرة مدرس الكمبيوتر لأنه يمكن أن يكون مشجعًا، ويمكنه فهم\nمفاهيمك الخاطئة، وإذا تمكنا من\nإتاحتها على نطاق واسع جدًا، فهذا يعني أن\nالتطور الذي يتمتع به والديّ على سبيل المثال.  إن ما يتم تقديمه\nلي كخريج جامعي هو أمر أقل تميزًا في\nعالم يكون فيه مدرس الذكاء الاصطناعي مفيدًا للغاية في\nمجموعة كبيرة ومتنوعة من المواضيع. لكنني سألتزم، في كثير من الحالات، بإجراء\nتقييم موضوعي لمهاراتك، وأعتقد أنه بمجرد الابتعاد عن ذلك، فأنت في مكان صعب للغاية، حتى فيما يتعلق بانضباطك الخاص، هل أفهم ذلك؟  هذا الموضوع أم لا؟ - نعم، لا، أنا أوافق. وكلما قال شخص ما، \"أوه، أنا ضد التقييم الموحد،\" أقول، \"أي جزء أنت ضد، الجزء الموحد\nأم جزء التقييم؟\" وعادة ما يكون من الصعب عليهم أن يكونوا ضد أي منهما. لكنني أعتقد أن ما\nيقولونه ضمنيًا هو أنهم يشعرون أنه\nربما لا يصور مكان الطالب بشكل كامل. هناك أشياء معينة فقط\nيمكنك قياسها. ربما لا يلتقط المنحدر. بالنسبة إلى وجهة نظرك، إنها لقطة في الوقت المناسب. هل تعتقد أن الذكاء الاصطناعي،\nفي السنوات الخمس أو العشر القادمة، قد يحل هذه المشكلة من خلال القدرة على تقديم تقييم أكثر ثراءً؟ ويمكن أن يكون التقييم هو\nمكانك في الرياضيات، أو مكانك في الكتابة. يمكن أن تكون أشياء\nمثل مقابلات العمل. هذا شكل من أشكال التقييم\nوالتقدم الوظيفي. هل تعتقد أنه سيكون\nله دور كبير هناك؟ - حسنًا، أعتقد أنه نظرًا لأنه لا يزال لدينا بعض العيوب في الذكاء الاصطناعي، فلا يزال بإمكان الناس أن يكونوا متشككين عندما نقول إن التقييم التفاعلي مع الذكاء الاصطناعي الذي يناقش موضوعًا مثل فهمك\nللتاريخ أو الاقتصاد، يمكننا أن نجعل ذلك معادلاً لـ  أفضل نوع من الأستاذ الذي سيشركك بعمق. وأعتقد أننا سنصل إلى هذا المستوى، وهو أعلى من مجرد\nمجموعة من الأسئلة القياسية التي يجب أن يكون لديك نوع\nمن الإجابة المباشرة عليها وثراء\nفهمك للموضوع. هناك أشخاص أفضل في أسئلة الاختيار من متعدد\nواختبار الأشياء. أعتقد أنني وأنت ربما\nكنا سنحقق أداءً تعليميًا جيدًا، ولكن أعتقد جزئيًا أننا جيدون في الاختبارات، وشعرت بالسوء تجاه الأطفال الذين الاختبار، أستطيع أن أقول إنهم كانوا خائفين عندما يكون الاختيار من متعدد، عليك الإجابة على كل شيء  من هذه\nفي ساعة سوف يخرج. لذلك، من خلال استيعاب\nحوار أكثر مرونة، أعتقد أنه\nسيتم تقدير أنماط التعلم المختلفة.  سيكون موضع تقدير مجموعة أوسع من المهارات\n. ولكن لا يزال يتعين علينا أن نثبت ذلك للناس. نحن لسنا على هذا المستوى من مطابقة أستاذ عظيم يناقش\nموضوعًا معك بعد. - ومن ثم القدرة على تقديم تقييم جيد لها. - بالضبط.\n- ما رأيناه، يمكننا محاكاة جزء المناقشة الفعلي بشكل جيد بالفعل. لكن التقييم القوي،\nأعتقد أن هناك، ولكن من المحتمل أن يحدث، تخميني. - أوه نعم، سوف يحدث. أعني، عندما يكون لديك خبراء يجيدون\nشيئًا ذو طبيعة لغوية، وبينما تقوم بجمع مجموعات البيانات هذه وتقديم تعليقات لهم باستمرار، حتى مع آليات اليوم،\nالتي يمكن تحسينها، ولكن حتى مع هذا فقط، يمكننا التطوير  شيء\nمثل خبير بشري. - وأعني بهذا أن الأمر مضحك. أعني، هذه المحادثة، كما تعلم، حتى قبل عام كانت\nستبدو وكأنها خيال علمي.  وكل هذا يتغير بسرعة كبيرة. أشعر بهذه الطريقة وأشعر\nوكأنني في منتصف الأمر، لكن الأمور تتغير بسرعة كبيرة.  من المحتمل أنك أيضًا ترى المزيد. أريد أن أطرح عليك سؤالاً طويل الأمد، لأنه من يدري كيف\nسيكون العالم حتى بعد 20 عاماً؟ لكن لنفترض خمس سنوات، وهو ما\nأعتقد أنه ما يجب على معظم الناس التخطيط\nله في حياتهم، سواء كانوا يديرون شركة، أو كانوا\nشبابًا في حياتهم المهنية. كيف سيبدو عالم التعليم والعمل برأيك؟ مثل رسم صورة. هل سنكون قادرين على عقد\nمؤتمر فيديو مع، أعني، لا أريد أن أحجبك، ولكن كيف سيبدو؟ كيف سيكون الأمر\nمختلفًا بشكل كبير أم لا عن العالم الذي نعيش فيه الآن؟ - حسنًا، ستكون هناك مجموعة معينة من الوظائف حيث مجرد تحريك المستندات\nوالنظر في المستندات، على سبيل المثال ، المطالبات المحاسبية أو الطبية، حيث يكون عمق\nالفهم في تلك الوظائف واضحًا جدًا. وستكون بعض هذه الوظائف\nمؤتمتة تمامًا. ثم سيكون هناك الكثير من الوظائف، حيث لا يزال البشر يقومون بها، مثل صنع بطاقات التهنئة. وعدت\nوشاهدت فيلم \"هي\" لأنه يثير إعجابًا كبيرًا - اعتقدت أن بطاقات التهنئة ستكون بالتأكيد آلية، لأنه الآن يمكنك الحصول على تخصيص كبير لبطاقات التهنئة، ولكن على أي حال. - نعم، ربما\nيمكنك أن تفعل ذلك بنفسك. خذ دوللي 10 وقل: \"مرحبًا، هذه هي الطريقة التي أريد أن\nأسخر بها من أختي. ذكّرها بهذا الشيء من الماضي، وإليك بعض الصور التي يمكنك لصقها فيها.\" لذا، نعم، يمكنك استبعاد\nالمحترف هناك لأنك والذكاء الاصطناعي يمكنكما\nالقيام بذلك بطريقة مخصصة للغاية. ولكن سيكون هناك الكثير من الوظائف المتبقية التي تكون أكثر إنتاجية، حيث يكون لديك هذا النوع من مساعد الطيار الذي يتولى، حسنًا،\nتحويل PowerPoint إلى مستند Word،\nومفاجأة، هذه المسودة متاحة لك لتتمكن من الحصول عليها  كنقطة البداية. ولذا فإن الإنتاجية الإضافية ستخلق فرصة جديدة لأخذ أشياء مثل الرعاية الطبية وجعلها أفضل، والتعليم وجعله أفضل، ورعاية المسنين وجعله أفضل. الإنتاجية شيء جيد، وكان الناس يتحسرون وهناك العديد من الكتب حول، أوه، لدينا كهرباء. ومنذ ذلك الحين،\nلم تكن الأمور على ما يرام، على الأقل بالطريقة التي تعكسها\nالأرقام الاقتصادية، بقدر ما حدث هناك من دراماتيكية. هذا سوف تراه في\nالأرقام الاقتصادية بشكل كبير، سواء الجانب الآلي منها أو جزء منها في القراءة والكتابة أيضًا. لذلك، في غضون خمس سنوات،\nسنكون في مكان مختلف. نأمل أن\nتظل الانتخابات بلا منازع، وأن التزييف العميق لن يجعل\nالمشاكل التي لدينا بالفعل أكثر صعوبة. ومن المثير للاهتمام أنه\nفي الوقت الذي لا تحظى فيه الحكومة بالثقة كما نرغب، سيتعين عليها أن تتقدم إلى الأمام\nوتغير سياساتها الضريبية وأن يكون لديها سياسات إعادة تدريب وأن تكون جزءًا من\nالحوار حول وضع القواعد. تقول الصناعة برمتها، إن هناك دوراً للحكومة هنا، ولكن في وقت تشكل فيه الثقة في ذلك والانقسام تحدياً كبيراً. لذا آمل ألا\nنعاني كثيرًا من السلبيات في\nفترة الخمس سنوات، وبحلول ذلك الوقت، سيعيد المجتمع\nتوجيه نفسه ويقول، \"حسنًا، كيف يمكننا تجنب\nاستخدام هذا كوسيلة للهجوم؟ كيف\"  هل نتأكد من\nاستخدامه بطريقة عادلة؟\" بالتأكيد، أحلامي بشأن الصحة والتعليم في البلدان الفقيرة، أعتقد أن الأمر سيستغرق منا خمس سنوات لتحقيقها\nواستخدامها على نطاق واسع. خمس سنوات هي فترة زمنية قصيرة جدًا، ولكنها تضع الأساس الذي آمل أن أكون فيه أكثر إنتاجية كمجتمع، والعديد من تحديات\nالشيخوخة أو المناخ، ويتوقع الناس من الحكومة أن تفعل أكثر مما هي قادرة\nعلى القيام به، وهذا ما نفعله.  ستقول: \"رائع، نحن نجعل أدوية السمنة أفضل. نحن نجعل أدوية الزهايمر أفضل.\" وستحصل على هذا النوع من النظرة الإيجابية للنظام الحالي\nولن تجعله يعمل بشكل أفضل بطريقة تدريجية\nمقابل الانقسام أو حتى النظر في البدائل الجذرية التي أعتقد أنها ستكون مخيفة جدًا. لذا فإن الابتكار هنا، لأنه\nسيفاجئ الناس، وهو غير متوقع، لديه\nالكثير من الجوانب الإيجابية. - نعم، أعني أن هذا يؤدي\nإلى السؤال الأخير، وهو كيف تشعر؟ تتغير وجهة نظري حول الذكاء الاصطناعي يوميًا تقريبًا، حيث أقرأ أكثر وأفكر أكثر وأجري مثل هذه المحادثات.  هل تشعر بإيجابية صافية؟ هل أنت قلق حقًا\nبشأن أشياء معينة ضمن إيجابيتك؟  هل أنت سلبي صافي؟ ما هو شعورك حيال ذلك، وما هي الأشياء التي\nتفكر فيها أكثر؟ - أشعر بسعادة غامرة عندما\nأجلس مع فريق مكافحة الملاريا ونتحدث عن كيف سيكون لدينا طرق أفضل لقتل البعوض والتي يمكن لهذه البرامج أن تساعدنا فيها، أو عندما نجلس ونتحدث عن الأطفال الذين قرروا أنهم كذلك  لسنا جيدين في الرياضيات، لأننا لم نحقق الكثير من\nالتقدم لهؤلاء الأطفال، مجرد امتلاكنا كل القدرة\nعلى تجربة معارفهم، لم يكن ذلك كافيًا لجذبهم. وبالتالي فإن مسألة التحفيز وحقيقة أن مدرس الذكاء الاصطناعي  ،\nأحد الأشياء الممتازة سيكون فهم المستوى الصحيح، والتشجيع المناسب،\nلجعل شخص ما يشعر وكأنه، \"نعم، هذا\nالفهم الرياضي للعالم هو شيء يمكن أن يعمل\nلصالحي ويجعل حياتي أفضل، حتى بما يتجاوز أي نوع من الأشياء\"\nفرص العمل التي يتيحها\". لذلك أنا سعيد جدًا بذلك.  في العالم الذي ننقله إليه وقدرته على إجراء\nمناقشات واقعية معقدة وبلدان مختلفة\nتجرب لوائح مختلفة، أود أن أقول إن التحدي السياسي حيث يقول الجميع إن الحكومة لديها هذا الدور الكبير الكبير الذي تلعبه، للاستفادة من  الإيجابيات، على سبيل المثال، تغيير الهيكل الضريبي، والتخفيف من السلبيات، والتزييف العميق، والتحيز، والهجمات السيبرانية المدعومة بالذكاء الاصطناعي.  فهل هياكل الإدارة لدينا\nناضجة بالدرجة الكافية، ومرنة بالقدر الكافي، وهل يمكنها التوصل إلى توافق في الآراء بالقدر الكافي لتمكيننا من إدارة هذه\nالفرصة بطريقة جيدة؟  ومن المؤكد أن هناك أيام أشعر فيها بالقلق من أن الجانب الحكومي في هذا الأمر لن يتقدم إلى ما هو ضروري. - نعم، حسنًا، يمكنني التحدث معك\nلعدة ساعات أخرى، وربما أيام حول هذا الموضوع. لكن بيل، شكرًا لك على تخصيص\nوقتك لهذا الغرض. هذه قيمة فائقة. - لا، من الممتع أن نكون في\nهذه الرحلة معًا، وسنكون شريكًا رائعًا وسنساعدك على تحقيق رؤيتك. - عظيم، حسنًا، نحن نقدر ذلك كثيرًا. إنها أوقات مثيرة. دعونا نرى ما سيحدث.  (يضحك) - حسنًا، شكرًا. - حسنًا، شكرًا بيل.",
    "t_italian": "- Ciao a tutti, sono Sal\ndella Khan Academy. E come alcuni di voi sanno,\nho pubblicato il mio secondo libro, \"Brave New Words\" sul futuro dell'intelligenza artificiale nell'istruzione e nel lavoro. È disponibile ovunque\ntu possa acquistare i tuoi libri. Ma come parte della ricerca per quel libro, ho fatto alcune interviste con\nalcune persone affascinanti, che stai per guardare. Sono molto entusiasta di\npresentarti il ​​nostro ospite che probabilmente non ha bisogno di\npresentazioni, Bill Gates. Bill, grazie per esserti unito a noi. - Bello vederti. - Quindi so che l'intelligenza artificiale è molto\nimportante per te. Ovviamente, tutti noi della Khan Academy abbiamo riflettuto molto\nsull’intelligenza artificiale nell’istruzione, e il focus di questo è l’\nintelligenza artificiale nell’istruzione e nel lavoro. E inizierò con una\ndomanda che ricevo da molti adolescenti e persone al college e dai loro genitori: dato quello che sai su ciò che sta accadendo nell'intelligenza artificiale e forse anche in altre tecnologie, ad esempio, quale consiglio daresti?  dare a qualcuno che sta cercando di capire su quali competenze dovrebbe concentrarsi o su quali non concentrarsi? In cosa dovrebbero specializzarsi? \nCome saranno o non saranno i lavori? - Beh, l'intelligenza artificiale renderà le\npersone più produttive. E in alcuni casi, come nel caso della scrittura di software, c'è molta\ndomanda insoddisfatta di buon software. Puoi renderlo un software di qualità superiore.  È molto difficile prevedere esattamente come sarà il mercato del lavoro, \nma più competenze saranno approfondite, che si tratti di consulenza medica, pensiero scientifico\no assistenza clienti, maggiore sarà il valore, anche in un mondo in cui la tua\nproduttività sarà migliorata avendo questo tipo di opportunità.  di lavoratore quasi libero, ti guarda alle\nspalle, ti dà consigli, ti dà molti feedback su\nquello che stai facendo. Quindi non penso che abbiamo in mente qualcosa\ncome non diventare un barbiere o un radiologo perché le nuove capacità\nsono di natura molto orizzontale. Non si tratta di una serie di progressi specifici per argomento. - Quindi è un po' come se\ntutti avessero uno stagista, un assistente di ricerca o un analista. Quindi forse la risposta è: non essere l'assistente di ricerca,\nil tirocinante o l'analista. Impara a gestirli. - Sì, e ovviamente lavori\ncome aiutare i portatori di handicap, gli anziani, aiutare a motivare gli studenti, c'è una domanda così infinita\nper queste cose, anche nel mondo ricco, ma in modo\nancora più drammatico nei paesi in via di sviluppo\nche richiedono lavori che richiedono una profonda connessione umana ed empatia  , diremmo che è ancora molto lontano prima che ci sia un sostituto\nper quelle cose. Abbiamo due rivoluzioni\nin parallelo. Abbiamo questo tipo di miglioramento della lettura e della scrittura abilitato per ChatGPT per i\ncolletti bianchi, ma nel frattempo, le persone\nnon dovrebbero sottovalutare che il tipo di robotica dei colletti blu, che alla fine porta a un robot umanoide, ha uno scopo abbastanza generale in termini di abilità fisiche  , braccia, gambe, cose che può fare, anche questo sta accadendo. E quindi la buona notizia è\nche avremo più tempo libero, che\nmolte delle carenze che abbiamo su\nconsiglio medico o quando ci confondiamo potranno essere risolte. Abbiamo questa scorta di\nqueste nuove capacità e i ruoli unici che gli esseri umani assumono o il modo in cui prenderanno il loro tempo libero extra e lo renderanno appagante,\nqueste sono le nostre sfide. - Quello che hai appena accennato è interessante, perché penso che le persone abbiano\nsempre teorizzato che, ehi, diventeremo più produttivi, saremo in grado di\nfare di più con meno tempo, e quindi avremo più tempo libero penso che sia utopico per molte persone. Ma sembra che gli\nschemi del passato, di\nmiglioramenti della produttività, o se non altro, che gli iperproduttivi\nstiano lavorando di più, perché ottengono così tanta\ninfluenza da ogni minuto che non porta necessariamente a quello. Pensi che ci sia qualcosa di\ndiverso in questa ondata in cui forse cose come la settimana lavorativa di quattro giorni o forse anche\nuna settimana lavorativa di tre giorni diventeranno comuni? O pensi che le persone\nsaranno in grado di fare di più con meno e assumere meno persone rispetto a oggi? -\nVale la pena comprendere le analogie con il passato, ma i cambiamenti nel passato\nerano di natura generazionale. Quindi la meccanizzazione\ndell’occupazione primaria, ovvero la coltivazione del cibo,\navviene gradualmente. E quindi il nonno era un contadino\ne i tuoi genitori meno, e poi ora non conosco\nmolti contadini ricchi nel mondo.  Ne conosco alcuni ma non molti. E quindi non dovevi\ncambiare a metà carriera. È vero che è emersa una domanda per cose che non ci saremmo aspettati. E quindi è confortante\nguardare quella storia, ma il livello totale di capacità qui e la velocità con cui si diffonderà nell'economia e cambierà i mercati del lavoro, in cinque anni, l'effetto sarà molto sostanziale. Direi che tra 10 anni\nsarà piuttosto drammatico. E quindi non penso che\npossiamo respingere completamente l'idea che questo cambiamento\nci porterà finalmente al punto in cui il compromesso\ntra lavoro e tempo libero diventa effettivamente importante. E invece di tassare il lavoro,\ncome con le tasse sui salari, l'ho chiamata tassa robot\nquando ne ho parlato e la gente ha pensato che fosse strano, ma passeremo a\nsovvenzionare il lavoro e tassare completamente sul\nlato del capitale e del profitto, il che già da solo rappresenta un cambiamento piuttosto grande che il governo dovrà fare. - È un'idea affascinante\ne ha molto senso, perché ovviamente, se\nabbiamo una società più abbondante, una società più produttiva, ma prendiamo una\nbanca di investimento o una società di consulenza. Gran parte del\nlavoro tradizionale che le persone fatturano e le dimensioni dell'organizzazione sono gli analisti che eseguono fogli di calcolo e realizzano presentazioni PowerPoint. E molte di queste cose\nverranno automatizzate molto velocemente. E quindi questo è un mondo in cui\nsi sovvenzionano queste aziende per dire: \"No, continua ad assumere stagisti. Continua ad assumere questi analisti junior\". Quindi abbi un senso di scopo rispetto al fatto che questi giovani\nnon abbiano qualcosa da fare, non sviluppino le proprie competenze e non siano mai in grado\ndi diventare manager. - Sì, se arrivi all'estremo in cui lo scopo fornito dal lavoro non è il principio organizzativo centrale\ndella società, allora entri in alcune profonde\ndomande filosofiche su quali dovrebbero essere le priorità\ne qual è lo scopo. In modo astruso, il libro di Bostrom\n“Superintelligence” ne ha parlato. Non penso davvero\nche sia stato scritto così bene. \"Life 3.0\" ha fatto un buon lavoro nel dire: ok, qual è il ruolo dell'intelligenza in questi scenari futuristici?  Stanno uscendo molti nuovi libri in questo momento, sono riuscita a recuperarli tutti. Probabilmente alcuni di questi saranno utili. - Ti sto intervistando\nproprio adesso per uno di loro. (entrambi ridono)\n- Esatto. - E tornando alle\nnozioni di base, per così dire, ovviamente, molta gente, abbiamo parlato un po' di lavoro, ma ora tornando al\nnocciolo dell'istruzione, a cui so che tieni profondamente, noi  Ho parlato molte volte di istruzione, in questo momento c'è una sorta di emergenza nel settore dell'istruzione. Persone come i bambini\nimbrogliano usando questa tecnologia. Hai una risposta e la stiamo sentendo da tutte le facoltà di tutti i livelli scolastici. Cosa faresti se\nfossi un professore di storia o di scrittura in una scuola superiore o all'università in questo momento? - Beh, per avere un\ntest puro della capacità di qualcuno di scrivere o\ncalcolare da solo, dovrai creare un ambiente in cui non abbiano accesso\nagli strumenti software.  I nostri sforzi per rilevare se il software ti ha aiutato a scrivere qualcosa\ncattureranno il tipo più sciatto dell'equivalente di\ntaglia e incolla da Wikipedia. Ma alla fine non saremo in grado di dirlo, perché ci sarà\nuna tale varietà di strumenti e la varietà di suggerimenti\nrenderà tutto ciò piuttosto difficile. Quindi la buona notizia è\nche per la prima volta, se scrivi su un argomento, l’\nintelligenza artificiale può darti un feedback. Può aiutarti con la prima bozza. Può aiutarti a confrontare ciò che\nhai fatto con qualcos'altro. Può creare un programma di studio di cose di cui potresti\nprovare a scrivere. E quindi il livello di coinvolgimento, dove può aiutarti\nogni volta che sei bloccato, è davvero qualcosa di nuovo. Va anche oltre il fatto che ci siano fantastici video su YouTube su tutte le scienze e la storia. Questo entra nel regno della personalizzazione dei tutor e del feedback\nsulla lettura e sulla scrittura. Quindi il paradosso è che ora abbiamo questo strumento che se vuoi\nimparare, rende tutto più semplice, ma per testare le capacità di qualcuno, dovremo usare nuove tecniche. E purtroppo, in alcuni casi, le\npersone potrebbero pensare: \"Wow, se è così bello, devo ancora impegnarmi altrettanto?\" Tu ed io stiamo dicendo, sia\nper la realizzazione personale che per svolgere un ruolo nel\ncontributo nel mercato del lavoro, più alto è il livello delle tue capacità, più manterrà\nun valore sostanziale. Quindi aiutare i ragazzi a imparare come\nottenere feedback sulla loro scrittura, penso che sia fondamentale, perché oggi facciamo un\npessimo lavoro in questo senso. - Quindi quello che sento è\nche non solo c'è una ragione in più, ma c'è anche\nuna ragione in più per accelerare, secondo la parte precedente della nostra conversazione, ovvero quelle\ncose a livello di stagista e di livello base che si aspetteranno rapidamente che tu faccia\nessere più architetto, più editore, più manager. E se non riesci a fare questo\nsalto prima o poi, la buona notizia è che questi stessi\nstrumenti possono essere usati per farlo, cosa con cui anch'io sono d'accordo. E ovviamente ci stiamo\nlavorando molto. Quindi, se ci fosse un professore, voglio dire, riceviamo email da\ngente, forse anche tu, del tipo: \"Cosa farò quest'autunno?\" E sembra che\nfaresti più cose supervisionate in classe per la valutazione, e faresti ancora\nla tradizionale tesina o cambieresti le\nregole di ingaggio al riguardo? - Beh, sì, sul posto di lavoro, le persone saranno incoraggiate a inventare il miglior prodotto possibile dove si trovano loro più l'intelligenza artificiale. E non c'è motivo per non far sì che quella sia una delle abilità\nche pratichi: ehi, facciamo un business plan. E certo, impara come utilizzare\ni migliori strumenti di intelligenza artificiale. Ma vedrò che, se lo\nfaccio fare solo all'intelligenza artificiale senza alcun valore aggiunto, sarà come una C-meno o peggio. Devi entrare lì e apportare un po' più di precisione, diverse fonti di conoscenza e avere un valore aggiunto unico. Voglio dire, se capisci il\npubblico, è ancora difficile per il computer comprendere tutti quei\ndiversi contesti. Quindi sì, avrai\ndue tipi di scrittura, la scrittura che fai completamente\nsenza l'aiuto del computer e la scrittura che fai dove sei incoraggiato a renderlo il miglior assistente possibile. - No, ha senso. Abbiamo parlato con Kevin Roose, che scrive per il New York Times, che ha scritto anche delle sue interazioni con\nSydney e tutto il resto. E il punto è che c'è la\nscrittura e c'è il giornalismo. La scrittura, le IA stanno\ndiventando molto brave, ma il giornalismo, stabilire contatti, essere in grado di intervistare\npersone, formare legami, eccetera. E che c'è un analogo a tutto. Se sei un imprenditore,\neffettui test sugli utenti, anche se l'intelligenza artificiale potrebbe essere in\ngrado di farne alcune parti. In relazione a tutto questo feedback sulla pratica, hai toccato la parola \"valutazione\". Sono curioso di sapere dove\npensi che stia andando la valutazione. Ovviamente, per molti anni, la valutazione scalabile è stata piuttosto limitata. Scantron, scelta multipla,\necco cosa abbiamo fatto. Poiché non potevamo fare una valutazione più completa, ha iniziato a guidare ciò che accade o non\naccade in classe. Pensi che le cose stiano per cambiare? - Beh, c'è una\ncontroversia sulla valutazione indipendente dall'intelligenza artificiale.  I punteggi SAP dovrebbero far parte\ndelle ammissioni al college? Penso che dimostrare che le tue abilità matematiche e la tua comprensione di base della storia e della scienza siano forti, sia piuttosto importante. E che quando vuoi\nconsolidare la conoscenza, il fatto che ti vengano poste\ndomande molto ampie al riguardo è molto motivante nel\nrenderla accessibile. Non solo \"Okay, domani lo saprò\" in una forma semplicistica, ma\npiuttosto so come accedervi e combinarlo con le altre mie conoscenze. Quindi sono ancora qualcuno che pensa che i test possano aiutarti a sapere\ndove ti trovi in ​​un'area tematica ed è una cosa meritocratica che tu voglia davvero essere in grado di dimostrare di avere delle capacità. Certamente, quando vado da un medico, sono contento che siano stati\nsottoposti a qualche esame e test Ora, affrontare il fatto che se hai un\nbackground svantaggiato, anche se sei sulla\nbuona strada per diventare davvero bravo, guardandoti proprio\nin quel momento forse non dovrebbe essere direttamente paragonabile sfida interessante. In parte, è per questo che amo l'\nidea del tutor di computer perché può essere incoraggiante, può capire quali\nsono le tue idee sbagliate e se riusciamo a renderlo\ndisponibile in modo molto ampio, significa che la\nsofisticatezza che, ad esempio, hanno i miei genitori.\nfornitomi come laureato è meno unico in un\nmondo in cui il tutor AI è di grande aiuto in un'enorme\nvarietà di materie. Ma resisterò, in molti casi, avendo una\nvalutazione obiettiva delle tue capacità, penso che una volta che ti allontani da ciò, ti trovi in ​​una situazione molto difficile, anche in termini di disciplina, capisco?  questo argomento o no? - Sì, no, sono d'accordo. E ogni volta che qualcuno dice: \"Oh, sono contrario alla valutazione standardizzata\", rispondo: \"A quale parte sei contrario, alla parte standardizzata\no alla parte di valutazione?\" E di solito è difficile per loro opporsi a uno di questi due. Ma penso che ciò che\nstanno implicitamente dicendo è che sentono che\nforse non sta catturando completamente dove si trova lo studente. Ci sono solo alcune\ncose che puoi misurare. Forse non sta catturando la loro pendenza. Secondo te è un'istantanea nel tempo. Pensi che l’intelligenza artificiale,\nnei prossimi cinque o dieci anni, potrebbe risolvere questo problema fornendo una valutazione più completa? E la valutazione potrebbe essere\ndove ti trovi in ​​matematica, potrebbe essere dove ti trovi in ​​scrittura. Potrebbero anche essere cose\ncome colloqui di lavoro. Questa è una forma di valutazione,\nprogressione di carriera. Pensi che\navrà un ruolo importante lì? - Beh, penso che dato che abbiamo ancora alcune imperfezioni nell'intelligenza artificiale, le persone possono ancora essere scettiche quando diciamo che una valutazione interattiva con l'intelligenza artificiale mentre si discute di un argomento come la tua comprensione\ndella storia o dell'economia, che possiamo renderla equivalente a  il miglior tipo di professore che ti coinvolgerebbe profondamente. E penso che arriveremo a quel livello, e questo è superiore a una semplice\nserie di domande standardizzate a cui devi avere\nuna risposta semplice e la tua ricchezza di\ncomprensione dell'argomento. Ci sono persone che sono più brave nelle domande di tipo a scelta multipla\ne testano le cose. Penso che tu ed io probabilmente\nsaremmo andati bene dal punto di vista educativo, ma penso che in parte siamo bravi nei test, e mi sono sentito male per i ragazzi che hanno fatto il test, potevo dire che erano intimiditi quando quella scelta multipla, devi rispondere a tutti  di questi\nin un'ora verrebbero fuori. Quindi, favorendo un\ndialogo più flessibile, penso che saranno apprezzati diversi stili di\napprendimento.  Sarà apprezzato un insieme più ampio di competenze\n. Ma dobbiamo ancora dimostrarlo alla gente. Non siamo ancora al livello necessario per eguagliare un grande professore che discute di\nun argomento con te. - E poi poterne effettivamente dare una buona valutazione. - Esattamente.\n- Ciò che abbiamo visto, possiamo già emulare abbastanza bene la parte della discussione vera e propria . Ma la valutazione forte,\npenso che ci sia, ma probabilmente accadrà, immagino. - Oh sì, succederà. Voglio dire, quando hai esperti\nche sono bravi in ​​qualcosa che è di natura linguistica, e mentre raccogli questi set di dati e fornisci loro costantemente feedback, anche con i meccanismi odierni,\nche possono essere migliorati, ma anche solo con questo, possiamo sviluppare  qualcosa\ncome un esperto umano. - E intendo dire che è divertente. Voglio dire, questa conversazione, come sai, anche un anno fa sarebbe\nsembrata fantascienza. E tutto questo sta cambiando così rapidamente. Mi sento così e mi sento\ncome se fossi nel mezzo di tutto ciò, ma comunque le cose stanno cambiando così velocemente. Probabilmente stai anche vedendo ancora di più. Voglio farti una domanda a lungo termine, perché chi sa come\nsarà il mondo anche solo tra 20 anni? Ma diciamo cinque anni, che\npenso sia ciò che la maggior parte delle persone dovrebbe pianificare\nnella propria vita, sia che gestiscano un'azienda, sia che siano giovani\nper la loro carriera. Come pensi che sarà il mondo dell’istruzione e del lavoro? Come dipingere un quadro. Potremo tenere\nuna videoconferenza con, voglio dire, non voglio offuscarti, ma come sarebbe? Come sarà\ndrammaticamente diverso o no rispetto al mondo in cui ci troviamo adesso? - Beh, ci saranno una certa serie di lavori in cui semplicemente si spostano documenti\ne si guardano documenti, diciamo, contabilità o richieste mediche, dove la profondità della\ncomprensione in questi lavori è piuttosto semplice. E alcuni di questi lavori\nsaranno puramente automatizzati. Poi ci saranno un sacco di lavori, dove verranno ancora svolti da esseri umani, come realizzare biglietti di auguri. E sono tornato a\nguardare il film \"Her\" perché racconta in modo carino... - Pensavo che i biglietti d'auguri sarebbero stati sicuramente automatizzati, perché ora puoi avere una personalizzazione di massa dei biglietti d'auguri, ma comunque. - Sì, probabilmente\npuoi farlo da solo. Prendi Dolly 10 e dì: \"Ehi, ecco come voglio\nprendere in giro mia sorella. Ricordale questa cosa del passato, ed ecco alcune foto da inserire\". Quindi sì, potresti eliminare\nil professionista lì perché tu e l'intelligenza artificiale potete\nfarlo in un modo molto personalizzato. Ma rimarranno molti lavori semplicemente più produttivi, in cui hai questo tipo di copilota che si occupa, ok,\ndi convertire PowerPoint in un documento Word e\nboom, quella bozza è a tua disposizione  come punto di partenza. E così quella produttività extra creerà nuove opportunità per prendere cose come l’assistenza medica e migliorarla, l’ istruzione e migliorarla, la cura degli anziani e renderla migliore. La produttività è una buona cosa, e la gente si è lamentata e ci sono molti libri su, oh, abbiamo l'elettricità. E da allora,\ntutto non è stato più così drammatico, almeno per come si riflette\nnei dati economici, come quello che è successo lì. Questo lo vedrai in\ngrande stile nei dati economici, sia nel lato robotico che nella parte di lettura e scrittura del LLM. Quindi tra cinque anni ci\ntroveremo in uno spazio diverso. Si spera che le elezioni\ncontinuino ad essere incontrastate e che i deepfake non rendano ancora più difficili i\nproblemi che già abbiamo lì . È interessante notare che il\ngoverno, in un momento in cui non gode della fiducia che vorremmo, dovrà fare un passo avanti\ne modificare le politiche fiscali, adottare politiche di riqualificazione ed essere parte del\ndialogo per la definizione delle regole. L’intero settore sta dicendo che qui c’è un ruolo per il governo, ma in un momento in cui la fiducia in questo e le divisioni sono molto impegnative. Quindi spero che non avremo\nsofferto così tanto degli aspetti negativi nel\nperiodo di cinque anni, e per allora la società\nsi sarà riorientata e dirà: \"Okay, come possiamo evitare che venga\nusato come veicolo di attacco? Come  ci assicuriamo che venga\nutilizzato in modo equo?\" Certamente, i sogni che ho sulla sanità e l'istruzione nei paesi poveri, penso che ci vorranno cinque anni per realizzarli e\ndiffonderli su larga scala. Cinque anni sono un periodo di tempo molto breve, ma gettano le basi su cui spero, essendo più produttivo come società, molte delle sfide\ndell'invecchiamento o del clima, le persone che si aspettano che il governo faccia più di quanto è in grado\ndi fare, che noi '  Direte: \"Wow, stiamo migliorando i farmaci per l'obesità. Stiamo migliorando i farmaci per l'Alzheimer\". E otterrai questo tipo di visione positiva del sistema attuale e\nnon lo farai funzionare meglio in modo incrementale\nrispetto alle divisioni o addirittura considererai alternative radicali che penso sarebbero piuttosto spaventose. Quindi l'innovazione qui, poiché\nsorprenderà le persone, non è prevista, ha\nmolti aspetti positivi. - Sì, voglio dire, questo porta\nall'ultima domanda, ovvero: come ti senti? La mia opinione sull'intelligenza artificiale cambia quasi ogni giorno, poiché leggo di più, penso di più e ho conversazioni come questa. Ti senti nettamente positivo? Sei davvero preoccupato\nper certe cose all’interno della tua positività? Sei netto negativo? Come ti senti a riguardo e quali sono le cose a cui\npensi di più? - Sono entusiasta del fatto che quando mi\nsiedo con la squadra contro la malaria e parliamo di come avremo modi migliori per uccidere le zanzare con cui questi software possano aiutare, o ci sediamo e parliamo di ragazzi che hanno deciso che sono  non erano bravi in ​​matematica, non abbiamo fatto molti\nprogressi per quei ragazzi, il solo fatto di avere tutta la capacità\ndi mettere alla prova le loro conoscenze, non era abbastanza per attirarli. E quindi la questione della motivazione e il fatto che il tutor dell'intelligenza artificiale  ,\nuna delle sue cose eccellenti sarà capire il giusto livello, il giusto incoraggiamento,\nper far sentire qualcuno del tipo: \"Sì, questa\ncomprensione matematica del mondo è qualcosa che può funzionare per\nme e rendere la mia vita migliore, anche al di là di ogni sorta di\nopportunità di lavoro che offre.\" Quindi ne sono molto entusiasta. Il mondo in cui lo stiamo offrendo e la sua capacità di avere\ndibattiti fattuali complessi e paesi diversi di provare\nnormative diverse, direi che la sfida politica in cui tutti dicono che il governo ha questo grande, grande ruolo da svolgere, per trarre vantaggio dal  aspetti positivi, ad esempio, la modifica della struttura fiscale e per mitigare gli aspetti negativi, i deepfake, i pregiudizi e gli attacchi informatici basati sull’intelligenza artificiale.  Le nostre strutture di governance sono\nabbastanza mature, abbastanza agili e riescono a raggiungere un consenso sufficiente per gestire questa\nopportunità in modo positivo? E ci sono sicuramente giorni in cui temo che il lato governativo di questa faccenda non si farà avanti per quanto è necessario. - Sì, beh, potrei parlarti ancora\nper molte ore, forse giorni, di questo. Ma Bill, grazie per aver dedicato del\ntempo a questo. Questo è estremamente prezioso. - No, è divertente intraprendere\nquesto viaggio insieme e saremo un ottimo partner e ti aiuteremo a realizzare la tua visione. - Fantastico, beh, lo apprezziamo moltissimo. Sono tempi entusiasmanti. Vediamo cosa succede.  (ride) - Va bene, grazie. - Va bene, grazie, Bill."
}