{
    "source": "4Jwyq9l3ANo",
    "youtubelink": "https://www.youtube.com/watch?v=4Jwyq9l3ANo",
    "t_english": "- My name is Michele Marbra and I am a professional learning specialist with Khan Academy. I am super excited to have you all with us today as we share all of the cool new resources that are coming your way. So thank you all so much for joining us today, and I will... Oh, and I live in Florida. I'll pass it to Stacy. - Hello everyone. My name is Stacie Johnson. I lead professional learning for Khan Academy. I am a veteran California teacher, taught in the Central Valley of California for over 10 years, have been very involved with math and science frameworks in the state of California, and really excited to be here today to talk about the state of tutoring in California and how we can continue to do better and evolve in what we're doing to better support our California students. So with that, we're gonna go ahead and jump in. There's our fabulous pictures on the screen, but you can already see us here. So with that, we're gonna go ahead and get started talking about the current state of tutoring in California. And there's some great things that are already going on. So the first is if you have not heard of the California State Library Program HelpNow, it is a great program run by the state of California's library system. It includes live tutors that are available on the screen. It has a skill surfer lab where students can select the different skills that they need to work on and lots of great resources, even including a language lab for our multilingual learners that need support. So it is a great program, spans the state of California. We also have a couple of great grant programs in the state of California. So there is a grant-funded afterschool education program, and this takes a lot of different looks. For a lot of schools or districts, this might be an afterschool program on the school campus where there's caring adults that are there to extend the school day to help students with homework and all of the things that they may need support with. And then there's the ELO-P program. We've probably all heard of ELO-P. It's been around for just a few years and really is focused on extending learning programs. So again, it takes a lot of different looks. This might be a summer program, it might be a Saturday school program. But it really, again, the focus of these grant programs is how do we make the value of the school day last a little bit longer, reach more kids across a greater amount of time. But with all of these programs, there are challenges and disconnects between the great work that's happening in our California classrooms and tutoring. So the first of those disconnects is curriculum alignment. We know that tutoring is the most powerful when students can connect what they're doing in the classroom to what they're learning with their tutor when they're able to make that connection and see that learning is gonna be triggered for them and they see how everything fits together. And it's a really powerful package. Often when tutors are coming from outside of the school program, they may not know what's happening in the classroom. They're not able to establish that connection and really draw those lines for kids. The next challenge that we have and we're all familiar with this is staffing and resourcing. It's one thing to find the resources to put in a program like, you know, what curriculum are we using? What tools? What are the great, engaging activities we're gonna do? That's one challenge. But finding the qualified staff to work these live programs can be particularly challenging. We're struggling to staff our daily classrooms, let alone supplemental instructional programs. And then the last disconnect that we really have is really leveraging the teacher. The teacher is the most powerful person in the school system for a learner. They are the ones that build the connection that really foster the excitement for learning, the passion for learning in our students. So when tutoring is happening apart from that teacher, when the teacher doesn't really know what's happening in tutoring, they're not able to leverage that. Again, we just have this chasm or this disconnect. So we're not really maximizing learning and efficiency for students. Next thing that can happen is, you know, we've been teachers in California, there are some big class sizes out there. Maybe you're a self-contained classroom with 30 to 40 students, or maybe you have five, six, seven, eight classes with 30 or more students, regardless of how many students you have in front of you, we are very excited to introduce you today to Khanmigo. That is our Khan Academy AI chatbot. You see it's little picture here on the screen. Khanmigo can help with that. Whether you have 35 students or over 100 on your roster, Khanmigo got some tools. And in just a second we're gonna jump in and show you those live in action so you can see exactly how Khanmigo can help. Before we do that, just a few things we wanna point out that you should be watching for as you watch Michele walk you through the great things that are gonna happen on the screen. The first is that Khan Academy and Khanmigo are all about personalized learning. None of us learn at the same speed, at the same pace. We don't have the same needs as far as tutoring. So the teacher has the power and the ability to determine what it is students need to work on, and then to put students on a path where they can grow and progress at their own pace, at their own rate. The next is trusted content. We've all heard of Khan Academy. This is a vetted, trusted platform. This content is solid. So you know that what students are working on is standards aligned, common core standards aligned in mathematics, NGSS aligned in science. So you know that this is a quality resource to pull from. And the last is that there's gonna be a full set of tools that Michele is gonna show you to empower teachers. Again, the most important thing we can do is get teachers more time with kids. And so when we can free up some of those clerical tasks, some of those administrative tasks that we have to do that keep us at school until five or starting at 5:00 a.m. if you're an early bird like me, that's gonna just free you up to spend more time with the kids. And that's really what our focus is today. So with that, that's enough talking. Let's see it in action, Michele. - All right, thank you so much, Stacie. This is absolutely one of my favorite things to do, giving teachers back more time. So I am just, I'm honored to be here with you all today. So we are gonna start with the Khanmigo's brand-new dashboard and let me make it a little bit smaller so you can see everything at one time. All right, so this is Khanmigo's brand-new dashboard. You are able to view all of the different tools that Khanmigo has available and we are going to go, we won't be able to hit all of them, but we are gonna look at many of them. You also can separate it by planning. You can separate it by creating, differentiating, supporting your students. So many different features. And again, we're gonna dig into all of them. One of the first things though I wanna show you, just to talk a little bit about what Stacie said, just piggybacking off of that, is all of our courses, in order to access all of our courses, you can view them anytime in the upper left-hand corner of the Khan Academy screen. You just select Courses and you're able to view all of the courses that we have, including the integrated math courses that we offer, as well as our science courses. And again, all of those are NGSS-aligned. So we have courses for anyone and everything, even adults, courses are available. Financial literacy, I think that's a great one and I want my husband to take it personally. But so many different classes. All right, so I wanna jump into, lemme just, how about integrated math? We'll jump into that course. When I select the course, it shows us all of the different units that are available for the course, and our units are broken down into lessons. So I'm just gonna jump into, how about, how about linear equations? That's always a fun one. And when I open that, you're able to see all of the content that the courses offer. Notice the little icons right here. It lets you know if it's a video or if it's an article or if it's a quiz or if it's an exercise that we want our students to complete. So let's say I am a math teacher and I want to assign this video for my students to watch. When I click on it, I'm able to view the video, I'm able to see the transcript of the video, but I wanna create a lesson around this entire video. How do I do that? Khanmigo. All I have to do, Khanmigo lives right here, and I like to... We're in the course now and Khanmigo lives in the course. I just select Khanmigo and several prompts pop up. It'll ask me, do I want help writing a lesson plan? Do I want help explaining the video to my students? Do I wanna help making some warmup activities? Khanmigo will do all of that for me. Or I can ask Khanmigo something different. I can ask Khanmigo, can you help me create exit ticket questions for this? I would like five multiple choice questions. And then I give Khanmigo a second and Khanmigo will be thrilled to help me write that little quiz for me and it will create that quiz immediately for you. And remember, Khanmigo is not like a Google search engine or anything. If Khanmigo doesn't give you what you want, you wanna push it to make sure it does. You know what? Can you make the answer choices abcd? And in just a matter of seconds, of course, and Khanmigo changes it into a quiz that I can give my students anytime. Now, if I wanna go back to the other prompts that were offered, I can ask Khanmigo to help me write a lesson plan with this. And notice it's saying it's gonna help me write a lesson plan. It's not gonna do the entire thing for me because we're co-creating it together. It's helping me because I have the ability and the control to change whatever Khanmigo creates. So yes, please, I would love to create a lesson plan for this. So I'm gonna click on it and it takes a couple of seconds to create it because it includes so many important features that we need. For example, the learning objective. It includes activities, it differentiates for me, it's going to give me direct instruction for my students. It's going to give me independent practice activities for my students, warmup activities for my students. It's just filled with so many great pieces that I need in my lesson plan. So I'm just gonna give it a second to create it. Also, notice this is independent practice that it's suggesting that I assign my students. And it's highlighted in blue. Anytime you see something blue, it's a clue to something else. So whenever you're in Khan Academy and you see something blue, click on it and it's gonna take you to something else to investigate. All right, so here is my lesson. Fantastic, fantastic. Here are the materials that it's including, and then a lesson summary at the very bottom, letting me know how long each activity is going to take. Let's say there's something that I don't really like. I'm not a fan of this exit ticket, I'd rather use the quiz that I made, or I want Khanmigo to come up with something different. No worries. Again, I'm in control. All I have to do is click on it. Khanmigo will pop up and ask me a couple of questions. Do I wanna make changes to it? And if so, I can just tell Khanmigo what those changes are. I can have a discussion with Khanmigo about it, or why did you select this, I can talk to him about it. Or I can just ask Khanmigo to try something different. I don't know what I want. I just know I don't like that and I want something different. I hit that button and it changes it for me. So again, I am in control and we're going together, we're gonna co-create a lesson plan that I can use with my students. Now, once I'm happy with my lesson plan, it's exactly the way I want it. Thank you so much, Khanmigo. I have the ability to print the lesson plan or... Oops, sorry. I closed it. But you're able to print the lesson plan or you can download it into a PDF file or you can download it into a Google Classroom or Microsoft Word. So there are a few things that you can do with it after that. All right, I'm gonna go back to my super cool Khanmigo tools. Another great feature that I love and I feel like I need to do this, I would do this at the beginning of every one of my lessons, it's the Lesson Hook feature. How do we get students excited about the content that we're doing? If I'm about to teach a lesson on linear equations, there's nothing really exciting about that. But to my students. To me, I'm all about linear equations. But Khanmigo will help me create a fun and exciting lesson hooks. All I have to do is click on it, let Khanmigo know the grade level, this is for my 9th grade algebra one class, or my 9th grade integrated math class, and we're working on linear equations and I just ask Khanmigo to create it for me. And again, in a matter of seconds, Khanmigo create three fantastic lesson hooks that I can use with my students that I probably would not have thought of on my own. I really like this one. For a hands-on activity, students can use a graphing calculator or an online graphing tool to plot a linear equation. Again, though, notice the purple bar. If there's something that I don't like, all I have to do is click on it and I can ask Khanmigo to change it. - Michele, you know what I think is great about this is that like, you know, being a teacher in the state of California, we have state-adopted curriculum and this really is a nice complement to be able to pull things out and to say, you know what, my lesson for today is great, but I just need a hook. I need this one part. So I love that I can find parts of this that would complement what I'm already doing in the classroom. I'm wondering, we got a lot of questions about what this looks like from a student's perspective. I'm wondering if we could go in and take a look at how Khanmigo serves as a tutor in like maybe that integrated math one class. - Absolutely. So I'm gonna go back to that integrated math class and I'll go back to that exact same unit - linear graphs. And I'm gonna go to the video, to pick a video. And when I select Khanmigo, just like a teacher would, up here at the very top of the screen, this lets me change it from teacher mode to student mode. So now student mode is on. Notice, it gives me different prompts right here. It's going to ask me, do I want a summary of the video? Do I want it to quiz me on the video? Do I wanna write a poem about the video? Or why should I care about learning this video? That's a question that most students have. Why should I care about this? So I'm gonna go ahead and click on that and Khanmigo is going to ask me, well, what do I like... Do you like video games? Video game characters moving all sorts of directions. And it relates the content back to the student. If the student is doing an assignment, because I may have students who are below grade level, but I still have to give my students on grade-level instruction. And if I assign my students on grade-level instruction and I'm not around to support them, I don't have to worry because Khanmigo is there. So if students are working on an assignment that I've given them, Khanmigo pops up and it says, do you need help solving the problem? Do you wanna try similar examples? Or again, why should I care about this? One thing I wanna point out, I love that Khanmigo says, do you wanna try a similar problem? The reason Khanmigo says that is because Khanmigo will never give your student the answer. Just like a good tutor would never give your student the answer. It's going to help them through the process of understanding and learning the problem. So Khanmigo, even if the student says, what's the answer? Khanmigo is going to tell me, I'm here to help you learn, not just give you the answer. Let's start with the first point and it will walk the students through the process of understanding the content in here. I was gonna say, show one other thing. If you assign your students, let's say, a quiz. If you want your students to complete a quiz on Khanmigo, your students will not be able to access the quiz on Khanmigo. Because the quiz, I wanna know the content that my students know. I don't wanna know what Khanmigo knows or how is Khanmigo helping my students. So if my students go in and I assign them a quiz, Khanmigo is gonna say, I'm sorry, I'm not available on this page. So you know that if you're doing a check for mastery with your students, you are able to know that they understand the content. - Michele, I wonder if I could just like try some things with you. I wonder if I could just be your student and try some things in one of the (indistinct) so we could see Khanmigo in action. - Absolutely. I'd love that. Okay. And we will start this. - Let's do some math. All right, let's see here. Where is our friend Khanmigo? So we're doing function inputs and outputs. I don't even know how to get started. Can we tell Khanmigo we need some help solving this? - Absolutely. What's the answer? I'm lost. - So imagine we're in a classroom, I got 35 kids, hands are up. As a teacher, we can't get to all of them at the same time. Kids are gonna be waiting. So while they're waiting for the teacher, we know that's the best resource. The teacher should always be the first line of defense. Khanmigo can be there to prevent frustration to prevent kids from getting stuck, or they're at home, right? It's in the moment, instant tutoring. So we've told Khanmigo we don't know how to get started, we don't know what to do. I think what I'm unsure of is, what is this f and then parenthesis this f of x? What does that mean? And notice those bubbles. So a lot of times the problem is that kids don't know what to say to Khanmigo. They know they're stuck, they know they don't know what to do, but they don't know how to verbalize that. And that's why those bubbles are there. We're not limited to those, right? So let's actually try something else. Khanmigo's doing a little bit of thinking here, doing some math. We've recently done some great work to improve the ability of Khanmigo to do math. That's why there's a little bit of a delay there. So here it's telling me what f of x is and asking me what happens if we put -8 into the box? So I'm just gonna think here, we got -7. If x is -8, I think that that would be, let's say I make an error and I see that that's -56 minus 1. Let's say that it's -57. Michele, let's see what it says with that. - Check it. - I think we just need to type it into that little Khanmigo box right there. - Oops. -57. - Let's go with anything. Let's see what Khanmigo does with that. So it's here to offer me some support in the moment. It's gonna think about how I've done there. It's doing some math. Let's see how it responds. Oops. Hmm. So it's acknowledging that I made a mistake, but in a really supportive way, and let's trying to work me through finding that small mistake. So f of x means that if we put x into that -7x, and then look at how it breaks that down. So if we put in -8, we get -7 times -8. So we get 56 minus 1. So take a look at how it validated me and it gave me a small step, but it's not giving me the answer. So you're gonna notice a very Socratic approach. Well, let's try something else, Michele, that a kid might say, let's go with the good old IDK. Again, imagine you got kids with their hand up, they're waiting for you, right? What is there to support them? Khanmigo is there in the moment, no matter where they are, as long as they have their device, they have this tutor on demand. So we're not trying to find people to be in the classroom to support. This is aligned to my instruction that my teacher is giving me in the classroom. So everything is together, it's on point, and my teacher is there with full access to this to know exactly where I've been stuck and how I need support. So for those of you that are in the chat asking, you know, what does that behavior, what does it look like? I hope this has given you just a little bit of a glimpse into how Khanmigo will behave and how it can support students in the moment. - Absolutely. And also as I'm communicating with Khanmigo, teachers have the ability to see any and everything that your students are talking and chatting with Khanmigo about. Or if your students say something inappropriate to Khanmigo, Khanmigo will actually stop that conversation right there. And the teacher gets an alert, letting the teacher know what the student said. Lots of great things with there. - I'm wondering about some NGSS-aligned science. Could we jump into one of our science classes and take a look at how Khanmigo supports there? - Most definitely. How about middle school biology? Sound like fun? - My favorite, my favorite. - Yes. All right. Is there a particular unit you would like to look at? - Definitely. Let's go with ecosystems, biodiversity. Lots of fun there. - That's good times. Good times. Would you like to see a video or an article or an exercise? - I think I'd like to go to an exercise and I think I want to go into that student mode and ask the age-old question that my students ask me all the time. Why in the heck do I need to care about learning this? Can we see what Khanmigo says about that? - Why should I care about this? What are some things that you care about? I love to dance. - Oh, look at that. Maybe pulling in a little bit of relevance, tying it to things that I care about as a learner. Okay. - I like it. - Oh, so like if a dancer leaves, the group gets smaller. So what an interesting way to tie what the student cares about to the content on the screen. Okay, you know what? That doesn't feel like enough though. Can I get another example maybe? - Yes, I like that. Can you give me another example? Also, I really like Taylor Swift. Think of Taylor Swift's fan base as an ecosystem. If she stops making music, some fans might leave. This is like changes in an ecosystem causing population to get smaller. Does that make sense? Oops. It does. It absolutely does. So thank you very much, Khanmigo. Now I would... Oops, let me turn that off. Can you explain more about how the ecosystem works. Because now I'm curious, I'm invested. I'm a Tailor, I'm a Swifty, and now I know why I need to learn about this. So I'm gonna ask a lot more questions with Khanmigo. Now I'm hooked and I wanna find out more. And let's go to a question. Let's go. I'm over here. Also, there are videos that are available for students to watch as well. So I can ask the question. Check it. Oh, I got the question right. Excellent, excellent. All right. Here's another one. I wanna try a similar example. Remember, Khanmigo will not give us the answer, but I can try a similar problem to help me through that. I don't want Khanmigo to give me the answer. I can get a similar one. - You know what, all of this has me thinking Michele is like this is engaging. Like if I had had this in the classroom, I wouldn't have had to perform nearly as hard to capture my students' interest and to support them in the moment. But I'm wondering how teachers respond and get data after. Could you walk us through what data teachers are able to get and how Khanmigo might be able to help summarize that data and maybe make some recommendations? - Absolutely. So if I assign content to my students or if my students are working on their own learning path and completing activities in Khan Academy, they're going to work on skills and they're going to get data from that. As a teacher, all I have to do, I can come over here and I can select this class snapshot button and it's going to give me a high-level overview. It's gonna let me select what class that I wanna look at first. I wanna look at this class, the Algebra one class, and it's going to give me a high-level overview of the progress that my students have made in the course, in my course for the last seven days. It's going to tell me the class average. It lets me know how my students are doing on the assignments that they're completing. Also notice it has these light reports in blue, which is a direct link to that actual report. So if I'm looking at the skills that my students are working on, but I want more details, all I have to do is click on it and it takes me to that skills report so I can see exactly what my students are working on. Khanmigo also gives me additional prompts here that I may not have thought of. For example, what student should I celebrate in my class? I love giving class shoutouts so I can see what students need those rewards or who've earned those rewards. What students are struggling? Who do I need to check on to make sure that they're doing what they're supposed to be doing? Another one, this one is my favorite. Group my class by their recommendations. That one, huge time saver. Because again, like Stacie was saying, all of my students are not going to be on the same level and I need to be able to differentiate and give my students what they need. This is my new best friend. It's going to break down what my students need and it tells me what students need what so I'm able to give them the assignments. But you know what? There's something even better. I'm gonna go back to that dashboard and this is my new best friend. This one, I shared this with a teacher yesterday and she said, \"The only thing that this is not doing is making me coffee.\" It is just an absolute game changer. This one is the Recommend Assignments. This is where Khanmigo looks at all of the data on all of the content that your students have been doing, and it recommends specific assignments for particular groups because remember, they're not all in the same place. But this one goes a step further. It will assign them directly for me. So if I want to assign these assignments to that group, all I have to do is select this button. The hardest thing about this that I have to do, the hardest decision that I have to make is, do I want each student to have a different question set or do I want all of my students to have the same question set? And honestly, there's no right or wrong answer. It really depends on what you're using it for. If I'm assigning this to my students as homework, yeah, I wanna make sure everybody has different questions. But if I want my students to work together and collaborate and build that mathematical discourse, I'm going to assign them the same question set and let them work together as I project on the screen. And we can do that together. So that one is a huge time saver. I love that new feature. Another really cool feature that's available is the Real World Context Generator. This one, huge, just like Khanmigo knows that students ask the question \"Why should I care about this?\", this makes it real for students. You just let Khanmigo know your grade level and what we're about to teach. Stacie, what are we about to teach? - Systems of equations. That is my favorite thing to teach. - Systems of equations. All right, and then again, in a matter of seconds, Khanmigo creates three different ideas that I can use with my students. How can they relate? So it's not just, they're not just doing math from my math book, I'm making this real and it's making it more engaging for my students. - And speaking of math books, we have a question in the chat, I wanna make sure everybody hears the answer too. Not only is this standards aligned, again, common core state standards in mathematics and NGSS in science, but we do have course options for Eureka Math or Engage New York in third grade all the way up through algebra two, and Illustrative Mathematics, starting with 7th grade through algebra one. So in that course menu, Michele's just gonna click right there on See all Math, there's tons of stuff here. So we could scroll for about five minutes to see all these different classes. But when we get about halfway down the page, we can actually click in and show you. You can see a quick screen grab here of all the different courses that are available from calculus, and there's our Illustrative mathematics classes right there. So if you are using that curriculum for 8th grade, for Algebra one, if you're using Eureka Math, those are on there. And again, not only standards aligned, but you do have that curriculum alignment, which are a great, great resource. - Would you like me to jump into one of the Eureka Math classes? - Let's take a look at Illustrative Mathematics for 8th grade. - All right. Okay. Any particular topic? - No, let's just take a look at how the course is aligned. And if you're used to using these curriculums, I know that these are pretty prevalent across the state, take a look at how this matches the alignment of the textbook. So you know, what's great about any of the courses, doesn't matter whether you're using our traditional 8th-grade course or you're using this course, the units can be assigned in any order. So you, as the teacher, can make those decisions about the order in which students need to receive content. And Khanmigo is gonna be there no matter what. If I wanna start with unit three, for example, I wanna start with linear relationships before I do any form of transformation, I can do that and Khanmigo is gonna be there the whole way through. So teachers have that autonomy to make those decisions about instructional order and how we're presenting things to kids in a way that's best for their students. - [Michele] Excellent. - All right, well with that, we are gonna just jump back into a few other things. Keep the questions coming. I'm gonna walk you through some of the advantages of the partnership. So if you choose to have your school or have your district pursue a partnership with us, there are several things that come with that as a district partner, right? We know that we can go to khanacademy.org, we can use the content for free. What if we're a district partner? What's different? So we've already seen that course menu, and you may think of Khan Academy, we're gonna go back one slide, so sorry, you may think of Khan Academy as a math program, but what you've already seen today on the screen is that there's so much more there. We have courses across disciplines, not only math and science, but humanities, life skills, computer programming, but the real value of being a district partner expands far past the content and it comes with the support that you receive. Next slide. All right, so on this slide, we are showing you here that, you know, when it comes to AI, the approach that we take to implementation matters. We have been working on this for almost 18 months, two years. We are here to support you with tools, training, data, and experience to guide you the whole way through. So we're not just there at the beginning to get you up and going. We are gonna be there to answer questions, big and small, throughout the duration of the partnership. In addition to that, we also have professional learning for both teachers and administrators. And that is critical to the success of any implementation. But if you're implementing AI, this isn't just a new tool, this isn't any old implementation. This is a shift in pedagogy and how we approach teaching and instruction in our classroom. We believe that teachers deserve comprehensive training on how to get started, how to access data, how to analyze data, and how to really use it to drive instruction. So we're committed to supporting teachers, not just with a one-and-done PD, not even a two, three-done PD, but across the year, and also being able to just be there to answer questions. Sometimes when we're implementing something that is this significant, we just need somebody to talk to, a thought partner to brainstorm. And our professional learning encompasses all of that. So teachers have that wraparound support the entire time. Let's also think about MTSS as multi-tiered systems of support for students. We've already talked about the suite of courses that are available to you, but what we're showing you here on the screen is that if you are using an MTSS model to differentiate and to meet the needs of your students, we have course content to support that. So across these tiers, whether we're using the grade-level course for tier one instruction, or we're using a course that's called Get Ready For where we're building the foundations and getting ready for that grade-level instruction, Khanmigo and that support that you watched Michele use is available in all of these. So the big point, the big thing with MTSS is we have learners that have been struggling for a while and we want to avoid mounting frustration. We don't want them to be stuck. So Khanmigo is available, whenever they need it, right there at their fingertips so that they have that support. - Absolutely. And one thing I wanna just share real quick, Stacie, is in Khanmigo, from the Khanmigo dashboard, if you're trying to, if I'm a 8th-grade science teacher, but my student is reading on a sixth-grade science level, there's a leveler here where you can input a text and you can change the reading level to it. Because if comprehension is not the main focus and understanding the science content is, I wanna make sure that my students are able to do that and they can absolutely do that with this feature. - Yeah. I think it's also important to say here, you know, as we're supporting all learners, Khan Academy is, also available Khanmigo, that chatbot, is also fully supported in English, Spanish, and Portuguese. So also meeting those multilingual learners where they're at and ensuring that while a multilingual learner is maybe requiring proficiency or comfort in English, they're not falling behind on their content, right? They're able to access Khanmigo in Spanish, in Portuguese, in their home language so that they can continue to stay up to, up to par on where they should be on academics. - Absolutely, and just to piggyback on that, just like we want our multilingual learners to do that, we want their parents to be involved as well. So if I need Khanmigo to create a letter to one of my students and the parent primarily speaks Spanish, Khanmigo will translate that letter for me so I can send it the students' parents to keep them involved and in the loop with their students' education. - Huge help, huge time saver. So let's think about data. We took a very brief glimpse at the data that's available to teachers today, but we know that administrators are instructional leaders. And in order to effectively lead instruction, as administrators, we need data. So if you're an administrator on this call, I wanna make sure that you get one glimpse here at the data that's available from a district or a school administrator level, and you're able to see this data. If you look at the left-hand side on that screenshot Michele has on the screen, we're able to see data here at a course level, at a school level, all the way down to a very granular student level so that we're able to identify successes, celebrate students as they make those small steps forward, as they gain proficiency and comfort, right? Really just feeling proud of themselves. We wanna celebrate that. But we're also able to identify opportunities where maybe we need to put a little bit more resourcing or support the teacher with students that are struggling. So as an administrator, the improvements that have been made to this dashboard to me are game changing because I can see that data wide view, very broad, down to a very narrow view. And it's really empowering to be able to lead and guide instruction from that database perspective. So with all of that great stuff in mind, I wanna spend just a second talking about safety. Because as we bring AI into the classroom, there are a lot of people that are nervous about this, and rightly so. This is a new technology. We need to be careful, we need to be thoughtful about how we bring this into our classrooms and in front of our students. So we have been working over the past 18 months with districts across the country and we have learned a lot. This technology is so new and we're all still learning. Nobody is an expert out there, right? This is a new technology. We're all in a place of learning. So there's a lot to figure out. And we're looking for partners. We're hoping that you all wanna partner with us to learn and grow in this mission, to empower teachers and learners to learn together. There's a lot of great stuff happening right now. You see some snips on the screen of like great news stories and great things that are happening. And we're excited to work through this with you, to innovate with you because there's a lot more to learn as we shape education a little bit differently in this age of AI. And if you follow safety, if you're thinking about student safety, I'm sure you've heard of common sense media ratings. And here on the screen, we wanna leave you with this closing thought. As we enter this age where AI is a part of all things in our lives, it seems like, right, it's increasingly prevalent, safety and privacy are paramount, particularly when it comes to our students. At Khan Academy, our team of veteran educators is committed to ensuring that students are safe and their information is private. So Michele already talked about with a partnership, teachers and administrators, you can see what students are talking about, you can get a log. There are guardrails there. This is specifically designed for kids in a classroom with safety first in mind. So there are guardrails, there's full transparency for teachers to see everything. And that's just part of why this rating is reflected here on the screen. Khanmigo is built for kids and it is built for education. So with that, keep the questions coming in the chat. That is what we have to share with you today. If you wanna learn more, our colleague Chelsea is here with us. There's her fabulous picture on the screen. You can email her directly, you can snap that QR code and reach out to Chelsea. But she's eager to talk to you about what all a district partnership entails and how to step into it with us because we're really excited to work with you all next year and continue to reach students in the fabulous state of California. - [Narrator] Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen and to never miss exciting announcements about new free course materials on Khan Academy. Be sure to subscribe. Thank you and happy teaching. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- میرا نام مشیل ماربرا ہے اور میں خان اکیڈمی کے ساتھ پیشہ ورانہ\nسیکھنے کا ماہر ہوں۔ میں\nآج آپ سب کو اپنے ساتھ رکھتے ہوئے بہت پرجوش ہوں کیونکہ ہم آپ کے آنے والے تمام نئے وسائل کا اشتراک کر رہے ہیں۔ تو آج ہمارے ساتھ شامل ہونے کے لیے آپ سب کا بہت بہت شکریہ،\nاور میں کروں گا... اوہ، اور میں فلوریڈا میں رہتا ہوں۔ میں اسے سٹیسی کو دے دوں گا۔ - سب کو سلام۔ میرا نام سٹیسی جانسن ہے۔ میں\nخان اکیڈمی کے لیے پیشہ ورانہ تعلیم کی رہنمائی کرتا ہوں۔ میں کیلیفورنیا کا ایک تجربہ کار استاد ہوں، جو کیلیفورنیا کی وسطی وادی میں 10 سال سے زیادہ عرصے سے پڑھایا جاتا ہوں، ریاست کیلیفورنیا میں \nریاضی اور سائنس کے فریم ورک کے ساتھ بہت زیادہ ملوث رہا ہوں، اور\n کیلیفورنیا میں ٹیوشن کی حالت کے بارے میں بات کرنے کے لیے آج یہاں آ کر واقعی بہت پرجوش ہوں۔ اور ہم اپنے کیلیفورنیا کے طلباء کی بہتر مدد کے لیے جو کچھ کر رہے ہیں اس میں ہم کس طرح بہتر کام جاری رکھ سکتے ہیں۔ تو اس کے ساتھ، ہم\nآگے بڑھیں گے اور کودیں گے۔ \nاسکرین پر ہماری شاندار تصاویر ہیں، لیکن آپ ہمیں پہلے ہی یہاں دیکھ سکتے ہیں۔ تو اس کے ساتھ، ہم آگے بڑھیں گے اور کیلیفورنیا میں ٹیوشن کی موجودہ حالت کے بارے میں بات کرنا شروع کریں گے۔ \n اور کچھ عظیم چیزیں ہیں\nجو پہلے ہی چل رہی ہیں۔ تو پہلا یہ ہے کہ اگر آپ نے کیلیفورنیا اسٹیٹ\nلائبریری پروگرام ہیلپ ناؤ کے بارے میں نہیں سنا ہے، تو یہ ریاست\nکیلیفورنیا کے لائبریری سسٹم کے ذریعے چلایا جانے والا ایک زبردست پروگرام ہے۔ اس میں لائیو ٹیوٹرز شامل ہیں جو\nاسکرین پر دستیاب ہیں۔ اس میں اسکل سرفر لیب ہے جہاں طلباء مختلف مہارتوں کا انتخاب کر سکتے ہیں\n جن پر انہیں کام کرنے کی ضرورت ہے اور بہت سارے بہترین وسائل، یہاں تک کہ ہمارے کثیر لسانی\nسیکھنے والوں کے لیے ایک لینگویج لیب بھی شامل ہے جس کو مدد کی ضرورت ہے۔ تو یہ ایک زبردست پروگرام ہے، جو\nریاست کیلیفورنیا تک پھیلا ہوا ہے۔  ریاست کیلیفورنیا میں ہمارے پاس چند\nعظیم گرانٹ پروگرام بھی ہیں۔ اس لیے ایک گرانٹ سے چلنے والا\nآفٹر اسکول ایجوکیشن پروگرام ہے، اور یہ بہت مختلف نظر آتا ہے۔ بہت سارے اسکولوں یا اضلاع کے لیے، یہ اسکول کے کیمپس میں اسکول کے بعد کا پروگرام ہو سکتا ہے\n جہاں پر دیکھ بھال کرنے والے بالغ افراد موجود ہیں جو \nطلبا کو ہوم ورک اور ان تمام چیزوں میں مدد کرنے کے لیے اسکول کے دن کو بڑھاتے ہیں جن کے لیے\nانہیں مدد کی ضرورت ہو سکتی ہے۔ اور پھر ELO-P پروگرام ہے۔ ہم سب نے شاید ELO-P کے بارے میں سنا ہے۔ یہ صرف چند سالوں سے ہے اور واقعی سیکھنے کے پروگراموں کو بڑھانے پر مرکوز ہے۔\n تو پھر، یہ\nبہت مختلف شکلیں لیتا ہے۔ یہ موسم گرما کا پروگرام ہو سکتا ہے، یہ سنیچر کے اسکول کا پروگرام ہو سکتا ہے۔ لیکن یہ واقعی، ایک بار پھر،\nان گرانٹ پروگراموں کی توجہ کا مرکز یہ ہے کہ ہم\nاسکول کے دن کی قدر کو تھوڑا سا لمبا کیسے بنائیں، \nزیادہ سے زیادہ وقت میں زیادہ سے زیادہ بچوں تک پہنچیں۔ لیکن ان تمام پروگراموں کے ساتھ، ہمارے کیلیفورنیا کے\nکلاس رومز اور ٹیوشننگ میں جو عظیم کام ہو رہا ہے اس کے درمیان چیلنجز اور منقطع ہیں۔ تو ان منقطع ہونے میں سے پہلا\nنصاب کی سیدھ ہے۔ ہم جانتے ہیں کہ ٹیوشن اس وقت سب سے زیادہ طاقتور ہوتی ہے جب طلباء کلاس روم میں جو کچھ وہ کر رہے ہیں اسے اپنے ٹیوٹر کے ساتھ جو کچھ سیکھ رہے ہیں اس سے جوڑ سکتے ہیں جب وہ اس کنکشن کو بنانے کے قابل ہو جاتے ہیں اور دیکھتے ہیں کہ سیکھنے کو\nان کے لیے متحرک کیا جائے گا اور وہ  دیکھیں کہ سب کچھ ایک ساتھ کیسے فٹ بیٹھتا ہے۔ اور یہ واقعی ایک طاقتور پیکج ہے۔ اکثر جب ٹیوٹرز اسکول کے پروگرام کے باہر سے آتے ہیں، تو وہ نہیں جانتے ہوں گے کہ\nکلاس روم میں کیا ہو رہا ہے۔ وہ\nاس کنکشن کو قائم کرنے کے قابل نہیں ہیں اور واقعی بچوں کے لیے وہ لکیریں کھینچتے ہیں۔ اگلا چیلنج جو ہمارے پاس ہے اور ہم سب اس سے واقف ہیں وہ ہے اسٹافنگ اور ریسورسنگ۔ کسی پروگرام میں ڈالنے کے لیے وسائل تلاش کرنا ایک چیز ہے، جیسے، آپ جانتے ہیں، ہم کون سا نصاب استعمال کر رہے ہیں؟ کون سے اوزار؟  ہم کیا کرنے والے ہیں زبردست، دلکش سرگرمیاں کیا ہیں\n؟ یہ ایک چیلنج ہے۔ لیکن\nان لائیو پروگراموں میں کام کرنے کے لیے قابل عملہ تلاش کرنا خاص طور پر مشکل ہو سکتا ہے۔ ہم\nاپنے روزانہ کلاس رومز کے عملے کے لیے جدوجہد کر رہے ہیں، اضافی\nتدریسی پروگراموں کو چھوڑ دیں۔ اور پھر آخری منقطع\nجو ہمارے پاس واقع ہے وہ واقعی استاد کا فائدہ اٹھا رہا ہے۔ استاد ایک طالب علم کے لیے اسکول کے نظام میں سب سے طاقتور شخص ہوتا ہے۔ یہ وہی ہیں جو\n \n ہمارے طلباء میں سیکھنے کا جذبہ، سیکھنے کے جذبے کو فروغ دیتے ہیں۔ لہذا جب ٹیوشننگ\nاس استاد کے علاوہ ہو رہی ہے، جب استاد کو یہ نہیں معلوم کہ ٹیوشن میں کیا ہو رہا ہے، تو وہ اس کا فائدہ اٹھانے کے قابل نہیں ہیں۔ ایک بار پھر، ہمارے پاس یہ\nکھائی ہے یا یہ منقطع ہے۔ لہذا ہم واقعی طلباء کے لیے سیکھنے اور کارکردگی کو زیادہ سے زیادہ نہیں کر رہے ہیں۔ اگلی چیز جو ہو سکتی ہے وہ ہے، آپ جانتے ہیں، ہم کیلیفورنیا میں اساتذہ رہے ہیں، وہاں کلاس کے کچھ بڑے سائز ہیں۔ ہوسکتا ہے کہ آپ 30 سے ​​40 طلباء کے ساتھ ایک خودمختار کلاس روم ہو، یا ہوسکتا ہے کہ آپ کی پانچ،\nچھ، سات، آٹھ کلاسیں ہوں جن میں 30 یا اس سے زیادہ طلباء ہوں، قطع نظر اس کے کہ آپ کے سامنے کتنے ہی طلباء ہوں،\n ہم بہت پرجوش ہیں۔\nآج آپ کو خانمیگو سے ملواتے ہیں۔ یہ ہماری خان اکیڈمی اے آئی چیٹ بوٹ ہے۔ آپ دیکھ رہے ہیں کہ اس کی چھوٹی سی\nتصویر یہاں سکرین پر ہے۔ Khanmigo اس میں مدد کر سکتا ہے۔ چاہے آپ کے روسٹر پر 35 طلباء ہوں یا 100 سے زیادہ، Khanmigo کو کچھ ٹولز ملے ہیں۔ اور صرف ایک سیکنڈ میں ہم چھلانگ لگانے والے ہیں اور آپ کو وہ لائیو ان ایکشن دکھائیں گے تاکہ آپ بالکل دیکھ سکیں کہ\nKhanmigo کس طرح مدد کر سکتا ہے۔  اس سے پہلے کہ ہم ایسا کریں، ہم صرف چند چیزوں کی طرف اشارہ کرنا چاہتے ہیں کہ آپ کو اس وقت دیکھنا چاہیے جب آپ Michele کو اسکرین پر ہونے والی عظیم چیزوں سے گزرتے ہوئے دیکھتے ہیں۔\n پہلا یہ کہ خان\nاکیڈمی اور خانمیگو سبھی ذاتی نوعیت کے سیکھنے کے بارے میں ہیں۔ ہم میں سے کوئی بھی ایک ہی\nرفتار، ایک ہی رفتار سے نہیں سیکھتا۔ ہمیں\nٹیوشن کی ضرورت نہیں ہے۔ لہٰذا استاد کے پاس یہ طاقت\nاور صلاحیت ہے کہ وہ اس بات کا تعین کرے کہ طالب علموں کو کس چیز پر کام کرنے کی ضرورت ہے، اور پھر طلبہ کو ایک ایسے راستے پر ڈالنا ہے جہاں وہ اپنی رفتار سے، اپنی رفتار سے ترقی کر سکیں۔ اگلا قابل اعتماد مواد ہے۔ خان اکیڈمی کے بارے میں ہم سب نے سنا ہے۔ یہ ایک پرکھا، بھروسہ مند پلیٹ فارم ہے۔ یہ مواد ٹھوس ہے۔ تو آپ جانتے ہیں کہ\nطلباء جس چیز پر کام کر رہے ہیں وہ معیارات سے منسلک ہیں، عام بنیادی معیارات\nریاضی میں، NGSS سائنس میں منسلک ہیں۔ تو آپ جانتے ہیں کہ یہ ایک\nمعیاری وسیلہ ہے جس سے کھینچنا ہے۔ اور آخری یہ ہے کہ وہاں\nٹولز کا ایک مکمل سیٹ ہوگا جو مشیل\nآپ کو اساتذہ کو بااختیار بنانے کے لیے دکھائے گی۔  ایک بار پھر، سب سے اہم چیز جو ہم کر سکتے ہیں وہ ہے اساتذہ کو بچوں کے ساتھ زیادہ وقت ملے۔ اور اس طرح جب ہم ان میں\nسے کچھ علما کے کاموں کو فارغ کر سکتے ہیں، ان میں سے کچھ انتظامی\nکام جو ہمیں کرنے ہیں جو کہ ہمیں پانچ بجے تک اسکول میں رکھیں یا صبح 5 بجے سے شروع کریں اگر\nآپ میری طرح ابتدائی پرندے ہیں، تو بس  آپ کو بچوں کے ساتھ زیادہ وقت گزارنے کے لیے آزاد کریں۔ اور یہ واقعی آج ہماری توجہ کا مرکز ہے۔ تو اس کے ساتھ بات کرنا کافی ہے۔ آئیے اسے ایکشن میں دیکھتے ہیں، مشیل۔ - ٹھیک ہے، بہت شکریہ، Stacie. یہ\nمیرے پسندیدہ کاموں میں سے ایک ہے جو اساتذہ کو مزید وقت دے رہا ہے۔ تو میں صرف ہوں، مجھے\nآج یہاں آپ سب کے ساتھ ہونے کا اعزاز حاصل ہے۔ لہذا ہم Khanmigo کے بالکل نئے ڈیش بورڈ کے ساتھ شروع کرنے والے ہیں اور مجھے اسے تھوڑا سا چھوٹا کرنے دیں تاکہ آپ ایک وقت میں سب کچھ دیکھ سکیں۔ ٹھیک ہے، تو یہ\nخانمیگو کا بالکل نیا ڈیش بورڈ ہے۔ آپ ان تمام مختلف ٹولز کو دیکھنے کے قابل ہیں\n جو Khanmigo کے پاس دستیاب ہیں اور ہم جانے والے ہیں، ہم ان\nسب کو نہیں مار سکیں گے، لیکن ہم ان میں سے بہت سے کو دیکھنے والے ہیں۔ آپ اسے منصوبہ بندی کے ذریعے بھی الگ کر سکتے ہیں۔ آپ اسے اپنے طلباء کی تخلیق، تفریق، مدد کر کے الگ کر سکتے ہیں۔ اتنی مختلف خصوصیات۔ اور پھر، ہم ان\nسب میں کھودنے والے ہیں۔ پہلی چیزوں میں سے ایک\nاگرچہ میں آپ کو دکھانا چاہتا ہوں، \nاسٹیسی نے جو کچھ کہا اس کے بارے میں تھوڑی سی بات کرنے کے لیے، صرف اس سے ہٹ کر، ہمارے تمام کورسز ہیں، ہمارے تمام کورسز تک رسائی حاصل کرنے کے لیے، آپ انہیں کسی بھی وقت میں دیکھ سکتے ہیں۔  خان اکیڈمی اسکرین کے اوپری بائیں کونے میں۔\n آپ صرف کورسز کا انتخاب کریں اور آپ ہمارے پاس موجود تمام کورسز کو دیکھنے کے قابل ہو جائیں گے،\n بشمول انٹیگریٹڈ\nریاضی کے کورسز جو ہم پیش کرتے ہیں، نیز ہمارے سائنس کورسز۔ اور پھر، وہ سب NGSS سے منسلک ہیں۔ لہذا ہمارے پاس\nہر کسی اور ہر چیز کے لیے کورسز ہیں، یہاں تک کہ بالغوں کے لیے بھی، کورسز دستیاب ہیں۔ مالی خواندگی، میرے\nخیال میں یہ بہت اچھا ہے اور میں چاہتی ہوں کہ میرے شوہر\nاسے ذاتی طور پر لیں۔ لیکن بہت ساری مختلف کلاسیں۔ ٹھیک ہے، تو میں اس میں کودنا چاہتا ہوں، بس، مربوط ریاضی کے بارے میں کیا خیال ہے؟ ہم اس کورس میں جائیں گے۔ جب میں کورس کا انتخاب کرتا ہوں، تو یہ ہمیں کورس کے لیے دستیاب تمام مختلف یونٹس دکھاتا ہے، اور ہماری اکائیوں کو\nاسباق میں تقسیم کیا جاتا ہے۔ تو میں صرف اس میں کودنے والا ہوں، کیسے، لکیری مساوات کے بارے میں؟ یہ ہمیشہ ایک مزہ ہے. اور جب میں اسے کھولتا ہوں، تو آپ کورسز پیش کیے جانے والے تمام مواد کو دیکھ سکیں گے۔ یہاں چھوٹے شبیہیں دیکھیں۔ یہ آپ کو بتاتا ہے کہ آیا یہ ایک ویڈیو ہے یا یہ ایک مضمون ہے یا اگر یہ کوئز ہے یا اگر یہ ایک مشق ہے جسے ہم اپنے طلباء سے مکمل کرنا چاہتے ہیں۔ تو آئیے کہتے ہیں کہ میں ریاضی کا استاد ہوں اور میں یہ\nویڈیو اپنے طلباء کو دیکھنے کے لیے تفویض کرنا چاہتا ہوں۔ جب میں اس پر کلک کرتا ہوں، میں ویڈیو دیکھنے کے قابل ہوں، میں\nویڈیو کی نقل دیکھ سکتا ہوں، لیکن میں\nاس پوری ویڈیو کے ارد گرد ایک سبق بنانا چاہتا ہوں۔ میں ایسا کیسے کروں؟ خانمیگو۔ مجھے بس اتنا کرنا ہے، خانمیگو یہیں رہتا ہے، اور مجھے یہ پسند ہے... ہم ابھی کورس میں ہیں اور خانمیگو کورس میں رہتا ہے۔ میں صرف Khanmigo کو منتخب کرتا ہوں اور کئی اشارے پاپ اپ ہوتے ہیں۔ یہ مجھ سے پوچھے گا، کیا میں سبق کا منصوبہ لکھنے میں مدد چاہتا ہوں؟ کیا میں اپنے طلباء کو ویڈیو کی وضاحت کرنے میں مدد چاہتا ہوں\n؟ کیا میں\nکچھ وارم اپ سرگرمیاں کرنے میں مدد کرنا چاہتا ہوں؟ خانمیگو میرے لیے یہ سب کچھ کرے گا۔ یا میں خانمیگو سے کچھ مختلف پوچھ سکتا ہوں۔ میں Khanmigo سے پوچھ سکتا ہوں، کیا آپ\nاس کے لیے ایگزٹ ٹکٹ کے سوالات بنانے میں میری مدد کر سکتے ہیں؟ میں پانچ\nمتعدد انتخابی سوالات چاہوں گا۔ اور پھر میں خانمیگو کو ایک سیکنڈ دیتا ہوں اور خانمیگو میرے لیے وہ چھوٹا کوئز لکھنے میں میری مدد کرنے پر بہت خوش ہوں گے اور یہ\nفوری طور پر آپ کے لیے کوئز تیار کر دے گا۔ اور یاد رکھیں، Khanmigo گوگل\nسرچ انجن یا کسی بھی چیز کی طرح نہیں ہے۔ اگر خانمیگو\nآپ کو وہ نہیں دیتا جو آپ چاہتے ہیں، تو آپ اس بات کو یقینی بنانے کے لیے اسے دبانا چاہتے ہیں۔ آپ کو پتہ ہے؟  کیا آپ جواب کا انتخاب abcd کر سکتے ہیں؟ اور محض چند سیکنڈوں میں، یقیناً، اور خانمیگو اسے ایک کوئز میں بدل دیتے ہیں جو میں اپنے طلباء کو کسی بھی وقت دے سکتا ہوں۔ اب، اگر میں دوسرے پرامپٹس پر واپس جانا چاہتا ہوں\n جو پیش کیے گئے تھے، تو میں خانمیگو سے\nاس کے ساتھ سبق کا منصوبہ لکھنے میں میری مدد کرنے کے لیے کہہ سکتا ہوں۔ اور دیکھیں کہ یہ کہہ رہا ہے کہ یہ سبق کا منصوبہ لکھنے میں میری مدد کرے گا۔ یہ میرے لئے پوری چیز نہیں کرنے والا ہے کیونکہ ہم اسے مل کر تخلیق کر رہے ہیں۔ یہ میری مدد کر رہا ہے کیونکہ میرے پاس خانمیگو کی تخلیق کردہ چیزوں کو تبدیل کرنے کی صلاحیت اور کنٹرول ہے۔\n تو ہاں، براہ کرم، میں\nاس کے لیے ایک سبق کا منصوبہ بنانا پسند کروں گا۔ تو میں اس پر کلک کرنے والا ہوں اور\nاسے بنانے میں چند سیکنڈ لگتے ہیں کیونکہ اس میں بہت ساری\nاہم خصوصیات شامل ہیں جن کی ہمیں ضرورت ہے۔ مثال کے طور پر، سیکھنے کا مقصد۔ اس میں سرگرمیاں شامل ہیں، یہ میرے لیے مختلف ہے، یہ مجھے اپنے طلباء کے لیے براہ راست ہدایات دینے والا ہے۔\n یہ مجھے\n اپنے طلباء کے لئے آزادانہ مشق کی سرگرمیاں، میرے طلباء کے لئے وارم اپ سرگرمیاں دینے والا ہے۔ یہ ابھی بہت سارے عمدہ ٹکڑوں سے بھرا ہوا ہے جن کی مجھے اپنے سبق کے منصوبے میں ضرورت ہے۔ تو میں\nاسے بنانے کے لیے صرف ایک سیکنڈ دینے والا ہوں۔ اس کے علاوہ، نوٹس کریں کہ یہ آزادانہ عمل ہے جو یہ تجویز کر رہا ہے کہ\nمیں اپنے طلباء کو تفویض کروں۔ اور اسے نیلے رنگ میں نمایاں کیا گیا ہے۔ جب بھی آپ کچھ نیلے رنگ کو دیکھتے ہیں، تو یہ کسی اور چیز کا اشارہ ہوتا ہے۔ لہذا جب بھی آپ خان اکیڈمی میں ہوں اور آپ کو کچھ نیلا نظر آئے تو اس پر کلک کریں اور یہ\nآپ کو تفتیش کے لیے کسی اور چیز پر لے جائے گا۔ ٹھیک ہے، تو یہاں میرا سبق ہے۔ لاجواب، لاجواب۔ یہاں وہ مواد ہیں\nجو اس میں شامل ہیں، اور پھر بالکل نیچے ایک سبق کا خلاصہ،\n مجھے بتاتا ہے کہ ہر ایک سرگرمی میں کتنا وقت\nلگے گا۔ آئیے کہتے ہیں کہ ایسی کوئی چیز ہے\nجو مجھے واقعی پسند نہیں ہے۔ میں اس ایگزٹ ٹکٹ کا مداح نہیں ہوں، میں اپنے بنائے ہوئے کوئز کو استعمال کرنا چاہتا ہوں، یا میں چاہتا ہوں کہ خانمیگو\nکچھ مختلف لے کر آئے۔  کوئی غم نہیں۔  ایک بار پھر، میں کنٹرول میں ہوں. مجھے بس اس پر کلک کرنا ہے۔ خانمیگو پاپ اپ ہو گا اور\nمجھ سے چند سوالات پوچھے گا۔ کیا میں اس میں تبدیلی کرنا چاہتا ہوں؟ اور اگر ایسا ہے تو، میں صرف Khanmigo کو بتا سکتا ہوں کہ\nوہ تبدیلیاں کیا ہیں۔ میں اس\nبارے میں خانمیگو سے بات کر سکتا ہوں، یا آپ نے اسے کیوں منتخب کیا، میں اس سے اس کے بارے میں بات کر سکتا ہوں۔ یا میں خانمیگو سے\nکچھ مختلف کرنے کو کہہ سکتا ہوں۔ مجھے نہیں معلوم کہ میں کیا چاہتا ہوں۔ میں صرف اتنا جانتا ہوں کہ مجھے یہ پسند نہیں ہے اور میں کچھ مختلف چاہتا ہوں۔ میں نے اس بٹن کو مارا اور\nیہ میرے لئے اسے بدل دیتا ہے۔ تو پھر، میں کنٹرول میں ہوں اور ہم ایک ساتھ جا رہے ہیں، ہم ایک سبق کا منصوبہ بنانے والے ہیں جسے میں اپنے طلباء کے ساتھ استعمال کر سکتا ہوں۔ اب، ایک بار جب میں اپنے اسباق کے منصوبے سے خوش ہوں، یہ بالکل ویسا ہی ہے جیسا میں چاہتا ہوں۔ آپ کا بہت شکریہ، خانمیگو۔ میرے پاس\nسبق کا منصوبہ پرنٹ کرنے کی صلاحیت ہے یا... افوہ، معذرت۔ میں نے اسے بند کر دیا۔ لیکن آپ سبق کے منصوبے کو پرنٹ کرنے کے قابل ہیں یا آپ اسے پی ڈی ایف فائل میں ڈاؤن لوڈ کرسکتے ہیں یا آپ اسے گوگل کلاس روم یا مائیکروسافٹ ورڈ میں ڈاؤن لوڈ کرسکتے ہیں۔ تو اس کے بعد آپ اس کے ساتھ کچھ چیزیں کر سکتے ہیں۔ ٹھیک ہے، میں اپنے زبردست خانمیگو ٹولز پر واپس جا رہا ہوں۔ ایک اور زبردست خصوصیت جو مجھے پسند ہے اور مجھے ایسا لگتا ہے کہ مجھے یہ کرنے کی ضرورت ہے، میں یہ\nاپنے ہر اسباق کے شروع میں کروں گا، یہ لیسن ہک فیچر ہے۔ ہم طلباء کو اس مواد کے بارے میں کیسے پرجوش کر سکتے ہیں جو ہم کر رہے ہیں؟ اگر میں\nلکیری مساوات پر سبق سکھانے والا ہوں، تو \nاس کے بارے میں کوئی دلچسپ بات نہیں ہے۔ لیکن میرے طلباء کو۔ میرے نزدیک، میں لکیری مساوات کے بارے میں ہوں۔ لیکن Khanmigo مجھے ایک پرلطف اور دلچسپ اسباق بنانے میں مدد کرے گا۔ مجھے بس اس پر کلک کرنا ہے، خانمیگو کو گریڈ لیول بتانا ہے، یہ میری 9ویں\nجماعت کے الجبرا کی ایک کلاس، یا میری 9ویں جماعت کی مربوط ریاضی کی کلاس کے لیے ہے، اور ہم لکیری مساوات پر کام کر رہے ہیں اور میں صرف Khanmigo سے\nتخلیق کرنے کو کہتا ہوں۔  یہ میرے لیے اور ایک بار پھر، چند سیکنڈوں میں، خانمیگو نے تین\nشاندار سبق آموز ہکس بنائے جنہیں میں اپنے طلباء کے ساتھ استعمال کر سکتا ہوں جن کے بارے میں شاید میں نے\nخود سوچا بھی نہیں ہوگا۔ مجھے واقعی یہ پسند ہے۔ ہینڈ آن ایکٹیویٹی کے لیے، طلباء ایک لکیری مساوات کی منصوبہ بندی کے لیے گرافنگ کیلکولیٹر یا آن لائن گرافنگ ٹول استعمال کر سکتے ہیں۔  ایک بار پھر، تاہم، جامنی رنگ کی بار کو دیکھیں۔ اگر کوئی ایسی چیز ہے جو مجھے پسند نہیں ہے، تو مجھے بس اس پر کلک کرنا ہے اور میں Khanmigo سے اسے تبدیل کرنے کے لیے کہہ سکتا ہوں۔ - مشیل، آپ جانتے ہیں کہ میرے\nخیال میں اس کے بارے میں کیا اچھا ہے، جیسا کہ، آپ جانتے ہیں، ریاست کیلیفورنیا میں ایک استاد ہونے کے ناطے،\n ہمارے پاس ریاست کا اپنایا ہوا نصاب ہے اور یہ واقعی چیزوں کو باہر نکالنے کے قابل ہونے کے لیے ایک اچھی تکمیل ہے۔ کہو، تم جانتے ہو، آج کا میرا سبق بہت اچھا ہے، لیکن مجھے صرف ایک ہک کی ضرورت ہے۔ مجھے یہ ایک حصہ چاہیے۔ لہذا مجھے پسند ہے کہ میں اس کے کچھ حصے تلاش کر سکوں جو کلاس روم میں پہلے سے کر رہا ہوں اس کی تکمیل کرے گا۔ میں حیران ہوں، ہمارے پاس بہت سارے سوالات ہیں کہ یہ\nطالب علم کے نقطہ نظر سے کیسا لگتا ہے۔ میں سوچ رہا ہوں کہ کیا ہم اندر جا سکتے ہیں اور اس پر ایک نظر ڈال سکتے ہیں کہ\nخانمیگو اس\nمربوط ریاضی کی ایک کلاس کی طرح ٹیوٹر کے طور پر کیسے کام کرتا ہے۔ - بالکل تو میں اس مربوط ریاضی کی کلاس میں واپس جاؤں گا\n اور میں بالکل اسی یونٹ - لکیری گرافس پر واپس جاؤں گا۔ اور میں ویڈیو لینے جا رہا ہوں، ویڈیو لینے کے لیے۔ اور جب میں خانمیگو کو منتخب کرتا ہوں، بالکل اسی طرح جیسے کوئی استاد، یہاں اسکرین کے بالکل اوپر، یہ مجھے اسے ٹیچر موڈ سے اسٹوڈنٹ موڈ میں تبدیل کرنے دیتا ہے۔ تو اب اسٹوڈنٹ موڈ آن ہے۔ نوٹس، یہ مجھے\nیہیں پر مختلف اشارے دیتا ہے۔ یہ مجھ سے پوچھے گا، کیا میں ویڈیو کا خلاصہ چاہتا ہوں؟ کیا میں چاہتا ہوں کہ یہ ویڈیو پر مجھ سے کوئز کرے؟ کیا میں ویڈیو کے بارے میں ایک نظم لکھنا چاہتا ہوں؟ یا میں\nاس ویڈیو کو سیکھنے کی فکر کیوں کروں؟ یہ ایک سوال ہے جو زیادہ تر طلباء کو ہوتا ہے۔ میں اس کی پرواہ کیوں کروں؟ تو میں آگے بڑھ کر اس پر کلک کروں گا اور خانمیگو مجھ سے پوچھے گا، اچھا، مجھے کیا پسند ہے... کیا آپ کو ویڈیو گیمز پسند ہیں؟ ویڈیو گیم کے کردار\nہر طرح کی سمتوں کو حرکت دیتے ہیں۔ اور یہ مواد کو\nدوبارہ طالب علم سے جوڑتا ہے۔ اگر طالب علم اسائنمنٹ کر رہا ہے، کیونکہ میرے پاس ایسے طالب علم ہو سکتے ہیں\nجو گریڈ لیول سے نیچے ہوں، لیکن مجھے پھر بھی اپنے طلباء کو گریڈ لیول کی ہدایات دینی ہیں۔ اور اگر میں اپنے طلباء کو\nگریڈ لیول کی ہدایات پر تفویض کرتا ہوں اور میں ان کی مدد کرنے کے لیے آس پاس نہیں ہوں تو مجھے پریشان ہونے کی ضرورت نہیں ہے\nکیونکہ خانمیگو وہاں موجود ہے۔ لہذا اگر طلباء\nکسی اسائنمنٹ پر کام کر رہے ہیں جو میں نے انہیں دیا ہے، تو Khanmigo پاپ اپ ہوتا ہے اور یہ کہتا ہے، کیا آپ کو مسئلہ حل کرنے میں مدد کی ضرورت ہے؟ کیا آپ اسی طرح کی مثالیں آزمانا چاہتے ہیں؟ یا پھر، میں اس کی پرواہ کیوں کروں؟ ایک چیز جس کی میں نشاندہی کرنا چاہتا ہوں، مجھے وہ پسند ہے جو خانمیگو کہتی ہے، کیا آپ بھی اسی طرح کا مسئلہ آزمانا چاہتے ہیں؟ خانمیگو کے کہنے کی وجہ یہ ہے کہ خانمیگو\nآپ کے طالب علم کو کبھی بھی جواب نہیں دے گا۔ جیسا کہ ایک اچھا ٹیوٹر آپ کے طالب علم کو کبھی بھی جواب نہیں دے گا۔ یہ\n مسئلہ کو سمجھنے اور سیکھنے کے عمل میں ان کی مدد کرنے والا ہے۔ تو خانمیگو، طالب علم بھی کہے، کیا جواب ہے؟ خانمیگو مجھے بتانے جا رہے ہیں، میں یہاں آپ کو سیکھنے میں مدد کرنے کے لیے ہوں، نہ کہ صرف آپ کو جواب دینے کے لیے۔ آئیے پہلے نقطہ سے شروع کریں اور یہ طلباء کو \nیہاں کے مواد کو سمجھنے کے عمل سے گزرے گا۔ میں کہنے والا تھا، ایک اور چیز دکھاؤ۔ اگر آپ اپنے\nطلباء کو تفویض کرتے ہیں، تو آئیے کہتے ہیں، ایک کوئز۔ اگر آپ چاہتے ہیں کہ آپ کے طلباء\nخانمیگو پر کوئز مکمل کریں، تو آپ کے طلباء خانمیگو پر کوئز تک رسائی حاصل نہیں کر سکیں گے۔ کیونکہ کوئز، میں وہ مواد جاننا چاہتا ہوں\nجو میرے طلباء جانتے ہیں۔ میں نہیں جاننا چاہتا کہ خانمیگو کیا جانتا ہے یا خانمیگو میرے طلباء کی مدد کیسے کر رہا ہے۔ لہذا اگر میرے طلباء اندر جاتے ہیں\nاور میں انہیں کوئز تفویض کرتا ہوں، تو Khanmigo کہے گا، مجھے افسوس ہے، میں اس صفحہ پر دستیاب نہیں ہوں۔ لہذا آپ جانتے ہیں کہ اگر آپ\nاپنے طلباء کے ساتھ مہارت حاصل کرنے کی جانچ کر رہے ہیں، تو آپ یہ جان سکتے ہیں کہ\nوہ مواد کو سمجھتے ہیں۔ - مشیل، مجھے حیرت ہے کہ کیا میں آپ کے ساتھ کچھ چیزیں آزمانا پسند کر سکتا ہوں۔ مجھے حیرت ہے کہ کیا میں صرف آپ کا طالب علم بن سکتا ہوں اور\n(غیر واضح) میں سے کچھ چیزوں کو آزما سکتا ہوں تاکہ ہم خانمیگو کو ایکشن میں دیکھ سکیں۔ - بالکل  میں اسے پسند کروں گا۔ ٹھیک ہے۔ اور ہم یہ شروع کریں گے۔ - چلو کچھ ریاضی کرتے ہیں. ٹھیک ہے، آئیے یہاں دیکھتے ہیں۔ ہمارا دوست خانمیگو کہاں ہے؟ تو ہم فنکشن\nان پٹ اور آؤٹ پٹ کر رہے ہیں۔ مجھے یہ بھی نہیں معلوم کہ شروعات کیسے کی جائے۔ کیا ہم Khanmigo کو بتا سکتے ہیں کہ ہمیں\nاسے حل کرنے میں کچھ مدد کی ضرورت ہے؟ - بالکل کیا جواب ہے؟ میں کھو گیا ہوں۔\n- تو تصور کریں کہ ہم ایک کلاس روم میں ہیں، میرے پاس 35 بچے ہیں، ہاتھ اوپر ہیں۔ ایک استاد کے طور پر، ہم\nایک ہی وقت میں ان سب تک نہیں پہنچ سکتے۔ بچے انتظار کر رہے ہوں گے۔ لہذا جب وہ استاد کا انتظار کر رہے ہیں، ہم جانتے ہیں کہ یہ بہترین وسیلہ ہے۔ استاد کو ہمیشہ\nدفاع کی پہلی لائن ہونا چاہیے۔ خانمیگو\n بچوں کو پھنسنے سے روکنے کے لیے مایوسی کو روکنے کے لیے وہاں ہو سکتا ہے، یا وہ گھر پر ہیں، ٹھیک ہے؟ یہ اس وقت ہے، فوری ٹیوشن۔ لہذا ہم نے Khanmigo کو بتایا ہے کہ ہم\nنہیں جانتے کہ کیسے شروع کیا جائے، ہمیں نہیں معلوم کہ کیا کرنا ہے۔ میں سوچتا ہوں کہ جس چیز کے بارے میں مجھے یقین نہیں ہے وہ یہ ہے کہ یہ f کیا ہے اور پھر\nx کے اس f کو قوسین کریں؟ اس کا کیا مطلب ہے؟ اور ان بلبلوں کو دیکھیں۔ لہذا اکثر مسئلہ یہ ہوتا ہے کہ بچے نہیں جانتے کہ خانمیگو کو کیا کہنا ہے۔ وہ جانتے ہیں کہ وہ پھنس گئے ہیں، وہ جانتے ہیں کہ وہ نہیں جانتے کہ کیا کرنا ہے، لیکن وہ نہیں جانتے کہ اسے زبانی کیسے بیان کرنا ہے۔ اور اسی وجہ سے وہ بلبلے موجود ہیں۔ ہم ان تک محدود نہیں ہیں، ٹھیک ہے؟ تو اصل میں کچھ اور کرنے کی کوشش کرتے ہیں. خانمیگو\nیہاں تھوڑا سا سوچ رہے ہیں، کچھ ریاضی کر رہے ہیں۔ ہم نے حال ہی میں خانمیگو کی ریاضی کرنے کی صلاحیت کو بہتر بنانے کے لیے کچھ زبردست کام کیا ہے۔  اس لیے \n \nوہاں تھوڑی تاخیر ہو رہی ہے۔ تو یہاں یہ مجھے بتا رہا ہے کہ x کا f کیا ہے اور مجھ سے پوچھ رہا ہے کہ\nاگر ہم -8 کو باکس میں ڈال دیں تو کیا ہوگا؟ تو میں یہاں سوچنے والا ہوں، ہمیں -7 ملا۔ اگر x -8 ہے تو میں سمجھتا ہوں کہ ایسا ہو گا، چلو کہ میں نے غلطی کی ہے اور میں دیکھتا ہوں کہ وہ -56 مائنس 1 ہے۔ چلو کہتے ہیں کہ یہ -57 ہے۔ مشیل، آئیے دیکھتے ہیں کہ اس کے ساتھ یہ کیا کہتا ہے۔ - یہ دیکھو۔ - مجھے لگتا ہے کہ ہمیں اسے ابھی اس چھوٹے خانمیگو باکس میں ٹائپ کرنے کی ضرورت ہے۔ - افوہ۔  -57. - چلو کچھ کے ساتھ چلتے ہیں. آئیے دیکھتے ہیں کہ خانمیگو اس کے ساتھ کیا کرتا ہے۔ تو یہ اس وقت مجھے کچھ مدد فراہم کرنے کے لیے حاضر ہے۔\n یہ سوچنے والا ہے کہ\nمیں نے وہاں کیسے کیا ہے۔ یہ کچھ ریاضی کر رہا ہے۔ آئیے دیکھتے ہیں کہ یہ کیسے جواب دیتا ہے۔ افوہ  ہمم تو یہ تسلیم کر رہا ہے\nکہ میں نے غلطی کی ہے، لیکن واقعی معاون طریقے سے، اور آئیے اس چھوٹی سی غلطی کو تلاش کرنے کے ذریعے مجھ سے کام کرنے کی کوشش کرتے ہیں۔\n تو x کے f کا مطلب ہے کہ اگر\nہم x کو اس -7x میں ڈالیں، اور پھر دیکھیں کہ یہ اسے کیسے توڑتا ہے۔ لہذا اگر ہم -8 ڈالتے ہیں، تو ہمیں -7 گنا -8 ملتا ہے۔ تو ہمیں 56 مائنس 1 ملتا ہے۔ تو اس پر ایک نظر ڈالیں کہ اس نے مجھے کیسے درست کیا اور اس نے مجھے ایک چھوٹا سا قدم دیا، لیکن یہ مجھے جواب نہیں دے رہا ہے۔ تو آپ کو ایک\nبہت ہی سقراطی انداز نظر آئے گا۔ ٹھیک ہے، آئیے کچھ اور کرنے کی کوشش کرتے ہیں، مشیل، کہ کوئی بچہ کہے، چلو اچھے پرانے IDK کے ساتھ چلتے ہیں۔  ایک بار پھر، تصور کریں کہ آپ نے\nبچوں کو اپنا ہاتھ اوپر کر لیا ہے، وہ آپ کا انتظار کر رہے ہیں، ٹھیک ہے؟ ان کا ساتھ دینے کے لیے کیا ہے؟ Khanmigo اس وقت وہاں موجود ہے، چاہے وہ کہیں بھی ہوں، جب تک کہ ان کے پاس اپنا آلہ ہے، ان کے پاس یہ ٹیوٹر ڈیمانڈ پر ہے۔ لہذا ہم مدد کرنے کے لیے کلاس روم میں لوگوں کو تلاش کرنے کی کوشش نہیں کر رہے ہیں۔ یہ میری ہدایات کے مطابق ہے جو میرا استاد\nمجھے کلاس روم میں دے رہا ہے۔ لہذا سب کچھ ایک ساتھ ہے، یہ نقطہ پر ہے، اور میرے استاد کے پاس\nاس تک مکمل رسائی ہے تاکہ یہ جان سکیں کہ میں کہاں پھنس گیا ہوں اور مجھے کس طرح مدد کی ضرورت ہے۔ تو آپ میں سے ان لوگوں کے لیے جو\nچیٹ میں پوچھ رہے ہیں، آپ جانتے ہیں کہ وہ سلوک کیا ہے،\nیہ کیسا لگتا ہے؟ مجھے امید ہے کہ اس سے آپ کو\nتھوڑی سی جھلک ملی ہو گی کہ خانمیگو کیسا برتاؤ کرے گا اور یہ اس وقت طلباء کی مدد کیسے کر سکتا ہے۔\n - بالکل اور یہ بھی کہ میں\nKhanmigo کے ساتھ بات چیت کر رہا ہوں، اساتذہ کے پاس ہر وہ چیز دیکھنے کی صلاحیت ہوتی ہے جس کے بارے میں آپ کے طلباء خانمیگو کے ساتھ بات کر رہے ہیں اور چیٹ کر رہے ہیں۔ یا اگر آپ کے طلباء خانمیگو کو کچھ نامناسب کہتے ہیں، تو\n خانمیگو\nاس گفتگو کو وہیں روک دے گا۔ اور استاد کو ایک انتباہ ملتا ہے، استاد کو بتاتا ہے کہ\nطالب علم نے کیا کہا۔ وہاں کے ساتھ بہت سی عظیم چیزیں۔ - میں\nکچھ NGSS سے منسلک سائنس کے بارے میں سوچ رہا ہوں۔ کیا ہم اپنی سائنس کی کسی کلاس میں جا سکتے ہیں\n اور ایک نظر ڈال سکتے ہیں کہ\nخانمیگو وہاں کس طرح سپورٹ کرتا ہے؟ - سب سے زیادہ یقینی طور پر. مڈل اسکول کی حیاتیات کے بارے میں کیا خیال ہے؟ مذاق کی طرح آواز؟\n- میرا پسندیدہ، میرا پسندیدہ۔ - جی ہاں۔  بالکل ٹھیک۔ کیا کوئی خاص یونٹ ہے جسے\nآپ دیکھنا چاہیں گے؟ - یقینی طور پر.  آئیے\nماحولیاتی نظام، حیاتیاتی تنوع کے ساتھ چلتے ہیں۔ وہاں بہت مزہ آیا۔ - یہ اچھا وقت ہے.  اچھے وقت۔ کیا آپ کوئی ویڈیو یا آرٹیکل یا کوئی مشق دیکھنا چاہیں گے؟ - مجھے لگتا ہے کہ میں ایک مشق میں جانا چاہوں گا اور مجھے لگتا ہے کہ میں\nاس اسٹوڈنٹ موڈ میں جانا چاہتا ہوں اور وہ پرانا سوال پوچھنا چاہتا ہوں جو میرے طلباء مجھ سے ہر وقت پوچھتے ہیں۔ آخر مجھے\nیہ سیکھنے کی پرواہ کرنے کی ضرورت کیوں ہے؟ کیا ہم دیکھ سکتے ہیں کہ خانمیگو اس کے بارے میں کیا کہتے ہیں؟ - مجھے اس کی پرواہ کیوں کرنی چاہئے؟ کچھ چیزیں کیا ہیں جن کا آپ کو خیال ہے؟ مجھے ناچنا پسند ہے۔ - اوہ، اسے دیکھو. ہو سکتا ہے کہ\nتھوڑا سا مطابقت پیدا کر کے، اسے ان چیزوں سے جوڑنا جن کی مجھے\nایک سیکھنے والے کے طور پر خیال ہے۔ ٹھیک ہے۔ - مجھے یہ پسند ہے۔ - اوہ، تو جیسے اگر کوئی رقاصہ چلا جائے تو گروپ چھوٹا ہو جاتا ہے۔ تو اسکرین پر موجود مواد کے ساتھ طالب علم کی پرواہ کرنے کا کتنا دلچسپ طریقہ ہے۔ ٹھیک ہے، تم جانتے ہو کیا؟ اگرچہ یہ کافی نہیں لگتا ہے۔ کیا مجھے ایک اور مثال مل سکتی ہے؟ - ہاں، مجھے یہ پسند ہے۔ کیا آپ مجھے ایک اور مثال دے سکتے ہیں؟ اس کے علاوہ، مجھے واقعی ٹیلر سوئفٹ پسند ہے۔ \nایک ماحولیاتی نظام کے طور پر ٹیلر سوئفٹ کے فین بیس کے بارے میں سوچئے۔ اگر وہ موسیقی بنانا بند کر دیتی ہے، تو کچھ پرستار چھوڑ سکتے ہیں۔ یہ ایک ماحولیاتی نظام میں تبدیلیوں کی طرح ہے جس کی وجہ سے آبادی کم ہو رہی ہے۔  کیا اسکا کوئ مطلب بنتا ہے؟ افوہ یہ کرتا ہے۔  یہ بالکل کرتا ہے۔  تو بہت بہت شکریہ خانمیگو۔ اب میں کروں گا... افوہ، مجھے اسے بند کرنے دو۔ کیا آپ اس بارے میں مزید وضاحت کر سکتے ہیں کہ\nماحولیاتی نظام کیسے کام کرتا ہے۔ کیونکہ اب میں متجسس ہوں، میں سرمایہ کاری کر رہا ہوں۔ میں ایک درزی ہوں، میں ایک Swifty ہوں، اور اب میں جانتا ہوں کہ مجھے\nاس کے بارے میں جاننے کی ضرورت کیوں ہے۔ تو میں خانمیگو کے ساتھ بہت سے سوالات کرنے والا ہوں۔\n اب میں جھکا ہوا ہوں اور میں مزید جاننا چاہتا ہوں۔ اور ایک سوال کی طرف چلتے ہیں۔ چلو۔ میں یہاں ہوں  اس کے علاوہ، ایسی ویڈیوز موجود ہیں جو\nطلباء کے لیے بھی دیکھنے کے لیے دستیاب ہیں۔ تو میں سوال پوچھ سکتا ہوں۔ یہ دیکھو۔ اوہ، میں نے صحیح سوال کیا. بہترین، بہترین۔ بالکل ٹھیک۔  یہاں ایک اور ہے۔ میں اسی طرح کی ایک مثال آزمانا چاہتا ہوں۔ یاد رکھیں، Khanmigo\nہمیں اس کا جواب نہیں دے گا، لیکن میں اس کے ذریعے میری مدد کرنے کے لیے اسی طرح کا مسئلہ آزما سکتا ہوں۔\n میں نہیں چاہتا کہ خانمیگو\nمجھے جواب دے۔ میں اسی طرح کی ایک حاصل کر سکتا ہوں. - آپ جانتے ہیں کیا،\nیہ سب مجھے یہ سوچنے پر مجبور کر رہا ہے کہ مشیل اس طرح مشغول ہے۔ جیسا کہ اگر میرے پاس یہ کلاس روم میں ہوتا، تو مجھے \nاپنے طلباء کی دلچسپی کو حاصل کرنے اور اس لمحے میں ان کی مدد کرنے کے لیے اتنی محنت نہیں کرنی پڑتی۔ لیکن میں حیران ہوں کہ اساتذہ کیسے\nجواب دیتے ہیں اور اس کے بعد ڈیٹا حاصل کرتے ہیں۔ کیا آپ ہمیں بتا سکتے ہیں کہ\nاساتذہ کون سا ڈیٹا حاصل کر سکتے ہیں اور خانمیگو\nاس ڈیٹا کا خلاصہ کرنے میں کس طرح مدد کر سکتا ہے اور شاید کچھ سفارشات دے سکتا ہے؟ - بالکل لہذا اگر میں اپنے طلباء کو مواد تفویض کرتا ہوں یا اگر میرے طلباء\nاپنے سیکھنے کے راستے پر کام کر رہے ہیں اور خان اکیڈمی میں سرگرمیاں مکمل کر رہے ہیں، تو وہ مہارتوں پر کام کرنے جا رہے ہیں اور وہ اس سے ڈیٹا حاصل کرنے جا رہے ہیں۔ ایک استاد کے طور پر، مجھے صرف اتنا کرنا ہے، میں یہاں آ سکتا ہوں اور میں اس\nکلاس سنیپ شاٹ بٹن کو منتخب کر سکتا ہوں اور یہ\nمجھے ایک اعلیٰ سطحی جائزہ فراہم کرے گا۔ یہ مجھے منتخب کرنے دے گا کہ میں پہلے کون سی کلاس دیکھنا چاہتا ہوں۔ میں اس کلاس کو دیکھنا چاہتا ہوں، الجبرا کی ایک کلاس، اور یہ\nمجھے اس پیشرفت کا ایک اعلیٰ سطحی جائزہ فراہم کرے گا جو میرے طلباء نے\n پچھلے سات دنوں سے کورس میں کی ہے۔ یہ مجھے کلاس کی اوسط بتانے جا رہا ہے۔ اس سے مجھے معلوم ہوتا ہے کہ میرے طلباء ان\nاسائنمنٹس پر کیسا کر رہے ہیں جو وہ مکمل کر رہے ہیں۔  یہ بھی نوٹ کریں کہ اس میں یہ\nہلکی رپورٹیں نیلے رنگ میں ہیں، جو کہ اصل رپورٹ کا براہ راست لنک ہے۔\n لہذا اگر میں ان مہارتوں کو دیکھ رہا ہوں جن پر میرے طلباء کام کر رہے ہیں، لیکن میں مزید تفصیلات چاہتا ہوں، تو مجھے صرف اس پر کلک کرنا ہے اور یہ مجھے اس مہارت کی رپورٹ تک لے جاتا ہے تاکہ میں بالکل دیکھ سکوں کہ\nمیرے طلباء کس چیز پر کام کر رہے ہیں۔  . Khanmigo مجھے\nیہاں اضافی اشارے بھی دیتا ہے جس کے بارے میں میں نے سوچا بھی نہیں ہوگا۔ مثال کے طور پر،\nمجھے اپنی کلاس میں کس طالب علم کو منانا چاہیے؟ مجھے کلاس شوٹ آؤٹ دینا پسند ہے تاکہ میں دیکھ سکوں کہ طلباء کو\nان انعامات کی کیا ضرورت ہے یا کس نے یہ انعامات حاصل کیے ہیں۔ طالب علم کیا جدوجہد کر رہے ہیں؟ مجھے یہ یقینی بنانے کے لیے کس کی جانچ پڑتال کرنے کی ضرورت ہے کہ وہ وہی کر رہے ہیں جو\nانھیں کرنا چاہیے تھا؟  ایک اور، یہ میرا پسندیدہ ہے۔ میری کلاس کو ان کی سفارشات کے مطابق گروپ کریں۔ وہ ایک، بہت بڑا وقت بچانے والا۔ کیونکہ ایک بار پھر، جیسا کہ سٹیسی کہہ رہا تھا، میرے تمام طلباء\nایک ہی سطح پر نہیں ہوں گے اور مجھے اپنے طالب علموں کو فرق کرنے کے قابل ہونے کی ضرورت ہے اور اپنے طلباء کو وہ دینے کی ضرورت ہے۔ یہ میرا نیا بہترین دوست ہے۔ یہ\nمیرے طلباء کو کس چیز کی ضرورت ہے اس کو توڑ دے گا اور یہ مجھے بتاتا ہے کہ طلباء کو کس چیز کی ضرورت ہے تاکہ میں انہیں اسائنمنٹس دینے کے قابل ہوں۔ لیکن تم جانتے ہو کیا؟  اس سے بھی بہتر کچھ ہے۔ میں اس ڈیش بورڈ پر واپس جانے والا ہوں اور یہ میرا نیا بہترین دوست ہے۔ یہ، میں نے اسے کل ایک ٹیچر کے ساتھ شیئر کیا\nاور اس نے کہا، \"صرف ایک چیز جو یہ\nنہیں کر رہی ہے وہ مجھے کافی بنا رہی ہے۔\" یہ صرف ایک مطلق گیم چینجر ہے۔ یہ ایک تجویز کردہ اسائنمنٹس ہے۔ یہ وہ جگہ ہے جہاں Khanmigo ان\nتمام مواد کے تمام ڈیٹا کو دیکھتا ہے جو\nآپ کے طلباء کر رہے ہیں، اور یہ\nمخصوص گروپس کے لیے مخصوص اسائنمنٹس کی سفارش کرتا ہے کیونکہ یاد رکھیں، وہ\nسب ایک ہی جگہ پر نہیں ہیں۔ لیکن یہ ایک قدم آگے بڑھتا ہے۔ یہ انہیں براہ راست میرے لیے تفویض کرے گا۔ لہذا اگر میں ان\nاسائنمنٹس کو اس گروپ کو تفویض کرنا چاہتا ہوں تو مجھے بس اس بٹن کو منتخب کرنا ہے۔  اس کے بارے میں سب سے مشکل کام\nجو مجھے کرنا ہے، سب سے مشکل فیصلہ\nجو مجھے کرنا ہے، کیا میں چاہتا ہوں کہ ہر طالب علم کا\nسوال الگ الگ ہو یا میں چاہتا ہوں کہ میرے تمام طلباء کے پاس ایک ہی سوال کا سیٹ ہو؟ اور ایمانداری سے، کوئی\nصحیح یا غلط جواب نہیں ہے۔ یہ واقعی اس بات پر منحصر ہے کہ\nآپ اسے کس چیز کے لیے استعمال کر رہے ہیں۔ اگر میں اسے\nاپنے طلباء کو ہوم ورک کے طور پر تفویض کر رہا ہوں، ہاں، میں یہ یقینی بنانا چاہتا ہوں کہ ہر ایک کے\nپاس مختلف سوالات ہوں۔ لیکن اگر میں چاہتا ہوں کہ میرے طلبا\nمل کر کام کریں اور اس ریاضی کی گفتگو کو تعاون اور تعمیر کریں، تو میں انہیں\nوہی سوال سیٹ تفویض کرنے جا رہا ہوں اور جب میں اسکرین پر پیش کروں گا تو انہیں مل کر کام کرنے دوں گا۔ اور ہم مل کر یہ کر سکتے ہیں۔ تو یہ ایک بہت بڑا وقت بچانے والا ہے۔ مجھے وہ نئی خصوصیت پسند ہے۔ ایک اور واقعی عمدہ\nخصوصیت جو دستیاب ہے وہ ہے حقیقی دنیا کا سیاق و سباق جنریٹر۔ یہ ایک، بہت بڑا، جیسا کہ خانمیگو جانتا ہے کہ\nطلباء یہ سوال پوچھتے ہیں کہ \"مجھے اس کی پرواہ کیوں کرنی چاہیے؟\"، یہ طلباء کے لیے حقیقت بناتا ہے۔ آپ صرف خانمیگو کو\nاپنے گریڈ کی سطح اور ہم کیا سکھانے والے ہیں۔ سٹیسی، ہم کیا سکھانے والے ہیں؟ - مساوات کے نظام. یہ پڑھانے کے لیے میری پسندیدہ چیز ہے۔ - مساوات کے نظام. ٹھیک ہے، اور پھر،\nچند سیکنڈوں میں، خانمیگو تین مختلف آئیڈیاز بناتا ہے جو میں اپنے طلباء کے ساتھ استعمال کر سکتا ہوں۔ وہ کیسے تعلق رکھ سکتے ہیں؟ تو یہ صرف نہیں ہے، وہ صرف\nمیری ریاضی کی کتاب سے ریاضی نہیں کر رہے ہیں، میں اسے حقیقی بنا رہا ہوں اور یہ اسے\nمیرے طلباء کے لیے مزید پرکشش بنا رہا ہے۔ - اور ریاضی کی کتابوں کی بات کرتے ہوئے، ہمارے پاس چیٹ میں ایک سوال ہے، میں اس بات کو یقینی بنانا چاہتا ہوں کہ ہر کوئی\nجواب بھی سنے۔ نہ صرف یہ معیارات ایک بار پھر، ریاضی میں مشترکہ بنیادی ریاستی\nمعیارات اور سائنس میں این جی ایس ایس کے ساتھ منسلک ہیں، بلکہ ہمارے پاس یوریکا میتھ یا انگیج\nنیو یارک کے تیسرے درجے میں الجبرا ٹو، اور مثالی ریاضی، کے ساتھ شروع ہونے والے کورس کے اختیارات موجود ہیں۔  7ویں جماعت\nبذریعہ الجبرا ایک۔ لہذا اس کورس کے مینو میں، مشیل صرف وہیں کلک کرنے والا ہے\nتمام ریاضی دیکھیں، یہاں بہت ساری چیزیں ہیں۔ لہذا ہم ان تمام مختلف کلاسوں کو دیکھنے کے لیے تقریباً پانچ منٹ تک سکرول کر سکتے ہیں۔ لیکن جب ہم\nصفحہ کے آدھے راستے پر پہنچ جاتے ہیں، تو ہم اصل میں کلک کر کے آپ کو دکھا سکتے ہیں۔ آپ یہاں کیلکولس سے دستیاب تمام مختلف کورسز کی ایک فوری اسکرین گریب دیکھ سکتے ہیں، اور وہیں ہماری مثالی\nریاضی کی کلاسیں ہیں۔ لہذا اگر آپ اس\nنصاب کو آٹھویں جماعت کے لیے استعمال کر رہے ہیں، الجبرا کے لیے، اگر آپ یوریکا ریاضی استعمال کر رہے ہیں، تو وہ وہاں موجود ہیں۔ اور ایک بار پھر، نہ صرف معیارات منسلک ہیں، بلکہ آپ کے پاس نصاب کی سیدھ بھی ہے، جو ایک عظیم، عظیم وسیلہ ہیں۔ - کیا آپ چاہیں گے کہ میں یوریکا ریاضی کی کلاسوں میں سے کسی ایک میں کود جاؤں؟ - آئیے\n آٹھویں جماعت کے لیے مثالی ریاضی پر ایک نظر ڈالتے ہیں۔ - بالکل ٹھیک۔ ٹھیک ہے۔ کوئی خاص موضوع؟ - نہیں، آئیے ذرا اس پر ایک نظر ڈالتے ہیں کہ\nکورس کیسے منسلک ہے۔ اور اگر آپ\nان نصابوں کو استعمال کرنے کے عادی ہیں، تو میں جانتا ہوں کہ یہ\nریاست بھر میں کافی مروجہ ہیں، اس پر ایک نظر ڈالیں کہ یہ نصابی کتاب کی صف بندی سے کیسے میل کھاتا ہے۔ تو آپ جانتے ہیں،\nکسی بھی کورس کے بارے میں کیا اچھا ہے، اس سے کوئی فرق نہیں پڑتا کہ آپ ہمارا روایتی آٹھویں جماعت کا کورس استعمال کر رہے ہیں یا آپ اس کورس کو استعمال کر رہے ہیں، یونٹس کو کسی بھی ترتیب سے تفویض کیا جا سکتا ہے۔ لہذا آپ، بطور استاد، اس ترتیب کے بارے میں وہ فیصلے کر سکتے ہیں جس میں طلباء کو مواد حاصل کرنے کی ضرورت ہے۔ اور خانمیگو\nوہاں ہونے والا ہے چاہے کچھ بھی ہو۔ اگر میں یونٹ تھری سے شروع کرنا چاہتا ہوں،\nمثال کے طور پر، میں کسی بھی قسم کی تبدیلی سے پہلے لکیری رشتوں کے ساتھ شروع کرنا چاہتا ہوں، میں ایسا کر سکتا ہوں اور Khanmigo\nپورے راستے میں موجود رہے گا۔ لہٰذا اساتذہ کو یہ خود مختاری حاصل ہے کہ وہ \nتدریسی ترتیب کے بارے میں یہ فیصلے کریں اور ہم بچوں کے سامنے چیزوں کو اس طرح پیش کر رہے ہیں جو ان کے طلباء کے لیے بہترین ہو۔ - [مشیل] بہترین۔\n- ٹھیک ہے، ٹھیک ہے، اس کے ساتھ، ہم صرف\nکچھ دوسری چیزوں میں واپس آنے والے ہیں. سوالات آتے رہیں۔ میں آپ کو شراکت کے کچھ فوائد سے آگاہ کروں گا۔ لہذا اگر آپ اپنا اسکول رکھنے کا انتخاب کرتے ہیں\nیا آپ کے ضلع کو ہمارے ساتھ شراکت داری کرنا ہے، تو \nاس کے ساتھ ضلع پارٹنر کے طور پر کئی چیزیں آتی ہیں، ٹھیک ہے؟ ہم جانتے ہیں کہ ہم khanacademy.org پر جا سکتے ہیں، ہم مفت میں مواد استعمال کر سکتے ہیں۔ اگر ہم ڈسٹرکٹ پارٹنر ہیں تو کیا ہوگا؟ کیا مختلف ہے؟ تو ہم پہلے ہی وہ کورس مینو دیکھ چکے ہیں، اور آپ خان اکیڈمی کے بارے میں سوچ سکتے ہیں، ہم ایک سلائیڈ پر واپس جانے والے ہیں، اس لیے معذرت، آپ خان\nاکیڈمی کو ریاضی کے پروگرام کے طور پر سوچ سکتے ہیں، لیکن جو آپ\nآج پہلے ہی دیکھ چکے ہیں۔  اسکرین یہ ہے کہ وہاں بہت کچھ ہے۔ ہمارے پاس نہ صرف ریاضی اور سائنس بلکہ ہیومینٹیز، لائف اسکلز، کمپیوٹر پروگرامنگ کے تمام شعبوں کے کورسز ہیں، لیکن ڈسٹرکٹ پارٹنر ہونے کی اصل قدر\n مواد سے بہت آگے بڑھ جاتی ہے اور یہ\nآپ کو ملنے والے تعاون کے ساتھ آتا ہے۔ اگلی سلائیڈ۔ ٹھیک ہے، تو اس سلائیڈ پر، ہم آپ کو یہاں دکھا رہے ہیں کہ،\nآپ جانتے ہیں، جب AI کی بات آتی ہے، تو ہم\nعمل درآمد کے معاملات کے لیے جو طریقہ اختیار کرتے ہیں۔ ہم تقریباً 18 ماہ، دو سال سے اس پر کام کر رہے ہیں۔ ہم یہاں ٹولز، ٹریننگ، ڈیٹا اور تجربے کے ساتھ آپ کی مدد کرنے کے لیے موجود ہیں تاکہ آپ کو پورے راستے میں رہنمائی فراہم کی جا سکے۔ لہذا ہم آپ کو اٹھانے اور جانے کے لیے شروع میں ہی نہیں ہیں۔ ہم\n \nشراکت داری کی پوری مدت کے دوران چھوٹے اور بڑے سوالات کے جوابات دینے کے لیے حاضر ہوں گے۔  اس کے علاوہ، ہمارے پاس اساتذہ اور منتظمین دونوں کے لیے پیشہ ورانہ تعلیم بھی ہے۔ اور یہ\nکسی بھی نفاذ کی کامیابی کے لیے اہم ہے۔ لیکن اگر آپ AI کو لاگو کر رہے ہیں، تو یہ صرف ایک نیا ٹول نہیں ہے، یہ کوئی پرانا عمل درآمد نہیں ہے۔ یہ درس گاہ میں ایک تبدیلی ہے اور یہ کہ ہم اپنے کلاس روم میں درس و تدریس سے کیسے رجوع کرتے ہیں۔ ہمارا ماننا ہے کہ اساتذہ اس بارے میں\nجامع تربیت کے مستحق ہیں کہ کس طرح آغاز کیا جائے، ڈیٹا تک کیسے رسائی حاصل کی جائے، ڈیٹا کا تجزیہ کیسے کیا جائے، اور ہدایت کو چلانے کے لیے اسے واقعی کیسے استعمال کیا جائے۔\n اس لیے ہم اساتذہ کی مدد کرنے کے لیے پرعزم ہیں، نہ صرف ایک اور کیے گئے PD کے ساتھ، یہاں تک کہ ایک دو، تین کیے گئے PD کے ساتھ نہیں، بلکہ سال بھر، اور صرف\nسوالات کے جوابات دینے کے لیے وہاں موجود ہونے کے قابل ہیں۔ بعض اوقات جب ہم کسی ایسی\nچیز کو نافذ کر رہے ہوتے ہیں جو بہت اہم ہوتی ہے، تو ہمیں صرف بات کرنے کے لیے کسی ایسے شخص کی ضرورت ہوتی ہے، جو ذہن سازی کے لیے سوچنے والے ساتھی ہو۔ اور ہماری پیشہ ورانہ تعلیم ان\nسب کو گھیرے ہوئے ہے۔ لہٰذا اساتذہ کے پاس\nپورے وقت کی مدد ہوتی ہے۔ آئیے MTSS کے بارے میں بھی سوچتے ہیں کہ \nطالب علموں کے لیے معاونت کے کثیر درجے والے نظام۔ ہم پہلے ہی آپ کے لیے دستیاب\nکورسز کے سوٹ کے بارے میں بات کر چکے ہیں، لیکن جو ہم\nآپ کو یہاں اسکرین پر دکھا رہے ہیں وہ یہ ہے کہ اگر آپ MTSS ماڈل کو فرق کرنے اور\nاپنے طلباء کی ضروریات کو پورا کرنے کے لیے استعمال کر رہے ہیں، تو ہمارے پاس کورس ہے۔  اس کی حمایت کرنے کے لیے مواد۔ لہٰذا ان درجات میں، چاہے ہم درجے کے درجے کے کورس کو پہلے درجے کی ہدایات کے لیے استعمال کر رہے ہوں، یا ہم ایک ایسا کورس استعمال کر رہے ہوں\nجس کا نام Get Ready For جہاں ہم بنیادیں بنا رہے ہیں اور اس\nگریڈ لیول کی ہدایات کے لیے تیار ہو رہے ہیں، Khanmigo  اور وہ سپورٹ\nجو آپ نے مشیل کو استعمال کرتے دیکھا ہے ان سب میں دستیاب ہے۔ تو بڑی بات، MTSS کے ساتھ بڑی بات یہ ہے کہ ہمارے پاس ایسے سیکھنے والے ہیں جو کچھ\nعرصے سے جدوجہد کر رہے ہیں اور ہم بڑھتی ہوئی مایوسی سے بچنا چاہتے ہیں۔ ہم نہیں چاہتے کہ وہ پھنس جائیں۔ لہٰذا خانمیگو دستیاب ہے، جب بھی انہیں ضرورت ہو، وہیں\nان کی انگلی کے اشارے پر، تاکہ انہیں وہ مدد حاصل ہو۔ - بالکل اور ایک چیز جو میں صرف\nجلدی سے شیئر کرنا چاہتا ہوں، سٹیسی، خانمیگو میں ہے، خانمیگو ڈیش بورڈ سے، اگر آپ کوشش کر رہے ہیں، اگر میں آٹھویں جماعت کا سائنس ٹیچر ہوں، لیکن میرا طالب علم\nچھٹی جماعت کی سائنس پر پڑھ رہا ہے۔  لیول، یہاں ایک لیولر ہے جہاں آپ متن داخل کر سکتے ہیں اور آپ\nپڑھنے کی سطح کو اس میں تبدیل کر سکتے ہیں۔ کیونکہ اگر فہم\nبنیادی توجہ نہیں ہے اور سائنس کے مواد کو سمجھنا ہے، تو میں اس بات کو یقینی بنانا چاہتا ہوں کہ میرے\nطلباء ایسا کرنے کے قابل ہیں اور وہ\nاس خصوصیت کے ساتھ بالکل ایسا کر سکتے ہیں۔ - ہاں.  میرے خیال میں\nیہاں یہ کہنا بھی ضروری ہے، آپ جانتے ہیں، جیسا کہ ہم\nتمام سیکھنے والوں کی مدد کر رہے ہیں، خان اکیڈمی ہے، خانمیگو بھی دستیاب ہے، وہ چیٹ بوٹ، \nانگریزی، ہسپانوی اور پرتگالی میں بھی مکمل طور پر معاون ہے۔ لہٰذا ان کثیر لسانی\nسیکھنے والوں سے بھی ملاقات کریں جہاں وہ موجود ہیں اور اس بات کو یقینی بنا رہے ہیں کہ جب\nایک کثیر لسانی سیکھنے والے کو \nانگریزی میں مہارت یا سکون کی ضرورت ہو، وہ\nاپنے مواد میں پیچھے نہیں پڑ رہے ہیں، ٹھیک ہے؟ وہ\n اپنی مادری زبان میں ہسپانوی، پرتگالی میں خانمیگو تک رسائی حاصل کر سکتے ہیں تاکہ وہ اس جگہ تک رہنا جاری رکھ سکیں جہاں انہیں\nماہرین تعلیم ہونا چاہیے۔ - بالکل، اور صرف\nاس پر piggyback کرنے کے لیے، جس طرح ہم چاہتے ہیں کہ ہمارے\nکثیر لسانی سیکھنے والے ایسا کریں، ہم چاہتے ہیں کہ ان کے والدین\nبھی اس میں شامل ہوں۔ لہذا اگر مجھے اپنے کسی طالب علم کو خط بنانے کے لیے خانمیگو کی ضرورت ہو اور والدین بنیادی طور پر ہسپانوی بولتے ہوں، تو خانمیگو میرے لیے اس خط کا ترجمہ کرے گا تاکہ میں اسے طلبا کے والدین کو بھیج سکوں\nتاکہ وہ \nان کے طالب علموں کی تعلیم میں شامل رہ سکیں۔  . - بہت بڑی مدد، بہت بڑا وقت بچانے والا۔ تو آئیے ڈیٹا کے بارے میں سوچتے ہیں۔ ہم نے اس ڈیٹا کی ایک بہت ہی مختصر جھلک لی جو آج اساتذہ کے لیے دستیاب ہے، لیکن ہم جانتے ہیں کہ منتظمین\nتدریسی رہنما ہوتے ہیں۔ اور مؤثر طریقے سے\nہدایات کی قیادت کرنے کے لیے، بطور منتظم، ہمیں ڈیٹا کی ضرورت ہے۔ لہذا اگر آپ\nاس کال پر ایڈمنسٹریٹر ہیں، تو میں اس بات کو یقینی بنانا چاہتا ہوں کہ آپ کو اس\nڈیٹا پر ایک جھلک ملے جو ضلع یا اسکول کے منتظم کی سطح سے دستیاب ہے، اور آپ اس ڈیٹا کو دیکھ سکیں گے۔ اگر آپ\nاس اسکرین شاٹ کے بائیں جانب دیکھیں جو مائیکل نے اسکرین پر دیا ہے، تو ہم\nیہاں کورس کی سطح پر، اسکول کی سطح پر، \nطالب علم کی سطح تک بہت نیچے تک ڈیٹا دیکھنے کے قابل ہیں تاکہ ہم  کامیابیوں کی شناخت کرنے کے قابل ہیں، طلباء کو مناتے ہیں جب وہ\nان چھوٹے قدموں کو آگے بڑھاتے ہیں، جیسا کہ وہ مہارت\nاور سکون حاصل کرتے ہیں، ٹھیک ہے؟ واقعی صرف اپنے آپ پر فخر محسوس کرتے ہیں۔ ہم اسے منانا چاہتے ہیں۔ لیکن ہم ایسے مواقع کی نشاندہی کرنے کے قابل بھی ہیں\n جہاں شاید ہمیں\nتھوڑا سا مزید وسائل فراہم کرنے کی ضرورت ہے یا اساتذہ کی مدد کرنے کی ضرورت ہے جو\nطالب علم جدوجہد کر رہے ہیں۔ اس لیے ایک منتظم کے طور پر، \nمیرے لیے اس ڈیش بورڈ میں جو بہتری لائی گئی ہے وہ گیم بدل رہی ہے کیونکہ میں اس\nڈیٹا کو وسیع، بہت وسیع، نیچے ایک بہت ہی تنگ منظر تک دیکھ سکتا ہوں۔ اور\n \nاس ڈیٹا بیس کے نقطہ نظر سے رہنمائی اور رہنمائی کرنے کے قابل ہونا واقعی بااختیار ہے۔ لہذا ان تمام عظیم چیزوں کو ذہن میں رکھتے ہوئے، میں حفاظت کے بارے میں بات کرنے میں صرف ایک سیکنڈ گزارنا چاہتا ہوں۔\n کیونکہ جیسے ہی ہم AI کو کلاس روم میں لاتے ہیں، بہت سارے لوگ ہیں\nجو اس سے گھبراتے ہیں، اور بجا طور پر۔ یہ ایک نئی ٹیکنالوجی ہے۔ ہمیں محتاط رہنے کی ضرورت ہے، ہمیں اس بارے میں سوچنے کی ضرورت ہے کہ ہم اسے\nاپنے کلاس رومز میں اور اپنے طلباء کے سامنے کیسے لاتے ہیں۔ اس لیے ہم\nگزشتہ 18 ماہ سے ملک بھر کے اضلاع کے ساتھ کام کر رہے ہیں اور ہم نے بہت کچھ سیکھا ہے۔ یہ ٹیکنالوجی بہت نئی ہے اور ہم سب ابھی بھی سیکھ رہے ہیں۔ وہاں کوئی بھی ماہر نہیں ہے، ٹھیک ہے؟ یہ ایک نئی ٹیکنالوجی ہے۔ ہم سب سیکھنے کی جگہ پر ہیں۔ تو پتہ لگانے کے لیے بہت کچھ ہے۔ اور ہم شراکت داروں کی تلاش کر رہے ہیں۔ ہم امید کر رہے ہیں کہ آپ\nسب اس مشن میں سیکھنے اور بڑھنے کے لیے، اساتذہ اور\nسیکھنے والوں کو ایک ساتھ سیکھنے کے لیے بااختیار بنانے کے لیے ہمارے ساتھ شراکت کرنا چاہتے ہیں۔  اس \nوقت بہت ساری زبردست چیزیں ہو رہی ہیں۔ آپ کو اسکرین پر کچھ جھلکیاں نظر آتی ہیں جیسے عظیم خبریں اور عظیم چیزیں جو ہو رہی ہیں۔ اور ہم\nآپ کے ساتھ اس کے ذریعے کام کرنے، آپ کے ساتھ اختراع کرنے کے لیے پرجوش ہیں کیونکہ سیکھنے کے لیے اور بھی بہت کچھ ہے کیونکہ ہم\n AI کے اس دور میں تعلیم کو قدرے مختلف انداز میں ڈھال رہے ہیں۔ اور اگر آپ حفاظت کی پیروی کرتے ہیں، اگر آپ طالب علم کی حفاظت کے بارے میں سوچ رہے ہیں، تو مجھے یقین ہے کہ آپ نے\nعام فہم میڈیا کی درجہ بندی کے بارے میں سنا ہوگا۔ اور یہاں اسکرین پر، ہم آپ کو اس اختتامی سوچ کے ساتھ چھوڑنا چاہتے ہیں۔\n جیسا کہ ہم اس دور میں داخل ہوتے ہیں جہاں AI\nہماری زندگی کی تمام چیزوں کا ایک حصہ ہے، ایسا لگتا ہے، ٹھیک ہے، یہ تیزی سے پھیل رہا ہے، حفاظت اور رازداری سب سے اہم ہے، خاص طور پر جب بات\nہمارے طلباء کی ہو۔ خان اکیڈمی میں، تجربہ کار اساتذہ کی ہماری ٹیم اس بات کو\nیقینی بنانے کے لیے پرعزم ہے کہ طلبہ محفوظ ہیں اور\nان کی معلومات نجی ہیں۔ لہذا مشیل نے پہلے ہی ایک شراکت داری،\nاساتذہ اور منتظمین کے ساتھ بات کی ہے، آپ دیکھ سکتے ہیں کہ طالب علم کس کے\nبارے میں بات کر رہے ہیں، آپ لاگ ان کر سکتے ہیں۔ وہاں پہرے ہیں۔ یہ خاص طور پر\nکلاس روم میں بچوں کے لیے حفاظت کو ذہن میں رکھتے ہوئے ڈیزائن کیا گیا ہے۔ لہذا وہاں پہرے ہیں، \nاساتذہ کے لیے سب کچھ دیکھنے کے لیے مکمل شفافیت ہے۔ اور یہ صرف اس بات کا حصہ ہے کہ یہ درجہ بندی\nیہاں اسکرین پر کیوں ظاہر ہوتی ہے۔ Khanmigo بچوں کے لیے بنایا گیا ہے اور یہ تعلیم کے لیے بنایا گیا ہے۔ تو اس کے ساتھ\nچیٹ میں سوالات آتے رہیں۔ یہی بات\nآج ہم نے آپ کے ساتھ شیئر کرنی ہے۔ اگر آپ مزید جاننا چاہتے ہیں تو ہماری ساتھی چیلسی ہمارے ساتھ ہے۔ \nاسکرین پر اس کی شاندار تصویر ہے۔ آپ اسے براہ راست ای میل کر سکتے ہیں، آپ اس QR کوڈ کو لے کر\nچیلسی تک پہنچ سکتے ہیں۔ لیکن وہ آپ سے اس بارے میں بات کرنے کے لیے بے تاب ہے کہ تمام ڈسٹرکٹ پارٹنرشپ میں کیا شامل ہے اور ہمارے ساتھ اس میں کیسے قدم رکھا جائے کیونکہ ہم\nاگلے سال آپ کے ساتھ کام کرنے اور کیلیفورنیا کی شاندار ریاست میں طلباء تک رسائی جاری رکھنے کے لیے واقعی پرجوش ہیں۔ - [راوی]\nاس ویڈیو کو دیکھنے اور ہماری\nتدریس اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ\nخانمیگو کلاس روم میں آپ کی اور آپ کے طلبا کی کس طرح مدد کر سکتا ہے، اپنی اسکرین پر موجود لنکس کو فالو کریں اور خان اکیڈمی پر نئے مفت کورس مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں۔\n سبسکرائب ضرور کریں۔ آپ کا شکریہ اور خوش تعلیم۔",
    "t_spanish": "- Mi nombre es Michele Marbra y soy\nespecialista en aprendizaje profesional en Khan Academy. Estoy muy emocionado de\ntenerlos a todos con nosotros hoy mientras compartimos todos los nuevos recursos interesantes que están por llegar. Así que muchas gracias a todos por\nacompañarnos hoy, y yo... Ah, y vivo en Florida.  Se lo pasaré a Stacy. - Hola a todos. Mi nombre es Stacie Johnson. Dirijo el\naprendizaje profesional para Khan Academy. Soy un maestro veterano de California, enseñé en el Valle Central de California durante más de 10 años, he estado muy involucrado con los\nmarcos de matemáticas y ciencias en el estado de California, y estoy muy emocionado de estar\naquí hoy para hablar sobre el estado de la tutoría en California. y cómo podemos seguir haciéndolo mejor y evolucionando en lo que estamos haciendo para apoyar mejor a nuestros estudiantes de California. Entonces, con eso,\ncontinuaremos y saltaremos. Están nuestras fabulosas\nimágenes en la pantalla, pero ya pueden vernos aquí. Con eso, continuaremos y comenzaremos a hablar sobre el estado actual de la\ntutoría en California. Y hay algunas cosas maravillosas\nque ya están sucediendo. Entonces, la primera es que si no ha oído hablar del\nPrograma de Bibliotecas del Estado de California HelpNow, es un excelente programa administrado por el\nsistema de bibliotecas del estado de California. Incluye tutores en vivo que\nestán disponibles en la pantalla. Tiene un laboratorio de navegación de habilidades donde los estudiantes pueden seleccionar\nlas diferentes habilidades en las que necesitan trabajar y muchos recursos excelentes, incluido incluso un laboratorio de idiomas para nuestros\nestudiantes multilingües que necesitan apoyo. Por lo tanto, es un gran programa que\nabarca todo el estado de California. También tenemos un par\nde excelentes programas de subvenciones en el estado de California. Así que existe un\nprograma de educación extraescolar financiado mediante subvenciones, y esto tiene muchas facetas diferentes. Para muchas escuelas o distritos, este podría ser un\nprograma extracurricular en el campus de la escuela donde hay adultos atentos que están allí para extender la jornada escolar y\nayudar a los estudiantes con la tarea y todas las cosas en las que\npuedan necesitar apoyo. Y luego está el programa ELO-P. Probablemente todos hayamos oído hablar de ELO-P.  Existe desde hace unos pocos años y realmente se centra en\nampliar los programas de aprendizaje. Nuevamente, se necesitan\nmuchas miradas diferentes. Este podría ser un programa de verano, podría ser un programa de escuela de sábado. Pero, una vez más, el\nenfoque de estos programas de subvenciones es cómo hacer que el\nvalor de la jornada escolar dure un poco más y llegue a más niños durante un\nmayor período de tiempo. Pero con todos estos programas, existen desafíos y desconexión entre el gran trabajo que se está realizando en nuestras\naulas de California y la tutoría. Entonces, la primera de esas desconexiones\nes la alineación del plan de estudios. Sabemos que la tutoría es más poderosa cuando los estudiantes pueden conectar lo que están haciendo en el aula con lo que están aprendiendo con su tutor, cuando pueden hacer esa conexión y ver que el aprendizaje se\ndesencadenará para ellos y para ellos.  ver cómo todo encaja. Y es un paquete realmente poderoso.  A menudo, cuando los tutores vienen de fuera del programa escolar, es posible que no sepan lo que\nsucede en el aula. No son capaces de\nestablecer esa conexión y realmente trazar esas líneas para los niños. El próximo desafío que tenemos y todos lo conocemos es la dotación de personal y recursos. Una cosa es encontrar los recursos para implementar un programa como, ya sabes, ¿ qué plan de estudios estamos usando?  ¿ Qué herramientas?  ¿ Cuáles son las actividades geniales y atractivas que\nvamos a hacer? Ese es un desafío. Pero encontrar personal calificado\npara trabajar en estos programas en vivo puede resultar particularmente desafiante. Estamos luchando para dotar de personal a\nnuestras aulas diarias, y mucho menos para\nprogramas de instrucción suplementarios. Y luego, la última desconexión\nque realmente tenemos es aprovechar al maestro. El maestro es la persona más poderosa en el sistema escolar para el alumno. Ellos son los que\nconstruyen la conexión que realmente fomenta el\nentusiasmo por aprender, la pasión por aprender en nuestros estudiantes. Entonces, cuando la tutoría se lleva a cabo\nsin el maestro, cuando el maestro no sabe realmente lo que está sucediendo en la tutoría, no puede aprovechar eso.  Una vez más, simplemente tenemos este\nabismo o esta desconexión. Así que en realidad no estamos maximizando el aprendizaje y la eficiencia de los estudiantes. Lo siguiente que puede suceder es que, ya sabes, hemos sido maestros en California y hay clases de gran tamaño. Tal vez sea un salón de clases independiente con 30 a 40 estudiantes, o tal vez tenga cinco,\nseis, siete, ocho clases con 30 o más estudiantes, sin importar cuántos estudiantes\ntenga frente a usted, estamos muy emocionados de poder\nLes presentamos hoy a Khanmigo. Ese es nuestro chatbot de IA de Khan Academy. Ves su pequeña\nimagen aquí en la pantalla. Khanmigo puede ayudar con eso. Ya sea que tenga 35 estudiantes o más de 100 en su lista, Khanmigo tiene algunas herramientas. Y en solo un segundo entraremos y te los mostraremos en vivo en acción para que puedas ver exactamente\ncómo Khanmigo puede ayudar. Antes de hacer eso, solo queremos señalar algunas cosas que debes estar atento mientras observas a Michele guiarte a través de las grandes cosas que\nsucederán en la pantalla. La primera es que Khan\nAcademy y Khanmigo tienen como objetivo el aprendizaje personalizado. Ninguno de nosotros aprende a la misma\nvelocidad, al mismo ritmo. No tenemos las mismas\nnecesidades en cuanto a tutoría. Por lo tanto, el maestro tiene el poder\ny la capacidad de determinar en qué deben trabajar los estudiantes y luego colocarlos en un camino en el que puedan crecer y progresar a su propio ritmo, a su propio ritmo. El siguiente es el contenido confiable. Todos hemos oído hablar de Khan Academy. Esta es una plataforma confiable y examinada. Este contenido es sólido. Entonces, ustedes saben que en lo que\nestán trabajando los estudiantes es en estándares alineados, estándares básicos comunes\nalineados en matemáticas, NGSS alineados en ciencias. Entonces ya sabes que este es un\nrecurso de calidad del que puedes aprovechar. Y la última es que\nhabrá un conjunto completo de herramientas que Michele les mostrará\npara empoderar a los docentes. Una vez más, lo más importante que podemos hacer es conseguir que los profesores pasen más tiempo con los niños. Entonces, cuando podamos liberar\nalgunas de esas tareas administrativas, algunas de esas\ntareas administrativas que tenemos que hacer y que nos mantienen en la escuela hasta las cinco o a partir de las 5:00 a. m., si\neres madrugador como yo, eso simplemente  te liberará para pasar más tiempo con los niños. Y ese es realmente nuestro enfoque hoy. Entonces con eso, ya es suficiente hablar. Veámoslo en acción, Michele. - Muy bien, muchas gracias, Stacie. Esta es absolutamente una de\nmis cosas favoritas para hacer, ya que les da a los maestros más tiempo. Así que me siento honrado de\nestar aquí con todos ustedes hoy. Entonces, comenzaremos con el nuevo tablero de Khanmigo y déjame hacerlo un poco más pequeño para que puedas verlo todo al mismo tiempo. Muy bien, este es el\nnuevo panel de Khanmigo. Puede ver todas\nlas diferentes herramientas que Khanmigo tiene disponibles y vamos a continuar, no\npodremos acceder a todas ellas, pero veremos muchas de ellas. También puedes separarlo planificando. Puedes separarlo creando, diferenciando, apoyando a tus alumnos. Tantas características diferentes. Y nuevamente,\nprofundizaremos en todos ellos.  Sin embargo, una de las primeras cosas\nque quiero mostrarles, solo para hablar un poco\nsobre lo que dijo Stacie, simplemente aprovechándolo de eso, son todos nuestros cursos, para acceder a todos nuestros cursos, puede verlos en cualquier momento en el  Esquina superior izquierda\nde la pantalla de Khan Academy. Simplemente seleccione Cursos y podrá ver todos\nlos cursos que tenemos, incluidos los\ncursos integrados de matemáticas que ofrecemos, así como nuestros cursos de ciencias. Y nuevamente, todos ellos están alineados con NGSS. Por eso tenemos cursos para\ntodos y para todos, incluso para adultos, hay cursos disponibles.  La educación financiera,\ncreo que es excelente y quiero que mi esposo se\nla tome como algo personal. Pero tantas clases diferentes. Muy bien, quiero comenzar, déjame, ¿qué tal las matemáticas integradas? Saltaremos a ese curso. Cuando selecciono el curso, nos muestra todas las diferentes unidades que están disponibles para el curso y nuestras unidades se dividen\nen lecciones. Así que voy a saltar a, ¿qué tal, qué tal las ecuaciones lineales? Eso siempre es divertido. Y cuando lo abro, puedes ver todo el contenido que ofrecen los cursos. Observe los pequeños íconos aquí.  Le permite saber si es un video, un artículo, una prueba o un ejercicio que queremos que nuestros estudiantes completen. Entonces, digamos que soy profesor de matemáticas y quiero asignar este\nvideo para que lo vean mis alumnos. Cuando hago clic en él, puedo ver el video, puedo ver la\ntranscripción del video, pero quiero crear una lección\nsobre todo este video.  ¿ Cómo puedo hacer eso? Khanmigo. Todo lo que tengo que hacer es que Khanmigo vive aquí y me gusta... Ahora estamos en el curso y Khanmigo vive en el curso. Simplemente selecciono Khanmigo y aparecen varios mensajes. Me preguntará, ¿ quiero ayuda para escribir un plan de lección?  ¿ Quiero ayuda para explicar\nel vídeo a mis alumnos?  ¿ Quiero ayudar haciendo\nalgunas actividades de calentamiento? Khanmigo hará todo eso por mí. O puedo preguntarle a Khanmigo algo diferente. Puedo preguntarle a Khanmigo, ¿ puedes ayudarme a crear\npreguntas sobre boletos de salida para esto? Me gustaría cinco\npreguntas de opción múltiple. Y luego le doy a Khanmigo un segundo y Khanmigo estará encantado de ayudarme a escribir ese pequeño cuestionario para mí y lo creará\ninmediatamente para usted. Y recuerda, Khanmigo no es como un\nmotor de búsqueda de Google ni nada por el estilo. Si Khanmigo no\nte da lo que quieres, debes presionarlo para asegurarte de que lo haga.  ¿ Sabes que?  ¿ Puedes elegir las respuestas abcd? Y en cuestión de segundos, por supuesto, Khanmigo lo convierte en un cuestionario que puedo realizar a mis alumnos en cualquier momento. Ahora, si quiero volver\na las otras indicaciones que se ofrecieron, puedo pedirle a Khanmigo que me ayude a\nescribir un plan de lección con esto. Y observe que dice que me ayudará a escribir un plan de lección. No va a hacer todo por mí porque lo estamos co-creando juntos. Me está ayudando porque tengo la capacidad y el control para cambiar\ntodo lo que crea Khanmigo. Entonces sí, por favor, me encantaría crear\nun plan de lección para esto. Así que haré clic en él y me llevará un par\nde segundos crearlo porque incluye muchas\ncaracterísticas importantes que necesitamos. Por ejemplo, el objetivo de aprendizaje. Incluye actividades, para mí es diferenciador, me va a dar\ninstrucción directa para mis alumnos. Me dará\nactividades de práctica independiente para mis alumnos, actividades de calentamiento para mis alumnos. Está lleno de tantas piezas geniales que necesito en mi plan de lección. Así que le daré\nun segundo para crearlo. Además, tenga en cuenta que esta es una práctica independiente que sugiere que\nasigne a mis alumnos. Y está resaltado en azul. Cada vez que ves algo azul, es una pista de algo más. Entonces, cada vez que estés en Khan Academy y veas algo azul, haz clic en él y\nte llevará a otra cosa para investigar. Muy bien, aquí está mi lección. Fantástico, fantástico. Aquí están los materiales\nque incluye y luego un resumen de la lección\nen la parte inferior, que me informa cuánto tiempo\nllevará cada actividad. Digamos que hay algo\nque no me gusta mucho. No soy fanático de este boleto de salida, prefiero usar el cuestionario que hice o quiero que a Khanmigo se le\nocurra algo diferente. No hay problema. De nuevo, tengo el control. Todo lo que tengo que hacer es hacer clic en él. Khanmigo aparecerá y\nme hará un par de preguntas.  ¿ Quiero hacerle cambios? Y si es así, puedo decirle a\nKhanmigo cuáles son esos cambios. Puedo tener una conversación\ncon Khanmigo al respecto, o por qué elegiste esto, puedo hablar con él al respecto. O simplemente puedo pedirle a Khanmigo\nque pruebe algo diferente. No sé lo que quiero. Sólo sé que no me gusta eso y quiero algo diferente. Presiono ese botón y\nlo cambia por mí. Nuevamente, yo tengo el control y vamos a co-crear un plan de lección que puedo usar con mis alumnos. Ahora, una vez que estoy satisfecho con mi plan de lección, es exactamente como lo quiero. Muchas gracias Khanmigo. Tengo la posibilidad de\nimprimir el plan de lección o... Ups, lo siento.  Lo cerré. Pero puede imprimir el plan de la lección, descargarlo en un archivo PDF o descargarlo en Google Classroom o Microsoft Word. Entonces, hay algunas cosas que puedes hacer con él después de eso. Muy bien, volveré a mis geniales herramientas Khanmigo. Otra gran característica que me encanta y siento que necesito hacer esto, la haría al comienzo\nde cada una de mis lecciones, es la característica Lesson Hook.  ¿ Cómo logramos que los estudiantes se entusiasmen con el contenido que estamos haciendo? Si estoy a punto de dar una\nlección sobre ecuaciones lineales, no hay nada realmente\nemocionante en eso. Pero a mis alumnos. Para mí, lo que más me interesan son las ecuaciones lineales. Pero Khanmigo me ayudará a crear ganchos de lección divertidos y emocionantes. Todo lo que tengo que hacer es hacer clic en él, informarle a Khanmigo el nivel de grado, esto es para mi\nclase de álgebra uno de noveno grado, o mi clase de matemáticas integradas de noveno grado, y estamos trabajando en ecuaciones lineales y solo le pido a Khanmigo\nque cree  es para mi. Y nuevamente, en cuestión de segundos, Khanmigo crea tres\nfantásticos ganchos de lecciones que puedo usar con mis alumnos y que probablemente no\nhabría pensado por mi cuenta. Realmente me gusta esta. Para una actividad práctica, los estudiantes pueden usar una calculadora gráfica o una herramienta gráfica en línea para trazar una ecuación lineal. Nuevamente, sin embargo, observe la barra violeta. Si hay algo que no me gusta, todo lo que tengo que hacer es hacer clic en él y puedo pedirle a Khanmigo que lo cambie. - Michele, ¿sabes? Lo que\ncreo que es genial de esto es que, como profesora en el\nestado de California, tenemos un plan de estudios adoptado por el estado y este es realmente un buen complemento para poder sacar cosas y  Dime, ¿sabes qué? Mi lección de hoy es genial, pero solo necesito un gancho. Necesito esta parte. Me encanta poder encontrar partes de esto que complementen lo que ya estoy haciendo en el aula.  Me pregunto si tenemos muchas preguntas sobre cómo se ve esto desde la\nperspectiva de un estudiante.  Me pregunto si podríamos entrar y ver cómo\nKhanmigo sirve como tutor en esa\nclase integrada de matemáticas. - Absolutamente. Así que volveré a\nesa clase de matemáticas integradas y volveré a exactamente la misma unidad: gráficas lineales. Y voy a ir al video, para elegir un video. Y cuando selecciono Khanmigo, tal como lo haría un maestro, aquí arriba en la parte superior de la pantalla, esto me permite cambiarlo del modo maestro al modo estudiante. Ahora el modo estudiante está activado. Aviso, aquí me da\ndiferentes indicaciones. Me va a preguntar ¿ quiero un resumen del vídeo?  ¿ Quiero que me interrogue en el vídeo?  ¿ Quiero escribir un poema sobre el video?  ¿ O por qué debería preocuparme\npor aprender este video? Ésa es una pregunta que tienen la mayoría de los estudiantes.  ¿ Por qué debería preocuparme por esto? Así que voy a seguir adelante y hacer clic en eso y Khanmigo me preguntará, bueno, ¿qué me gusta? ¿Te gustan los videojuegos? Personajes de videojuegos que se mueven en\ntodas direcciones. Y relaciona el contenido\ncon el estudiante. Si el estudiante está haciendo una tarea, porque puedo tener estudiantes\nque están por debajo del nivel de grado, pero aún así tengo que darles a mis estudiantes instrucción al nivel de grado. Y si asigno a mis alumnos\ninstrucción de nivel de grado y no estoy presente para apoyarlos, no tengo que preocuparme\nporque Khanmigo está allí. Entonces, si los estudiantes están\ntrabajando en una tarea que les he asignado, aparece Khanmigo y dice: ¿ Necesitas ayuda para resolver el problema?  ¿ Quieres probar ejemplos similares? O nuevamente, ¿por qué debería preocuparme por esto? Una cosa que quiero señalar es que me encanta que Khanmigo diga: ¿ Quieres probar un problema similar? La razón por la que Khanmigo dice eso es porque Khanmigo nunca le\ndará la respuesta a su estudiante. Al igual que un buen tutor nunca le daría la respuesta a su alumno. Les ayudará\nen el proceso de comprensión y aprendizaje del problema. Entonces Khanmigo, incluso si el estudiante dice, ¿ cuál es la respuesta? Khanmigo me lo va a decir, estoy aquí para ayudarte a aprender, no solo para darte la respuesta. Comencemos con el primer punto y guiará a los estudiantes a través del proceso de\ncomprensión del contenido aquí. Iba a decir, mostrar otra cosa. Si asigna a sus\nalumnos, digamos, una prueba. Si desea que sus alumnos\ncompleten un cuestionario en Khanmigo, no podrán acceder al cuestionario en Khanmigo. Debido al cuestionario, quiero saber el contenido\nque conocen mis alumnos. No quiero saber qué sabe Khanmigo ni cómo está ayudando Khanmigo a mis alumnos. Entonces, si mis alumnos entran\ny les asigno una prueba, Khanmigo dirá: Lo siento, no estoy disponible en esta página. De modo que sepa que si está verificando el\ndominio de sus alumnos, podrá saber si\ncomprenden el contenido. - Michele, me pregunto si podría probar algunas cosas contigo.  Me pregunto si podría ser tu alumno y probar algunas cosas en\nuno de los (indistintos) para que podamos ver a Khanmigo en acción. - Absolutamente.  Amaría eso. Bueno. Y comenzaremos con esto. - Hagamos algunos cálculos. Muy bien, veamos aquí.  ¿ Dónde está nuestro amigo Khanmigo? Entonces estamos haciendo\nentradas y salidas de funciones. Ni siquiera sé cómo empezar.  ¿ Podemos decirle a Khanmigo que\nnecesitamos ayuda para resolver esto? - Absolutamente.  ¿ Cuál es la respuesta? Estoy perdido.\n- Imaginemos que estamos en un salón de clases, tengo 35 niños, con las manos en alto. Como docente, no podemos abordarlos\ntodos al mismo tiempo. Los niños estarán esperando. Entonces, mientras esperan al maestro, sabemos que ese es el mejor recurso. El profesor siempre debe ser\nla primera línea de defensa. Khanmigo puede estar allí\npara evitar la frustración y evitar que los niños se queden estancados, o pueden estar en casa, ¿verdad? Es en el momento, tutoría instantánea. Entonces le dijimos a Khanmigo que\nno sabemos cómo empezar, no sabemos qué hacer. Creo que de lo que no estoy seguro es: ¿ cuál es esta f y luego entre\nparéntesis esta f de x?  ¿ Qué significa eso? Y nota esas burbujas. Muchas veces el problema es que los niños no saben qué decirle a Khanmigo. Saben que están estancados, saben que no saben qué hacer, pero no saben cómo verbalizarlo. Y es por eso que esas burbujas están ahí. No estamos limitados a esos, ¿verdad? Así que intentemos algo más. Khanmigo está pensando un\npoco aquí, haciendo algunos cálculos. Recientemente hemos realizado un gran trabajo para mejorar la capacidad\nde Khanmigo para hacer matemáticas.  Por eso hay un\npequeño retraso allí. Entonces aquí me dice qué es f de x y me pregunta qué sucede\nsi ponemos -8 en el cuadro. Así que voy a pensar que tenemos -7. Si x es -8, creo que sería, digamos que cometo un error y veo que es -56 menos 1. Digamos que es -57. Michele, veamos qué dice con eso. - Revisalo. - Creo que sólo tenemos que escribirlo en ese pequeño cuadro de Khanmigo que está ahí. - Ups.  -57. - Vamos con cualquier cosa. Veamos qué hace Khanmigo con eso. Así que está aquí para ofrecerme\napoyo en este momento. Pensará en\ncómo me fue allí. Está haciendo algunos cálculos. Veamos cómo responde. Ups.  Mmm. Entonces, se trata de reconocer\nque cometí un error, pero de una manera realmente solidaria, y tratemos de ayudarme a encontrar\nese pequeño error. Entonces f de x significa que si\nponemos x en ese -7x, y luego miramos cómo se descompone. Entonces, si ponemos -8, obtenemos -7 por -8. Entonces obtenemos 56 menos 1. Entonces mire cómo me validó y me dio un pequeño paso, pero no me da la respuesta. Entonces notarás un\nenfoque muy socrático. Bueno, intentemos algo más, Michele, que un niño podría decir, vamos con el viejo IDK. Nuevamente, imagina que tienes\nniños con la mano en alto, te están esperando, ¿verdad?  ¿ Qué hay para apoyarlos? Khanmigo está ahí en el momento, sin importar dónde estén, siempre que tengan su dispositivo, tendrán este tutor a pedido. Así que no estamos tratando de encontrar personas que estén en el aula para apoyar. Esto está alineado con las instrucciones que mi maestro me está dando\nen el salón de clases. Entonces, todo está en orden, está en su punto y mi maestro está allí\ncon acceso completo a esto para saber exactamente dónde me he quedado estancado y cómo necesito apoyo. Entonces, para aquellos de ustedes que están\nen el chat preguntando, ya saben, ¿ qué significa ese comportamiento? ¿\nCómo se ve? Espero que esto les haya dado\nuna pequeña idea de cómo se comportará Khanmigo y cómo puede ayudar a los\nestudiantes en este momento. - Absolutamente. Y además, mientras me\ncomunico con Khanmigo, los profesores tienen la capacidad de ver todo lo que sus alumnos están hablando y conversando con Khanmigo. O si sus alumnos le dicen algo\ninapropiado a Khanmigo, Khanmigo detendrá\nesa conversación allí mismo. Y el maestro recibe una alerta, informándole\nlo que dijo el estudiante.  Hay muchas cosas geniales allí. - Me pregunto acerca de\nalguna ciencia alineada con NGSS.  ¿ Podríamos saltar a una\nde nuestras clases de ciencias y ver cómo\nKhanmigo apoya allí? - Definitivamente.  ¿ Qué tal la biología de la escuela secundaria?  ¿ Suena divertido?\n- Mi favorito, mi favorito. - Sí.  Está bien.  ¿ Hay alguna unidad en particular que\nle gustaría ver? - Definitivamente.  Vamos con los\necosistemas, la biodiversidad. Mucha diversión allí. - Esos son buenos tiempos.  Buenos tiempos.  ¿ Quieres ver un vídeo, un artículo o un ejercicio? - Creo que me gustaría ir a un ejercicio y creo que quiero entrar\nen ese modo de estudiante y hacer la antigua pregunta que mis alumnos me hacen todo el tiempo.  ¿ Por qué diablos tengo que\npreocuparme por aprender esto?  ¿ Podemos ver qué dice Khanmigo sobre eso? - ¿Por qué debería importarme esto?  ¿ Cuáles son algunas de las cosas que te importan? Me encanta bailar. - Oh, mira eso. Tal vez darle un\npoco de relevancia, vinculándolo a cosas que me\nimportan como alumno. Bueno. - Me gusta. - Oh, entonces si un bailarín se va, el grupo se hace más pequeño. Entonces, qué manera tan interesante de vincular lo que le interesa al estudiante con el contenido de la pantalla. Vale, ¿sabes qué? Aunque eso no parece suficiente.  ¿ Puedo conseguir otro ejemplo tal vez? - Si me gusta eso.  ¿ Puedes darme otro ejemplo? Además, me gusta mucho Taylor Swift. Piense en la base de fans de Taylor Swift\ncomo un ecosistema. Si deja de hacer música, algunos fans podrían irse. Esto es como cambios en un ecosistema que hacen que la población se reduzca.  ¿ Tiene sentido? Ups.  Lo hace.  Absolutamente lo hace. Muchas gracias, Khanmigo. Ahora yo... Vaya, déjame apagarlo.  ¿ Puedes explicar más sobre\ncómo funciona el ecosistema? Porque ahora tengo curiosidad, estoy invertido. Soy sastre, soy Swifty y ahora sé por qué\nnecesito aprender sobre esto. Entonces le haré muchas más\npreguntas a Khanmigo. Ahora estoy enganchado y quiero saber más. Y vayamos a una pregunta. Vamos. Estoy por aquí. Además, hay videos que están disponibles para que los\nestudiantes los vean. Entonces puedo hacer la pregunta. Revisalo. Oh, entendí bien la pregunta. Excelente, excelente. Está bien.  Aqui hay otro más. Quiero probar un ejemplo similar. Recuerde, Khanmigo\nno nos dará la respuesta, pero puedo intentar un problema similar\npara ayudarme a resolverlo. No quiero que Khanmigo\nme dé la respuesta. Puedo conseguir uno similar. - ¿Sabes qué? Todo\nesto me hace pensar que Michele es tan atractiva. Si hubiera tenido esto en el aula, no habría tenido que esforzarme tanto para captar el\ninterés de mis alumnos y apoyarlos en el momento. Pero me pregunto cómo\nresponden los profesores y obtienen datos después.  ¿ Podría explicarnos qué\ndatos pueden obtener los profesores y cómo Khanmigo podría\nayudar a resumir esos datos y tal vez hacer algunas recomendaciones? - Absolutamente. Entonces, si asigno contenido a mis alumnos o si mis alumnos están trabajando\nen su propio camino de aprendizaje y completando actividades en Khan Academy, trabajarán en habilidades y obtendrán datos de eso. Como maestro, todo lo que tengo que hacer es venir aquí y seleccionar este\nbotón de instantánea de la clase y\nme dará una descripción general de alto nivel. Me permitirá seleccionar qué clase quiero ver primero. Quiero ver esta clase, la clase de Álgebra uno, y\nme dará una descripción general de alto nivel del progreso que mis alumnos\nhan logrado en el curso, en mi curso durante los últimos siete días. Me va a decir el promedio de la clase. Me permite saber cómo les está yendo a mis alumnos\nen las tareas que están completando. Observe también que tiene estos\ninformes luminosos en azul, que son un enlace directo\na ese informe real. Entonces, si estoy viendo las habilidades en las que están trabajando mis alumnos, pero quiero más detalles, todo lo que tengo que hacer es hacer clic en él y me llevará al informe de habilidades para poder ver exactamente en qué\nestán trabajando mis alumnos.  . Khanmigo también me da\nindicaciones adicionales aquí en las que quizás no haya pensado. Por ejemplo, ¿qué estudiante\ndebería celebrar en mi clase? Me encanta dar menciones a las clases para poder ver qué estudiantes\nnecesitan esas recompensas o quiénes las han ganado.  ¿ Qué estudiantes tienen dificultades?  ¿A quién debo controlar para asegurarme de que estén haciendo lo que se\nsupone que deben hacer? Otro, este es mi favorito. Agrupar mi clase por sus recomendaciones. Ese es un gran ahorro de tiempo. Porque nuevamente, como decía Stacie, todos mis alumnos no\nestarán en el mismo nivel y necesito poder diferenciarme y darles a mis alumnos lo que necesitan. Este es mi nuevo mejor amigo. Desglosará\nlo que mis alumnos necesitan y me dirá qué necesitan los alumnos para poder asignarles las tareas.  ¿ Pero sabes que? Hay algo aún mejor. Volveré a ese tablero y este es mi nuevo mejor amigo. Este se lo compartí ayer a una maestra\ny ella dijo: \"Lo único que esto\nno hace es prepararme café\". Es simplemente un cambio absoluto del juego. Esta es la de Recomendar tareas. Aquí es donde Khanmigo\nanaliza todos los datos sobre todo el contenido que\nsus estudiantes han estado haciendo y recomienda\ntareas específicas para grupos particulares porque recuerde,\nno todos están en el mismo lugar. Pero éste va un paso más allá. Los asignará directamente por mí. Entonces, si quiero asignar estas\ntareas a ese grupo, todo lo que tengo que hacer es seleccionar este botón. Lo más difícil\nque tengo que hacer, la decisión más difícil\nque tengo que tomar es: ¿ quiero que cada estudiante\ntenga un conjunto de preguntas diferente o quiero que todos mis estudiantes tengan el mismo conjunto de preguntas? Y, sinceramente, no hay una\nrespuesta correcta o incorrecta. Realmente depende de para\nqué lo estés usando. Si les asigno esto a\nmis alumnos como tarea, sí, quiero asegurarme de que todos\ntengan preguntas diferentes. Pero si quiero que mis alumnos\ntrabajen juntos, colaboren y construyan ese discurso matemático, les asignaré\nel mismo conjunto de preguntas y les dejaré trabajar juntos mientras proyecto en la pantalla. Y podemos hacerlo juntos. Entonces ese es un gran ahorro de tiempo. Me encanta esa nueva característica. Otra característica realmente interesante\nque está disponible es el Generador de contexto del mundo real. Éste, enorme, al igual que Khanmigo sabe que los\nestudiantes hacen la pregunta \"¿Por qué debería importarme esto?\", Esto lo hace real para los estudiantes. Simplemente dígale a Khanmigo\nsu nivel de grado y lo que vamos a enseñar. Stacie, ¿qué vamos a enseñarte? - Sistemas de ecuaciones. Eso es lo que más me gusta enseñar. - Sistemas de ecuaciones. Muy bien, y de nuevo,\nen cuestión de segundos, Khanmigo crea tres ideas diferentes que puedo usar con mis alumnos.  ¿ Cómo pueden relacionarse? Así que no es solo que ellos no solo estén haciendo\nmatemáticas con mi libro de matemáticas, sino que estoy haciendo esto real y lo estoy haciendo más\natractivo para mis estudiantes. - Y hablando de libros de matemáticas, tenemos una pregunta en el chat, quiero asegurarme de que todos\nescuchen la respuesta también. Estos estándares no solo están alineados, nuevamente, con los estándares estatales básicos comunes\nen matemáticas y NGSS en ciencias, sino que también tenemos opciones de cursos para Eureka Math o Engage\nNew York desde tercer grado hasta álgebra dos, y Matemáticas ilustrativas, comenzando con  7mo grado\nhasta álgebra uno. Entonces, en el menú del curso, Michele simplemente hará clic\nallí en Ver todas las matemáticas, hay toneladas de cosas aquí. Así que podríamos desplazarnos durante unos cinco minutos para ver todas estas clases diferentes. Pero cuando llegamos a la\nmitad de la página, podemos hacer clic y mostrárselo. Puede ver una captura de pantalla rápida aquí de todos los diferentes cursos que están disponibles en cálculo, y allí están nuestras\nclases ilustrativas de matemáticas . Entonces, si están usando ese\nplan de estudios para el octavo grado, para Álgebra uno, si están usando Eureka Math, esos están ahí. Y nuevamente, no solo están alineados los estándares, sino que también existe esa alineación curricular, que es un gran recurso. - ¿Quieres que participe en una de las clases de Eureka Math? - Echemos un vistazo a\nMatemáticas ilustrativas para octavo grado. - Está bien. Bueno.  ¿ Algún tema en particular? - No, echemos un vistazo\na cómo está alineado el rumbo. Y si está acostumbrado a\nutilizar estos planes de estudio, sé que son bastante\nfrecuentes en todo el estado, observe cómo coincide con la alineación del libro de texto. Entonces, ya saben, lo bueno\nde cualquiera de los cursos es que no importa si están usando nuestro curso tradicional de octavo grado o si están usando este curso, las unidades se pueden asignar en cualquier orden. De modo que usted, como profesor, puede tomar decisiones sobre el orden en el que los estudiantes deben recibir el contenido. Y Khanmigo\nestará allí pase lo que pase. Si quiero comenzar con\nla unidad tres, por ejemplo, quiero comenzar con relaciones lineales antes de realizar cualquier tipo de transformación, puedo hacerlo y Khanmigo estará\nallí durante todo el proceso. Entonces los maestros tienen esa autonomía para tomar decisiones\nsobre el orden de la instrucción y cómo presentamos las cosas a los niños de la mejor manera para sus alumnos.  - [Michele] Excelente.\n- Muy bien, bueno, con eso, volveremos\na algunas otras cosas. Sigan llegando las preguntas. Le explicaré algunas de las ventajas de la asociación. Entonces, si elige que su\nescuela o su distrito se asocien con nosotros, hay varias cosas\nque vienen con eso como socio del distrito, ¿verdad? Sabemos que podemos ir a khanacademy.org y podemos usar el contenido de forma gratuita.  ¿ Qué pasa si somos socios del distrito?  ¿ Qué es diferente? Ya hemos visto el menú del curso, y quizás pienses en Khan Academy, retrocederemos una diapositiva, lo siento, puedes pensar en Khan\nAcademy como un programa de matemáticas, pero lo que ya has\nvisto hoy en  la pantalla es que hay mucho más allí. Tenemos cursos en todas las disciplinas, no solo matemáticas y ciencias, sino también humanidades, habilidades para la vida y programación de computadoras, pero el valor real de\nser un socio del distrito se expande mucho más allá del contenido y viene con el\napoyo que usted recibe.  La siguiente diapositiva. Muy bien, en esta diapositiva les mostramos que,\ncuando se trata de IA, el enfoque que adoptamos\npara la implementación es importante. Llevamos casi 18 meses, dos años, trabajando en esto. Estamos aquí para ayudarlo con herramientas, capacitación, datos y experiencia para guiarlo en todo el camino. Así que no estamos ahí sólo al principio para ayudarle a ponerse en marcha. Estaremos allí para responder\npreguntas, grandes y pequeñas, durante toda la duración\nde la asociación. Además de eso, también contamos con aprendizaje profesional tanto para profesores como para administradores. Y eso es fundamental para el\néxito de cualquier implementación. Pero si está implementando IA, esta no es solo una herramienta nueva, no es una implementación antigua. Este es un cambio en la pedagogía y en la forma en que abordamos la enseñanza y la instrucción en nuestro salón de clases. Creemos que los profesores\nmerecen una formación integral sobre cómo empezar, cómo acceder a los datos, cómo analizarlos y cómo utilizarlos realmente\npara impulsar la instrucción. Por eso, estamos comprometidos a apoyar a los maestros, no solo con un PD de una sola vez, ni siquiera con dos o tres PD, sino durante todo el año, y también poder\nestar allí para responder preguntas. A veces, cuando\nimplementamos algo tan importante, solo necesitamos alguien con quien hablar, un compañero de pensamiento con quien intercambiar ideas. Y nuestro aprendizaje profesional\nabarca todo eso. De modo que los profesores cuentan con ese\napoyo integral todo el tiempo. Pensemos también en MTSS como sistemas\nde apoyo de múltiples niveles para los estudiantes. Ya hemos hablado\ndel conjunto de cursos que están disponibles para usted, pero lo que\nle mostramos aquí en la pantalla es que si está utilizando un modelo MTSS para diferenciarse y satisfacer\nlas necesidades de sus estudiantes, tenemos cursos  contenido que respalde eso. Entonces, en todos estos niveles, ya sea que estemos usando el curso de nivel de grado para la instrucción de nivel uno, o estemos usando un curso\nllamado Prepárese para donde estamos construyendo las bases y preparándonos para esa\ninstrucción de nivel de grado, Khanmigo  y ese soporte\nque viste usar a Michele está disponible en todos estos. Entonces, lo más importante con MTSS es que tenemos estudiantes que han\nestado luchando por un tiempo y queremos evitar una frustración creciente. No queremos que se queden estancados. Entonces Khanmigo está disponible, siempre que lo necesiten, al alcance de\nsu mano para que tengan ese apoyo. - Absolutamente. Y una cosa que quiero\ncompartir muy rápidamente, Stacie, es en Khanmigo, desde el panel de Khanmigo, si lo intentas, si soy profesor de ciencias de octavo grado, pero mi alumno está leyendo en\nuna ciencia de sexto grado.  nivel, hay un nivelador aquí donde puedes ingresar un texto y puedes cambiarle el\nnivel de lectura. Porque si la comprensión\nno es el enfoque principal y la comprensión del contenido científico sí lo es, quiero asegurarme de que mis\nalumnos puedan hacerlo y que absolutamente puedan\nhacerlo con esta función. - Sí.  Creo que también es\nimportante decir aquí, ya sabes, como\napoyamos a todos los estudiantes, Khan Academy también está disponible Khanmigo, ese chatbot, que también es totalmente compatible en\ninglés, español y portugués. Entonces, también encontrar a esos\nestudiantes multilingües en el lugar donde se encuentran y garantizar que, si bien\nun estudiante multilingüe tal vez requiera dominio\no comodidad en inglés, no se esté quedando atrás\nen su contenido, ¿verdad? Pueden acceder a\nKhanmigo en español, en portugués y en su idioma natal para que puedan seguir estando al día con lo que\ndeberían estar en el ámbito académico. - Por supuesto, y\npara aprovechar eso, así como queremos que nuestros\nestudiantes multilingües hagan eso, queremos que sus padres\ntambién participen. Entonces, si necesito que Khanmigo cree una carta para uno de mis estudiantes y el padre habla principalmente español, Khanmigo me traducirá esa carta para que pueda enviársela a los padres de los estudiantes\npara mantenerlos involucrados y informados con la\neducación de sus estudiantes.  . - Gran ayuda, gran ahorro de tiempo. Entonces pensemos en los datos. Echamos un vistazo muy breve a los datos que están disponibles para los maestros hoy en día, pero sabemos que los administradores\nson líderes educativos. Y para\ndirigir eficazmente la instrucción, como administradores, necesitamos datos. Entonces, si usted es\nadministrador en esta llamada, quiero asegurarme de que pueda echar\nun vistazo aquí a los datos que están disponibles a nivel de administrador de distrito o escuela, y que pueda ver estos datos. Si miras el\nlado izquierdo de esa captura de pantalla que Michele tiene en la pantalla, podemos ver datos\naquí a nivel de curso, a nivel de escuela, hasta un\nnivel de estudiante muy granular, de modo que  Somos capaces de identificar éxitos, celebrar a los estudiantes a medida que\ndan esos pequeños pasos hacia adelante, a medida que adquieren competencia\ny comodidad, ¿verdad? Realmente simplemente se sienten orgullosos de sí mismos. Queremos celebrar eso. Pero también podemos\nidentificar oportunidades en las que tal vez necesitemos destinar\nun poco más de recursos o apoyar al maestro con los\nestudiantes que tienen dificultades. Entonces, como administrador, las mejoras que se han\nrealizado en este panel para mí cambian las reglas del juego porque puedo ver esa\nvista amplia de datos, muy amplia, hasta una vista muy estrecha. Y es realmente enriquecedor\npoder liderar y guiar la instrucción desde\nesa perspectiva de base de datos. Con todas estas cosas maravillosas en mente, quiero dedicar un segundo a\nhablar sobre seguridad. Porque a medida que llevamos la IA al aula, hay muchas personas\nque se ponen nerviosas por esto, y con razón. Esta es una nueva tecnología. Necesitamos tener cuidado, debemos reflexionar sobre cómo llevamos esto a\nnuestras aulas y frente a nuestros estudiantes. Hemos estado trabajando\ndurante los últimos 18 meses con distritos de todo el país y hemos aprendido mucho. Esta tecnología es muy nueva y todos todavía estamos aprendiendo. Nadie es un experto ahí fuera, ¿verdad? Esta es una nueva tecnología. Todos estamos en un lugar de aprendizaje. Entonces hay mucho que descubrir. Y estamos buscando socios. Esperamos que\ntodos quieran asociarse con nosotros para aprender y crecer en esta misión, para capacitar a profesores y\nalumnos para que aprendan juntos. Están\nsucediendo muchas cosas geniales en este momento. Ves algunos fragmentos en la pantalla de grandes noticias y grandes cosas que están sucediendo. Y estamos entusiasmados de trabajar\nen esto con ustedes, de innovar con ustedes porque hay mucho más que aprender a medida que damos forma a la educación de manera un\npoco diferente en esta era de la IA. Y si sigue la seguridad, si está pensando en la seguridad de los estudiantes, estoy seguro de que ha oído hablar de las\ncalificaciones de los medios de sentido común. Y aquí en la pantalla queremos dejarles con\neste pensamiento final. A medida que entramos en esta era en la que la IA es parte de\ntodas las cosas en nuestras vidas, parece que es cada vez más frecuente, la seguridad y la privacidad son primordiales, especialmente cuando se\ntrata de nuestros estudiantes. En Khan Academy, nuestro equipo de educadores veteranos\nestá comprometido a garantizar que los estudiantes estén seguros y que\nsu información sea privada. Michele ya habló con una asociación,\nmaestros y administradores, pueden ver de qué\nestán hablando los estudiantes y pueden obtener un registro. Hay barandillas allí. Esto está diseñado específicamente\npara niños en un salón de clases teniendo en cuenta la seguridad. Hay barreras de seguridad y total transparencia para que\nlos profesores puedan ver todo. Y eso es sólo una parte de por qué esta calificación se refleja\naquí en la pantalla. Khanmigo está diseñado para niños y para la educación. Entonces, con eso, sigan con las\npreguntas en el chat. Eso es lo que tenemos para\ncompartir con ustedes hoy. Si quieres saber más, nuestra colega Chelsea está aquí con nosotros. Allí está su fabulosa\nimagen en la pantalla. Puedes enviarle un correo electrónico directamente, puedes tomar ese código QR\ny comunicarte con Chelsea. Pero está ansiosa por hablar con ustedes sobre lo que implica toda asociación distrital y cómo participar en ella con nosotros porque estamos muy emocionados\nde trabajar con ustedes todo el próximo año y continuar llegando a los estudiantes en el fabuloso estado de California. - [Narrador] Gracias\npor ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus alumnos en el aula, siga los enlaces en su pantalla y no se pierda nunca anuncios interesantes sobre nuevos materiales de cursos gratuitos\nen Khan Academy. Asegúrate de suscribirte. Gracias y feliz enseñanza.",
    "t_arabic": "- اسمي ميشيل ماربرا وأنا\nمتخصص في التعلم المهني في أكاديمية خان. أنا متحمس جدًا\nلوجودكم معنا جميعًا اليوم حيث نشارك جميع الموارد الجديدة الرائعة التي تأتي في طريقكم. شكرًا جزيلاً لكم جميعًا على\nانضمامكم إلينا اليوم، وسأفعل... أوه، وأنا أعيش في فلوريدا. سأمررها إلى ستايسي. - أهلا بالجميع. اسمي ستيسي جونسون. أقود\nالتعلم المهني لأكاديمية خان. أنا مدرس مخضرم في كاليفورنيا، وقمت بالتدريس في وادي كاليفورنيا المركزي لأكثر من 10 سنوات، وقد شاركت بشكل كبير في\nأطر الرياضيات والعلوم في ولاية كاليفورنيا، وأنا متحمس حقًا لوجودي\nهنا اليوم للحديث عن حالة التدريس الخصوصي في كاليفورنيا وكيف يمكننا الاستمرار في العمل بشكل أفضل والتطور فيما نقوم به لدعم طلابنا في كاليفورنيا بشكل أفضل. وبهذا،\nسنمضي قدمًا ونبدأ. هناك صورنا الرائعة\nعلى الشاشة، ولكن يمكنك رؤيتنا هنا بالفعل. وبهذا، سنمضي قدمًا ونبدأ في الحديث عن الوضع الحالي\nللتعليم الخصوصي في كاليفورنيا.  وهناك بعض الأشياء العظيمة\nالتي تحدث بالفعل. لذا، الأول هو إذا لم تكن قد سمعت عن\nبرنامج HelpNow لمكتبة ولاية كاليفورنيا، فهو برنامج رائع يديره\nنظام مكتبات ولاية كاليفورنيا. ويشمل المعلمين الحية\nالمتوفرة على الشاشة. يحتوي على معمل لتصفح المهارات حيث يمكن للطلاب اختيار\nالمهارات المختلفة التي يحتاجون للعمل عليها والكثير من الموارد الرائعة، بما في ذلك معمل اللغة \nللمتعلمين متعددي اللغات الذين يحتاجون إلى الدعم. لذا فهو برنامج رائع،\nويمتد إلى ولاية كاليفورنيا. لدينا أيضًا بعض\nبرامج المنح الرائعة في ولاية كاليفورنيا. إذًا هناك\nبرنامج تعليم ما بعد المدرسة ممول بمنحة، وهذا يأخذ الكثير من الأشكال المختلفة. بالنسبة للعديد من المدارس أو المناطق، قد يكون هذا برنامجًا لما بعد المدرسة\nفي حرم المدرسة حيث يوجد بالغون مهتمون لتمديد اليوم الدراسي لمساعدة\nالطلاب في الواجبات المنزلية وجميع الأشياء التي\nقد يحتاجون إلى الدعم فيها. ثم هناك برنامج ELO-P. ربما سمعنا جميعًا عن ELO-P.  لقد كان موجودًا منذ بضع سنوات فقط ويركز حقًا على\nتوسيع نطاق برامج التعلم. لذا مرة أخرى، يتطلب الأمر\nالكثير من الأشكال المختلفة. قد يكون هذا برنامجًا صيفيًا، أو قد يكون برنامجًا مدرسيًا يوم السبت. ولكن في الواقع، مرة أخرى،\nتركز برامج المنح هذه على كيفية جعل\nقيمة اليوم الدراسي تدوم لفترة أطول قليلاً، وتصل إلى المزيد من الأطفال خلال\nفترة زمنية أكبر. ولكن مع كل هذه البرامج، هناك تحديات وانفصال بين العمل الرائع الذي يحدث في\nفصولنا الدراسية في كاليفورنيا والدروس الخصوصية. لذا فإن أول هذه الانفصالات\nهو مواءمة المناهج الدراسية. نحن نعلم أن التدريس الخصوصي يكون أقوى عندما يتمكن الطلاب من ربط ما يفعلونه في الفصل الدراسي بما يتعلمونه مع معلمهم عندما يكونون قادرين على إجراء هذا الاتصال ويرون أن التعلم\nسيتم تحفيزه لهم وهم  انظر كيف يتناسب كل شيء معًا. وهي حزمة قوية حقًا.  في كثير من الأحيان، عندما يأتي المعلمون من خارج البرنامج المدرسي، فقد لا يعرفون ما\nيحدث في الفصل الدراسي. إنهم غير قادرين على\nإنشاء هذا الاتصال ورسم تلك الخطوط للأطفال. التحدي التالي الذي نواجهه ونحن جميعًا على دراية به هو التوظيف وتوفير الموارد. يعد العثور على الموارد اللازمة لوضعها في برنامج مثل، كما تعلمون، ما المنهج الذي نستخدمه؟ ما الأدوات؟ ما هي الأنشطة الرائعة والممتعة التي\nسنقوم بها؟ هذا هو التحدي الوحيد. لكن العثور على موظفين مؤهلين\nللعمل في هذه البرامج الحية قد يكون أمرًا صعبًا بشكل خاص. نحن نكافح من أجل توفير الموظفين في\nفصولنا الدراسية اليومية، ناهيك عن\nالبرامج التعليمية التكميلية. ومن ثم فإن الانفصال الأخير\nالذي لدينا حقًا هو الاستفادة من المعلم. المعلم هو أقوى شخص في النظام المدرسي بالنسبة للمتعلم. إنهم هم الذين\nيبنون الاتصال الذي يعزز حقًا\nالإثارة للتعلم والشغف بالتعلم لدى طلابنا. لذلك عندما يتم التدريس\nبعيدًا عن ذلك المعلم، عندما لا يعرف المعلم حقًا ما يحدث في التدريس، فلن يتمكن من الاستفادة من ذلك. مرة أخرى، لدينا فقط هذه\nالهوة أو هذا الانفصال. لذلك نحن لا نحقق أقصى قدر من التعلم والكفاءة للطلاب. الشيء التالي الذي يمكن أن يحدث هو أننا كنا مدرسين في كاليفورنيا، وهناك بعض الفصول ذات أحجام كبيرة هناك. ربما تكون فصلًا دراسيًا قائمًا بذاته يضم 30 إلى 40 طالبًا، أو ربما لديك خمسة أو\nستة أو سبعة أو ثمانية فصول تضم 30 طالبًا أو أكثر، بغض النظر عن عدد الطلاب\nالموجودين أمامك، فنحن متحمسون جدًا لذلك\nأقدم لكم اليوم خانميغو. هذا هو برنامج الدردشة الآلي الخاص بأكاديمية خان للذكاء الاصطناعي. ترون أنها\nصورة صغيرة هنا على الشاشة. يمكن أن يساعد خانميغو في ذلك. سواء كان لديك 35 طالبًا أو أكثر من 100 طالب في قائمتك، فإن خانميغو لديه بعض الأدوات. وفي غضون ثانية واحدة فقط، سنتدخل ونعرض لك تلك الأحداث الحية حتى تتمكن من رؤية بالضبط\nكيف يمكن لـ Khanmigo المساعدة. قبل أن نفعل ذلك، نريد أن نشير إلى بعض الأشياء التي يجب أن تنتبه إليها وأنت تشاهد ميشيل وهي ترشدك عبر الأشياء الرائعة التي\nستحدث على الشاشة. الأول هو أن\nأكاديمية خان وخانميغو تتمحوران حول التعلم الشخصي. لا أحد منا يتعلم بنفس\nالسرعة، بنفس الوتيرة. ليس لدينا نفس\nالاحتياجات فيما يتعلق بالتدريس. لذلك يتمتع المعلم بالقوة\nوالقدرة على تحديد ما يحتاج الطلاب إلى العمل عليه، ومن ثم وضع الطلاب على المسار الذي يمكنهم من خلاله النمو والتقدم بالسرعة التي تناسبهم، وبمعدلهم الخاص. التالي هو المحتوى الموثوق به.  لقد سمعنا جميعا عن أكاديمية خان. هذه منصة موثوقة ومدققة. هذا المحتوى صلب. لذا فأنت تعلم أن ما\nيعمل عليه الطلاب هو التوافق مع المعايير، والمعايير الأساسية المشتركة\nالمتوافقة مع الرياضيات، و NGSS المتوافقة مع العلوم. إذن أنت تعلم أن هذا\nمورد عالي الجودة يمكنك الاستفادة منه. والأخير هو أنه\nستكون هناك مجموعة كاملة من الأدوات التي ستعرضها\nلك ميشيل لتمكين المعلمين. مرة أخرى، أهم شيء يمكننا القيام به هو منح المعلمين مزيدًا من الوقت مع الأطفال. ولذا عندما نتمكن من تحرير\nبعض تلك المهام الكتابية، فإن بعض تلك\nالمهام الإدارية التي يتعين علينا القيام بها والتي تبقينا في المدرسة حتى الخامسة أو بدءًا من الساعة 5:00 صباحًا. إذا\nكنت طائرًا مبكرًا مثلي، فهذا سيكون فقط  يحررك لقضاء المزيد من الوقت مع الأطفال. وهذا حقًا ما ينصب عليه تركيزنا اليوم. وبهذا يكفي الحديث. دعونا نرى ذلك على أرض الواقع، ميشيل. - حسنًا، شكرًا جزيلاً لك، ستيسي. يعد هذا بالتأكيد أحد\nالأشياء المفضلة لدي، حيث يمنح المعلمين المزيد من الوقت. لذا، أنا فقط، يشرفني أن\nأكون هنا معكم جميعًا اليوم. لذلك سنبدأ بلوحة القيادة الجديدة تمامًا لـKhanmigo واسمحوا لي أن أجعلها أصغر قليلاً حتى تتمكن من رؤية كل شيء في وقت واحد. حسنًا، هذه هي\nلوحة القيادة الجديدة تمامًا لـKhanmigo. أنت قادر على عرض جميع\nالأدوات المختلفة المتوفرة لدى خانميغو وسنذهب، ولن نتمكن\nمن الوصول إليها جميعًا، ولكننا سنلقي نظرة على العديد منها. يمكنك أيضًا فصله عن طريق التخطيط. يمكنك فصله عن طريق إنشاء طلابك وتمييزهم ودعمهم. الكثير من الميزات المختلفة. ومرة أخرى، سوف نقوم\nبالبحث في كل منهم. أحد الأشياء الأولى\nالتي أريد أن أوضحها لك، فقط للحديث قليلاً\nعما قالته ستيسي، مجرد الاستفادة من ذلك، هو جميع دوراتنا، ومن أجل الوصول إلى جميع دوراتنا، يمكنك مشاهدتها في أي وقت في  الزاوية العلوية اليسرى\nمن شاشة أكاديمية خان.  ما عليك سوى تحديد الدورات التدريبية وستتمكن من عرض جميع\nالدورات التدريبية التي لدينا، بما في ذلك\nدورات الرياضيات المتكاملة التي نقدمها، بالإضافة إلى دورات العلوم لدينا. ومرة أخرى، كل هذه العناصر متوافقة مع NGSS. لذلك لدينا دورات\nلأي شخص وكل شيء، حتى الكبار، الدورات متاحة. محو الأمية المالية،\nأعتقد أن هذا أمر رائع وأريد أن\nيأخذ زوجي الأمر على محمل شخصي. ولكن هناك العديد من الطبقات المختلفة. حسنًا، أريد أن أنتقل إلى ما يلي، ماذا عن الرياضيات المتكاملة؟ سوف نقفز إلى تلك الدورة. عندما أحدد الدورة التدريبية، تظهر لنا جميع الوحدات المختلفة المتوفرة للدورة، ويتم تقسيم وحداتنا\nإلى دروس. لذلك سأنتقل إلى، ماذا عن المعادلات الخطية؟ هذا دائمًا شيء ممتع. وعندما أفتحه، ستتمكن من رؤية كل المحتوى الذي تقدمه الدورات. لاحظ الرموز الصغيرة هنا. فهو يتيح لك معرفة ما إذا كان مقطع فيديو أو مقالًا أو اختبارًا أو تمرينًا نريد من طلابنا إكماله. لنفترض أنني مدرس رياضيات وأريد تخصيص هذا\nالفيديو لطلابي لمشاهدته. عندما أنقر عليه، أستطيع مشاهدة الفيديو، وأستطيع رؤية\nنص الفيديو، ولكنني أريد إنشاء درس\nحول هذا الفيديو بأكمله. كيف يمكنني فعل ذلك؟ خانميجو. كل ما علي فعله هو أن خانميغو يعيش هنا، وأنا أحب ذلك... نحن في المسار الآن وخانميغو يعيش في المسار.  لقد قمت فقط باختيار خانميغو وستظهر عدة مطالبات. سيسألني، هل أريد مساعدة في كتابة خطة الدرس؟ هل أريد مساعدة في شرح\nالفيديو لطلابي؟ هل أريد المساعدة في القيام ببعض\nأنشطة الإحماء؟ سوف يقوم خانميغو بكل ذلك من أجلي. أو يمكنني أن أطلب من خانميغو شيئًا مختلفًا. يمكنني أن أسأل خانميغو، هل يمكنك مساعدتي في إنشاء\nأسئلة تتعلق بتذكرة الخروج لهذا الغرض؟ أريد خمسة\nأسئلة اختيار من متعدد. ثم أعطي خانميغو ثانية وسيسعد خانميغو بمساعدتي في كتابة هذا الاختبار الصغير لي وسيقوم بإنشاء هذا\nالاختبار لك على الفور. وتذكر أن خانميغو ليس مثل\nمحرك بحث جوجل أو أي شيء آخر. إذا لم\nيمنحك خانميغو ما تريد، فأنت تريد الضغط عليه للتأكد من أنه يفعل ذلك. أتعلم؟  هل يمكنك اختيار الإجابة abcd؟ وفي غضون ثوانٍ فقط، بالطبع، يقوم خانميغو بتغييره إلى اختبار يمكنني تقديمه لطلابي في أي وقت. الآن، إذا أردت العودة\nإلى المطالبات الأخرى التي تم تقديمها، يمكنني أن أطلب من خانميجو مساعدتي في\nكتابة خطة الدرس في هذا الشأن. ولاحظ أنه يقول أنه سيساعدني في كتابة خطة الدرس. لن يفعل كل شيء بالنسبة لي لأننا نشارك في إنشائه معًا. إنه يساعدني لأن لدي القدرة والتحكم لتغيير\nكل ما يصنعه خانميغو. لذا، نعم، من فضلك، أرغب في إنشاء\nخطة درس لهذا الغرض. لذلك سأقوم بالنقر عليه وسيستغرق\nإنشائه بضع ثوانٍ لأنه يتضمن العديد من\nالميزات المهمة التي نحتاجها. على سبيل المثال، الهدف التعليمي. إنه يشتمل على أنشطة، وهو ما يميزني، وسيقدم لي\nتعليمات مباشرة لطلابي. سوف يمنحني ذلك\nأنشطة تدريب مستقلة لطلابي، وأنشطة إحماء لطلابي. إنها مليئة بالعديد من القطع الرائعة التي أحتاجها في خطة الدرس. لذلك\nسأعطيه ثانية لإنشائه. لاحظ أيضًا أن هذه ممارسة مستقلة تقترح أن\nأقوم بتعيين طلابي. ويتم تسليط الضوء عليه باللون الأزرق. في أي وقت ترى فيه شيئًا باللون الأزرق، فهذا دليل على شيء آخر. لذا، عندما تكون في أكاديمية خان وترى شيئًا باللون الأزرق، انقر عليه وسيأخذك\nإلى شيء آخر للتحقيق فيه. حسنًا، هذا هو درسي. رائع، رائع. فيما يلي المواد\nالتي يتضمنها، ثم ملخص الدرس\nفي الأسفل، مما يسمح لي بمعرفة المدة التي\nسيستغرقها كل نشاط. لنفترض أن هناك شيئًا\nلا يعجبني حقًا. أنا لست من محبي تذكرة الخروج هذه، أفضل استخدام الاختبار الذي أجريته، أو أريد أن يأتي خانميغو\nبشيء مختلف. لا شكر على واجب. مرة أخرى، أنا المسيطر. كل ما علي فعله هو النقر عليه. سوف يظهر خانميغو ويسألني\nبعض الأسئلة.  هل أريد إجراء تغييرات عليه؟ وإذا كان الأمر كذلك، يمكنني فقط أن أخبر\nخانميغو ما هي تلك التغييرات. يمكنني إجراء مناقشة\nمع خانميغو حول هذا الموضوع، أو لماذا اخترت هذا، يمكنني التحدث معه حول هذا الموضوع. أو يمكنني فقط أن أطلب من خانميغو\nتجربة شيء مختلف. لا أعرف ماذا أريد. أعلم فقط أنني لا أحب ذلك وأريد شيئًا مختلفًا.  لقد ضغطت على هذا الزر\nويغيره بالنسبة لي.  مرة أخرى، أنا المسيطر وسنذهب معًا، وسنشارك في إنشاء خطة درس يمكنني استخدامها مع طلابي. الآن، بمجرد أن أكون سعيدًا بخطة الدرس الخاصة بي، فهي بالضبط بالطريقة التي أريدها. شكرا جزيلا لك، خانميجو. لدي القدرة على\nطباعة خطة الدرس أو... عفوًا، آسف. أنا قفلته. ولكن يمكنك طباعة خطة الدرس أو يمكنك تنزيلها في ملف PDF أو يمكنك تنزيلها في Google Classroom أو Microsoft Word. لذلك هناك بعض الأشياء التي يمكنك القيام بها بعد ذلك. حسنًا، سأعود إلى أدوات خانميغو الرائعة الخاصة بي.  هناك ميزة رائعة أخرى أحبها وأشعر أنني بحاجة إلى القيام بذلك، وسأفعل ذلك في بداية\nكل درس من دروسي، إنها ميزة \"ربط الدروس\". كيف نجعل الطلاب متحمسين للمحتوى الذي نقوم به؟ إذا كنت على وشك تدريس\nدرس في المعادلات الخطية، فلا يوجد شيء\nمثير حقًا في ذلك. لكن لطلابي. بالنسبة لي، كل ما أهتم به هو المعادلات الخطية. لكن خانميغو سيساعدني في إنشاء خطافات درس ممتعة ومثيرة. كل ما علي فعله هو النقر عليه، وإعلام خانميغو بمستوى الصف، وهذا مخصص لصف\nواحد في الجبر للصف التاسع، أو صف الرياضيات المتكامل للصف التاسع، ونحن نعمل على معادلات خطية وأنا فقط أطلب من خانميغو\nإنشاء  بالنسبة لي. ومرة أخرى، في غضون ثوانٍ، أنشأ خانميغو ثلاثة\nدروس رائعة يمكنني استخدامها مع طلابي والتي ربما لم أكن\nلأفكر فيها بمفردي. أنا حقا أحب هذا واحد. بالنسبة للنشاط العملي، يمكن للطلاب استخدام الآلة الحاسبة الرسومية أو أداة الرسوم البيانية عبر الإنترنت لرسم معادلة خطية. مرة أخرى، لاحظ الشريط الأرجواني. إذا كان هناك شيء لا يعجبني، كل ما علي فعله هو النقر عليه ويمكنني أن أطلب من خانميغو تغييره. - ميشيل، أنت تعلم أن الأمر\nالرائع في هذا الأمر هو أنني، كما تعلم، كوني مدرسًا في\nولاية كاليفورنيا، لدينا منهج دراسي معتمد من قبل الولاية، وهذا حقًا مكمل رائع لتكون قادرًا على إخراج الأشياء وإخراجها  قل، كما تعلم، درسي لهذا اليوم رائع، لكني بحاجة فقط إلى خطاف. أحتاج هذا جزء واحد. لذلك أحب أن أتمكن من العثور على أجزاء من هذا من شأنها أن تكمل ما أفعله بالفعل في الفصل الدراسي. أنا أتساءل، لدينا الكثير من الأسئلة حول كيف يبدو هذا من\nوجهة نظر الطالب. أتساءل عما إذا كان بإمكاننا الدخول وإلقاء نظرة على كيفية\nعمل خانميغو كمدرس في\nفصل واحد من الرياضيات المتكاملة. - قطعاً. لذا سأعود إلى\nفصل الرياضيات المتكامل وسأعود إلى نفس الوحدة بالضبط - الرسوم البيانية الخطية. وسأذهب إلى الفيديو لاختيار مقطع فيديو. وعندما أختار خانميغو، تمامًا كما يفعل المعلم، هنا في أعلى الشاشة، يتيح لي ذلك تغييره من وضع المعلم إلى وضع الطالب. والآن أصبح وضع الطالب قيد التشغيل. لاحظ أنه يعطيني\nمطالبات مختلفة هنا. سوف يسألني، هل أريد ملخصًا للفيديو؟ هل أريد أن يستجوبني على الفيديو؟ هل أريد أن أكتب قصيدة عن الفيديو؟ أو لماذا يجب أن أهتم بتعلم\nهذا الفيديو؟ هذا هو السؤال الذي يطرحه معظم الطلاب. لماذا يجب أن أهتم بهذا؟ لذا سأمضي قدمًا وأضغط على ذلك وسيسألني خانميغو، حسنًا، ما الذي يعجبني... هل تحب ألعاب الفيديو؟ شخصيات ألعاب الفيديو تتحرك في\nجميع أنواع الاتجاهات. ويربط المحتوى\nبالطالب. إذا كان الطالب يقوم بمهمة ما، لأنه قد يكون لدي طلاب\nأقل من مستوى الصف الدراسي، ولكن لا يزال يتعين علي إعطاء طلابي تعليمات على مستوى الصف الدراسي. وإذا قمت بتعيين طلابي\nعلى مستوى الصف الدراسي ولم أكن موجودًا لدعمهم، فلا داعي للقلق\nلأن خانميجو موجود. لذا، إذا كان الطلاب\nيعملون في مهمة أعطيتها لهم، فسينبثق خانميغو ويقول، هل تحتاج إلى مساعدة في حل المشكلة؟ هل تريد تجربة أمثلة مماثلة؟ أو مرة أخرى، لماذا يجب أن أهتم بهذا؟ شيء واحد أريد الإشارة إليه، أحب ما يقوله خانميغو، هل تريد تجربة مشكلة مماثلة؟ السبب وراء قول خانميغو ذلك هو أن خانميغو لن\nيعطي تلميذك الإجابة أبدًا. تمامًا كما أن المعلم الجيد لن يعطي تلميذك الإجابة أبدًا. سيساعدهم ذلك\nخلال عملية فهم المشكلة وتعلمها. إذن خانميغو حتى لو قال الطالب ما هو الجواب؟ سيخبرني خانميغو، أنا هنا لمساعدتك على التعلم، وليس فقط لإعطائك الإجابة. لنبدأ بالنقطة الأولى وسترشد الطلاب خلال عملية\nفهم المحتوى الموجود هنا. كنت سأقول، أظهر شيئًا آخر. إذا قمت بتعيين\nطلابك، على سبيل المثال، اختبار. إذا كنت تريد من طلابك\nإكمال اختبار على Khanmigo، فلن يتمكن طلابك من الوصول إلى الاختبار على Khanmigo. بسبب الاختبار، أريد أن أعرف المحتوى\nالذي يعرفه طلابي. لا أريد أن أعرف ما يعرفه خانميغو أو كيف يساعد خانميغو طلابي. لذا، إذا دخل طلابي\nوخصصت لهم اختبارًا، سيقول خانميجو، أنا آسف، لست متاحًا في هذه الصفحة. لذا، فأنت تعلم أنه إذا كنت تقوم باختبار\nالإتقان مع طلابك، فيمكنك معرفة\nأنهم يفهمون المحتوى. - ميشيل، أتساءل عما إذا كان بإمكاني تجربة بعض الأشياء معك. أتساءل عما إذا كان بإمكاني أن أكون تلميذك وتجربة بعض الأشياء في\nواحدة من (غير الواضحة) حتى نتمكن من رؤية خانميغو أثناء العمل. - قطعاً.  أنا أحب ذلك. تمام. وسنبدأ بهذا. - دعونا نفعل بعض الرياضيات. حسنا، دعونا نرى هنا. أين صديقنا خانميجو؟ لذلك نحن نقوم\nبمدخلات ومخرجات الوظيفة. أنا لا أعرف حتى كيف أبدأ.  هل يمكننا إخبار خانميغو أننا\nبحاجة إلى بعض المساعدة لحل هذه المشكلة؟ - قطعاً. ماهي الاجابة؟ أنا تائه.\n- تخيل أننا في فصل دراسي، لدي 35 طفلاً، أيديهم مرفوعة. كمعلم، لا يمكننا الوصول إلى\nكل منهم في نفس الوقت. الاطفال سوف ينتظرون. لذلك بينما ينتظرون المعلم، نعلم أن هذا هو أفضل مورد. يجب أن يكون المعلم دائمًا\nخط الدفاع الأول. يمكن أن يكون خانميغو موجودًا\nلمنع الإحباط ومنع الأطفال من التعثر، أو أنهم في المنزل، أليس كذلك؟ إنها في الوقت الحالي، دروس خصوصية فورية. لذلك أخبرنا خانميغو أننا\nلا نعرف كيف نبدأ، ولا نعرف ماذا نفعل. أعتقد أن ما لست متأكدًا منه هو، ما هو f ثم\nضع f بين قوسين؟ ماذا يعني ذالك؟ ولاحظ تلك الفقاعات. لذا تكمن المشكلة في كثير من الأحيان في أن الأطفال لا يعرفون ماذا يقولون لخانميغو. إنهم يعلمون أنهم عالقون، ويعلمون أنهم لا يعرفون ماذا يفعلون، لكنهم لا يعرفون كيفية التعبير عن ذلك لفظيًا. ولهذا السبب توجد تلك الفقاعات. نحن لا نقتصر على هؤلاء، أليس كذلك؟ لذلك دعونا في الواقع نجرب شيئًا آخر. يقوم خانميغو\nببعض التفكير هنا، ويقوم ببعض العمليات الحسابية.  لقد قمنا مؤخرًا ببعض الأعمال الرائعة لتحسين قدرة\nخانميجو على إجراء العمليات الحسابية. لهذا السبب يوجد\nالقليل من التأخير هناك. إذًا هنا يخبرني ما هو f x ويسألني ماذا يحدث\nإذا وضعنا -8 في الصندوق؟ لذلك سأفكر هنا، لقد حصلنا على -7. إذا كانت x هي -8، فأعتقد أن ذلك سيكون، لنفترض أنني ارتكبت خطأً وأرى أن هذا يساوي -56 ناقص 1. لنفترض أنه -57. ميشيل، دعونا نرى ما يقوله مع ذلك. - افحصها. - أعتقد أننا نحتاج فقط إلى كتابته في صندوق خانميغو الصغير الموجود هناك. - أُووبس.  -57. - دعنا نذهب مع أي شيء. دعونا نرى ما سيفعله خانميغو بذلك. لذا، فهي هنا لتقدم لي\nبعض الدعم في الوقت الحالي. سوف أفكر في\nما فعلته هناك. انها تفعل بعض الرياضيات. دعونا نرى كيف يستجيب. أُووبس.  همم. لذا فهو اعتراف\nبأنني ارتكبت خطأً، ولكن بطريقة داعمة حقًا، ودعنا نحاول مساعدتي في العثور على\nهذا الخطأ الصغير. إذًا f لـ x يعني أننا إذا\nوضعنا x في -7x، ثم ننظر إلى كيفية تقسيم ذلك. لذا، إذا عوضنا بـ -8، نحصل على -7 ضرب -8. لذلك حصلنا على 56 ناقص 1. لذا ألقِ نظرة على كيفية التحقق من صحتها وأعطاني خطوة صغيرة، لكنها لا تعطيني الإجابة. لذا ستلاحظون\nالنهج السقراطي للغاية. حسنًا، دعنا نجرب شيئًا آخر، ميشيل، الذي قد يقوله الطفل، دعنا نستخدم IDK القديم الجيد. مرة أخرى، تخيل أن لديك\nأطفالًا وأيديهم مرفوعة، وهم في انتظارك، أليس كذلك؟ ما هو هناك لدعمهم؟ خانميغو موجود في الوقت الحالي، بغض النظر عن مكان وجودهم، طالما لديهم أجهزتهم، لديهم هذا المعلم عند الطلب. لذلك نحن لا نحاول العثور على أشخاص ليكونوا في الفصل الدراسي لدعمهم. وهذا يتماشى مع تعليماتي التي يقدمها\nلي أستاذي في الفصل الدراسي. لذا فإن كل شيء معًا، وهو في مكانه الصحيح، ومعلمي موجود هناك ولديه حق\nالوصول الكامل إلى هذا ليعرف بالضبط أين أنا عالق وكيف أحتاج إلى الدعم. لذا بالنسبة لأولئك منكم الموجودين\nفي الدردشة الذين يسألون، كما تعلمون، ما هو هذا السلوك،\nوكيف يبدو؟ آمل أن يكون هذا قد أعطاك\nلمحة بسيطة عن كيفية تصرف خانميغو وكيف يمكنه دعم\nالطلاب في الوقت الحالي. - قطعاً. وأيضًا أثناء\nتواصلي مع خانميغو، يتمتع المعلمون بالقدرة على رؤية أي وكل شيء يتحدث عنه طلابك ويتحدثون معه مع خانميغو. أو إذا قال طلابك شيئًا\nغير مناسب لخانميغو، فسيقوم خانميغو بإيقاف\nتلك المحادثة على الفور. ويحصل المعلم على تنبيه، ليعلم المعلم\nبما قاله الطالب. الكثير من الأشياء العظيمة هناك. - أنا أتساءل عن\nبعض العلوم المتوافقة مع NGSS.  هل يمكننا الانتقال إلى\nأحد دروس العلوم لدينا وإلقاء نظرة على كيفية\nدعم خانميغو هناك؟ - بالتأكيد. ماذا عن علم الأحياء في المدرسة المتوسطة؟ انها تبدو مضحكه؟\n- المفضل لدي، المفضل لدي. - نعم.  حسنًا. هل هناك وحدة معينة\nتود الاطلاع عليها؟ - قطعاً.  لنتحدث عن\nالنظم البيئية، والتنوع البيولوجي. الكثير من المرح هناك. - هذه الأوقات الجيدة.  اوقات سعيدة. هل ترغب في مشاهدة فيديو أو مقال أو تمرين؟ - أعتقد أنني أرغب في الذهاب إلى أحد التمارين وأعتقد أنني أريد الدخول\nفي وضع الطالب وطرح السؤال القديم الذي يطرحه علي طلابي طوال الوقت. لماذا بحق الجحيم أحتاج\nإلى الاهتمام بتعلم هذا؟  هل يمكننا أن نرى ما يقوله خانميغو عن ذلك؟ - لماذا يجب أن أهتم بهذا؟ ما هي بعض الأشياء التي تهتم بها؟ أنا أحب أن أرقص. - أوه، انظر إلى ذلك. ربما أجمع\nالقليل من الملاءمة، وربطها بالأشياء التي\nأهتم بها كمتعلم. تمام. - أحبها. - أوه، مثلًا إذا غادرت راقصة، تصبح المجموعة أصغر. لذا، يا لها من طريقة مثيرة للاهتمام لربط ما يهتم به الطالب بالمحتوى الموجود على الشاشة. حسنا، هل تعرف ماذا؟ هذا لا يبدو كافيا بالرغم من ذلك.  هل يمكنني الحصول على مثال آخر ربما؟ - نعم انا احب ذلك.  هل يمكن أن تعطيني مثالا آخر؟ كما أنني أحب تايلور سويفت حقًا. فكر في\nقاعدة المعجبين بتايلور سويفت كنظام بيئي. إذا توقفت عن صنع الموسيقى، فقد يغادر بعض المعجبين. وهذا يشبه التغيرات في النظام البيئي مما يؤدي إلى انخفاض عدد السكان.  هل هذا منطقي؟ أُووبس.  نعم هو كذلك.  إنه كذلك بالتأكيد. شكرًا جزيلاً لك يا خانميغو. الآن أود... عفوًا، دعني أطفئ ذلك.  هل يمكنك شرح المزيد عن\nكيفية عمل النظام البيئي؟ لأنني الآن أشعر بالفضول، وأنا مستثمر. أنا خياط، أنا سويفتي، والآن أعرف لماذا\nأحتاج إلى معرفة المزيد عن هذا. لذا سأطرح الكثير من\nالأسئلة على خانميجو. الآن أنا مدمن مخدرات وأريد معرفة المزيد. ودعنا ننتقل إلى سؤال. دعنا نذهب. أنا هنا. هناك أيضًا مقاطع فيديو متاحة\nللطلاب لمشاهدتها أيضًا. لذلك يمكنني أن أطرح السؤال. افحصها. أوه ، لقد فهمت السؤال بشكل صحيح. ممتاز، ممتاز. حسنًا.  تفضل واحد اخر. أريد تجربة مثال مماثل. تذكر أن خانميغو\nلن يقدم لنا الإجابة، لكن يمكنني تجربة مشكلة مماثلة\nلمساعدتي في حل ذلك. لا أريد\nأن يعطيني خانميغو الإجابة. يمكنني الحصول على واحدة مماثلة. - أتعلم، كل\nهذا جعلني أفكر أن ميشيل بهذا الشكل جذابة. كما لو كان لدي هذا في الفصل الدراسي، لم أكن لأضطر إلى الأداء بنفس القدر من الجهد لجذب\nاهتمام طلابي ودعمهم في الوقت الحالي. لكنني أتساءل كيف\nيستجيب المعلمون ويحصلون على البيانات بعد ذلك.  هل يمكنك إطلاعنا على\nالبيانات التي يستطيع المعلمون الحصول عليها وكيف يمكن لـ Khanmigo\nالمساعدة في تلخيص تلك البيانات وربما تقديم بعض التوصيات؟ - قطعاً. لذا، إذا قمت بتعيين محتوى لطلابي أو إذا كان طلابي يعملون\nعلى مسار التعلم الخاص بهم ويكملون الأنشطة في أكاديمية خان، فسيعملون على المهارات وسيحصلون على البيانات من ذلك. كمعلم، كل ما علي فعله هو أن آتي إلى هنا وأختار\nزر لقطة الفصل هذا وسيعطيني\nنظرة عامة عالية المستوى. سيسمح لي باختيار الفصل الذي أريد أن أشاهده أولاً. أريد أن ألقي نظرة على هذا الفصل، فصل الجبر الأول، \nوسيعطيني نظرة عامة عالية المستوى عن التقدم الذي\nأحرزه طلابي في الدورة، في الدورة التدريبية الخاصة بي خلال الأيام السبعة الماضية. سيخبرني متوسط ​​الفصل. فهو يسمح لي بمعرفة \nأداء طلابي في المهام التي يقومون بإكمالها. لاحظ أيضًا أنه يحتوي على هذه\nالتقارير الضوئية باللون الأزرق، وهو رابط مباشر\nلهذا التقرير الفعلي. لذا، إذا كنت أنظر إلى المهارات التي يعمل عليها طلابي، ولكنني أريد المزيد من التفاصيل، فكل ما علي فعله هو النقر عليها وينقلني إلى تقرير المهارات هذا حتى أتمكن من رؤية ما\nيعمل عليه طلابي بالضبط  . يقدم لي خانميغو أيضًا\nمطالبات إضافية هنا ربما لم أفكر فيها. على سبيل المثال، ما هو الطالب الذي\nيجب أن أحتفل به في صفي؟ أحب تقديم صيحات الفصل حتى أتمكن من معرفة ما\nيحتاجه الطلاب من تلك المكافآت أو من حصل على تلك المكافآت. ما الطلاب الذين يعانون؟ من الذي يجب أن أتحقق منه للتأكد من أنهم يفعلون ما\nيفترض بهم القيام به؟ واحد آخر، وهذا هو المفضل لدي. قم بتجميع صفي حسب توصياتهم. هذا واحد، توفير كبير للوقت. لأنه مرة أخرى، كما كانت ستيسي تقول، لن يكون جميع طلابي\nعلى نفس المستوى وأحتاج إلى أن أكون قادرًا على التمييز ومنح طلابي ما يحتاجون إليه. هذا هو أفضل صديق لي الجديد. سيقوم بتفصيل\nما يحتاجه طلابي ويخبرني بما يحتاجه الطلاب حتى أتمكن من تكليفهم بالمهام. ولكن هل تعلم؟ هناك شيء أفضل. سأعود إلى لوحة القيادة وهذا هو صديقي المفضل الجديد. هذا، لقد شاركت هذا مع إحدى المعلمات\nبالأمس وقالت: \"الشيء الوحيد الذي\nلا يفعله هذا هو إعداد القهوة لي.\" إنها مجرد لعبة تغيير مطلقة. هذا هو \"المهام الموصى بها\". هذا هو المكان الذي\nينظر فيه Khanmigo إلى جميع البيانات الموجودة في كل المحتوى الذي كان\nطلابك يقومون به، ويوصي\nبمهام محددة لمجموعات معينة لأنه تذكر، أنهم\nليسوا جميعًا في نفس المكان. ولكن هذا واحد يذهب أبعد من ذلك. وسوف يعينهم مباشرة بالنسبة لي. لذا، إذا أردت تعيين هذه\nالمهام لتلك المجموعة، كل ما علي فعله هو تحديد هذا الزر. أصعب شيء\nيجب أن أفعله في هذا الأمر، أصعب قرار\nيجب أن أتخذه هو، هل أريد أن يكون لكل طالب\nمجموعة أسئلة مختلفة أم أريد أن يكون لدى جميع طلابي نفس مجموعة الأسئلة؟ وبصراحة، ليس هناك\nإجابة صحيحة أو خاطئة. يعتمد الأمر حقًا على\nالغرض الذي تستخدمه من أجله. إذا قمت بتعيين هذا\nلطلابي كواجب منزلي، نعم، أريد التأكد من أن كل شخص\nلديه أسئلة مختلفة. لكن إذا أردت من طلابي أن\nيعملوا معًا ويتعاونوا ويبنوا هذا الخطاب الرياضي، فسوف أخصص لهم\nنفس مجموعة الأسئلة وأدعهم يعملون معًا أثناء عرضي على الشاشة. ويمكننا أن نفعل ذلك معًا. لذلك هذا هو توفير كبير للوقت. أنا أحب هذه الميزة الجديدة.  ميزة أخرى رائعة حقًا\nمتاحة هي Real World context Generator. هذا، ضخم، تمامًا مثل خانميجو يعرف أن\nالطلاب يطرحون السؤال \"لماذا يجب أن أهتم بهذا؟\"، وهذا يجعله حقيقيًا للطلاب.  كل ما عليك فعله هو إخبار خانميغو\nبمستوى صفك الدراسي وما نحن على وشك تدريسه. ستيسي، ماذا نحن على وشك أن نعلم؟ - أنظمة المعادلات. هذا هو الشيء المفضل لدي للتدريس. - أنظمة المعادلات. حسنًا، ومرة ​​أخرى،\nفي غضون ثوانٍ، ابتكر خانميجو ثلاث أفكار مختلفة يمكنني استخدامها مع طلابي. كيف يمكن أن ترتبط؟ لذلك لا يقتصر الأمر على أنهم لا يقومون فقط\nبالرياضيات من كتاب الرياضيات الخاص بي، بل إنني أجعل هذا الأمر حقيقيًا ويجعله أكثر\nجاذبية لطلابي. - وبالحديث عن كتب الرياضيات، لدينا سؤال في الدردشة، أريد التأكد من أن الجميع\nيسمع الإجابة أيضًا. لا تتماشى هذه المعايير فقط مع معايير الدولة الأساسية المشتركة\nفي الرياضيات وNGSS في العلوم، ولكن لدينا خيارات الدورة التدريبية لـ Eureka Math أو Engage\nNew York في الصف الثالث وصولاً إلى الجبر الثاني والرياضيات التوضيحية، بدءًا من  الصف السابع\nمن خلال الجبر واحد. لذا، في قائمة الدورة التدريبية تلك، ستنقر ميشيل\nهناك مباشرةً على \"رؤية كل الرياضيات\"، حيث يوجد الكثير من الأشياء هنا. لذلك يمكننا التمرير لمدة خمس دقائق تقريبًا لرؤية كل هذه الفئات المختلفة. ولكن عندما نصل إلى\nمنتصف الصفحة تقريبًا، يمكننا النقر عليها وإظهارها لك. يمكنك هنا رؤية لقطة شاشة سريعة لجميع الدورات التدريبية المختلفة المتوفرة في حساب التفاضل والتكامل، كما توجد دروس الرياضيات التوضيحية لدينا\n هناك. لذا، إذا كنت تستخدم هذا\nالمنهج للصف الثامن، للجبر الأول، وإذا كنت تستخدم Eureka Math، فهذه موجودة هناك. ومرة أخرى، لم تتم مواءمة المعايير فحسب، بل كان لديك أيضًا مواءمة المناهج الدراسية، والتي تعد موردًا عظيمًا وعظيمًا. - هل تريد مني أن أشارك في أحد دروس Eureka Math؟ - دعونا نلقي نظرة على\nالرياضيات التوضيحية للصف الثامن. - حسنًا. تمام. أي موضوع معين؟ - لا، دعونا نلقي نظرة\nعلى كيفية محاذاة الدورة. وإذا كنت معتادًا على\nاستخدام هذه المناهج الدراسية، فأنا أعلم أنها\nمنتشرة جدًا في جميع أنحاء الولاية، ألقِ نظرة على كيفية تطابق ذلك مع محاذاة الكتاب المدرسي. إذن، كما تعلم، ما هو رائع\nفي أي من الدورات التدريبية، لا يهم ما إذا كنت تستخدم الدورة التدريبية التقليدية للصف الثامن أو كنت تستخدم هذه الدورة، يمكن تعيين الوحدات بأي ترتيب.  ومن ثم، يمكنك، كمعلم، اتخاذ تلك القرارات بشأن الترتيب الذي يحتاج الطلاب إلى تلقي المحتوى به. وKhanmigo\nسيكون هناك مهما حدث. إذا أردت أن أبدأ بالوحدة\nالثالثة، على سبيل المثال، أريد أن أبدأ بالعلاقات الخطية قبل أن أقوم بأي شكل من أشكال التحويل، يمكنني أن أفعل ذلك وسيكون خانميغو\nهناك طوال الطريق. لذلك يتمتع المعلمون بالاستقلالية في اتخاذ تلك القرارات\nالمتعلقة بالترتيب التعليمي وكيفية تقديم الأشياء للأطفال بطريقة أفضل لطلابهم. - [ميشيل] ممتاز.\n- حسنًا، حسنًا، سنعود\nإلى بعض الأشياء الأخرى. إبقاء الأسئلة القادمة. سأطلعك على بعض مزايا الشراكة. لذا، إذا اخترت أن تكون\nمدرستك أو تجعل منطقتك تسعى إلى إقامة شراكة معنا، فهناك العديد من الأشياء\nالتي تأتي مع ذلك كشريك للمنطقة، أليس كذلك؟ نحن نعلم أنه يمكننا الذهاب إلى موقع khanacademy.org، ويمكننا استخدام المحتوى مجانًا. ماذا لو كنا شركاء المنطقة؟ ما هو المختلف؟  لقد رأينا قائمة الدورة التدريبية بالفعل، وقد تفكر في أكاديمية خان، وسنعود إلى شريحة واحدة، لذا آسف، قد تفكر في\nأكاديمية خان كبرنامج للرياضيات، ولكن ما رأيته بالفعل\nاليوم على  الشاشة هي أن هناك الكثير هناك. لدينا دورات في مختلف التخصصات، ليس فقط الرياضيات والعلوم، ولكن أيضًا العلوم الإنسانية والمهارات الحياتية وبرمجة الكمبيوتر، ولكن القيمة الحقيقية\nلكونك شريكًا في المنطقة تتوسع إلى ما هو أبعد من المحتوى وتأتي مع\nالدعم الذي تتلقاه. الشريحة التالية. حسنًا، في هذه الشريحة، نعرض لكم هنا أنه\nعندما يتعلق الأمر بالذكاء الاصطناعي، فإن النهج الذي نتبعه\nفي التنفيذ مهم.  لقد عملنا على هذا الأمر لمدة 18 شهرًا وسنتين تقريبًا. نحن هنا لدعمك بالأدوات والتدريب والبيانات والخبرة لإرشادك طوال الطريق. لذلك نحن لسنا هناك فقط في البداية لنساعدك على النهوض والانطلاق. سنكون هناك للإجابة على\nالأسئلة، الكبيرة والصغيرة، طوال مدة\nالشراكة. بالإضافة إلى ذلك، لدينا أيضًا تعليم احترافي لكل من المعلمين والإداريين. وهذا أمر بالغ الأهمية\nلنجاح أي تنفيذ. لكن إذا كنت تطبق الذكاء الاصطناعي، فهذا ليس مجرد أداة جديدة، وهذا ليس تطبيقًا قديمًا. يعد هذا تحولًا في طرق التدريس وكيفية تعاملنا مع التدريس والتعليم في فصولنا الدراسية. نحن نؤمن بأن المعلمين\nيستحقون تدريبًا شاملاً حول كيفية البدء، وكيفية الوصول إلى البيانات، وكيفية تحليل البيانات، وكيفية استخدامها حقًا\nلدفع عملية التدريس. لذا، نحن ملتزمون بدعم المعلمين، ليس فقط من خلال التطوير المهني الفردي، ولا حتى من خلال التطوير المهني الفردي أو الثلاثي، ولكن على مدار العام، وأيضًا أن نكون\nحاضرين للإجابة على الأسئلة.  في بعض الأحيان عندما نقوم\nبتنفيذ شيء بهذه الأهمية، نحتاج فقط إلى شخص ما للتحدث معه، إلى شريك فكري لتبادل الأفكار. وتعلمنا المهني\nيشمل كل ذلك. لذلك يتمتع المعلمون بهذا\nالدعم الشامل طوال الوقت. دعونا نفكر أيضًا في MTSS كأنظمة دعم متعددة المستويات\nللطلاب.  لقد تحدثنا بالفعل\nعن مجموعة الدورات التدريبية المتاحة لك، ولكن ما نعرضه\nلك هنا على الشاشة هو أنه إذا كنت تستخدم نموذج MTSS للتمييز وتلبية\nاحتياجات طلابك، فلدينا دورة تدريبية  المحتوى لدعم ذلك. لذلك، عبر هذه المستويات، سواء كنا نستخدم الدورة التدريبية على مستوى الصف الدراسي لتعليم المستوى الأول، أو كنا نستخدم دورة تدريبية\nتسمى \"استعد لـ\" حيث نقوم ببناء الأسس والاستعداد لتعليمات\nمستوى الصف الدراسي، خانميجو  وهذا الدعم\nالذي شاهدته وهو يستخدم ميشيل متاح في كل هذه الأشياء. لذا فإن النقطة المهمة، والشيء المهم في نظام MTSS هو أن لدينا متعلمين\nيعانون منذ فترة من الوقت ونريد تجنب الإحباط المتزايد. لا نريدهم أن يعلقوا. لذا فإن Khanmigo متاح، عندما يحتاجون إليه،\nوفي متناول أيديهم مباشرةً حتى يحصلوا على هذا الدعم. - قطعاً. والشيء الوحيد الذي أريد\nمشاركته بسرعة، ستيسي، موجود في خانميغو، من لوحة تحكم خانميغو، إذا كنت تحاول ذلك، إذا كنت مدرس علوم للصف الثامن، لكن طالبي يقرأ مادة\nالعلوم للصف السادس  المستوى، هناك مستوي هنا حيث يمكنك إدخال النص ويمكنك تغيير\nمستوى القراءة إليه. لأنه إذا\nلم يكن الفهم هو محور التركيز الرئيسي وفهم محتوى العلوم، فأنا أريد التأكد من أن\nطلابي قادرون على القيام بذلك ويمكنهم\nفعل ذلك تمامًا باستخدام هذه الميزة. - نعم.  أعتقد أنه من\nالمهم أيضًا أن نقول هنا، كما تعلمون، نظرًا لأننا\nندعم جميع المتعلمين، فإن Khan Academy متاح أيضًا، وهو برنامج الدردشة الآلي، مدعوم بالكامل باللغة\nالإنجليزية والإسبانية والبرتغالية. لذا، يمكنك أيضًا مقابلة هؤلاء المتعلمين متعددي اللغات\nأينما كانوا والتأكد من أنه في حين أن\nالمتعلم متعدد اللغات قد يحتاج إلى إتقان\nأو راحة في اللغة الإنجليزية، إلا أنه لا يتخلف\nعن المحتوى الخاص به، أليس كذلك؟ إنهم قادرون على الوصول إلى\nKhanmigo باللغة الإسبانية والبرتغالية بلغتهم الأم حتى يتمكنوا من الاستمرار في البقاء على قدم المساواة مع المكان الذي\nينبغي أن يكونوا فيه في الأكاديميين. - بالتأكيد، ولمجرد\nالاستفادة من ذلك، تمامًا كما نريد من\nالمتعلمين متعددي اللغات أن يفعلوا ذلك، نريد أن\nيشارك آباؤهم أيضًا. لذا، إذا كنت بحاجة إلى أن يقوم خانميغو بإنشاء رسالة إلى أحد طلابي وكان ولي الأمر يتحدث الإسبانية بشكل أساسي، فسيقوم خانميغو بترجمة هذه الرسالة لي حتى أتمكن من إرسالها إلى\nأولياء أمور الطلاب لإبقائهم على اطلاع على\nتعليم طلابهم  . - مساعدة ضخمة، توفير كبير للوقت. لذلك دعونا نفكر في البيانات.  لقد ألقينا نظرة سريعة جدًا على البيانات المتاحة للمعلمين اليوم، ولكننا نعلم أن المسؤولين\nهم قادة التعليم. ومن أجل\nقيادة عملية التدريس بفعالية، نحتاج كمسؤولين إلى البيانات. لذا، إذا كنت\nمسؤولاً في هذه المكالمة، أريد التأكد من حصولك على\nلمحة واحدة هنا عن البيانات المتاحة على مستوى مدير المنطقة أو المدرسة، وسيكون بمقدورك رؤية هذه البيانات. إذا نظرت إلى\nالجانب الأيسر من لقطة الشاشة التي تظهرها ميشيل على الشاشة، فإننا قادرون على رؤية البيانات\nهنا على مستوى الدورة التدريبية، على مستوى المدرسة، وصولاً إلى\nمستوى الطالب الدقيق جدًا حتى نتمكن من  نحن قادرون على تحديد النجاحات، والاحتفال بالطلاب وهم\nيتخذون تلك الخطوات الصغيرة للأمام، بينما يكتسبون الكفاءة\nوالراحة، أليس كذلك؟ حقا مجرد الشعور بالفخر بأنفسهم. نريد أن نحتفل بذلك. ولكننا أيضًا قادرون على\nتحديد الفرص التي قد نحتاج فيها إلى توفير المزيد من\nالموارد أو دعم المعلم مع\nالطلاب الذين يعانون. لذا، كمسؤول، فإن التحسينات التي تم\nإدخالها على لوحة التحكم هذه بالنسبة لي تغير قواعد اللعبة لأنني أستطيع رؤية\nعرض البيانات على نطاق واسع، واسع جدًا، وصولاً إلى عرض ضيق جدًا.  ومن الممتع حقًا\nأن تكون قادرًا على قيادة وتوجيه التعليمات من\nمنظور قاعدة البيانات. لذلك، مع وضع كل هذه الأشياء الرائعة في الاعتبار، أريد أن أقضي ثانية واحدة فقط في\nالحديث عن السلامة. لأنه بينما نقوم بإدخال الذكاء الاصطناعي إلى الفصول الدراسية، هناك الكثير من الأشخاص\nالذين يشعرون بالتوتر بشأن هذا الأمر، وهم محقون في ذلك. هذه هي التكنولوجيا الجديدة. يجب أن نكون حذرين، وعلينا أن نكون مدروسين بشأن كيفية إدخال هذا الأمر\nإلى فصولنا الدراسية وأمام طلابنا.  لقد عملنا\nعلى مدار الثمانية عشر شهرًا الماضية مع المقاطعات في جميع أنحاء البلاد وتعلمنا الكثير. هذه التكنولوجيا جديدة جدًا وما زلنا جميعًا نتعلم. لا أحد خبير هناك، أليس كذلك؟ هذه هي التكنولوجيا الجديدة. نحن جميعا في مكان للتعلم. لذلك هناك الكثير لمعرفة ذلك. ونحن نبحث عن شركاء. نأمل أن ترغبوا\nجميعًا في الشراكة معنا للتعلم والنمو في هذه المهمة، لتمكين المعلمين\nوالمتعلمين من التعلم معًا. هناك الكثير من\nالأشياء الرائعة التي تحدث الآن. ترى بعض القصاصات على الشاشة مثل القصص الإخبارية الرائعة والأشياء العظيمة التي تحدث. ونحن متحمسون للعمل\nمعكم من خلال هذا، والابتكار معكم لأن هناك الكثير لنتعلمه ونحن نشكل التعليم بشكل\nمختلف قليلاً في عصر الذكاء الاصطناعي هذا. وإذا كنت تتبع السلامة، وإذا كنت تفكر في سلامة الطلاب، فأنا متأكد من أنك سمعت عن\nتقييمات الوسائط المنطقية. وهنا على الشاشة، نريد أن نترككم مع\nهذه الفكرة الختامية. مع دخولنا هذا العصر حيث الذكاء الاصطناعي جزء من\nكل شيء في حياتنا، يبدو أنه منتشر بشكل متزايد، والسلامة والخصوصية لهما أهمية قصوى، خاصة عندما\nيتعلق الأمر بطلابنا. في أكاديمية خان، يلتزم فريقنا من المعلمين المخضرمين\nبضمان سلامة الطلاب وخصوصية\nمعلوماتهم. لقد تحدثت ميشيل بالفعل عن الشراكة\nوالمعلمين والإداريين، ويمكنك رؤية ما\nيتحدث عنه الطلاب، ويمكنك الحصول على سجل. هناك حواجز حماية هناك.  تم تصميم هذا خصيصًا\nللأطفال في الفصل الدراسي مع وضع السلامة في الاعتبار أولاً. لذلك هناك حواجز حماية، وهناك شفافية كاملة\nللمعلمين لرؤية كل شيء. وهذا مجرد جزء من سبب ظهور هذا التصنيف\nهنا على الشاشة.  تم تصميم خانميغو للأطفال وتم تصميمه للتعليم. لذا، استمر في\nطرح الأسئلة في الدردشة. وهذا ما يجب أن\nنشارككم إياه اليوم. إذا كنت تريد معرفة المزيد، زميلنا تشيلسي موجود معنا هنا.  وها هي صورتها الرائعة\nعلى الشاشة. يمكنك مراسلتها عبر البريد الإلكتروني مباشرةً، ويمكنك التقاط رمز الاستجابة السريعة\nوالتواصل مع تشيلسي. لكنها حريصة على التحدث معك حول ما تستلزمه شراكة المنطقة وكيفية الدخول فيها معنا لأننا متحمسون حقًا\nللعمل معكم طوال العام المقبل ومواصلة الوصول إلى الطلاب في ولاية كاليفورنيا الرائعة. - [الراوي] شكرًا لك\nعلى مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التدريس والتعلم لدينا. لمعرفة المزيد حول كيف\nيمكن لـ Khanmigo دعمك أنت وطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك ولا تفوت أبدًا الإعلانات المثيرة حول مواد الدورة التدريبية المجانية الجديدة\nفي Khan Academy. تأكد من الاشتراك. شكرا لك وتدريس سعيد.",
    "t_italian": "- Mi chiamo Michele Marbra e sono uno\nspecialista dell'apprendimento professionale presso Khan Academy. Sono davvero entusiasta di\navervi tutti con noi oggi mentre condividiamo tutte le nuove fantastiche risorse che vi stanno arrivando. Quindi grazie mille a tutti per esservi\nuniti a noi oggi, e io... Oh, e vivo in Florida.  Lo passerò a Stacy. - Ciao a tutti.  Il mio nome è Stacie Johnson. Conduco l'\napprendimento professionale per Khan Academy. Sono un insegnante veterano della California, insegno nella Central Valley della California da oltre 10 anni, sono stato molto coinvolto nelle\nstrutture di matematica e scienze nello stato della California e sono davvero entusiasta di essere\nqui oggi per parlare dello stato del tutoraggio in California e come possiamo continuare a fare meglio ed evolvere in ciò che stiamo facendo per supportare meglio i nostri studenti della California. Detto questo,\nandiamo avanti e entriamo. Ci sono le nostre favolose\nfoto sullo schermo, ma potete già vederci qui. Detto questo, andremo avanti e inizieremo a parlare dello stato attuale del\ntutoraggio in California. E ci sono alcune grandi cose\nche stanno già accadendo. Quindi il primo è se non hai sentito parlare del\nprogramma HelpNow della Biblioteca dello Stato della California, è un ottimo programma gestito dal\nsistema bibliotecario dello stato della California. Include tutor dal vivo\ndisponibili sullo schermo. Dispone di un laboratorio di abilità per surfisti in cui gli studenti possono selezionare\nle diverse competenze su cui hanno bisogno di lavorare e molte ottime risorse, incluso anche un laboratorio linguistico per i nostri\nstudenti multilingue che necessitano di supporto. Quindi è un ottimo programma,\nabbraccia lo stato della California. Abbiamo anche un paio\ndi ottimi programmi di sovvenzioni nello stato della California. Quindi esiste un\nprogramma di istruzione doposcuola finanziato da sovvenzioni, e questo assume aspetti molto diversi. Per molte scuole o distretti, questo potrebbe essere un\nprogramma di doposcuola nel campus scolastico dove ci sono adulti premurosi che sono lì per prolungare la giornata scolastica per\naiutare gli studenti con i compiti e tutte le cose per cui\npotrebbero aver bisogno di supporto. E poi c'è il programma ELO-P. Probabilmente abbiamo tutti sentito parlare di ELO-P. È in circolazione solo da pochi anni e si concentra davvero\nsull'estensione dei programmi di apprendimento. Quindi, ancora una volta, ci vogliono\nmolti aspetti diversi. Potrebbe essere un programma estivo, potrebbe essere un programma scolastico del sabato. Ma in realtà, ancora una volta, il\nfocus di questi programmi di sovvenzione è come far durare il\nvalore della giornata scolastica un po' più a lungo, raggiungere più bambini in un periodo\ndi tempo maggiore. Ma con tutti questi programmi, ci sono sfide e discrepanze tra l'ottimo lavoro che si sta svolgendo nelle nostre\nclassi della California e il tutoraggio. Quindi la prima di queste disconnessioni\nè l’allineamento del curriculum. Sappiamo che il tutoraggio è più potente quando gli studenti possono collegare ciò che stanno facendo in classe a ciò che stanno imparando con il loro tutor, quando sono in grado di stabilire quella connessione e vedere che l'apprendimento\nverrà attivato per loro e loro  vedere come tutto combacia. Ed è un pacchetto davvero potente. Spesso, quando i tutor provengono dall'esterno del programma scolastico, potrebbero non sapere cosa sta\nsuccedendo in classe. Non sono in grado di\nstabilire quella connessione e tracciare davvero quei limiti per i bambini. La prossima sfida che abbiamo e che tutti conosciamo è il personale e le risorse. Una cosa è trovare le risorse da inserire in un programma come, sai, quale curriculum stiamo usando? Quali strumenti? Quali sono le attività fantastiche e coinvolgenti che\nfaremo? Questa è una sfida. Ma trovare personale qualificato\nper gestire questi programmi dal vivo può essere particolarmente impegnativo.  Stiamo lottando per fornire personale alle\nnostre aule quotidiane, per non parlare dei\nprogrammi didattici supplementari. E poi l'ultima disconnessione\nche abbiamo veramente è sfruttare l'insegnante. L’insegnante è la persona più potente nel sistema scolastico per uno studente. Sono loro che\ncostruiscono la connessione che favorisce davvero l’\nentusiasmo per l’apprendimento, la passione per l’apprendimento nei nostri studenti. Quindi, quando il tutoraggio avviene\nsenza l'intervento dell'insegnante, quando l'insegnante non sa veramente cosa sta succedendo nel tutoraggio, non è in grado di sfruttarlo. Ancora una volta, abbiamo solo questo\nabisso o questa disconnessione. Quindi non stiamo davvero massimizzando l'apprendimento e l'efficienza per gli studenti.  La prossima cosa che può succedere è, sai, siamo stati insegnanti in California, ci sono classi di grandi dimensioni là fuori. Forse hai una classe indipendente con 30-40 studenti, o forse hai cinque,\nsei, sette, otto classi con 30 o più studenti, indipendentemente da quanti studenti\nhai di fronte, siamo molto entusiasti di\nti presento oggi Khanmigo. Questo è il nostro chatbot AI di Khan Academy. Vedete che c'è una piccola\nimmagine qui sullo schermo. Khanmigo può aiutarti in questo. Che tu abbia 35 studenti o più di 100 nel tuo elenco, Khanmigo ha alcuni strumenti. E tra un secondo entreremo e vi mostreremo quelli dal vivo in azione, così potrete vedere esattamente\ncome Khanmigo può aiutarvi. Prima di farlo, vogliamo sottolineare solo alcune cose che dovresti tenere d'occhio mentre guardi Michele che ti guida attraverso le grandi cose che\naccadranno sullo schermo. Il primo è che Khan\nAcademy e Khanmigo sono incentrati sull’apprendimento personalizzato. Nessuno di noi impara alla stessa\nvelocità, allo stesso ritmo. Non abbiamo le stesse\nesigenze per quanto riguarda il tutoraggio. Quindi l'insegnante ha il potere\ne la capacità di determinare su cosa gli studenti devono lavorare e quindi di metterli su un percorso in cui possono crescere e progredire al proprio ritmo, al proprio ritmo. Il prossimo è il contenuto attendibile. Abbiamo tutti sentito parlare della Khan Academy. Questa è una piattaforma controllata e affidabile. Questo contenuto è solido. Quindi sai che ciò su cui\nstanno lavorando gli studenti sono gli standard allineati, gli standard fondamentali comuni\nallineati in matematica, l' NGSS allineato nelle scienze. Quindi sai che questa è una\nrisorsa di qualità da cui attingere. E l'ultimo è che ci\nsarà una serie completa di strumenti che Michele\nvi mostrerà per dare potere agli insegnanti. Ancora una volta, la cosa più importante che possiamo fare è concedere agli insegnanti più tempo con i bambini. E così, quando potremo liberare\nalcuni di quei compiti d'ufficio, alcuni di quei\ncompiti amministrativi che dobbiamo svolgere che ci tengono a scuola fino alle cinque o a partire dalle 5 del mattino, se\nsei mattiniero come me, sarà semplicemente  liberarti per trascorrere più tempo con i bambini. Ed è proprio questo il nostro focus oggi. Quindi con questo basta parlare. Vediamolo in azione, Michele. - Va bene, grazie mille, Stacie. Questa è assolutamente una delle\ncose che preferisco fare, restituire più tempo agli insegnanti. Quindi sono semplicemente onorato di\nessere qui con tutti voi oggi. Quindi inizieremo con il nuovissimo dashboard di Khanmigo e permetterò di rimpicciolirlo un po' in modo da poter vedere tutto in una volta. Va bene, quindi questo è il\nnuovissimo dashboard di Khanmigo. Puoi visualizzare tutti\ni diversi strumenti che Khanmigo ha a disposizione e andremo, non\nsaremo in grado di colpirli tutti, ma ne esamineremo molti. Puoi anche separarlo pianificando. Puoi separarlo creando, differenziando e supportando i tuoi studenti. Tante caratteristiche diverse. E ancora una volta, li\nesamineremo tutti.  Tuttavia, una delle prime cose\nche voglio mostrarti, solo per parlare un po'\ndi quello che ha detto Stacie, prendendo spunto da ciò, sono tutti i nostri corsi, per poter accedere a tutti i nostri corsi, puoi visualizzarli in qualsiasi momento nella sezione  nell'angolo in alto a sinistra\ndella schermata Khan Academy. Seleziona semplicemente Corsi e potrai visualizzare tutti\ni corsi che abbiamo, inclusi i\ncorsi di matematica integrata che offriamo, nonché i nostri corsi di scienze. E ancora, tutti questi sono allineati con NGSS. Quindi abbiamo corsi per\nchiunque e per tutto, anche per gli adulti, i corsi sono disponibili.  L' alfabetizzazione finanziaria,\npenso che sia fantastica e voglio che mio marito\nla prenda sul personale. Ma così tante classi diverse. Va bene, quindi voglio passare a, lasciami solo, che ne dici della matematica integrata? Entreremo in quel corso. Quando seleziono il corso, ci vengono mostrate tutte le diverse unità disponibili per il corso e le nostre unità sono\nsuddivise in lezioni. Quindi mi limiterò a parlare di, che ne dici delle equazioni lineari?  E' sempre divertente. E quando lo apro, puoi vedere tutti i contenuti offerti dai corsi. Nota le piccole icone proprio qui. Ti consente di sapere se si tratta di un video o di un articolo o di un quiz o di un esercizio che vogliamo che i nostri studenti completino. Quindi diciamo che sono un insegnante di matematica e voglio assegnare questo\nvideo affinché i miei studenti lo guardino. Quando faccio clic su di esso, posso visualizzare il video, posso vedere la\ntrascrizione del video, ma voglio creare una lezione\nsull'intero video. Come lo faccio? Khanmigo. Tutto quello che devo fare è che Khanmigo vive proprio qui, e mi piace... Siamo nel corso adesso e Khanmigo vive nel corso. Seleziono semplicemente Khanmigo e vengono visualizzati diversi messaggi. Mi chiederà, voglio aiuto per scrivere un programma di lezione? Voglio aiuto per spiegare\nil video ai miei studenti? Voglio aiutare a realizzare\nalcune attività di riscaldamento? Khanmigo farà tutto questo per me. Oppure posso chiedere a Khanmigo qualcosa di diverso. Posso chiedere a Khanmigo, puoi aiutarmi a creare\ndomande sui ticket di uscita per questo? Vorrei cinque\ndomande a scelta multipla. E poi do a Khanmigo un secondo e Khanmigo sarà entusiasta di aiutarmi a scrivere quel piccolo quiz per me e lo creerà\nimmediatamente per te. E ricorda, Khanmigo non è come un\nmotore di ricerca Google o qualcosa del genere. Se Khanmigo non\nti dà quello che vuoi, vuoi spingerlo per assicurarti che lo faccia. Sai cosa? Puoi scegliere la risposta abcd? E in pochi secondi, ovviamente, Khanmigo lo trasforma in un quiz che posso sottoporre ai miei studenti in qualsiasi momento. Ora, se voglio tornare\nagli altri suggerimenti offerti, posso chiedere a Khanmigo di aiutarmi a\nscrivere un programma di lezione con questo. E nota che dice che mi aiuterà a scrivere un programma di lezione. Non farà tutto per me perché lo stiamo co-creando insieme. Mi sta aiutando perché ho la capacità e il controllo per cambiare\nqualunque cosa crei Khanmigo. Quindi sì, per favore, mi piacerebbe creare\nun programma di lezioni per questo. Quindi farò clic su di esso e ci vorranno un paio\ndi secondi per crearlo perché include così tante\nfunzionalità importanti di cui abbiamo bisogno. Ad esempio, l'obiettivo di apprendimento. Include attività, si differenzia per me, mi darà\nistruzioni dirette per i miei studenti. Mi offrirà\nattività pratiche indipendenti per i miei studenti, attività di riscaldamento per i miei studenti. È pieno di così tanti pezzi fantastici di cui ho bisogno nel mio programma di lezioni. Quindi gli darò solo\nun secondo per crearlo. Inoltre, nota che questa è una pratica indipendente che suggerisce di\nassegnare i miei studenti. Ed è evidenziato in blu. Ogni volta che vedi qualcosa di blu, è un indizio per qualcos'altro. Quindi ogni volta che sei nella Khan Academy e vedi qualcosa di blu, fai clic su di esso e\nti porterà a qualcos'altro su cui indagare. Va bene, quindi ecco la mia lezione. Fantastico, fantastico. Ecco i materiali\ninclusi e poi un riepilogo della lezione\nin fondo, che mi fa sapere quanto tempo\nrichiederà ciascuna attività. Diciamo che c'è qualcosa\nche non mi piace proprio. Non sono un fan di questo biglietto d'uscita, preferirei usare il quiz che ho fatto, o voglio che Khanmigo\ntrovi qualcosa di diverso. Nessun problema. Ancora una volta, ho il controllo. Tutto quello che devo fare è cliccarci sopra. Khanmigo apparirà e\nmi farà un paio di domande. Voglio apportarvi delle modifiche? E se è così, posso semplicemente dire a\nKhanmigo quali sono questi cambiamenti. Posso parlarne\ncon Khanmigo, o perché hai scelto questo, posso parlargliene. Oppure posso semplicemente chiedere a Khanmigo\ndi provare qualcosa di diverso. Non so cosa voglio. So solo che non mi piace e voglio qualcosa di diverso. Premo quel pulsante e\nquesto cambia per me. Quindi, ancora una volta, ho il controllo e lavoreremo insieme, co-creeremo un programma di lezioni che potrò utilizzare con i miei studenti. Ora, una volta che sono soddisfatto del mio programma di lezione, è esattamente come lo voglio. Grazie mille, Khanmigo. Ho la possibilità di\nstampare il programma della lezione o... Ops, scusa.  L' ho chiuso. Ma puoi stampare il programma della lezione oppure scaricarlo in un file PDF oppure scaricarlo in Google Classroom o Microsoft Word. Quindi ci sono alcune cose che puoi fare dopo. Va bene, tornerò ai miei fantastici strumenti Khanmigo. Un'altra fantastica funzionalità che amo e di cui sento il bisogno, lo farei all'inizio\ndi ogni lezione, è la funzione Lesson Hook. Come facciamo a entusiasmare gli studenti per i contenuti che stiamo realizzando? Se sto per tenere una\nlezione sulle equazioni lineari, non c'è niente di veramente\nentusiasmante in questo. Ma ai miei studenti. Per me, mi occupo solo di equazioni lineari. Ma Khanmigo mi aiuterà a creare lezioni divertenti ed emozionanti. Tutto quello che devo fare è cliccarci sopra, far sapere a Khanmigo il livello del voto, questo è per la mia\nlezione di algebra di 9° grado, o per la mia lezione di matematica integrata di 9° grado, e stiamo lavorando su equazioni lineari e chiedo semplicemente a Khanmigo\ndi creare  è per me. E ancora, in pochi secondi, Khanmigo crea tre\nfantastici hook di lezione che posso usare con i miei studenti a cui probabilmente non avrei\npensato da solo. Mi piace molto questo. Per un'attività pratica, gli studenti possono utilizzare una calcolatrice grafica o uno strumento grafico online per tracciare un'equazione lineare. Ancora una volta, però, nota la barra viola. Se c'è qualcosa che non mi piace, tutto quello che devo fare è cliccarci sopra e posso chiedere a Khanmigo di cambiarlo. - Michele, sai, la cosa\nfantastica di tutto ciò è che, essendo un insegnante nello\nstato della California, abbiamo un programma di studio adottato dallo stato e questo è davvero un bel complemento per poter tirare fuori le cose e per  diciamo, sai una cosa, la mia lezione per oggi è fantastica, ma mi serve solo un riassunto. Ho bisogno di questa parte. Quindi mi piace poter trovare parti di questo che possano integrare ciò che sto già facendo in classe.  Mi chiedo, abbiamo molte domande su come appare dal\npunto di vista di uno studente. Mi chiedevo se potessimo entrare e dare un'occhiata a come\nKhanmigo funge da tutor in quella\nlezione di matematica integrata. - Assolutamente. Quindi tornerò a\nquella lezione di matematica integrata e tornerò alla stessa identica unità: i grafici lineari. E andrò al video, per sceglierne uno. E quando seleziono Khanmigo, proprio come farebbe un insegnante, qui nella parte superiore dello schermo, posso passare dalla modalità insegnante alla modalità studente. Quindi ora la modalità studente è attiva. Nota, mi dà\ndiversi suggerimenti proprio qui. Mi chiederà: voglio un riassunto del video? Voglio che mi faccia delle domande nel video? Voglio scrivere una poesia sul video? Oppure perché dovrebbe\ninteressarmi imparare questo video? Questa è una domanda che si pone la maggior parte degli studenti. Perché dovrebbe interessarmi questo? Quindi andrò avanti e farò clic su quello e Khanmigo mi chiederà, beh, cosa mi piace... Ti piacciono i videogiochi? Personaggi dei videogiochi che si muovono in\ntutte le direzioni. E collega il contenuto\nallo studente. Se lo studente sta svolgendo un compito, perché potrei avere studenti\nche sono al di sotto del livello scolastico, ma devo comunque impartire ai miei studenti istruzioni a livello scolastico. E se assegno ai miei studenti l'\nistruzione a livello scolastico e non sono disponibile a sostenerli, non devo preoccuparmi\nperché Khanmigo è lì. Quindi, se gli studenti stanno\nlavorando su un compito che ho assegnato loro, appare Khanmigo e dice: hai bisogno di aiuto per risolvere il problema? Vuoi provare esempi simili? O ancora, perché dovrebbe interessarmi questa cosa? Una cosa che voglio sottolineare, mi piace che Khanmigo dica, vuoi provare un problema simile? Il motivo per cui Khanmigo dice questo è perché Khanmigo non\ndarà mai la risposta al tuo studente. Proprio come un buon tutor non darebbe mai la risposta al tuo studente. Li aiuterà\nattraverso il processo di comprensione e apprendimento del problema. Quindi Khanmigo, anche se lo studente dice, qual è la risposta? Khanmigo mi dirà che sono qui per aiutarti a imparare, non solo per darti la risposta. Iniziamo con il primo punto che accompagnerà gli studenti attraverso il processo di\ncomprensione del contenuto qui presente. Stavo per dire di mostrare un'altra cosa. Se assegni ai tuoi\nstudenti, diciamo, un quiz. Se desideri che i tuoi studenti\ncompletino un quiz su Khanmigo, i tuoi studenti non potranno accedere al quiz su Khanmigo. Poiché il quiz, voglio conoscere il contenuto\nche conoscono i miei studenti. Non voglio sapere cosa sa Khanmigo o come sta aiutando i miei studenti. Quindi, se i miei studenti entrano\ne assegno loro un quiz, Khanmigo dirà, mi dispiace, non sono disponibile su questa pagina. Quindi sai che se stai effettuando un controllo di\npadronanza con i tuoi studenti, puoi sapere se\ncapiscono il contenuto. - Michele, mi chiedo se potrei provare alcune cose con te. Mi chiedo se potrei semplicemente essere tuo studente e provare alcune cose in\nuno degli (indistinti) in modo da poter vedere Khanmigo in azione. - Assolutamente.  Mi piacerebbe.  Va bene. E inizieremo questo. - Facciamo un po' di conti. Va bene, vediamo qui. Dov'è il nostro amico Khanmigo? Quindi stiamo facendo\ninput e output di funzioni. Non so nemmeno come iniziare. Possiamo dire a Khanmigo che abbiamo\nbisogno di aiuto per risolvere questo problema? - Assolutamente. Qual è la risposta? Mi sono perso.\n- Quindi immagina di essere in una classe, ho 35 bambini, le mani sono alzate. Come insegnanti, non possiamo raggiungerli\ntutti allo stesso tempo. I bambini aspetteranno. Quindi, mentre aspettano l'insegnante, sappiamo che è la migliore risorsa. L’insegnante dovrebbe sempre essere\nla prima linea di difesa. Khanmigo può essere lì\nper prevenire la frustrazione ed evitare che i bambini rimangano bloccati o siano a casa, giusto? È nel momento, tutoraggio istantaneo. Quindi abbiamo detto a Khanmigo che\nnon sappiamo come iniziare, non sappiamo cosa fare. Penso che quello di cui non sono sicuro sia: cos'è questa f e poi tra\nparentesi questa f di x? Che cosa significa? E nota quelle bolle. Quindi molte volte il problema è che i ragazzi non sanno cosa dire a Khanmigo.  Sanno di essere bloccati, sanno di non sapere cosa fare, ma non sanno come verbalizzarlo. Ed è per questo che ci sono quelle bolle. Non ci limitiamo a quelli, giusto? Quindi proviamo effettivamente qualcos'altro. Khanmigo sta riflettendo un po'\nqui, facendo un po' di conti. Recentemente abbiamo svolto un ottimo lavoro per migliorare la capacità\ndi Khanmigo di fare matematica. Ecco perché c'è un po'\ndi ritardo lì. Quindi qui mi dice quanto vale f(x) e mi chiede cosa succede\nse mettiamo -8 nella scatola? Quindi penserò semplicemente che abbiamo -7. Se x è -8, penso che sarebbe, diciamo che faccio un errore e vedo che è -56 meno 1. Diciamo che è -57. Michele, vediamo cosa dice. - Controllalo. - Penso che dobbiamo semplicemente scriverlo in quella piccola casella Khanmigo proprio lì. - Ops.  -57. - Andiamo con qualsiasi cosa. Vediamo cosa ne fa Khanmigo. Quindi è qui per offrirmi\nun po' di supporto in questo momento. Penserà a\ncome mi sono comportato lì.  Sta facendo un po' di conti. Vediamo come risponde. Ops.  Hmm. Quindi è riconoscere\nche ho fatto un errore, ma in un modo davvero di supporto, e cerchiamo di aiutarmi a trovare\nquel piccolo errore. Quindi f(x) significa che se\nmettiamo x in quello -7x, e poi guardiamo come lo scompone. Quindi se inseriamo -8, otteniamo -7 per -8. Quindi otteniamo 56 meno 1. Quindi dai un'occhiata a come mi ha convalidato e mi ha dato un piccolo passo avanti, ma non mi sta dando la risposta. Quindi noterai un\napproccio molto socratico. Bene, proviamo qualcos'altro, Michele, che direbbe un ragazzino, andiamo con il buon vecchio non so. Ancora una volta, immagina di avere\ndei bambini con la mano alzata, che ti stanno aspettando, giusto? Cosa c'è per sostenerli? Khanmigo è lì in questo momento, non importa dove si trovino, purché abbiano il loro dispositivo, hanno questo tutor su richiesta. Quindi non stiamo cercando di trovare persone da sostenere in classe. Questo è in linea con le istruzioni che il mio insegnante\nmi dà in classe. Quindi tutto è a posto, è giusto e il mio insegnante è lì\ncon pieno accesso a questo per sapere esattamente dove sono rimasto bloccato e come ho bisogno di supporto. Quindi per quelli di voi che sono\nnella chat chiedendo, cosa comporta questo comportamento,\nche aspetto ha? Spero che questo vi abbia dato\nun'idea di come si comporterà Khanmigo e di come potrà supportare\ngli studenti in questo momento. - Assolutamente. Inoltre, mentre\ncomunico con Khanmigo, gli insegnanti hanno la capacità di vedere tutto ciò di cui i tuoi studenti parlano e chiacchierano con Khanmigo. Oppure, se i tuoi studenti dicono qualcosa di\ninappropriato a Khanmigo, Khanmigo interromperà\nla conversazione proprio lì. E l'insegnante riceve un avviso, facendo sapere all'insegnante\ncosa ha detto lo studente.  Ci sono un sacco di cose fantastiche lì. - Mi chiedo se la\nscienza sia allineata a NGSS. Potremmo partecipare a una\ndelle nostre lezioni di scienze e dare un'occhiata al\nsupporto di Khanmigo? - Sicuramente. Che ne dici di biologia delle scuole medie? Sembra divertente?\n- Il mio preferito, il mio preferito. - SÌ.  Va bene. C'è un'unità particolare che\nvorresti esaminare? - Decisamente.  Andiamo con gli\necosistemi, la biodiversità.  Ci sono un sacco di divertimento lì. - Sono bei tempi.  Bei tempi. Ti piacerebbe vedere un video, un articolo o un esercizio? - Penso che mi piacerebbe andare a un esercizio e penso di voler entrare\nin quella modalità studente e porre l'annosa domanda che i miei studenti mi fanno continuamente. Perché diavolo dovrei\npreoccuparmi di impararlo? Possiamo vedere cosa dice Khanmigo a riguardo? - Perché dovrebbe preoccuparmi? Quali sono alcune cose a cui tieni?  Adoro ballare . - Oh, guarda quello. Magari aggiungendo un\npo' di pertinenza, collegandolo a cose a cui\ntengo come studente.  Va bene. - Mi piace. - Oh, quindi se un ballerino se ne va, il gruppo si rimpicciolisce. Che modo interessante di collegare ciò che interessa allo studente al contenuto sullo schermo. Ok, sai una cosa? Ma non mi sembra abbastanza. Posso avere un altro esempio magari? - Sì mi piace. Puoi farmi un altro esempio? Inoltre, mi piace molto Taylor Swift. Pensa alla base di fan di Taylor Swift\ncome a un ecosistema. Se smettesse di fare musica, alcuni fan potrebbero andarsene. È come se i cambiamenti in un ecosistema facessero diminuire la popolazione.  Ha senso? Ops.  Lo fa.  Lo fa assolutamente. Quindi grazie mille, Khanmigo. Adesso vorrei... Ops, lasciami disattivarlo. Puoi spiegare di più su\ncome funziona l'ecosistema? Perché adesso sono curioso, sono investito. Sono un Sarto, sono uno Swifty e ora so perché ho\nbisogno di saperne di più. Quindi farò molte più\ndomande a Khanmigo. Ora sono appassionato e voglio saperne di più. E passiamo ad una domanda. Andiamo. Sono qui. Inoltre, ci sono video che possono essere\nguardati anche dagli studenti. Quindi posso porre la domanda. Controllalo. Oh, ho capito bene la domanda. Eccellente, eccellente. Va bene.  Eccone un altro. Voglio provare un esempio simile. Ricorda, Khanmigo\nnon ci darà la risposta, ma posso provare un problema simile\nper aiutarmi a risolverlo. Non voglio che Khanmigo\nmi dia la risposta. Posso procurarmene uno simile. - Sai una cosa, tutto\nquesto mi fa pensare che Michele sia così coinvolgente. Ad esempio, se avessi avuto questo in classe, non avrei dovuto impegnarmi così tanto per catturare l'\ninteresse dei miei studenti e supportarli in questo momento. Ma mi chiedo come\nrispondono gli insegnanti e come ottengono i dati dopo. Potresti spiegarci quali\ndati sono in grado di ottenere gli insegnanti e come Khanmigo potrebbe essere in grado\ndi aiutare a riassumere tali dati e magari formulare alcuni consigli? - Assolutamente. Quindi, se assegno contenuti ai miei studenti o se i miei studenti stanno lavorando\nsul proprio percorso di apprendimento e completando le attività in Khan Academy, lavoreranno sulle competenze e ne otterranno dati. Come insegnante, tutto quello che devo fare è venire qui e selezionare questo\npulsante di istantanea della classe e\nmi darà una panoramica di alto livello. Mi permetterà di selezionare quale classe voglio guardare per prima. Voglio dare un'occhiata a questa lezione, la lezione di Algebra One, e\nmi darà una panoramica di alto livello dei progressi che i miei studenti\nhanno fatto nel corso, nel mio corso negli ultimi sette giorni. Mi dirà la media della classe. Mi consente di sapere come stanno andando i miei studenti\ncon i compiti che stanno completando. Nota anche che ha questi\nrapporti luminosi in blu, che è un collegamento diretto\na quel rapporto effettivo. Quindi, se sto esaminando le competenze su cui stanno lavorando i miei studenti, ma desidero maggiori dettagli, tutto quello che devo fare è fare clic su di esso e mi porterà al rapporto sulle competenze in modo da poter vedere esattamente su cosa\nstanno lavorando i miei studenti  . Khanmigo mi fornisce anche\nulteriori suggerimenti a cui forse non avevo pensato. Ad esempio, quale studente\ndovrei festeggiare nella mia classe? Adoro ringraziare le lezioni in modo da poter vedere quali studenti\nhanno bisogno di quei premi o chi li ha guadagnati. Quali studenti sono in difficoltà? Chi devo controllare per assicurarmi che stiano facendo quello che\ndovrebbero fare? Un altro, questo è il mio preferito. Raggruppa la mia classe in base ai loro consigli. Quello, un enorme risparmio di tempo. Perché ancora una volta, come diceva Stacie, tutti i miei studenti non\nsaranno allo stesso livello e devo essere in grado di differenziarmi e dare ai miei studenti ciò di cui hanno bisogno. Questo è il mio nuovo migliore amico. Analizzerà\nciò di cui i miei studenti hanno bisogno e mi dice di cosa hanno bisogno gli studenti e cosa, così posso dare loro i compiti. Ma sai cosa? C'è qualcosa di ancora migliore. Tornerò a quel cruscotto e questo sarà il mio nuovo migliore amico. Questo, l'ho condiviso ieri con un'insegnante\ne lei ha detto: \"L'unica cosa che\nnon sto facendo è prepararmi il caffè\". È semplicemente un punto di svolta assoluto. Questo è il compito consigliato. È qui che Khanmigo\nesamina tutti i dati su tutti i contenuti\nrealizzati dai tuoi studenti e consiglia\ncompiti specifici per gruppi particolari perché ricorda,\nnon sono tutti nello stesso posto. Ma questo fa un ulteriore passo avanti. Me li assegnerà direttamente. Quindi, se voglio assegnare queste\nassegnazioni a quel gruppo, tutto quello che devo fare è selezionare questo pulsante. La cosa più difficile\nche devo fare a questo proposito, la decisione più difficile\nche devo prendere è: voglio che ogni studente\nabbia una serie di domande diversa o voglio che tutti i miei studenti abbiano la stessa serie di domande? E onestamente, non esiste una\nrisposta giusta o sbagliata. Dipende davvero da\ncosa lo usi. Se lo assegno ai\nmiei studenti come compito a casa, sì, voglio assicurarmi che tutti\nabbiano domande diverse. Ma se voglio che i miei studenti\nlavorino insieme, collaborino e costruiscano quel discorso matematico, assegnerò loro\nla stessa serie di domande e lascerò che lavorino insieme mentre progetto sullo schermo. E possiamo farlo insieme. Quindi quello è un enorme risparmio di tempo. Adoro quella nuova funzionalità. Un'altra funzionalità davvero interessante\ndisponibile è il Real World Context Generator. Questo, enorme, proprio come Khanmigo sa che gli\nstudenti si pongono la domanda \"Perché dovrebbe interessarmi?\", questo lo rende reale per gli studenti. Devi solo far\nsapere a Khanmigo il tuo livello scolastico e cosa stiamo per insegnare. Stacie, cosa stiamo per insegnarti? - Sistemi di equazioni. Questa è la cosa che preferisco insegnare. - Sistemi di equazioni. Va bene, e poi ancora,\nin pochi secondi, Khanmigo crea tre idee diverse che posso usare con i miei studenti. Come possono relazionarsi? Quindi non solo, non stanno solo facendo\nmatematica dal mio libro di matematica, lo sto rendendo reale e lo sto rendendo più\ncoinvolgente per i miei studenti. - E a proposito di libri di matematica, abbiamo una domanda nella chat, voglio assicurarmi che\nanche tutti sentano la risposta. Non solo questi standard sono allineati, ancora una volta, agli standard statali fondamentali comuni\nin matematica e NGSS in scienze, ma abbiamo opzioni di corso per Eureka Math o Engage\nNew York in terza elementare fino all'algebra due e Matematica illustrativa, a partire da  Dalla settima elementare\nall'algebra. Quindi nel menu del corso, Michele farà semplicemente clic\nsu Vedi tutta la matematica, ci sono un sacco di cose qui. Quindi potremmo scorrere per circa cinque minuti per vedere tutte queste diverse classi. Ma quando arriviamo a circa\nmetà della pagina, possiamo effettivamente fare clic e mostrartelo. Qui puoi vedere una rapida schermata di tutti i diversi corsi disponibili da calcolo, e proprio lì ci sono le nostre\nlezioni di matematica illustrativa . Quindi, se stai usando quel\nprogramma per la terza media, per Algebra, se usi Eureka Math, quelli sono lì. E ancora, non solo gli standard sono allineati, ma c'è anche l'allineamento del curriculum, che è una grande, grande risorsa. - Vorresti che partecipassi a uno dei corsi di Eureka Math? - Diamo un'occhiata alla\nMatematica Illustrativa per l'ottavo anno. - Va bene.  Va bene. Qualche argomento particolare? - No, diamo solo un'occhiata\na come è allineato il percorso. E se sei abituato a\nusare questi programmi, so che sono piuttosto\ndiffusi in tutto lo stato, dai un'occhiata a come si adattano all'allineamento del libro di testo. Quindi sai, la cosa fantastica\ndi ogni corso è che non importa se stai usando il nostro tradizionale corso di terza media o se stai usando questo corso, le unità possono essere assegnate in qualsiasi ordine. Quindi tu, come insegnante, puoi prendere decisioni sull'ordine in cui gli studenti devono ricevere i contenuti. E Khanmigo\nsarà lì, qualunque cosa accada. Se voglio iniziare con l'\nunità tre, ad esempio, voglio iniziare con le relazioni lineari prima di eseguire qualsiasi forma di trasformazione, posso farlo e Khanmigo sarà\npresente per tutto il percorso. Quindi gli insegnanti hanno l'autonomia necessaria per prendere decisioni\nsull'ordine didattico e su come presentare le cose ai ragazzi nel modo migliore per i loro studenti. - [Michele] Eccellente.\n- Va bene, bene con questo, torneremo ad\nalcune altre cose. Continua ad arrivare con le domande. Ti illustrerò alcuni dei vantaggi della partnership. Quindi, se scegli che la tua\nscuola o il tuo distretto persegua una partnership con noi, ci sono diverse cose\nche ne derivano come partner distrettuale, giusto? Sappiamo che possiamo andare su khanacademy.org, possiamo utilizzare il contenuto gratuitamente. E se fossimo partner distrettuali? Cosa c'è di diverso? Abbiamo già visto il menu del corso e potresti pensare a Khan Academy, torniamo indietro di una diapositiva, quindi scusa, potresti pensare a Khan\nAcademy come a un programma di matematica, ma quello che hai già\nvisto oggi su  lo schermo è che c'è molto di più lì. Abbiamo corsi in tutte le discipline, non solo matematica e scienze, ma anche discipline umanistiche, abilità di vita, programmazione informatica, ma il valore reale di\nessere un partner distrettuale va ben oltre il contenuto e arriva con il\nsupporto che ricevi. Diapositiva successiva. Va bene, quindi in questa diapositiva vi mostriamo che,\nquando si tratta di intelligenza artificiale, l'approccio che adottiamo\nall'implementazione è importante.  Ci stiamo lavorando da quasi 18 mesi, due anni. Siamo qui per supportarti con strumenti, formazione, dati ed esperienza per guidarti durante l'intero percorso. Quindi non siamo lì solo all'inizio per farti alzare e andare avanti. Saremo presenti per rispondere a\ndomande, grandi e piccole, per tutta la durata\ndella partnership. Oltre a ciò, offriamo anche formazione professionale sia per insegnanti che per amministratori. E questo è fondamentale per il\nsuccesso di qualsiasi implementazione. Ma se stai implementando l'intelligenza artificiale, questo non è solo un nuovo strumento, non è una vecchia implementazione. Questo è un cambiamento nella pedagogia e nel modo in cui affrontiamo l’insegnamento e l’istruzione nella nostra classe. Riteniamo che gli insegnanti\nmeritino una formazione completa su come iniziare, come accedere ai dati, come analizzarli e come utilizzarli realmente\nper guidare l'istruzione. Quindi ci impegniamo a supportare gli insegnanti, non solo con un PD una tantum, nemmeno con un PD a due, tre, ma durante tutto l'anno, e anche con la possibilità di\nessere lì solo per rispondere alle domande. A volte, quando stiamo\nimplementando qualcosa di così significativo, abbiamo solo bisogno di qualcuno con cui parlare, un partner di pensiero con cui fare brainstorming. E il nostro apprendimento professionale\ncomprende tutto questo. Quindi gli insegnanti hanno questo\nsupporto avvolgente per tutto il tempo. Pensiamo anche all'MTSS come a un sistema\ndi supporto a più livelli per gli studenti. Abbiamo già parlato\ndella suite di corsi a tua disposizione, ma quello che\nti mostriamo qui sullo schermo è che se utilizzi un modello MTSS per differenziare e soddisfare\nle esigenze dei tuoi studenti, abbiamo dei corsi  contenuto per supportarlo. Quindi, attraverso questi livelli, sia che utilizziamo il corso di livello elementare per l'istruzione di livello uno, sia che utilizziamo un corso\nchiamato Get Ready For in cui stiamo costruendo le basi e preparandoci per quell'istruzione di livello\nelementare, Khanmigo  e quel supporto\nche hai visto usare da Michele è disponibile in tutti questi. Quindi il punto importante, la cosa più importante con MTSS è che abbiamo studenti che hanno\ndifficoltà per un po’ e vogliamo evitare una crescente frustrazione. Non vogliamo che rimangano bloccati. Quindi Khanmigo è disponibile, ogni volta che ne hanno bisogno, proprio\nlì a portata di mano in modo che abbiano quel supporto. - Assolutamente. E una cosa che voglio\ncondividere velocemente, Stacie, è in Khanmigo, dal dashboard di Khanmigo, se ci stai provando, se sono un insegnante di scienze di terza media, ma il mio studente sta leggendo\nun corso di scienze di prima media  livello, qui c'è un livellatore in cui puoi inserire un testo e puoi modificare il\nlivello di lettura su di esso. Perché se la comprensione\nnon è l'obiettivo principale e lo è la comprensione dei contenuti scientifici, voglio assicurarmi che i miei\nstudenti siano in grado di farlo e possano assolutamente\nfarlo con questa funzionalità. - Sì.  Penso che sia anche\nimportante dirlo qui, poiché\nsupportiamo tutti gli studenti, Khan Academy è disponibile anche Khanmigo, che il chatbot è completamente supportato anche in\ninglese, spagnolo e portoghese. Quindi, anche incontrare quegli\nstudenti multilingue dove si trovano e garantire che, sebbene\nuno studente multilingue abbia forse bisogno di competenza\no dimestichezza con l'inglese, non rimanga indietro\ncon i suoi contenuti, giusto? Sono in grado di accedere a\nKhanmigo in spagnolo, in portoghese, nella loro lingua madre in modo che possano continuare a rimanere aggiornati, all'altezza di dove\ndovrebbero essere a livello accademico. - Assolutamente, e\n proprio come vogliamo che i nostri\nstudenti multilingue lo facciano, vogliamo che anche i loro genitori\nsiano coinvolti. Quindi, se ho bisogno che Khanmigo crei una lettera a uno dei miei studenti e il genitore parla principalmente spagnolo, Khanmigo tradurrà quella lettera per me in modo che io possa inviarla ai genitori degli studenti\nper tenerli coinvolti e aggiornati con l'\nistruzione dei loro studenti  . - Enorme aiuto, enorme risparmio di tempo. Pensiamo allora ai dati. Abbiamo dato un breve sguardo ai dati a disposizione degli insegnanti oggi, ma sappiamo che gli amministratori\nsono leader didattici. E per\ncondurre in modo efficace l’istruzione, come amministratori, abbiamo bisogno di dati. Quindi, se sei un\namministratore di questa chiamata, voglio assicurarmi che tu possa dare\nun'occhiata qui ai dati disponibili a livello di distretto o amministratore scolastico e che tu possa vedere questi dati. Se guardi il\nlato sinistro dello screenshot che Michele ha sullo schermo, qui siamo in grado di vedere i dati\na livello di corso, a livello di scuola, fino al\nlivello di studente molto granulare, quindi possiamo  Siamo in grado di identificare i successi, celebrare gli studenti mentre\nfanno quei piccoli passi avanti, mentre acquisiscono competenza\ne conforto, giusto?  Mi sento davvero orgoglioso di se stessi. Vogliamo celebrarlo. Ma siamo anche in grado di\nidentificare opportunità in cui forse è necessario investire\nun po' più di risorse o supportare l'insegnante con gli\nstudenti in difficoltà. Quindi, come amministratore, i miglioramenti\napportati a questa dashboard per me stanno cambiando le regole del gioco perché posso vedere una\nvisione ampia dei dati, molto ampia, fino a una visualizzazione molto ristretta. Ed è davvero stimolante\nessere in grado di condurre e guidare l'istruzione dal\npunto di vista del database. Quindi, con tutte queste fantastiche cose in mente, voglio dedicare solo un secondo a\nparlare di sicurezza. Perché mentre portiamo l’intelligenza artificiale in classe, ci sono molte persone\nche sono nervose per questo, ed è giusto che sia così. Questa è una nuova tecnologia. Dobbiamo stare attenti, dobbiamo riflettere su come portare tutto questo\nnelle nostre classi e davanti ai nostri studenti. \nNegli ultimi 18 mesi abbiamo lavorato con i distretti di tutto il Paese e abbiamo imparato molto. Questa tecnologia è così nuova e stiamo tutti ancora imparando. Nessuno è un esperto là fuori, giusto? Questa è una nuova tecnologia. Siamo tutti in un luogo di apprendimento. Quindi c'è molto da capire. E stiamo cercando partner. Ci auguriamo che\ntutti voi vogliate collaborare con noi per imparare e crescere in questa missione, per consentire a insegnanti e\nstudenti di imparare insieme. Stanno accadendo un sacco di\ncose fantastiche in questo momento. Vedi alcuni ritagli sullo schermo di grandi notizie e grandi cose che stanno accadendo. E siamo entusiasti di lavorare\nsu tutto questo con voi, di innovare con voi perché c'è molto altro da imparare mentre diamo forma all'istruzione in modo\nleggermente diverso in quest'era di intelligenza artificiale. E se segui la sicurezza, se stai pensando alla sicurezza degli studenti, sono sicuro che hai sentito parlare di\nvalutazioni mediatiche basate sul buon senso. E qui sullo schermo vogliamo lasciarvi con\nquesto pensiero conclusivo. Mentre entriamo in quest'era in cui l'intelligenza artificiale fa parte di\ntutte le cose della nostra vita, sembra che, giusto, sia sempre più diffusa, la sicurezza e la privacy siano fondamentali, in particolare quando si\ntratta dei nostri studenti. Alla Khan Academy, il nostro team di educatori veterani\nsi impegna a garantire che gli studenti siano al sicuro e che le\nloro informazioni siano private. Quindi Michele ne ha già parlato con un partenariato,\ninsegnanti e amministratori, puoi vedere di cosa\nparlano gli studenti, puoi ottenere un registro.  Lì ci sono dei guardrail. Questo è progettato specificamente\nper i bambini in una classe con la sicurezza al primo posto. Quindi ci sono i guardrail, c'è piena trasparenza affinché\ngli insegnanti possano vedere tutto. E questo è solo uno dei motivi per cui questa valutazione si riflette\nqui sullo schermo. Khanmigo è pensato per i bambini ed è pensato per l'istruzione. Detto questo, continua ad\narrivare con le domande nella chat. Questo è ciò che dobbiamo\ncondividere con voi oggi. Se vuoi saperne di più, la nostra collega Chelsea è qui con noi. C'è la sua favolosa\nfoto sullo schermo. Puoi inviarle un'e-mail direttamente, puoi scattare il codice QR\ne contattare Chelsea. Ma è ansiosa di parlarvi di cosa comporta una partnership distrettuale e di come entrarci insieme a noi perché siamo davvero entusiasti\ndi lavorare con tutti voi l'anno prossimo e di continuare a raggiungere gli studenti nel favoloso stato della California. - [Narratore] Grazie\nper aver guardato questo video e per aver fatto parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo e non perdere mai gli entusiasmanti annunci sui nuovi materiali dei corsi gratuiti\nsu Khan Academy. Assicurati di iscriverti. Grazie e buon insegnamento."
}