{
    "source": "4s46U9_eIXg",
    "youtubelink": "https://www.youtube.com/watch?v=4s46U9_eIXg",
    "t_english": "- Meet Khanmigo, your AI driven companion whose revolutionizing teaching for a more engaging and efficient experience. Khanmigo has many exciting features that support teachers and this video will showcase ways you can use Khanmigo to create course specific mathematics content to enhance the learning experience for all of your students. Throughout this video, we'll explore ways Khanmigo can assist you with creating unique and engaging lesson plans and student centered activities that gets students excited about math while saving you time. Ready to see the teaching assistant you've always wanted? Let's take a look. This is Kahnmigo's dashboard brimming with a multitude of unique time saving features all tailored to elevate your teaching experience. Let's begin with the Lesson Hook feature. Igniting a passion for mathematics can be challenging, but it's profoundly impactful and a definite game changer when accomplished. And powered by Khanmigo, I'll be able to design captivating math lesson introductions that ignite student curiosity and hopefully it will spark a thirst for knowledge in math. I can't wait to see what Khanmigo comes up with. I'm going to let Khanmigo know the grade level that I'm teaching. This is for my algebra one class filled with ninth graders. The topic is going to be reasoning with systems of equations, and then I just ask Khanmigo to write me a Lesson Hook. Wow, these are fantastic. These lesson hooks will really get my students excited about math. Thanks, Khanmigo. With my students curiosity ignited, it's time to craft a lesson plan, so I'm going to use Khanmigo's Lesson Plan tool. This Lesson Plan tool is going to help me design a customized plan aligning with my curriculum and my students needs. Once I click the lesson plan button, Khanmigo asks me to detail the topic I intend to teach. It then presents a selection of topics from Khan Academy's rich course offerings. If my topic isn't listed, Khanmigo allows me to incorporate my own content. I'm going to select the first one, reasoning with systems of equation. Once I select my lesson, Khanmigo swiftly generates a structured, detailed lesson plan tailored to my curriculum and my students. The plan includes objectives, learning activities, guided practice, independent practice, assessments and so much more to ensure that my students have a complete learning experience. And the lesson plans are fully customizable. I can effortlessly modify any part to better fit my needs. If there's something that I want to change, all I have to do is click on it, and Khanmigo gives me the option to chat about it, to make changes to it, or I just want to try something different. I love it, I have complete control over the content. Once I'm happy with my completed lesson plan, Khanmigo gives me the option to print it, or I can export it to the a Microsoft Word document, a PDF, or I can save it to my Google Drive and upload it to my Google Classroom. This saved me so much time. Thank you so much, Khanmigo. Multiple choice assessments with Khanmigo is a math teachers dream come true. It's an innovative tool that transforms math evaluation into an engaging interactive process. It could be your secret weapon for assessing students understanding, identifying gaps, and guiding instruction. It's not just a quiz. It's your roadmap to effective math teaching. All I have to do is select the button, let Khanmigo know my grade level. I'm doing this for my eighth grade students. And then let Khanmigo know how many questions. Let's just go with five today. And then the topic. The topic is multiplying positive and negative numbers. And in a matter of seconds, Khanmigo generates the quiz and includes the answer key for me. What a time saver. Thanks so much, Khanmigo. In my classroom, mathematical discourse has been a game changer for my students. It transforms them from passive listeners to active thinkers, boosting their problem solving skills and confidence while empowering them to articulate ideas, learn from peers, and master problem solving. With a single click of the button, Khanmigo will generate a wealth of captivating conversation kick starters so it's not just a discussion. It's the ignition switch for a learning community where math is exciting. I just have to let Khanmigo know the grade level and the topic. And with a single click, Khanmigo generates a wealth of captivating conversation kick starters. So it's just a discussion, it's the ignition switch for a vibrant learning community where math is exciting. Refresh my Knowledge is another helpful feature, as well as a personal knowledge booster. It's like having a pocket sized tutor ready to give you a concise, engaging recap on any topic that you've studied before. It's the perfect tool for keeping knowledge fresh and at your fingertips. For less experienced teachers, it can be a lifeline, simplifying complex topics while guiding you on how to teach them effectively. For seasoned educators, it's a treasure trove of fresh ideas which can reinvigorate your approach to subjects you've taught for years. Once I let Khanmigo know the topic that I'm interested in reviewing, Khanmigo gives me the option of being quizzed on the topic or learning through conversation. I always like to learn through conversation. Refresh my Knowledge can definitely be a teacher's secret weapon for dynamic and impactful teaching. As a math teacher, you can bridge the gap between abstract concepts in every day life. The Real World Text Generator can make math more relevant and engaging for students by connecting concepts to real life situations. Once I let Khanmigo know the intended grade level and topic, Khanmigo instantly creates practical applications of math that I can share with my students, enhancing their understanding and interest in the topic. No more, \"When will I ever use this?\" question, because the Real World Context Generator makes math come alive. If you're looking for a fun, engaging way to learn for your students, you have to try our Fun Class Summary Poem feature. It's a unique, rhythmic way to summarize lessons for your students. Let's give it a try. When I select the button, Khanmigo wants me to ask my class what they learned today. Today, they learned about calculating percentages, and then Khanmigo wants to know a guiding word or a theme to help inspire the poem. They all said, \"Khanmigo.\" All right, now I'm gonna let Khanmigo do the rest. And here's the poem. Khanmigo the math whiz was quite sage calculating percentages he took center stage. 50% of 100, that's a piece of cake. But 15% of 60, that might take a break. He crunched and munched numbers in his head. \"Nine is the answer,\" with a grin, he said. As you can see, it's not just a poem. It's a memory booster, a creativity enhancer, and a super cool learning tool. Thanks so much, Khanmigo. As you can see, integrating Khanmigo into your classroom routine empowers you to tailor Khanmigo's ideas and suggestions to your mathematics curriculum while factoring in student needs, learning objectives, and creative resources. Khanmigo's insights will not only enrich the learning experience for your students, but it will also free up your time, enabling you to concentrate on what truly matters most, your students. Thanks, Khanmigo. Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen. And to never miss exciting announcements about new, free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- خانمیگو سے ملیں، جو آپ کے AI سے چلنے والے ساتھی ہیں جس کی تعلیم میں انقلابی تبدیلیاں\nمزید پرکشش اور موثر تجربے کے لیے ہیں۔ Khanmigo میں بہت ساری دلچسپ خصوصیات ہیں جو اساتذہ کی مدد کرتی ہیں اور یہ ویڈیو آپ \n کے تمام طلباء کے لیے سیکھنے کے تجربے کو بڑھانے کے لیے مخصوص ریاضی کا مواد بنانے کے لیے Khanmigo کو استعمال کرنے کے طریقے دکھائے گی۔ اس پورے ویڈیو کے دوران، ہم ان طریقوں کی کھوج کریں گے جن سے Khanmigo آپ کو منفرد اور دل چسپ اسباق کے منصوبے بنانے میں مدد کر سکتا ہے اور طلباء پر مبنی سرگرمیاں جو آپ کے وقت کی بچت کرتے ہوئے طلباء کو ریاضی کے بارے میں پرجوش کرتی ہیں۔ اس ٹیچنگ اسسٹنٹ کو دیکھنے کے لیے تیار ہیں جسے\nآپ ہمیشہ چاہتے ہیں؟ آئیے ایک نظر ڈالتے ہیں۔ یہ Kahnmigo کا ڈیش بورڈ ہے جس میں \nوقت کی بچت کی بہت سی منفرد خصوصیات ہیں جو \nآپ کے تدریسی تجربے کو بلند کرنے کے لیے تیار کی گئی ہیں۔ آئیے سبق ہک کی خصوصیت کے ساتھ شروع کریں۔ ریاضی کے لیے جنون کو بھڑکانا مشکل ہو سکتا ہے، لیکن جب یہ مکمل ہو جائے تو\nیہ بہت زیادہ اثر انگیز اور ایک یقینی گیم\nچینجر ہے۔ اور خانمیگو کے ذریعے تقویت یافتہ،\nمیں ریاضی کے سبق آموز تعارف تیار کرنے کے قابل ہو جاؤں گا جو طالب علم کے تجسس کو بھڑکاتے ہیں اور امید ہے کہ یہ\nریاضی میں علم کی پیاس کو جنم دے گا۔ میں یہ دیکھنے کے لیے انتظار نہیں کر سکتا کہ خانمیگو کیا لے کر آتا ہے۔\n میں خانمیگو کو اس\nگریڈ کی سطح سے آگاہ کرنے جا رہا ہوں جو میں پڑھا رہا ہوں۔ یہ میری الجبرا کی ایک کلاس کے لیے ہے جو نویں جماعت کے طلباء سے بھری ہوئی ہے۔ موضوع مساوات کے نظام کے ساتھ استدلال کرنے والا ہے، اور پھر میں صرف خانمیگو سے کہوں گا کہ وہ\nمجھے ایک سبق ہک لکھے۔ واہ، یہ لاجواب ہیں۔ یہ سبق ہکس\nواقعی میرے طلباء کو ریاضی کے بارے میں پرجوش کریں گے۔ شکریہ، خانمیگو۔ میرے طلباء کے تجسس کے بھڑکنے کے ساتھ، یہ سبق کا منصوبہ تیار کرنے کا وقت ہے، اس لیے میں\nKhanmigo کے سبق پلان کے آلے کو استعمال کرنے جا رہا ہوں۔ سبق کی منصوبہ بندی کا یہ ٹول\n \nمیرے نصاب اور میرے طلباء کی ضروریات کے مطابق حسب ضرورت منصوبہ تیار کرنے میں میری مدد کرے گا۔ ایک بار جب میں سبق کے منصوبے کے بٹن پر کلک کرتا ہوں، خانمیگو مجھ سے اس موضوع کی تفصیل طلب کرتا ہے جسے میں پڑھانا چاہتا ہوں۔  اس کے بعد یہ خان اکیڈمی کے بھرپور کورس کی پیشکشوں سے موضوعات کا انتخاب پیش کرتا ہے۔ اگر میرا موضوع درج نہیں ہے، تو خانمیگو مجھے\nاپنا مواد شامل کرنے کی اجازت دیتا ہے۔ میں مساوات کے نظام کے ساتھ استدلال کرتے ہوئے پہلے کو منتخب کرنے جا رہا ہوں۔ ایک بار جب میں اپنا سبق منتخب کر لیتا ہوں، Khanmigo تیزی سے میرے نصاب اور میرے طلباء کے مطابق ایک منظم، تفصیلی سبق کا منصوبہ تیار کرتا ہے۔  اس\n منصوبے میں مقاصد، سیکھنے کی سرگرمیاں، رہنمائی کی مشق، آزادانہ مشق، تشخیصات اور بہت کچھ شامل ہے تاکہ یہ یقینی بنایا جا سکے کہ میرے طلباء کو سیکھنے کا مکمل تجربہ حاصل ہے۔ اور سبق کے منصوبے\nمکمل طور پر حسب ضرورت ہیں۔ میں اپنی ضروریات کو بہتر طور پر فٹ کرنے کے لیے آسانی سے کسی بھی حصے میں ترمیم کر سکتا ہوں۔ اگر کوئی ایسی چیز ہے\nجسے میں تبدیل کرنا چاہتا ہوں، تو مجھے بس اس پر کلک کرنا ہے، اور Khanmigo مجھے اس کے بارے میں چیٹ کرنے، اس میں تبدیلیاں کرنے کا اختیار دیتا ہے، یا میں صرف کچھ مختلف کرنے کی کوشش کرنا چاہتا ہوں۔ مجھے یہ پسند ہے، میرا\nمواد پر مکمل کنٹرول ہے۔ ایک بار جب میں اپنے\nمکمل سبق کے منصوبے سے خوش ہوں، خانمیگو مجھے اسے پرنٹ کرنے کا اختیار دیتا ہے، یا میں اسے\nمائیکروسافٹ ورڈ دستاویز، پی ڈی ایف میں ایکسپورٹ کر سکتا ہوں، یا میں اسے اپنی گوگل ڈرائیو میں محفوظ کر کے اپنے گوگل پر اپ لوڈ کر سکتا ہوں۔  کلاس روم۔ اس سے میرا بہت وقت بچ گیا۔ آپ کا بہت شکریہ، خانمیگو۔ خانمیگو کے ساتھ ایک سے زیادہ انتخابی جائزے ایک ریاضی کے اساتذہ کا خواب پورا ہونا ہے۔ یہ ایک جدید ٹول ہے جو\nریاضی کی تشخیص کو ایک پرکشش انٹرایکٹو عمل میں بدل دیتا ہے۔ \n طلباء کی سمجھ بوجھ کا اندازہ لگانے، خلاء کی نشاندہی کرنے اور ہدایات کی رہنمائی کے لیے یہ آپ کا خفیہ ہتھیار ہو سکتا ہے۔ یہ صرف کوئز نہیں ہے۔ یہ ریاضی کی مؤثر تدریس کے لیے آپ کا روڈ میپ ہے۔\n مجھے بس بٹن کو منتخب کرنا ہے، خانمیگو کو میرے گریڈ کی سطح سے آگاہ کرنا ہے۔ میں یہ اپنے آٹھویں جماعت کے طلباء کے لیے کر رہا ہوں۔\n اور پھر خانمیگو\nجانے کتنے سوال؟ چلو آج پانچ کے ساتھ چلتے ہیں۔ اور پھر موضوع۔ موضوع\nمثبت اور منفی نمبروں کو ضرب کر رہا ہے۔ اور چند سیکنڈوں میں، Khanmigo کوئز تیار کرتا ہے اور اس میں میرے لیے جواب کی کلید شامل ہوتی ہے۔ کتنا وقت بچانے والا ہے۔ بہت شکریہ، خانمیگو۔ میرے کلاس روم میں، ریاضی کی گفتگو میرے طلباء کے لیے گیم چینجر رہی ہے۔ یہ انہیں غیر فعال سامعین سے فعال سوچنے والوں میں تبدیل کر دیتا ہے، \nان کے مسائل حل کرنے کی مہارت اور اعتماد کو بڑھاتا ہے جبکہ انہیں خیالات کو بیان کرنے، ساتھیوں سے سیکھنے اور مسئلہ حل کرنے میں مہارت فراہم کرتا ہے۔ بٹن کے ایک کلک کے ساتھ، Khanmigo\n بات چیت کے آغاز کرنے والوں کی دلفریب دولت پیدا کرے گا لہذا\nیہ صرف بحث نہیں ہے۔ یہ\nسیکھنے والی کمیونٹی کے لیے اگنیشن سوئچ ہے جہاں ریاضی دلچسپ ہے۔ مجھے صرف خانمیگو کو گریڈ لیول اور موضوع سے آگاہ کرنا ہے۔ اور ایک ہی کلک کے ساتھ، Khanmigo نے گفتگو کے آغاز کرنے والوں کو دلکش بنانے کا خزانہ پیدا کیا۔ تو یہ صرف ایک بحث ہے، یہ\nایک متحرک سیکھنے والی کمیونٹی کے لیے اگنیشن سوئچ ہے جہاں ریاضی دلچسپ ہے۔ میری نالج کو ریفریش کرنا\nایک اور مددگار خصوصیت کے ساتھ ساتھ پرسنل نالج بوسٹر ہے۔ یہ ایسا ہی ہے جیسے ایک جیب کے سائز کا ٹیوٹر آپ کو کسی بھی موضوع پر ایک\nمختصر، دلکش ریپ دینے کے لیے تیار ہو جس کا آپ نے پہلے مطالعہ کیا ہو۔ یہ\nعلم کو تازہ رکھنے اور آپ کی انگلی پر رکھنے کے لیے بہترین ٹول ہے۔ کم تجربہ کار اساتذہ کے لیے، یہ ایک لائف لائن ہو سکتا ہے،\nپیچیدہ موضوعات کو آسان بنا کر آپ کی رہنمائی کرتا ہے کہ\nانھیں مؤثر طریقے سے کیسے پڑھایا جائے۔ تجربہ کار معلمین کے لیے،\nیہ تازہ خیالات کا خزانہ ہے جو آپ کے برسوں سے پڑھائے گئے مضامین کے لیے\nآپ کے نقطہ نظر کو پھر سے تقویت دے سکتا ہے۔ ایک بار جب میں خانمیگو کو اس\nموضوع سے آگاہ کرتا ہوں جس کا میں جائزہ لینے میں دلچسپی رکھتا ہوں، خانمیگو مجھے اس موضوع پر کوئز کرنے یا گفتگو کے ذریعے سیکھنے کا اختیار دیتا ہے۔ میں ہمیشہ\nبات چیت کے ذریعے سیکھنا پسند کرتا ہوں۔ میرے علم کو تازہ کریں\nیقینی طور پر متحرک اور اثر انگیز تدریس کے لیے استاد کا خفیہ ہتھیار ہو سکتا ہے۔\n ریاضی کے استاد کے طور پر، آپ ہر روز کی زندگی میں تجریدی تصورات کے درمیان فرق کو ختم کر سکتے ہیں۔ \n حقیقی دنیا کا ٹیکسٹ جنریٹر تصورات کو حقیقی زندگی کے حالات سے جوڑ کر طلباء کے لیے\nریاضی کو مزید متعلقہ اور پرکشش بنا سکتا ہے۔ \n ایک بار جب میں Khanmigo کو\nمطلوبہ گریڈ لیول اور موضوع سے آگاہ کرتا ہوں، Khanmigo فوری طور پر\nریاضی کی عملی ایپلی کیشنز بناتا ہے جسے میں اپنے طلباء کے ساتھ شیئر کر سکتا ہوں، \nموضوع میں ان کی سمجھ اور دلچسپی کو بڑھا سکتا ہوں۔ مزید نہیں، \"میں\nاسے کب استعمال کروں گا؟\"  سوال، کیونکہ حقیقی دنیا کا سیاق و سباق پیدا کرنے والا ریاضی کو زندہ کرتا ہے۔ اگر آپ اپنے طلباء کے لیے سیکھنے کے لیے ایک تفریحی، دل چسپ طریقہ تلاش کر رہے ہیں، تو آپ کو ہماری فن\nکلاس سمری نظم کی خصوصیت کو آزمانا ہوگا۔ یہ\n آپ کے طالب علموں کے لیے اسباق کا خلاصہ کرنے کا ایک انوکھا، ردھم والا طریقہ ہے۔  آئیے اسے آزماتے ہیں۔ جب میں بٹن کو منتخب کرتا ہوں،\nخانمیگو چاہتا ہے کہ میں اپنی کلاس سے پوچھوں کہ انہوں نے آج کیا سیکھا۔ آج، انہوں نے فیصد کا حساب لگانے کے بارے میں سیکھا،\n اور پھر خانمیگو نظم کو متاثر کرنے میں مدد کرنے کے لیے ایک رہنما لفظ یا تھیم جاننا چاہتے ہیں۔ سب نے کہا خانمیگو۔ ٹھیک ہے، اب میں\nخانمیگو کو باقی کام کرنے دوں گا۔ اور یہ نظم ہے۔ خانمیگو ریاضی کا ماہر تھا جو \nاس نے سینٹر اسٹیج کو حاصل کرنے والے فیصد کا حساب لگاتا تھا۔ 100 کا 50%، یہ کیک کا ایک ٹکڑا ہے۔ لیکن 60 میں سے 15%، اس میں وقفہ لگ سکتا ہے۔ اس نے\nاپنے سر میں نمبروں کو کچل دیا اور چبایا۔ \"نو جواب ہے،\"\nایک مسکراہٹ کے ساتھ، اس نے کہا۔ جیسا کہ آپ دیکھ سکتے ہیں، یہ صرف ایک نظم نہیں ہے۔ یہ میموری کو بڑھانے والا،\nتخلیقی صلاحیتوں کو بڑھانے والا، اور سیکھنے کا ایک زبردست ٹول ہے۔ بہت شکریہ، خانمیگو۔ جیسا کہ آپ دیکھ سکتے ہیں، Khanmigo کو اپنے کلاس روم کے معمولات میں ضم کرنا آپ کو \n طالب علم کی ضروریات، سیکھنے کے مقاصد،\nاور تخلیقی وسائل کو مدنظر رکھتے ہوئے اپنے ریاضی کے نصاب کے مطابق خانمیگو کے خیالات اور تجاویز کو تیار کرنے کی طاقت دیتا ہے۔ Khanmigo کی بصیرت نہ صرف آپ کے طلباء کے لیے سیکھنے کے تجربے کو تقویت بخشے گی، بلکہ یہ آپ کا وقت بھی خالی کرے گی، جس سے آپ اس بات پر توجہ مرکوز کر سکیں گے کہ آپ کے طلباء، جو واقعی سب سے اہم ہیں۔ شکریہ، خانمیگو۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ\nخانمیگو کلاس روم میں آپ اور آپ کے طلباء کی کس طرح مدد کر سکتا ہے، اپنی اسکرین پر موجود لنکس پر عمل کریں۔ اور خان اکیڈمی پر نئے، مفت کورس مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں\n، سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Conozca a Khanmigo, su compañero impulsado por IA cuya\nenseñanza revoluciona la experiencia más atractiva y eficiente. Khanmigo tiene muchas características interesantes que apoyan a los profesores y este video mostrará formas en que puede usar Khanmigo para crear contenido de matemáticas específico del curso\n para mejorar la experiencia de aprendizaje de todos sus estudiantes. A lo largo de este video, exploraremos las formas en que Khanmigo puede ayudarlo a crear planes de lecciones y actividades centradas en los estudiantes únicos y atractivos que los entusiasmen con las matemáticas y, al mismo tiempo, les ahorren tiempo.  ¿ Listo para ver al\nasistente de enseñanza que siempre quisiste? Vamos a ver. Este es el panel de Kahnmigo repleto de una multitud de\nfunciones únicas para ahorrar tiempo, todas diseñadas para mejorar\nsu experiencia docente. Comencemos con la función Lesson Hook. Encender una pasión por las matemáticas puede ser un desafío, pero\nes profundamente impactante y definitivamente cambia las reglas del juego\ncuando se logra. Y con la tecnología de Khanmigo,\npodré diseñar cautivadoras introducciones a lecciones de matemáticas que enciendan la curiosidad de los estudiantes y, con suerte, despierten su\nsed de conocimiento en matemáticas. No puedo esperar a ver qué se le\nocurre a Khanmigo.  Le haré\nsaber a Khanmigo el nivel de grado en el que estoy enseñando. Esto es para mi clase de álgebra uno llena de estudiantes de noveno grado. El tema será razonar con sistemas de ecuaciones y luego le pediré a Khanmigo\nque me escriba un gancho de lección. Vaya, estos son fantásticos. Estos ganchos para lecciones\nrealmente entusiasmarán a mis alumnos con las matemáticas. Gracias, Khanmigo. Con la curiosidad de mis alumnos encendida, es hora de elaborar un plan de lección, así que usaré la\nherramienta Plan de lección de Khanmigo. Esta herramienta de plan de lección\nme ayudará a diseñar un plan personalizado que se alinee\ncon mi plan de estudios y las necesidades de mis alumnos. Una vez que hago clic en el botón del plan de lección, Khanmigo me pide que detalle el tema que pretendo enseñar. Luego presenta una selección de temas de la rica oferta de cursos de Khan Academy. Si mi tema no aparece en la lista, Khanmigo me permite\nincorporar mi propio contenido. Voy a seleccionar el primero, razonar con sistemas de ecuaciones. Una vez que selecciono mi lección, Khanmigo genera rápidamente un plan de lección estructurado y detallado\nadaptado a mi plan de estudios y a mis alumnos. El plan incluye objetivos, actividades de aprendizaje, práctica guiada, práctica independiente, evaluaciones y mucho más para garantizar que mis alumnos tengan una experiencia de aprendizaje completa. Y los planes de lecciones\nson totalmente personalizables. Puedo modificar sin esfuerzo cualquier pieza para adaptarla mejor a mis necesidades. Si hay algo\nque quiero cambiar, todo lo que tengo que hacer es hacer clic en ello y Khanmigo me da la opción de conversar sobre ello, realizar cambios o simplemente quiero probar algo diferente. Me encanta, tengo\ncontrol total sobre el contenido. Una vez que estoy satisfecho con mi\nplan de lección completo, Khanmigo me da la opción de imprimirlo, o puedo exportarlo a\nun documento de Microsoft Word, un PDF, o puedo guardarlo en mi Google Drive y subirlo a mi cuenta de Google.  Aula. Esto me ahorró mucho tiempo. Muchas gracias Khanmigo.  Las evaluaciones de opción múltiple con Khanmigo son el sueño de los profesores de matemáticas hecho realidad. Es una herramienta innovadora que\ntransforma la evaluación de matemáticas en un proceso interactivo atractivo. Podría ser su\narma secreta para evaluar la comprensión de los estudiantes, identificar brechas y guiar la instrucción. No es sólo una prueba. Es su hoja de ruta para una\nenseñanza eficaz de las matemáticas. Todo lo que tengo que hacer es seleccionar el botón, informarle a Khanmigo mi nivel de grado. Estoy haciendo esto para mis\nalumnos de octavo grado. Y luego déjele\nsaber a Khanmigo cuántas preguntas. Vayamos con cinco hoy. Y luego el tema. El tema es multiplicar\nnúmeros positivos y negativos. Y en cuestión de segundos, Khanmigo genera el cuestionario y me incluye la clave de respuestas. Qué ahorro de tiempo. Muchas gracias Khanmigo. En mi clase, el discurso matemático ha cambiado las reglas del juego para mis alumnos. Los transforma de oyentes pasivos a pensadores activos, lo que aumenta\nsus habilidades para resolver problemas y su confianza, al mismo tiempo que les permite articular ideas, aprender de sus compañeros y dominar la resolución de problemas. Con un solo clic en el botón, Khanmigo generará\nuna gran cantidad de temas de conversación cautivadores para que\nno sea solo una discusión. Es el interruptor de encendido\nde una comunidad de aprendizaje donde las matemáticas son apasionantes. Sólo tengo que informarle a Khanmigo el nivel de grado y el tema. Y con un solo clic, Khanmigo genera una gran cantidad de temas cautivadores para iniciar conversaciones. Así que es sólo una discusión, es el interruptor de encendido de\nuna vibrante comunidad de aprendizaje donde las matemáticas son apasionantes. Actualizar mis conocimientos es\notra función útil, además de un refuerzo de conocimientos personales. Es como tener un tutor de bolsillo listo para brindarte un\nresumen conciso y atractivo sobre cualquier tema que hayas estudiado antes. Es la herramienta perfecta para\nmantener el conocimiento actualizado y al alcance de su mano. Para los profesores menos experimentados, puede ser un salvavidas, ya que\nsimplifica temas complejos y al mismo tiempo les orienta sobre cómo\nenseñarlos de forma eficaz. Para los educadores experimentados,\nes un tesoro de ideas nuevas que pueden\nrevitalizar su enfoque de las materias que han enseñado durante años. Una vez que le informo a Khanmigo el\ntema que me interesa revisar, Khanmigo me da la opción de que me pregunten sobre el tema o aprender a través de una conversación. Siempre me gusta aprender\na través de la conversación. Refresh my Knowledge\ndefinitivamente puede ser el arma secreta de un maestro para una\nenseñanza dinámica e impactante. Como profesor de matemáticas, puedes cerrar la brecha entre conceptos abstractos\nen la vida cotidiana. El Real World Text Generator\npuede hacer que las matemáticas sean más relevantes y atractivas para los estudiantes\nal conectar conceptos con situaciones de la vida real. Una vez que le informo a Khanmigo el\nnivel de grado y el tema previsto, Khanmigo crea instantáneamente\naplicaciones prácticas de matemáticas que puedo compartir con mis alumnos, mejorando su comprensión\ne interés en el tema. No más preguntas: \"¿Cuándo\nusaré esto?\"  pregunta, porque el Generador de contexto del mundo real hace que las matemáticas cobren vida. Si está buscando una forma divertida y atractiva de que sus alumnos aprendan, debe probar nuestra\nfunción Poema divertido de resumen de clase. Es una forma única y rítmica\nde resumir las lecciones para sus alumnos.  Hagamos un intento. Cuando selecciono el botón,\nKhanmigo quiere que le pregunte a mi clase qué aprendieron hoy. Hoy aprendieron a\ncalcular porcentajes y luego Khanmigo quiere saber una palabra guía o un tema que los ayude a inspirar el poema. Todos dijeron: \"Khanmigo\". Muy bien, ahora\ndejaré que Khanmigo haga el resto. Y aquí está el poema. Khanmigo, el genio de las matemáticas, era bastante sabio al calcular los porcentajes y\nocupó un lugar central.  El 50% de 100, eso es pan comido. Pero el 15% de los 60, eso podría tomarse un descanso. Hizo y masticó\nnúmeros en su cabeza. \"Nueve es la respuesta\",\ndijo con una sonrisa. Como puedes ver, no es sólo un poema. Es un refuerzo de la memoria,\nun potenciador de la creatividad y una herramienta de aprendizaje genial. Muchas gracias Khanmigo. Como puede ver, integrar Khanmigo en su rutina de clase le permite adaptar las ideas y sugerencias de Khanmigo a su\nplan de estudios de matemáticas, teniendo en cuenta las necesidades de los estudiantes, los objetivos de aprendizaje\ny los recursos creativos.  Los conocimientos de Khanmigo no solo enriquecerán la experiencia de aprendizaje de sus estudiantes, sino que también le liberarán tiempo, permitiéndole concentrarse en lo que realmente importa: sus estudiantes. Gracias, Khanmigo. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus alumnos en el aula, siga los enlaces en su pantalla. Y para no perderse nunca anuncios interesantes sobre materiales de cursos nuevos y gratuitos\nen Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- تعرف على Khanmigo، رفيقك الذي يعتمد على الذكاء الاصطناعي والذي أحدث ثورة في\nالتدريس للحصول على تجربة أكثر جاذبية وكفاءة. يحتوي Khanmigo على العديد من الميزات المثيرة التي تدعم المعلمين وسيعرض هذا الفيديو الطرق التي يمكنك من خلالها استخدام Khanmigo لإنشاء محتوى رياضيات خاص بالدورة التدريبية\n لتعزيز تجربة التعلم لجميع طلابك. خلال هذا الفيديو، سنستكشف الطرق التي يمكن أن يساعدك بها Khanmigo في إنشاء خطط دروس فريدة وجذابة وأنشطة تتمحور حول الطلاب والتي تجعل الطلاب متحمسين للرياضيات مع توفير الوقت.  هل أنت مستعد لرؤية\nمساعد التدريس الذي طالما أردته؟ لنلقي نظرة. هذه هي لوحة المعلومات الخاصة بـ Kahnmigo والتي تزخر بالعديد من\nالميزات الفريدة لتوفير الوقت والتي تم تصميمها جميعًا للارتقاء\nبتجربة التدريس لديك. لنبدأ بميزة \"ربط الدرس\".  قد يكون إشعال الشغف بالرياضيات أمرًا صعبًا، لكنه ذو\nتأثير عميق ويغير قواعد اللعبة بشكل واضح\nعند إنجازه. وبدعم من Khanmigo،\nسأكون قادرًا على تصميم مقدمات جذابة لدروس الرياضيات تثير فضول الطلاب ونأمل أن تثير\nالتعطش للمعرفة في الرياضيات. لا أستطيع الانتظار لرؤية ما\nسيأتي به خانميغو. سأخبر خانميغو\nبمستوى الصف الذي أقوم بتدريسه. هذا هو فصل الجبر الخاص بي المليء بطلاب الصف التاسع. سيكون الموضوع هو الاستدلال باستخدام أنظمة المعادلات، ثم أطلب من خانميغو\nأن يكتب لي خطافًا للدرس. واو، هذه رائعة. هذه الخطافات الدرسية\nستجعل طلابي متحمسين حقًا للرياضيات. شكرا خانميجو. مع إشعال فضول طلابي، حان الوقت لصياغة خطة الدرس، لذلك سأستخدم\nأداة خطة الدرس الخاصة بـ Khanmigo.  ستساعدني أداة خطة الدرس هذه في\nتصميم خطة مخصصة تتوافق\nمع المنهج الدراسي واحتياجات طلابي. بمجرد النقر على زر خطة الدرس، يطلب مني خانميغو تفصيل الموضوع الذي أنوي تدريسه. ثم يقدم مجموعة مختارة من المواضيع من عروض الدورات التدريبية الغنية التي تقدمها أكاديمية خان. إذا لم يكن موضوعي مدرجًا، فإن Khanmigo يسمح لي\nبدمج المحتوى الخاص بي. سأقوم باختيار الخيار الأول، باستخدام أنظمة المعادلات. بمجرد تحديد الدرس الخاص بي، يقوم Khanmigo بسرعة بإنشاء خطة درس منظمة ومفصلة مصممة\nخصيصًا لمناهجي وطلابي. تتضمن الخطة الأهداف وأنشطة التعلم والممارسة الموجهة والممارسة المستقلة والتقييمات وغير ذلك الكثير لضمان حصول طلابي على تجربة تعليمية كاملة. وخطط الدروس قابلة\nللتخصيص بالكامل. يمكنني بسهولة تعديل أي جزء ليناسب احتياجاتي بشكل أفضل. إذا كان هناك شيء\nأريد تغييره، فكل ما علي فعله هو النقر عليه، ويمنحني Khanmigo خيار الدردشة حوله، أو إجراء تغييرات عليه، أو أريد فقط تجربة شيء مختلف. أنا أحب ذلك، لدي\nالسيطرة الكاملة على المحتوى. بمجرد أن أكون سعيدًا\nبخطة الدرس المكتملة، يمنحني Khanmigo خيار طباعتها، أو يمكنني تصديرها إلى\nمستند Microsoft Word، أو ملف PDF، أو يمكنني حفظها على Google Drive وتحميله على Google.  قاعة الدراسة. هذا وفر لي الكثير من الوقت. شكرا جزيلا لك، خانميجو. تقييمات الاختيار من متعدد مع Khanmigo هي حلم مدرسي الرياضيات الذي أصبح حقيقة. إنها أداة مبتكرة\nتحول تقييم الرياضيات إلى عملية تفاعلية جذابة. يمكن أن يكون\nسلاحك السري لتقييم فهم الطلاب وتحديد الفجوات وتوجيه التعليمات. انها ليست مجرد مسابقة. إنها خارطة الطريق الخاصة بك\nلتدريس الرياضيات بشكل فعال. كل ما علي فعله هو الضغط على الزر، والسماح لـ Khanmigo بمعرفة مستوى الصف الخاص بي. أنا أفعل هذا\nلطلابي في الصف الثامن. ثم أخبر خانميغو\nبعدد الأسئلة. دعنا نذهب مع خمسة اليوم. ومن ثم الموضوع. الموضوع هو ضرب\nالأعداد الموجبة والسالبة. وفي غضون ثوانٍ، يقوم خانميغو بإنشاء الاختبار ويتضمن مفتاح الإجابة لي. ما هو توفير الوقت. شكرا جزيلا، خانميجو. في فصلي الدراسي، كان الخطاب الرياضي بمثابة تغيير في قواعد اللعبة بالنسبة لطلابي. إنه يحولهم من مستمعين سلبيين إلى مفكرين نشطين، ويعزز\nمهاراتهم في حل المشكلات وثقتهم بينما يمكّنهم من التعبير عن الأفكار والتعلم من أقرانهم وإتقان حل المشكلات. بنقرة واحدة على الزر، سيولد Khanmigo\nثروة من المحادثات الجذابة التي تبدأ المحادثة، لذا\nفهي ليست مجرد مناقشة. إنه مفتاح التشغيل\nلمجتمع التعلم حيث تكون الرياضيات مثيرة. عليّ فقط أن أخبر خانميغو بمستوى الصف والموضوع. وبنقرة واحدة، يولد Khanmigo ثروة من المحادثات الجذابة التي تبدأ. إنها مجرد مناقشة، إنها مفتاح التشغيل\nلمجتمع تعليمي نابض بالحياة حيث تكون الرياضيات مثيرة.  يعد تحديث معرفتي\nميزة مفيدة أخرى، بالإضافة إلى تعزيز المعرفة الشخصية. يشبه الأمر وجود مدرس بحجم الجيب جاهز لتزويدك\nبملخص موجز وجذاب حول أي موضوع قمت بدراسته من قبل. إنها الأداة المثالية للحفاظ على\nالمعرفة جديدة وفي متناول يدك. بالنسبة للمعلمين الأقل خبرة، يمكن أن يكون بمثابة شريان الحياة، حيث\nيبسط الموضوعات المعقدة بينما يرشدك إلى كيفية\nتدريسها بشكل فعال. بالنسبة للمعلمين المتمرسين،\nيعد هذا كنزًا من الأفكار الجديدة التي يمكنها\nتنشيط أسلوبك في المواد التي قمت بتدريسها لسنوات. بمجرد أن أعلم خانميغو\nبالموضوع الذي أرغب في مراجعته، يمنحني خانميغو خيار أن يتم استجوابي حول الموضوع أو التعلم من خلال المحادثة. أنا دائما أحب أن أتعلم\nمن خلال المحادثة.  من المؤكد أن تحديث معرفتي يمكن أن\nيكون سلاح المعلم السري للتدريس الديناميكي\nوالمؤثر. كمدرس للرياضيات، يمكنك سد الفجوة بين المفاهيم المجردة\nفي الحياة اليومية.  يمكن لـ Real World Text Generator أن\nيجعل الرياضيات أكثر صلة وجاذبية للطلاب\nمن خلال ربط المفاهيم بمواقف الحياة الحقيقية. بمجرد أن أعلم خانميغو\nبمستوى الصف المقصود والموضوع، يقوم خانميغو على الفور بإنشاء\nتطبيقات عملية للرياضيات يمكنني مشاركتها مع طلابي، مما يعزز فهمهم\nواهتمامهم بالموضوع. لا مزيد من السؤال \"متى سأستخدم\nهذا؟\"  سؤال، لأن منشئ سياق العالم الحقيقي يجعل الرياضيات تنبض بالحياة. إذا كنت تبحث عن طريقة ممتعة وجذابة للتعلم لطلابك، فعليك تجربة\nميزة Fun Class Summary Poem الخاصة بنا. إنها طريقة فريدة وإيقاعية\nلتلخيص الدروس لطلابك.  دعنا نعطيها محاولة. عندما أحدد الزر،\nيريدني خانميغو أن أسأل طلاب صفي عما تعلموه اليوم. اليوم، تعلموا كيفية\nحساب النسب المئوية، وبعد ذلك يريد خانميغو معرفة كلمة إرشادية أو موضوع للمساعدة في إلهام القصيدة. كلهم قالوا \"خانميجو\". حسنًا، الآن\nسأدع خانميجو يقوم بالباقي. وهنا القصيدة. كان خانميغو، خبير الرياضيات، حكيمًا جدًا في حساب النسب المئوية التي\nاحتلها مركز الصدارة. 50% من 100، هذه قطعة من الكعكة. لكن 15% من 60، قد يأخذون فترة راحة. كان يطحن ويمضغ\nالأرقام في رأسه.  وقال مبتسماً: \"تسعة هي الإجابة\".\n كما ترون، إنها ليست مجرد قصيدة. إنها أداة معززة للذاكرة،\nومُحسِّنة للإبداع، وأداة تعليمية رائعة للغاية. شكرا جزيلا، خانميجو. كما ترون، فإن دمج Khanmigo في روتين الفصل الدراسي الخاص بك يمكّنك من تصميم أفكار واقتراحات Khanmigo لمناهج الرياضيات الخاصة بك\n مع الأخذ في الاعتبار احتياجات الطلاب وأهداف التعلم\nوالموارد الإبداعية. لن تعمل رؤى خانميغو على إثراء تجربة التعلم لطلابك فحسب، بل ستوفر أيضًا وقتك، مما يتيح لك التركيز على ما يهم حقًا، وهو طلابك. شكرا خانميجو. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد حول كيفية\nدعم Khanmigo لك ولطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك. وحتى لا تفوت أبدًا الإعلانات المثيرة حول المواد الدراسية المجانية الجديدة\nفي أكاديمية خان، تأكد من الاشتراك.",
    "t_italian": "- Incontra Khanmigo, il tuo compagno guidato dall'intelligenza artificiale il cui\ninsegnamento rivoluzionario per un'esperienza più coinvolgente ed efficiente. Khanmigo ha molte funzionalità interessanti che supportano gli insegnanti e questo video mostrerà i modi in cui puoi utilizzare Khanmigo per creare contenuti matematici specifici del corso\n per migliorare l'esperienza di apprendimento per tutti i tuoi studenti. In questo video esploreremo i modi in cui Khanmigo può aiutarti a creare programmi di lezioni unici e coinvolgenti e attività incentrate sugli studenti che entusiasmano gli studenti per la matematica facendoti risparmiare tempo. Pronto a vedere l'\nassistente didattico che hai sempre desiderato? Diamo un'occhiata. Questa è la dashboard di Kahnmigo ricca di una moltitudine di\nfunzionalità uniche per risparmiare tempo, tutte progettate su misura per migliorare\nla tua esperienza di insegnamento. Cominciamo con la funzione Lesson Hook. Accendere la passione per la matematica può essere impegnativo, ma\nha un profondo impatto e,\nuna volta realizzato, rappresenta una svolta decisiva. Grazie a Khanmigo,\nsarò in grado di progettare accattivanti introduzioni alle lezioni di matematica che accendono la curiosità degli studenti e, si spera, susciteranno la\nsete di conoscenza in matematica. Non vedo l'ora di vedere cosa\ninventerà Khanmigo. Farò\nsapere a Khanmigo a che livello insegno. Questa è per la mia classe di algebra piena di alunni della prima media. L'argomento riguarderà il ragionamento con sistemi di equazioni, quindi chiedo semplicemente a Khanmigo\ndi scrivermi un Lesson Hook. Wow, sono fantastici. Questi riassunti delle lezioni\nfaranno davvero appassionare i miei studenti alla matematica. Grazie, Khanmigo. Con la curiosità dei miei studenti accesa, è tempo di creare un piano di lezione, quindi utilizzerò lo\nstrumento Piano di lezione di Khanmigo. Questo strumento del piano di lezione\nmi aiuterà a progettare un piano personalizzato in linea\ncon il mio curriculum e le esigenze dei miei studenti. Dopo aver fatto clic sul pulsante del programma della lezione, Khanmigo mi chiede di dettagliare l'argomento che intendo insegnare. Presenta quindi una selezione di argomenti dalla ricca offerta di corsi di Khan Academy. Se il mio argomento non è elencato, Khanmigo mi consente di\nincorporare i miei contenuti. Selezionerò la prima, ragionando con sistemi di equazioni. Una volta selezionata la mia lezione, Khanmigo genera rapidamente un piano di lezione strutturato e dettagliato su misura\nper il mio curriculum e per i miei studenti. Il piano include obiettivi, attività di apprendimento, pratica guidata, pratica indipendente, valutazioni e molto altro ancora per garantire che i miei studenti abbiano un'esperienza di apprendimento completa. E i piani delle lezioni\nsono completamente personalizzabili. Posso modificare senza sforzo qualsiasi parte per adattarla meglio alle mie esigenze. Se c'è qualcosa\nche voglio cambiare, tutto quello che devo fare è cliccarci sopra e Khanmigo mi darà la possibilità di parlarne, di apportarvi modifiche o semplicemente di voler provare qualcosa di diverso.  Lo adoro, ho il\ncontrollo completo sul contenuto. Una volta che sono soddisfatto del mio\nprogramma di lezione completato, Khanmigo mi dà la possibilità di stamparlo, oppure posso esportarlo in\nun documento Microsoft Word, un PDF, oppure posso salvarlo sul mio Google Drive e caricarlo sul mio Google  Aula. Questo mi ha fatto risparmiare così tanto tempo. Grazie mille, Khanmigo.  Le valutazioni a scelta multipla con Khanmigo sono il sogno degli insegnanti di matematica che diventa realtà. È uno strumento innovativo che\ntrasforma la valutazione matematica in un processo interattivo coinvolgente. Potrebbe essere la tua\narma segreta per valutare la comprensione degli studenti, identificare le lacune e guidare l'istruzione. Non è solo un quiz. È la tua tabella di marcia verso un\ninsegnamento efficace della matematica. Tutto quello che devo fare è selezionare il pulsante e far sapere a Khanmigo il mio livello scolastico.  Lo sto facendo per i miei\nstudenti di terza media. E poi fai\nsapere a Khanmigo quante domande. Andiamo con cinque oggi. E poi l'argomento. L'argomento è moltiplicare\ni numeri positivi e negativi. E nel giro di pochi secondi, Khanmigo genera il quiz e include la chiave di risposta per me. Che risparmio di tempo. Grazie mille, Khanmigo. Nella mia classe, il discorso matematico ha rappresentato un punto di svolta per i miei studenti. Li trasforma da ascoltatori passivi a pensatori attivi, aumentando le\nloro capacità di problem solving e la loro fiducia, consentendo loro di articolare idee, imparare dai colleghi e padroneggiare la risoluzione dei problemi. Con un solo clic del pulsante, Khanmigo genererà\nuna serie di accattivanti spunti di conversazione, quindi\nnon si tratterà solo di una discussione. È l'interruttore di accensione\nper una comunità di apprendimento in cui la matematica è entusiasmante. Devo solo far sapere a Khanmigo il livello della scuola e l'argomento. E con un solo clic, Khanmigo genera una vasta gamma di accattivanti spunti di conversazione. Quindi è solo una discussione, è l'interruttore di accensione per\nuna vivace comunità di apprendimento in cui la matematica è entusiasmante. Aggiorna la mia conoscenza è\nun'altra funzionalità utile, nonché un potenziamento della conoscenza personale. È come avere un tutor tascabile pronto a darti un\nriepilogo conciso e coinvolgente su qualsiasi argomento che hai studiato in precedenza. È lo strumento perfetto per\nmantenere la conoscenza fresca e a portata di mano. Per gli insegnanti meno esperti, può essere un'ancora di salvezza,\nsemplificando argomenti complessi e guidandoti su come\ninsegnarli in modo efficace. Per gli educatori esperti,\nè un tesoro di nuove idee che possono\nrinvigorire il tuo approccio alle materie che insegni da anni. Una volta che ho comunicato a Khanmigo l'\nargomento che mi interessa rivedere, Khanmigo mi dà la possibilità di essere interrogato sull'argomento o di imparare attraverso la conversazione. Mi piace sempre imparare\nattraverso la conversazione. Aggiorna le mie conoscenze può\nsicuramente essere l' arma segreta di un insegnante per un\ninsegnamento dinamico e di grande impatto. Come insegnante di matematica, puoi colmare il divario tra i concetti astratti\nnella vita di tutti i giorni. Il Real World Text Generator\npuò rendere la matematica più rilevante e coinvolgente per gli studenti\ncollegando i concetti a situazioni di vita reale. Una volta comunicato a Khanmigo il\nlivello scolastico e l'argomento previsti, Khanmigo crea immediatamente\napplicazioni pratiche di matematica che posso condividere con i miei studenti, migliorando la loro comprensione\ne interesse per l'argomento. Non più: \"Quando\nmai lo userò?\"  domanda, perché il generatore di contesto del mondo reale rende viva la matematica. Se stai cercando un modo divertente e coinvolgente di apprendere per i tuoi studenti, devi provare la nostra\nfunzione Poesia di riepilogo della classe divertente. È un modo unico e ritmato\nper riassumere le lezioni per i tuoi studenti.  Proviamolo. Quando seleziono il pulsante,\nKhanmigo vuole che chieda alla mia classe cosa hanno imparato oggi. Oggi hanno imparato a\ncalcolare le percentuali e poi Khanmigo vuole conoscere una parola guida o un tema che possa ispirare la poesia. Tutti dissero: \"Khanmigo\". Va bene, ora\nlascerò che Khanmigo faccia il resto. Ed ecco la poesia. Khanmigo, il mago della matematica, era piuttosto saggio nel calcolare le percentuali ed\nera al centro della scena. 50% di 100, è un gioco da ragazzi. Ma il 15% dei 60 potrebbe fare una pausa. Sgranocchiava e masticava\nnumeri nella sua testa. \"Nove è la risposta\",\ncon un sorriso, ha detto. Come puoi vedere, non è solo una poesia. È un potenziatore della memoria,\nun potenziatore della creatività e uno strumento di apprendimento fantastico. Grazie mille, Khanmigo. Come puoi vedere, l'integrazione di Khanmigo nella routine della tua classe ti consente di adattare le idee e i suggerimenti di Khanmigo al tuo\ncurriculum di matematica, tenendo conto delle esigenze degli studenti, degli obiettivi di apprendimento\ne delle risorse creative.  Gli approfondimenti di Khanmigo non solo arricchiranno l'esperienza di apprendimento dei tuoi studenti, ma ti libereranno anche tempo, permettendoti di concentrarti su ciò che conta veramente di più: i tuoi studenti. Grazie, Khanmigo. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo. E per non perdere mai entusiasmanti annunci sui nuovi materiali gratuiti dei corsi\nsu Khan Academy, assicurati di iscriverti."
}