{
    "source": "5xo4pgy5x7M",
    "youtubelink": "https://www.youtube.com/watch?v=5xo4pgy5x7M",
    "t_english": "- Hi, I'm Michelle, a professional learning specialist here at Khan Academy and a former classroom teacher, just like you. I'd like to introduce you to Khanmigo, your AI-driven companion who's revolutionizing teaching for a more engaging and efficient experience. Khanmigo has many exciting features that support teachers, and this video will showcase ways that you can use Khanmigo to create core specific content to enhance the learning experience for all of your students. Throughout this video, we'll explore ways Khanmigo can assist elementary school teachers with creating unique and engaging lesson plans and student-centered activities that get students excited about learning while saving you time. Ready to see the teaching assistant you've always wanted? Let's take a look. This is Khanmigo's Dashboard, your hub of unique powerful features masterfully designed with precision to enhance your teaching experience and maximize your time so you can spend it where it's most important: with your students. Let's begin our exploration with the Learning Objective feature. It's critical for teachers to have a learning objective before teaching because it shapes the lesson's path and makes students' expectations clear. Now, let's put it into action. To use the Learning Objective tool, Khanmigo just needs to know what grade level you teach and what your topic is. We are about to start a unit on multiplying fractions. Khanmigo, please help me write a learning objective. And in a matter of seconds, Khanmigo creates a learning objective that I can use to help guide the rest of my lesson. Now that we have our learning objective, let's move on to the Lesson Hook, because let's face it, it's not just about teaching. It's about creating memorable engaging experiences that enhance student understanding and retention. Empowered by Khanmigo, teachers will be able to design captivating lesson introductions that ignite student curiosity and spark a thirst for knowledge. Once I open the Lesson Hook tool, all I have to do is let Khanmigo know the grade level and the lesson topic. Multiplying fractions. Khanmigo will do the rest. And in a matter of seconds, Khanmigo creates three fantastic Lesson Hooks that'll be sure to spark my students' curiosity and increase their engagement. This is a great way to make learning exciting right from the start. Ignited by my student's curiosity, I'm now excited and ready to create an amazing Lesson Plan. Khanmigo's Lesson Plan feature will quickly assist me in crafting a plan that aligns with my curriculum and meets the needs of my students. When I select the Lesson Plan button, Khanmigo prompts me to specify the topic I'm planning to teach. It then offers a variety of topics from Khan Academy's extensive course list. If my topic isn't included, Khanmigo gives me the option to add my own. I do see my lesson on here, so I'm going to select this one. Promptly, Khanmigo generates a thorough Lesson Plan that aligns with my curriculum. The plan includes learning objectives, learning activities such as warmups, direct instruction, independent practice, exit ticket questions, assessments, and so much more to ensure a well-rounded learning experience for my class. Plus, these Lesson Plans are fully customizable. I can easily alter any section to better suit the needs of my students, whether it's the objective, the activities, or this warmup activity. All I have to do is click on it, Khanmigo will appear, and Khanmigo wants to know if I wanna make changes to it, if I wanna try something different, or I could discuss it with Khanmigo because we're co-creating this together. I think I just wanna try something different. And as soon as I select the button, Khanmigo quickly creates a new warmup activity for my students. I like this one much better. Now that my Lesson Plan is exactly the way I want it, I have a few options: I can print the lesson, or I can easily export it to a Word document, a PDF, or save it to my Google Drive. This has saved me so much time; thank you so much, Khanmigo. As an educator, I understand the value of exposing students to grade level text and vocabulary. However, balancing this with comprehension is crucial to the overall learning experience for students. The Leveler feature, one of my new favorite tools, adjusts text complexity to match students' reading levels, ensuring understanding while engaging with grade level material and personalized instruction to each student's needs. Once I select the Leveler feature, I just have to let Khanmigo know the title of the text and then copy and paste the original text in the space provided. The next unit in my science class is over the lifecycle of a butterfly. I'm a fifth grade teacher; however, I do have a few students who are currently reading on a second grade level, so I'm going to adjust this text for them. And in a matter of seconds, Khanmigo creates the same text but on a second grade reading level for my students, so that all of my students can understand the life cycle of a butterfly. The next feature that I'd like to explore is the Chunk Text feature. This incredible tool allows me to transform complex text into bite-sized pieces, which is perfect for young learners. This tool will enhance comprehension, boost confidence, and foster a love of reading with my students. When I select the Chunk Text feature, I input the title and the text, and then I just let Khanmigo the type of chunks that I want. Do I wanna chunk a longer text by ideas for comprehension or chunk a shorter text by phrases for fluency? I really want my students working on fluency this week, so I'm going to select this one. And in a matter of seconds, Khanmigo transforms the text into smaller chunks, which helps with comprehension and makes reading less intimidating for young learners. It's a great way to build confidence and reading skills. As an educator, I aim to craft thought-provoking discussion prompts tailored to specific topics for my students. My goal is to ignite their curiosity and stimulate intellectual discourse, so I'm going to use the Discussion Prompt feature. I just have to let Khanmigo know the grade level and the topic. We're about to work on the American Revolution in my history class. And in a matter of seconds, Khanmigo creates multiple detailed and thought-provoking discussion questions that'll be sure to get my students chatting but in a good way. The Newsletter tool is a communication powerhouse for elementary teachers. The newsletter tool allows teachers to create custom newsletters. You can add updates, photos, reminders, and so much more. Once created, it can easily be shared with parents via email or print. It's a simple effective way to keep parents in the loop about their child's education. When I open the Class Newsletter feature, I just have to let Khanmigo know the name of my class, what we did last week, what we're doing next week, and any other information that I'd like to include. Khanmigo will do the rest. Once my newsletter is created, it can easily be shared with parents via email or print. It's a simple effective way to keep parents in the loop about their child's education. Thanks, Khanmigo. Another one of my new favorite tools is the IEP Assistant, which helps teachers craft individualized education plans for students. It guides teachers through the entire process, helping identify student needs, setting achievable goals, and planning appropriate supports. Upon opening the IEP Assistant, Khanmigo asks important questions about your student, such as the learning environment, the disability category, the current challenges the student has, current strengths the student has. Then, once you fill in all of those categories, you can draft an accommodation plan in a matter of seconds. And in no time at all, Khanmigo creates a customized detailed individualized education plan for your student that includes accommodation, suggestions, smart goals, and so much more. The IEP Assistant is truly a game changer when creating individualized education plans, ensuring that every one of your students gets the support that they need. If you're looking for a fun engaging way to learn for your students, you have to try our Fun Class Summary Poem feature. It's a unique rhythmic way to summarize lessons for your students. Let's give it a try. When I select the button, Khanmigo wants me to ask my students what they learned today. They all shout out \"Quadrilaterals!\" and I'm so excited that they remember that name. Then, Khanmigo wants me to ask them for a fun word that will inspire our poem. One student shouts out \"Fluffy\"; I think they must have gotten a new cat. Then, Khanmigo will do the rest. And in a matter of seconds, Khanmigo creates our fun class poem. Quadrilaterals, oh so fluffy. Four sides, none too stuffy. Rectangle, squares, and the trapezoid. In geometry, they're hard to avoid. Rhombus, kite, parallelogram. All part of the quadrilateral fam. So remember, don't be in a huff. Quadrilaterals are fluffy, not tough! As you can see, it's not just a poem. It's a memory booster, a creativity enhancer, and a super cool learning tool your students will love. Thanks, Khanmigo. As you can see, integrating Khanmigo into your classroom routine empowers you to tailor Khanmigo's ideas and suggestions to your curriculum, while factoring in student needs, learning objectives and creative resources. Khanmigo's Insights will not only enrich the learning experience for all of your students, but it will also free up your time, enabling you to concentrate on what truly matters: your students. Thanks, Khanmigo. Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen. And to never miss exciting announcements about new free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، \nیہاں خان اکیڈمی میں ایک پروفیشنل لرننگ اسپیشلسٹ اور ایک سابقہ ​​کلاس روم\nٹیچر، بالکل آپ کی طرح۔ میں آپ کو خانمیگو سے ملوانا چاہتا ہوں، جو آپ کے AI سے چلنے والے ساتھی ہیں\nجو زیادہ پرکشش اور موثر تجربے کے لیے تدریس میں انقلاب برپا کر رہے ہیں۔\n Khanmigo میں بہت ساری دلچسپ\nخصوصیات ہیں جو اساتذہ کی مدد کرتی ہیں، اور یہ ویڈیو ان طریقوں کو ظاہر کرے گی\nجن سے آپ اپنے تمام طلباء کے لیے سیکھنے کے تجربے کو بڑھانے کے لیے بنیادی مخصوص مواد بنانے کے لیے Khanmigo کو استعمال کر سکتے ہیں۔ \n اس پورے ویڈیو کے دوران، ہم ان طریقوں کو تلاش کریں گے جن سے Khanmigo\nایلیمنٹری اسکول کے اساتذہ کی مدد کر سکتا ہے انوکھے اور\nدل چسپ اسباق کے منصوبے اور طالب علم پر مبنی سرگرمیاں جو آپ کے وقت کی بچت کرتے ہوئے طلباء کو سیکھنے کے لیے پرجوش کرتی ہیں۔ اس ٹیچنگ اسسٹنٹ کو دیکھنے کے لیے تیار ہیں جسے\nآپ ہمیشہ چاہتے ہیں؟ آئیے ایک نظر ڈالتے ہیں۔ یہ خانمیگو کا ڈیش بورڈ ہے، آپ کی منفرد طاقتور خصوصیات کا مرکز ہے جو آپ کے تدریسی تجربے کو بہتر بنانے اور آپ کے وقت کو زیادہ سے زیادہ بنانے کے لیے مہارت کے ساتھ ڈیزائن کیا گیا ہے تاکہ آپ اسے جہاں سب سے اہم ہے وہاں گزار سکیں:\nاپنے طلباء کے ساتھ۔ آئیے سیکھنے کے مقصد کی خصوصیت کے ساتھ اپنی تلاش شروع کریں۔ اساتذہ کے لیے پڑھانے سے پہلے ایک سیکھنے کا مقصد ہونا بہت ضروری ہے کیونکہ یہ سبق کے راستے کو تشکیل دیتا ہے اور طلباء کی توقعات کو واضح کرتا ہے۔ اب، آئیے اسے عملی جامہ پہناتے ہیں۔ لرننگ آبجیکٹیو ٹول استعمال کرنے کے لیے، خانمیگو کو صرف یہ جاننے کی ضرورت ہے کہ\nآپ کس گریڈ کی سطح پر پڑھاتے ہیں اور آپ کا موضوع کیا ہے۔ ہم\nکسروں کو ضرب دینے پر اکائی شروع کرنے والے ہیں۔ خانمیگو، براہ کرم\nسیکھنے کا مقصد لکھنے میں میری مدد کریں۔ اور چند سیکنڈوں میں، Khanmigo ایک سیکھنے کا\nمقصد بناتا ہے جسے میں اپنے باقی سبق کی رہنمائی کے لیے استعمال کر سکتا ہوں۔ اب جب کہ ہمارا سیکھنے کا مقصد ہے، آئیے سبق\nہک کی طرف بڑھتے ہیں، کیونکہ آئیے اس کا سامنا کرتے ہیں، یہ صرف پڑھانے کے بارے میں نہیں ہے۔ یہ یادگار مشغول تجربات تخلیق کرنے کے بارے میں ہے\n جو طالب علم کی\nسمجھ اور برقراری کو بڑھاتے ہیں۔ Khanmigo کی طرف سے بااختیار،\nاساتذہ دلچسپ سبق آموز تعارف تیار کرنے کے قابل ہوں گے جو طالب علم کے تجسس کو بھڑکاتے ہیں اور علم کی پیاس کو جنم دیتے ہیں۔ ایک بار جب میں Lesson\nHook ٹول کھولتا ہوں، تو مجھے صرف اتنا کرنا ہے کہ Khanmigo کو گریڈ\nلیول اور سبق کا موضوع بتانا ہے۔ کسر کو ضرب دینا۔\nباقی کام خانمیگو کریں گے۔ اور چند سیکنڈوں میں، Khanmigo نے تین\nشاندار Lesson Hooks بنائے ہیں جو یقینی طور پر\nمیرے طلباء کے تجسس کو جگائیں گے اور ان کی مصروفیت میں اضافہ کریں گے۔  سیکھنے کو شروع سے ہی دلچسپ بنانے کا یہ ایک بہترین طریقہ ہے۔\n اپنے طالب علم کے تجسس کی وجہ سے، میں اب پرجوش ہوں اور\nایک حیرت انگیز سبق کا منصوبہ بنانے کے لیے تیار ہوں۔ Khanmigo کا سبق منصوبہ\nفیچر فوری طور پر ایک ایسا منصوبہ تیار کرنے میں میری مدد کرے گا جو\nمیرے نصاب کے مطابق ہو اور میرے طلباء کی ضروریات کو پورا کرے۔ جب میں سبق کی منصوبہ بندی کا بٹن منتخب کرتا ہوں، تو خانمیگو مجھے اس موضوع کی وضاحت کرنے کا اشارہ کرتا ہے جسے میں پڑھانے کا سوچ رہا ہوں۔  اس کے بعد یہ خان اکیڈمی کے وسیع کورس کی فہرست سے مختلف موضوعات پیش کرتا ہے۔ اگر میرا موضوع شامل نہیں ہے، تو خانمیگو مجھے\nاپنا مضمون شامل کرنے کا اختیار دیتا ہے۔ میں یہاں اپنا سبق دیکھ رہا ہوں، لہذا میں اسے منتخب کرنے جا رہا ہوں۔ فوری طور پر، Khanmigo\nایک مکمل سبقی منصوبہ تیار کرتا ہے جو میرے نصاب کے مطابق ہوتا ہے۔  اس منصوبے میں سیکھنے کے مقاصد، سیکھنے کی سرگرمیاں شامل ہیں جیسے وارم اپ، براہ راست ہدایات، آزادانہ مشق، ایگزٹ ٹکٹ کے سوالات، تشخیصات، اور بہت کچھ تاکہ \nمیری کلاس کے لیے سیکھنے کے اچھے تجربے کو یقینی بنایا جا سکے۔  اس کے علاوہ، یہ سبق کے منصوبے\nمکمل طور پر حسب ضرورت ہیں۔ میں اپنے طلباء کی ضروریات کے مطابق کسی بھی حصے کو آسانی سے تبدیل کر سکتا ہوں، چاہے وہ\nمقصد ہو، سرگرمیاں، یا یہ وارم اپ سرگرمی۔ مجھے بس\nاس پر کلک کرنا ہے، خانمیگو ظاہر ہو جائے گا، اور خانمیگو جاننا چاہتا ہے کہ کیا\nمیں اس میں تبدیلیاں کرنا چاہتا ہوں، اگر میں کچھ مختلف کرنے کی کوشش کرنا چاہتا ہوں، یا میں خانمیگو سے اس پر بات کر سکتا ہوں کیونکہ ہم اسے مل کر تخلیق کر رہے ہیں۔  . مجھے لگتا ہے کہ میں صرف\nکچھ مختلف کرنے کی کوشش کرنا چاہتا ہوں۔ اور جیسے ہی میں بٹن کو منتخب کرتا ہوں، Khanmigo تیزی سے میرے طلباء کے لیے\nایک نئی وارم اپ سرگرمی تخلیق کرتا ہے۔ مجھے یہ بہت بہتر پسند ہے۔ اب چونکہ میرا سبق کا منصوبہ\nبالکل ویسا ہی ہے جیسا میں چاہتا ہوں، میرے پاس چند اختیارات ہیں: میں اسباق کو پرنٹ کر سکتا ہوں، یا میں اسے آسانی سے\nورڈ دستاویز، پی ڈی ایف میں ایکسپورٹ کر سکتا ہوں، یا اسے اپنی گوگل ڈرائیو میں محفوظ کر سکتا ہوں۔ اس سے میرا بہت وقت بچ گیا ہے۔ آپ کا بہت شکریہ، خانمیگو۔ ایک معلم کے طور پر، میں\nطلباء کو گریڈ لیول کے متن اور الفاظ سے روشناس کرانے کی اہمیت کو سمجھتا ہوں۔ تاہم، فہم کے ساتھ اس کا توازن\n \nطلباء کے لیے سیکھنے کے مجموعی تجربے کے لیے بہت ضروری ہے۔ لیولر کی خصوصیت،\nمیرے نئے پسندیدہ ٹولز میں سے ایک، \nطلباء کے پڑھنے کی سطح سے مطابقت رکھنے کے لیے متن کی پیچیدگی کو ایڈجسٹ کرتی ہے، ہر طالب علم کی ضروریات کے مطابق گریڈ لیول کے مواد اور ذاتی نوعیت کی ہدایات کے ساتھ مشغول ہونے کے دوران سمجھ بوجھ کو یقینی بناتی ہے۔ \n ایک بار جب میں لیولر فیچر کو منتخب کر لیتا ہوں، مجھے صرف Khanmigo کو\nمتن کا عنوان بتانا ہوگا اور پھر فراہم کردہ جگہ میں اصل متن کو کاپی اور پیسٹ کرنا ہوگا۔ میری سائنس کلاس میں اگلی اکائی تتلی کے لائف سائیکل پر ہے۔ میں پانچویں جماعت کا استاد ہوں؛ تاہم، میرے پاس چند طلباء ہیں جو فی الحال\nدوسری جماعت کی سطح پر پڑھ رہے ہیں، اس لیے میں ان کے لیے اس متن کو ایڈجسٹ کرنے جا رہا ہوں۔ اور چند سیکنڈوں میں،\nKhanmigo وہی متن بناتا ہے لیکن\nمیرے طلبہ کے لیے دوسری جماعت کے پڑھنے کی سطح پر، تاکہ میرے تمام طلبہ تتلی کی زندگی کے چکر کو سمجھ سکیں۔ اگلی خصوصیت جسے میں دریافت کرنا چاہوں گا وہ ہے Chunk Text کی خصوصیت۔ یہ ناقابل یقین ٹول مجھے پیچیدہ متن کو\nکاٹنے کے سائز کے ٹکڑوں میں تبدیل کرنے کی اجازت دیتا ہے، جو نوجوان سیکھنے والوں کے لیے بہترین ہے۔ یہ ٹول سمجھ میں اضافہ کرے گا،\nاعتماد میں اضافہ کرے گا، اور\nمیرے طلباء کے ساتھ پڑھنے کی محبت کو فروغ دے گا۔ جب میں Chunk Text کی خصوصیت کو منتخب کرتا ہوں، میں عنوان اور متن داخل کرتا ہوں، اور پھر میں Khanmigo کو صرف اس قسم کے ٹکڑوں کی اجازت دیتا ہوں جو میں چاہتا ہوں۔ کیا میں فہم کے لیے آئیڈیاز کے ذریعے ایک لمبا متن کا ٹکڑا کرنا چاہتا ہوں\n یا\nروانی کے لیے فقروں کے ذریعے مختصر متن کا ٹکڑا کرنا چاہتا ہوں؟ میں واقعی چاہتا ہوں کہ میرے طلباء\nاس ہفتے روانی پر کام کریں، لہذا میں اسے منتخب کرنے جا رہا ہوں۔ اور چند سیکنڈوں میں، Khanmigo\nمتن کو چھوٹے حصوں میں تبدیل کر دیتا ہے، جو سمجھنے میں مدد کرتا ہے اور\nنوجوان سیکھنے والوں کے لیے پڑھنا کم خوفزدہ کرتا ہے۔ یہ اعتماد اور پڑھنے کی مہارت پیدا کرنے کا ایک بہترین طریقہ ہے۔\n ایک معلم کے طور پر، میرا مقصد \nاپنے طلباء کے لیے مخصوص موضوعات کے مطابق فکر انگیز گفتگو کے اشارے تیار کرنا ہے۔ میرا مقصد ان کے تجسس کو بھڑکانا اور فکری گفتگو کو متحرک کرنا ہے، اس لیے میں\nڈسکشن پرامپٹ فیچر استعمال کرنے جا رہا ہوں۔ مجھے صرف خانمیگو کو گریڈ لیول اور موضوع سے آگاہ کرنا ہے۔ ہم\n اپنی تاریخ کی کلاس میں امریکی انقلاب پر کام کرنے والے ہیں۔ اور چند سیکنڈوں میں، Khanmigo متعدد مفصل اور فکر انگیز بحث کے سوالات تخلیق کرتا ہے جو یقینی طور پر\nمیرے طالب علموں کو چیٹنگ کرنے پر اکساتے ہیں لیکن اچھے طریقے سے۔ نیوز لیٹر ٹول ابتدائی اساتذہ کے لیے ایک\nمواصلاتی پاور ہاؤس ہے۔ نیوز لیٹر ٹول اساتذہ کو حسب ضرورت نیوز لیٹر بنانے کی اجازت دیتا ہے۔ آپ اپ ڈیٹس، تصاویر،\nیاد دہانیاں اور بہت کچھ شامل کر سکتے ہیں۔ ایک بار بن جانے کے بعد، اسے آسانی سے\nوالدین کے ساتھ ای میل یا پرنٹ کے ذریعے شیئر کیا جا سکتا ہے۔  والدین کو اپنے بچے کی تعلیم کے بارے میں باخبر رکھنے کا یہ ایک آسان موثر طریقہ ہے۔\n جب میں کلاس نیوز لیٹر کا فیچر کھولتا ہوں، تو مجھے صرف خانمیگو کو\nاپنی کلاس کا نام بتانا ہوتا ہے، ہم نے پچھلے ہفتے کیا کیا،\nاگلے ہفتے ہم کیا کر رہے ہیں، اور کوئی دوسری معلومات\nجو میں شامل کرنا چاہوں گا۔ باقی کام خانمیگو کریں گے۔ میرا نیوز لیٹر بننے کے بعد، اسے\nوالدین کے ساتھ ای میل یا پرنٹ کے ذریعے باآسانی شیئر کیا جا سکتا ہے۔  والدین کو اپنے بچے کی تعلیم کے بارے میں باخبر رکھنے کا یہ ایک آسان موثر طریقہ ہے۔\n شکریہ، خانمیگو۔ میرے نئے پسندیدہ\nٹولز میں سے ایک اور IEP اسسٹنٹ ہے، جو اساتذہ کو \nطلباء کے لیے انفرادی تعلیمی منصوبے بنانے میں مدد کرتا ہے۔ یہ پورے عمل میں اساتذہ کی رہنمائی کرتا ہے،\n طالب علم کی ضروریات کی شناخت میں مدد کرتا ہے،\nقابل حصول اہداف کا تعین کرتا ہے، اور مناسب مدد کی منصوبہ بندی کرتا ہے۔ IEP اسسٹنٹ کھولنے پر، Khanmigo\nآپ کے طالب علم کے بارے میں اہم سوالات پوچھتا ہے، جیسے کہ سیکھنے کا ماحول،\nمعذوری کا زمرہ، طالب علم کو موجودہ چیلنجز، طالب علم کی موجودہ طاقت۔ پھر، ایک بار جب آپ\nان تمام زمروں کو پُر کر لیتے ہیں، تو آپ چند سیکنڈوں میں رہائش کا منصوبہ تیار کر سکتے ہیں۔\n اور کسی بھی وقت میں، Khanmigo \nآپ کے طالب علم کے لیے ایک حسب ضرورت تفصیلی انفرادی تعلیمی منصوبہ بناتا ہے جس میں رہائش،\nتجاویز، سمارٹ اہداف اور بہت کچھ شامل ہوتا ہے۔  انفرادی تعلیمی منصوبے بناتے وقت IEP اسسٹنٹ واقعی ایک گیم چینجر ہے، اس بات کو \n یقینی بناتے ہوئے کہ آپ کے ہر طالب علم کو وہ مدد ملے جس کی انہیں ضرورت ہے۔ اگر آپ اپنے\nطالب علموں کے لیے سیکھنے کے لیے ایک دلچسپ تفریحی طریقہ تلاش کر رہے ہیں، تو آپ کو ہماری فن کلاس سمری نظم کی خصوصیت کو آزمانا ہوگا۔ یہ آپ کے طلباء کے لیے اسباق کا خلاصہ کرنے کا ایک انوکھا ردھم والا طریقہ ہے۔ آئیے اسے آزماتے ہیں۔ جب میں بٹن کو منتخب کرتا ہوں، خانمیگو چاہتا ہے کہ میں اپنے طلباء سے پوچھوں کہ انہوں نے آج کیا سیکھا۔ وہ سب چیختے ہیں \"چودھری!\" اور میں بہت پرجوش ہوں کہ\nانہیں وہ نام یاد ہے۔ اس کے بعد، خانمیگو چاہتا ہے کہ میں\nان سے ایک تفریحی لفظ طلب کروں جو ہماری نظم کو متاثر کرے۔ ایک طالب علم چیختا ہے \"فلفی\"؛ مجھے لگتا ہے کہ انہوں نے ایک نئی بلی حاصل کی ہوگی۔ پھر، خانمیگو باقی کام کریں گے۔ اور چند سیکنڈوں میں، خانمیگو ہماری تفریحی کلاس کی نظم بناتا ہے۔ چوکور، اوہ بہت تیز۔ چار اطراف، کوئی بھی زیادہ بھرا ہوا. مستطیل، مربع، اور trapezoid. جیومیٹری میں، ان سے بچنا مشکل ہے۔ رومبس، پتنگ، متوازی علامت۔ چوکور فام کا تمام حصہ۔ تو یاد رکھو، جھنجھلاہٹ میں مت رہو۔ چوکور چپل دار ہیں، سخت نہیں! جیسا کہ آپ دیکھ سکتے ہیں، یہ صرف ایک نظم نہیں ہے۔ یہ میموری کو بڑھانے والا،\nتخلیقی صلاحیتوں کو بڑھانے والا، اور ایک زبردست سیکھنے والا\nٹول ہے جسے آپ کے طلباء پسند کریں گے۔ شکریہ، خانمیگو۔ جیسا کہ آپ دیکھ سکتے ہیں، خانمیگو کو\nاپنے کلاس روم کے معمولات میں ضم کرنا آپ کو\nخانمیگو کے خیالات اور تجاویز کو اپنے نصاب کے مطابق بنانے کا اختیار دیتا ہے، جبکہ\nطالب علم کی ضروریات، سیکھنے کے مقاصد\nاور تخلیقی وسائل کو مدنظر رکھتے ہوئے۔ Khanmigo's Insights نہ صرف \nآپ کے تمام طلبہ کے لیے سیکھنے کے تجربے کو مزید تقویت بخشے گی، بلکہ یہ آپ کا وقت بھی خالی کرے گی، جس سے آپ اس بات\nپر توجہ مرکوز کر سکیں گے کہ اصل میں کیا اہم ہے: آپ کے طلبہ۔ شکریہ، خانمیگو۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ خانمیگو کلاس روم میں آپ اور آپ کے طلباء کی کس طرح مدد کر سکتا ہے،\n اپنی اسکرین پر موجود لنکس پر عمل کریں۔ اور خان اکیڈمی پر نئے مفت کورس کے مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں،\n سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola, soy Michelle, una especialista en aprendizaje profesional\naquí en Khan Academy y ex\nmaestra de aula, como tú. Me gustaría presentarles a Khanmigo, su compañero impulsado por IA\nque está revolucionando la enseñanza para ofrecer una experiencia más atractiva y\neficiente. Khanmigo tiene muchas\ncaracterísticas interesantes que apoyan a los profesores, y este video mostrará\nformas en que puede usar Khanmigo para crear contenido básico específico para mejorar la experiencia de aprendizaje\nde todos sus estudiantes. A lo largo de este video, exploraremos formas en que Khanmigo puede ayudar a los\nmaestros de escuela primaria a crear\nplanes de lecciones únicos y atractivos y actividades centradas en los estudiantes que los entusiasmen con el aprendizaje y, al mismo tiempo, les ahorren tiempo.  ¿ Listo para ver al\nasistente de enseñanza que siempre quisiste? Vamos a ver. Este es el Panel de Khanmigo, su centro de potentes funciones únicas diseñadas magistralmente con precisión para mejorar su experiencia docente y maximizar su tiempo para que pueda dedicarlo a lo más importante:\ncon sus estudiantes. Comencemos nuestra exploración con la función Objetivo de aprendizaje. Es fundamental que los profesores tengan un objetivo de aprendizaje antes de enseñar porque da forma al camino de la lección y deja claras las expectativas de los estudiantes. Ahora, pongámoslo en acción. Para utilizar la herramienta Objetivo de aprendizaje, Khanmigo solo necesita saber en\nqué nivel de grado enseña y cuál es su tema. Estamos a punto de comenzar una unidad\nsobre multiplicación de fracciones. Khanmigo, por favor ayúdame a\nescribir un objetivo de aprendizaje. Y en cuestión de segundos, Khanmigo crea un\nobjetivo de aprendizaje que puedo utilizar para guiar el resto de mi lección. Ahora que tenemos nuestro objetivo de aprendizaje, pasemos al\ngancho de lección, porque seamos realistas, no se trata sólo de enseñar.  Se trata de crear\nexperiencias atractivas y memorables que mejoren la\ncomprensión y la retención de los estudiantes.  Con el apoyo de Khanmigo, los\nprofesores podrán diseñar introducciones de lecciones cautivadoras que enciendan la curiosidad de los estudiantes y despierten su sed de conocimiento. Una vez que abro la\nherramienta Lesson Hook, todo lo que tengo que hacer es informar a Khanmigo el\nnivel de grado y el tema de la lección. Multiplicar fracciones.\nKhanmigo hará el resto. Y en cuestión de segundos, Khanmigo crea tres\nfantásticos ganchos de lección que seguramente despertarán la\ncuriosidad de mis alumnos y aumentarán su participación. Esta es una excelente manera de\nhacer que el aprendizaje sea emocionante desde el principio. Movido por la curiosidad de mi alumno, ahora estoy entusiasmado y listo para\ncrear un increíble plan de lección.  La función Plan de lecciones de Khanmigo\nme ayudará rápidamente a elaborar un plan que se\nalinee con mi plan de estudios y satisfaga las necesidades de mis alumnos. Cuando selecciono el botón Plan de lección, Khanmigo me pide que especifique el tema que planeo enseñar. Luego ofrece una variedad de temas de la extensa lista de cursos de Khan Academy. Si mi tema no está incluido, Khanmigo me da la\nopción de agregar el mío. Veo mi lección aquí, así que seleccionaré esta. Rápidamente, Khanmigo genera\nun plan de lección completo que se alinea con mi plan de estudios. El plan incluye objetivos de aprendizaje, actividades de aprendizaje como calentamientos, instrucción directa, práctica independiente, preguntas sobre el boleto de salida, evaluaciones y mucho más para garantizar una experiencia de aprendizaje integral\npara mi clase. Además, estos planes de lecciones\nson totalmente personalizables. Puedo modificar fácilmente cualquier sección para adaptarla mejor a las necesidades de mis alumnos, ya sea el\nobjetivo, las actividades o esta actividad de preparación. Todo lo que tengo que hacer es hacer clic\nen él, aparecerá Khanmigo y Khanmigo quiere saber si\nquiero hacer cambios, si quiero probar algo diferente o podría discutirlo con Khanmigo porque estamos co-creando esto juntos.  . Creo que sólo quiero\nprobar algo diferente. Y tan pronto como selecciono el botón, Khanmigo crea rápidamente\nuna nueva actividad de calentamiento para mis alumnos. Me gusta este mucho más. Ahora que mi plan de lección es\nexactamente como lo quiero, tengo algunas opciones: puedo imprimir la lección o exportarla fácilmente\na un documento de Word, PDF o guardarla en mi Google Drive. Esto me ha ahorrado mucho tiempo; Muchas gracias Khanmigo. Como educador, entiendo\nel valor de exponer a los estudiantes a textos y vocabulario de nivel de grado. Sin embargo, equilibrar esto con\nla comprensión es crucial para la experiencia general de aprendizaje\nde los estudiantes. La función Leveler, una\nde mis nuevas herramientas favoritas, ajusta la complejidad del texto para que\ncoincida con los niveles de lectura de los estudiantes, lo que garantiza la comprensión mientras interactúa con el material del nivel de grado y la instrucción personalizada\nsegún las necesidades de cada estudiante. Una vez que selecciono la función Nivelador, solo tengo que informarle a Khanmigo\nel título del texto y luego copiar y pegar el texto original en el espacio provisto. La siguiente unidad de mi clase de ciencias trata sobre el ciclo de vida de una mariposa. Soy maestra de quinto grado; sin embargo, tengo algunos estudiantes que actualmente están leyendo\nen un nivel de segundo grado, así que voy a ajustar este texto para ellos. Y en cuestión de segundos,\nKhanmigo crea el mismo texto pero en un nivel de lectura de segundo grado\npara mis alumnos, para que todos mis alumnos puedan comprender el ciclo de vida de una mariposa. La siguiente característica que me gustaría explorar es la función Texto fragmentado. Esta increíble herramienta me permite transformar texto complejo\nen fragmentos pequeños, lo cual es perfecto para estudiantes jóvenes. Esta herramienta mejorará\nla comprensión, aumentará la confianza y fomentará el amor por la\nlectura en mis alumnos. Cuando selecciono la función Texto fragmentado, ingreso el título y el texto, y luego le dejo a Khanmigo el tipo de fragmentos que quiero.  ¿ Quiero dividir un texto más largo\nen ideas para la comprensión o un texto más corto\nen frases para mejorar la fluidez? Realmente quiero que mis alumnos\ntrabajen en la fluidez esta semana, así que seleccionaré este. Y en cuestión de segundos, Khanmigo transforma el\ntexto en fragmentos más pequeños, lo que ayuda a la comprensión y hace que la lectura sea menos\nintimidante para los estudiantes jóvenes. Es una excelente manera de desarrollar\nconfianza y habilidades de lectura. Como educador, mi objetivo es crear temas de debate que inviten a la reflexión y adaptados a\ntemas específicos para mis alumnos. Mi objetivo es despertar su curiosidad y estimular el discurso intelectual, por eso voy a utilizar la\nfunción Mensaje de debate. Sólo tengo que informarle a Khanmigo el nivel de grado y el tema. Estamos a punto de trabajar sobre\nla Revolución Americana en mi clase de historia. Y en cuestión de segundos, Khanmigo crea múltiples preguntas de discusión detalladas y estimulantes que seguramente harán que\nmis alumnos conversen, pero en el buen sentido. La herramienta Newsletter es un\ncentro de comunicación para profesores de primaria. La herramienta de boletines permite a los profesores crear boletines personalizados. Puede agregar actualizaciones, fotos,\nrecordatorios y mucho más. Una vez creado, se puede\ncompartir fácilmente con los padres por correo electrónico o imprimirlo. Es una forma sencilla y eficaz\nde mantener a los padres informados sobre la educación de sus hijos. Cuando abro la función Boletín informativo de la clase, solo tengo que informarle a Khanmigo\nel nombre de mi clase, lo que hicimos la semana pasada,\nlo que haremos la próxima semana y cualquier otra información\nque me gustaría incluir. Khanmigo hará el resto. Una vez creado mi boletín, puedo compartirlo fácilmente con los\npadres por correo electrónico o imprimirlo. Es una forma sencilla y eficaz\nde mantener a los padres informados sobre la educación de sus hijos. Gracias, Khanmigo. Otra de mis nuevas\nherramientas favoritas es el Asistente IEP, que ayuda a los profesores a elaborar planes educativos individualizados\npara los estudiantes. Guía a los maestros a lo largo de\ntodo el proceso, ayudando a identificar las necesidades de los estudiantes,\nestableciendo metas alcanzables y planificando apoyos apropiados. Al abrir el Asistente del IEP, Khanmigo hace\npreguntas importantes sobre su estudiante, como el entorno de aprendizaje,\nla categoría de discapacidad, los desafíos actuales que tiene el estudiante y sus fortalezas actuales. Luego, una vez que complete\ntodas esas categorías, podrá redactar un\nplan de alojamiento en cuestión de segundos. Y en muy poco tiempo, Khanmigo crea un plan educativo individualizado, detallado y personalizado\npara su estudiante que incluye alojamiento,\nsugerencias, objetivos inteligentes y mucho más. El Asistente del IEP realmente cambia las reglas del juego al crear\nplanes educativos individualizados, asegurando que cada uno de sus estudiantes reciba el apoyo que necesita. Si está buscando una forma divertida y atractiva de que sus\nalumnos aprendan, debe probar nuestra función Poema divertido de resumen de clase. Es una forma rítmica única de resumir las lecciones para sus alumnos. Hagamos un intento. Cuando selecciono el botón, Khanmigo quiere que les pregunte a mis alumnos qué aprendieron hoy. Todos gritan \"¡Cuadriláteros!\" y me hace mucha ilusión que\nrecuerden ese nombre. Luego, Khanmigo quiere que\nles pida una palabra divertida que inspire nuestro poema. Un estudiante grita \"Fluffy\"; Creo que deben haber conseguido un gato nuevo. Luego, Khanmigo hará el resto. Y en cuestión de segundos, Khanmigo crea nuestro divertido poema de clase. Cuadriláteros, qué esponjosos. Cuatro lados, ninguno demasiado sofocante. Rectángulo, cuadrados y trapezoide. En geometría, son difíciles de evitar. Rombo, cometa, paralelogramo. Todo parte de la familia cuadrilátera. Así que recuerda, no te enfades.  ¡ Los cuadriláteros son esponjosos, no duros! Como puedes ver, no es sólo un poema. Es un refuerzo de la memoria,\nun potenciador de la creatividad y una herramienta de aprendizaje genial que a\ntus alumnos les encantará. Gracias, Khanmigo. Como puede ver, integrar Khanmigo en\nsu rutina de clase le permite adaptar las\nideas y sugerencias de Khanmigo a su plan de estudios, teniendo en cuenta las\nnecesidades de los estudiantes, los objetivos de aprendizaje\ny los recursos creativos. Khanmigo's Insights no solo enriquecerá la experiencia de aprendizaje\nde todos sus estudiantes, sino que también le liberará tiempo, permitiéndole concentrarse\nen lo que realmente importa: sus estudiantes. Gracias, Khanmigo. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo Khanmigo puede ayudarlo a usted y a sus\nalumnos en el aula, siga los enlaces en su pantalla. Y para no perderse nunca anuncios interesantes sobre nuevos materiales de cursos gratuitos\nen Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- مرحبًا، أنا ميشيل، متخصصة في التعلم المهني\nهنا في أكاديمية خان ومعلمة سابقة في الفصل الدراسي\n، مثلك تمامًا. أود أن أقدم لك Khanmigo، رفيقك المعتمد على الذكاء الاصطناعي\nوالذي أحدث ثورة في التدريس من أجل تجربة أكثر جاذبية\nوكفاءة. يحتوي Khanmigo على العديد من\nالميزات المثيرة التي تدعم المعلمين، وسيعرض هذا الفيديو\nالطرق التي يمكنك من خلالها استخدام Khanmigo لإنشاء محتوى أساسي محدد لتعزيز تجربة التعلم\nلجميع طلابك. خلال هذا الفيديو، سنستكشف الطرق التي يمكن لـ Khanmigo من خلالها مساعدة\nمعلمي المدارس الابتدائية في إنشاء\nخطط دروس فريدة وجذابة وأنشطة تتمحور حول الطالب والتي تجعل الطلاب متحمسين للتعلم مع توفير الوقت.  هل أنت مستعد لرؤية\nمساعد التدريس الذي طالما أردته؟ لنلقي نظرة. هذه هي لوحة تحكم Khanmigo، مركز الميزات القوية الفريدة المصممة ببراعة ودقة لتعزيز تجربة التدريس الخاصة بك وزيادة وقتك إلى أقصى حد حتى تتمكن من قضاء الوقت في المكان الأكثر أهمية:\nمع طلابك. فلنبدأ استكشافنا باستخدام ميزة الأهداف التعليمية.  من المهم جدًا أن يكون لدى المعلمين هدف تعليمي قبل التدريس لأنه يشكل مسار الدرس ويجعل توقعات الطلاب واضحة. الآن، دعونا نضعها موضع التنفيذ. لاستخدام أداة الأهداف التعليمية، يحتاج خانميغو فقط إلى معرفة\nمستوى الصف الذي تقوم بتدريسه وما هو موضوعك. نحن على وشك البدء بوحدة\nحول ضرب الكسور. خانميغو، الرجاء مساعدتي في\nكتابة هدف التعلم. وفي غضون ثوانٍ، ينشئ خانميغو\nهدفًا تعليميًا يمكنني استخدامه للمساعدة في توجيه بقية الدرس. الآن وبعد أن أصبح لدينا هدفنا التعليمي، فلننتقل إلى \"\nخطاف الدرس\"، لأننا لنواجه الأمر، فالأمر لا يتعلق بالتدريس فقط. يتعلق الأمر بإنشاء تجارب جذابة لا تُنسى\n تعمل على تعزيز\nفهم الطلاب واستبقائهم. وبدعم من خانميغو،\nسيتمكن المعلمون من تصميم مقدمات دروس جذابة تثير فضول الطلاب وتثير التعطش للمعرفة. بمجرد أن أفتح\nأداة ربط الدروس، كل ما علي فعله هو السماح لـ Khanmigo بمعرفة\nمستوى الصف وموضوع الدرس. ضرب الكسور.\nسوف يقوم خانميغو بالباقي. وفي غضون ثوانٍ، أنشأ خانميغو ثلاث\nخطافات رائعة للدروس والتي من المؤكد أنها ستثير\nفضول طلابي وتزيد من تفاعلهم. هذه طريقة رائعة\nلجعل التعلم مثيرًا منذ البداية.  لقد أشعلني فضول طلابي، وأنا الآن متحمس ومستعد\nلإنشاء خطة درس مذهلة.  ستساعدني ميزة خطة الدرس في Khanmigo\nبسرعة في صياغة خطة\nتتوافق مع المنهج الدراسي الخاص بي وتلبي احتياجات طلابي. عندما أحدد زر خطة الدرس، يطالبني خانميغو بتحديد الموضوع الذي أخطط لتدريسه. ثم يقدم بعد ذلك مجموعة متنوعة من المواضيع من قائمة الدورات الشاملة لأكاديمية خان. إذا لم يتم تضمين الموضوع الخاص بي، فإن Khanmigo يمنحني\nخيار إضافة الموضوع الخاص بي. أرى الدرس الخاص بي هنا، لذا سأختار هذا الدرس. على الفور، يقوم خانميغو بإنشاء\nخطة درس شاملة تتوافق مع المنهج الدراسي الخاص بي. تتضمن الخطة أهدافًا تعليمية وأنشطة تعليمية مثل عمليات الإحماء والتعليم المباشر والممارسة المستقلة وأسئلة تذكرة الخروج والتقييمات وغير ذلك الكثير لضمان \nتجربة تعليمية شاملة لفصلي. بالإضافة إلى ذلك، فإن خطط الدروس هذه قابلة\nللتخصيص بالكامل. يمكنني بسهولة تعديل أي قسم ليناسب احتياجات طلابي بشكل أفضل، سواء كان ذلك\nالهدف أو الأنشطة أو هذا النشاط التمهيدي. كل ما علي فعله هو النقر\nعليه، وسيظهر خانميغو، ويريد خانميغو معرفة ما إذا\nكنت أريد إجراء تغييرات عليه، أو إذا كنت أريد تجربة شيء مختلف، أو يمكنني مناقشة الأمر مع خانميغو لأننا نشارك في إنشاء هذا معًا  . أعتقد أنني أريد فقط\nتجربة شيء مختلف. وبمجرد تحديد الزر، يقوم خانميغو بسرعة بإنشاء\nنشاط إحماء جديد لطلابي. أعجبني هذا أكثر. الآن بعد أن أصبحت خطة الدرس الخاصة بي\nبالطريقة التي أريدها تمامًا، لدي بعض الخيارات: يمكنني طباعة الدرس، أو يمكنني بسهولة تصديره\nإلى مستند Word، أو PDF، أو حفظه على Google Drive.  لقد وفر لي هذا الكثير من الوقت. شكرا جزيلا لك، خانميجو. كمعلم، أفهم\nقيمة تعريض الطلاب للنصوص والمفردات على مستوى الصف الدراسي. ومع ذلك، فإن تحقيق التوازن بين ذلك\nوالفهم أمر بالغ الأهمية لتجربة التعلم الشاملة\nللطلاب.  تعمل ميزة Leveler،\nإحدى أدواتي المفضلة الجديدة، على ضبط تعقيد النص ليتناسب مع\nمستويات القراءة لدى الطلاب، مما يضمن الفهم أثناء التعامل مع مواد مستوى الصف الدراسي والتعليمات المخصصة التي تلبي\nاحتياجات كل طالب. بمجرد تحديد ميزة Leveler، يجب علي فقط السماح لـ Khanmigo\nبمعرفة عنوان النص ثم نسخ النص الأصلي ولصقه في المساحة المتوفرة. الوحدة التالية في صف العلوم تدور حول دورة حياة الفراشة. أنا معلمة للصف الخامس؛ ومع ذلك، لدي عدد قليل من الطلاب الذين يقرؤون حاليًا\nفي مستوى الصف الثاني، لذلك سأقوم بتعديل هذا النص لهم. وفي غضون ثوانٍ،\nأنشأ خانميغو نفس النص ولكن على مستوى القراءة للصف الثاني\nلطلابي، حتى يتمكن جميع طلابي من فهم دورة حياة الفراشة. الميزة التالية التي أود استكشافها هي ميزة Chunk Text. تسمح لي هذه الأداة المذهلة بتحويل النص المعقد\nإلى أجزاء صغيرة الحجم، وهو مثالي للمتعلمين الصغار. ستعمل هذه الأداة على تعزيز\nالفهم وتعزيز الثقة وتعزيز حب\nالقراءة لدى طلابي. عندما أحدد ميزة Chunk Text، أقوم بإدخال العنوان والنص، ثم أسمح لـ Khanmigo بنوع القطع التي أريدها. هل أرغب في تقسيم نص أطول\nمن خلال أفكار للفهم أو تقسيم نص أقصر من\nخلال عبارات من أجل الطلاقة؟ أريد حقًا أن\nيعمل طلابي على الطلاقة هذا الأسبوع، لذا سأختار هذا. وفي غضون ثوانٍ، يقوم Khanmigo بتحويل\nالنص إلى أجزاء أصغر، مما يساعد على الفهم ويجعل القراءة أقل\nرهبة للمتعلمين الصغار. إنها طريقة رائعة لبناء\nالثقة ومهارات القراءة. كمعلم، أهدف إلى صياغة مناقشات مثيرة للتفكير ومصممة خصيصًا\nلموضوعات محددة لطلابي. هدفي هو إثارة فضولهم وتحفيز الخطاب الفكري، لذلك سأستخدم\nميزة \"موجه المناقشة\". عليّ فقط أن أخبر خانميغو بمستوى الصف والموضوع. نحن على وشك العمل على\nالثورة الأمريكية في صف التاريخ الخاص بي. وفي غضون ثوانٍ، يقوم Khanmigo بإنشاء العديد من أسئلة المناقشة التفصيلية والمثيرة للتفكير والتي من المؤكد أنها ستجعل\nطلابي يدردشون ولكن بطريقة جيدة.  تعد أداة النشرة الإخبارية بمثابة\nقوة اتصال لمعلمي المرحلة الابتدائية. تتيح أداة النشرة الإخبارية للمعلمين إنشاء رسائل إخبارية مخصصة. يمكنك إضافة التحديثات والصور\nوالتذكيرات وغير ذلك الكثير. بمجرد إنشائه، يمكن\nمشاركته بسهولة مع أولياء الأمور عبر البريد الإلكتروني أو الطباعة. إنها طريقة بسيطة وفعالة\nلإبقاء الآباء على اطلاع بشأن تعليم أطفالهم. عندما أفتح ميزة النشرة الإخبارية للفصل، كل ما علي فعله هو السماح لـ Khanmigo\nبمعرفة اسم فصلي، وما فعلناه في الأسبوع الماضي،\nوما سنفعله في الأسبوع المقبل، وأي معلومات أخرى\nأود تضمينها. سوف يقوم خانميغو بالباقي. بمجرد إنشاء رسالتي الإخبارية، يمكن مشاركتها بسهولة مع\nأولياء الأمور عبر البريد الإلكتروني أو الطباعة. إنها طريقة بسيطة وفعالة\nلإبقاء الآباء على اطلاع بشأن تعليم أطفالهم. شكرا خانميجو. إحدى أدواتي المفضلة الجديدة\nهي مساعد IEP، الذي يساعد المعلمين على صياغة خطط تعليمية فردية\nللطلاب. فهو يرشد المعلمين خلال\nالعملية برمتها، ويساعد في تحديد احتياجات الطلاب،\nوتحديد أهداف قابلة للتحقيق، وتخطيط الدعم المناسب. عند فتح مساعد برنامج التعليم الفردي (IEP Assistant)، يطرح خانميغو\nأسئلة مهمة حول طالبك، مثل بيئة التعلم،\nوفئة الإعاقة، والتحديات الحالية التي يواجهها الطالب، ونقاط القوة الحالية التي يتمتع بها الطالب. وبعد ذلك، بمجرد ملء\nجميع هذه الفئات، يمكنك صياغة\nخطة الإقامة في غضون ثوانٍ. وفي أي وقت من الأوقات على الإطلاق، يقوم Khanmigo بإنشاء خطة تعليمية فردية ومفصلة مخصصة\nلطلابك تتضمن الإقامة\nوالاقتراحات والأهداف الذكية وغير ذلك الكثير.  يُعد مساعد برنامج التعليم الفردي (IEP Assistant) بمثابة تغيير حقيقي لقواعد اللعبة عند إنشاء\nخطط تعليمية فردية، مما يضمن حصول كل طالب من طلابك على الدعم الذي يحتاجه. إذا كنت تبحث عن طريقة ممتعة وجذابة للتعلم\nلطلابك، فعليك تجربة ميزة Fun Class Summary Poem الخاصة بنا. إنها طريقة إيقاعية فريدة لتلخيص الدروس لطلابك. دعنا نعطيها محاولة. عندما أحدد الزر، يريد خانميغو أن أسأل طلابي عما تعلموه اليوم. كلهم يصرخون \"رباعي الأضلاع!\" وأنا متحمس جدًا لأنهم\nيتذكرون هذا الاسم. بعد ذلك، يريد خانميغو مني\nأن أطلب منهم كلمة ممتعة تلهم قصيدتنا. أحد الطلاب يصرخ \"رقيق\". أعتقد أنهم حصلوا على قطة جديدة. ثم سيقوم خانميغو بالباقي. وفي غضون ثوانٍ، ينشئ خانميغو قصيدتنا الصفية الممتعة. رباعيات، أوه رقيق جدًا. أربعة جوانب، لا شيء خانق للغاية. المستطيل والمربعات وشبه المنحرف. في الهندسة، من الصعب تجنبها. المعين، الطائرة الورقية، متوازي الأضلاع. كل جزء من العائلة الرباعية. لذا تذكر، لا تكن في حالة من الغضب. الرباعيات رقيقه وليست صعبه! كما ترون، إنها ليست مجرد قصيدة. إنها أداة معززة للذاكرة،\nومُحسِّنة للإبداع، \nوأداة تعليمية رائعة للغاية سيحبها طلابك. شكرا خانميجو. كما ترون، فإن دمج Khanmigo في\nروتين الفصل الدراسي الخاص بك يمكّنك من تصميم\nأفكار واقتراحات Khanmigo لتناسب منهجك الدراسي، مع\nالأخذ في الاعتبار احتياجات الطلاب وأهداف التعلم\nوالموارد الإبداعية. لن تعمل رؤى خانميغو على إثراء تجربة التعلم\nلجميع طلابك فحسب، بل ستوفر أيضًا وقتك، مما يتيح لك التركيز\nعلى ما يهم حقًا: طلابك. شكرا خانميجو. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد حول كيفية دعم Khanmigo لك\nولطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك. وحتى لا تفوت أبدًا الإعلانات المثيرة حول المواد الدراسية المجانية الجديدة\nفي أكاديمية خان، تأكد من الاشتراك.",
    "t_italian": "- Ciao, sono Michelle, una specialista dell'apprendimento professionale\nqui alla Khan Academy ed ex\ninsegnante di classe, proprio come te. Vorrei presentarti Khanmigo, il tuo compagno basato sull'intelligenza artificiale\nche sta rivoluzionando l'insegnamento per un'esperienza più coinvolgente ed\nefficiente. Khanmigo ha molte\nfunzionalità interessanti che supportano gli insegnanti e questo video mostrerà\ni modi in cui puoi utilizzare Khanmigo per creare contenuti specifici di base per migliorare l'esperienza di apprendimento\nper tutti i tuoi studenti. In questo video esploreremo i modi in cui Khanmigo può assistere gli\ninsegnanti delle scuole elementari nella creazione di\nprogrammi di lezioni unici e coinvolgenti e di attività incentrate sullo studente che stimolano gli studenti ad apprendere e fanno risparmiare tempo. Pronto a vedere l'\nassistente didattico che hai sempre desiderato? Diamo un'occhiata. Questa è la Dashboard di Khanmigo, il tuo hub di potenti funzionalità uniche progettate magistralmente con precisione per migliorare la tua esperienza di insegnamento e massimizzare il tuo tempo in modo da poterlo trascorrere dove è più importante:\ncon i tuoi studenti. Iniziamo la nostra esplorazione con la funzione Obiettivo di apprendimento. È fondamentale che gli insegnanti abbiano un obiettivo di apprendimento prima di insegnare perché modella il percorso della lezione e rende chiare le aspettative degli studenti. Ora mettiamolo in azione. Per utilizzare lo strumento Obiettivo di apprendimento, Khanmigo deve solo sapere a\nquale livello insegni e qual è il tuo argomento. Stiamo per iniziare un'unità\nsulla moltiplicazione delle frazioni. Khanmigo, per favore aiutami a\nscrivere un obiettivo di apprendimento. E in pochi secondi, Khanmigo crea un\nobiettivo di apprendimento che posso utilizzare per guidare il resto della lezione. Ora che abbiamo il nostro obiettivo di apprendimento, passiamo al Lesson\nHook, perché ammettiamolo, non si tratta solo di insegnare.  Si tratta di creare\nesperienze coinvolgenti e memorabili che migliorino la\ncomprensione e la fidelizzazione degli studenti. Grazie al potere di Khanmigo,\ngli insegnanti saranno in grado di progettare introduzioni alle lezioni accattivanti che accendono la curiosità degli studenti e stimolano la sete di conoscenza. Una volta aperto lo\nstrumento Lesson Hook, tutto ciò che devo fare è comunicare a Khanmigo il\nlivello del voto e l'argomento della lezione. Moltiplicazione delle frazioni.\nKhanmigo farà il resto. E in pochi secondi, Khanmigo crea tre\nfantastici Lesson Hooks che sicuramente susciteranno la\ncuriosità dei miei studenti e aumenteranno il loro coinvolgimento. Questo è un ottimo modo per\nrendere l'apprendimento entusiasmante fin dall'inizio. Acceso dalla curiosità dei miei studenti, ora sono entusiasta e pronto a\ncreare uno straordinario programma di lezione.  La funzione Piano di lezione di Khanmigo\nmi aiuterà rapidamente a creare un piano\nin linea con il mio curriculum e che soddisfi le esigenze dei miei studenti. Quando seleziono il pulsante Programma lezione, Khanmigo mi chiede di specificare l'argomento che intendo insegnare. Offre quindi una varietà di argomenti dall'ampio elenco di corsi di Khan Academy. Se il mio argomento non è incluso, Khanmigo mi dà la\npossibilità di aggiungerne uno mio. Vedo la mia lezione qui, quindi selezionerò questa. Immediatamente, Khanmigo genera\nun piano di lezione approfondito che si allinea al mio curriculum. Il piano include obiettivi di apprendimento, attività di apprendimento come riscaldamento, istruzioni dirette, pratica indipendente, domande sui ticket di uscita, valutazioni e molto altro ancora per garantire un'esperienza di apprendimento a tutto tondo\nper la mia classe. Inoltre, questi piani di lezione\nsono completamente personalizzabili. Posso facilmente modificare qualsiasi sezione per adattarla meglio alle esigenze dei miei studenti, che si tratti dell'obiettivo\n, delle attività o di questa attività di riscaldamento. Tutto quello che devo fare è cliccarci\nsopra, apparirà Khanmigo e Khanmigo vuole sapere se\nvoglio apportare modifiche, se voglio provare qualcosa di diverso o potrei discuterne con Khanmigo perché lo stiamo co-creando insieme  . Penso che voglio solo\nprovare qualcosa di diverso. E non appena seleziono il pulsante, Khanmigo crea rapidamente\nuna nuova attività di riscaldamento per i miei studenti. Questo qui mi piace molto di più. Ora che il mio programma di lezione è\nesattamente come lo desidero, ho alcune opzioni: posso stampare la lezione oppure esportarla facilmente\nin un documento Word, un PDF o salvarla sul mio Google Drive. Questo mi ha fatto risparmiare così tanto tempo; grazie mille, Khanmigo. Come educatore, capisco\nil valore di esporre gli studenti al testo e al vocabolario di livello scolastico. Tuttavia, bilanciare questo aspetto con la\ncomprensione è fondamentale per l’esperienza di apprendimento complessiva\ndegli studenti. La funzione Livellatore, uno\ndei miei nuovi strumenti preferiti, regola la complessità del testo per\nadattarlo ai livelli di lettura degli studenti, garantendo la comprensione e al tempo stesso l'interazione con materiale di livello scolastico e istruzioni personalizzate in base alle\nesigenze di ogni studente. Una volta selezionata la funzione Leveler, non mi resta che comunicare a Khanmigo\nil titolo del testo e poi copiare e incollare il testo originale nell'apposito spazio. La prossima unità del mio corso di scienze riguarda il ciclo di vita di una farfalla. Sono un insegnante di quinta elementare; tuttavia, ho alcuni studenti che attualmente leggono\na livello di seconda elementare, quindi adatterò questo testo per loro. E in pochi secondi,\nKhanmigo crea lo stesso testo ma a un livello di lettura di seconda elementare\nper i miei studenti, in modo che tutti i miei studenti possano comprendere il ciclo di vita di una farfalla. La prossima funzionalità che mi piacerebbe esplorare è la funzione Chunk Text. Questo incredibile strumento mi consente di trasformare testi complessi\nin piccoli pezzi, perfetti per i giovani studenti. Questo strumento migliorerà\nla comprensione, aumenterà la fiducia e favorirà l'amore per\nla lettura tra i miei studenti. Quando seleziono la funzione Chunk Text, inserisco il titolo e il testo, quindi lascio a Khanmigo il tipo di blocchi che desidero. Voglio suddividere un testo più lungo\nin base a idee per la comprensione o suddividere un testo più breve\nin frasi per renderlo più fluido? Voglio davvero che i miei studenti\nlavorino sulla fluidità questa settimana, quindi selezionerò questo. E in pochi secondi, Khanmigo trasforma il\ntesto in parti più piccole, il che aiuta la comprensione e rende la lettura meno\nintimidatoria per i giovani studenti. È un ottimo modo per sviluppare\nsicurezza e capacità di lettura. Come educatore, miro a creare spunti di discussione stimolanti su misura per\nargomenti specifici per i miei studenti.  Il mio obiettivo è accendere la loro curiosità e stimolare il discorso intellettuale, quindi utilizzerò la\nfunzione Richiesta di discussione. Devo solo far sapere a Khanmigo il livello della scuola e l'argomento. Stiamo per lavorare sulla\nRivoluzione Americana nella mia lezione di storia. E in pochi secondi, Khanmigo crea molteplici domande di discussione dettagliate e stimolanti che sicuramente faranno\nchiacchierare i miei studenti, ma in senso positivo. Lo strumento Newsletter è un\npotente strumento di comunicazione per gli insegnanti elementari. Lo strumento newsletter consente agli insegnanti di creare newsletter personalizzate. Puoi aggiungere aggiornamenti, foto,\npromemoria e molto altro ancora. Una volta creato, può\nessere facilmente condiviso con i genitori via e-mail o stampato. È un modo semplice ed efficace\nper tenere informati i genitori sull'istruzione dei propri figli. Quando apro la funzione Newsletter di classe, devo solo far\nsapere a Khanmigo il nome della mia classe, cosa abbiamo fatto la scorsa settimana,\ncosa faremo la prossima settimana e qualsiasi altra informazione\nche vorrei includere. Khanmigo farà il resto. Una volta creata la mia newsletter, può essere facilmente condivisa con i\ngenitori via e-mail o stampata. È un modo semplice ed efficace\nper tenere informati i genitori sull'istruzione dei propri figli. Grazie, Khanmigo. Un altro dei miei nuovi\nstrumenti preferiti è l'Assistente IEP, che aiuta gli insegnanti a creare piani educativi personalizzati\nper gli studenti. Guida gli insegnanti attraverso\nl'intero processo, aiutando a identificare le esigenze degli studenti, a\nstabilire obiettivi raggiungibili e a pianificare supporti adeguati. All'apertura dell'Assistente IEP, Khanmigo pone\ndomande importanti sul tuo studente, come l'ambiente di apprendimento,\nla categoria di disabilità, le sfide attuali dello studente, i punti di forza attuali dello studente. Quindi, una volta compilate\ntutte queste categorie, puoi elaborare un\npiano di alloggio in pochi secondi. E in pochissimo tempo, Khanmigo crea un piano educativo personalizzato dettagliato e personalizzato\nper il tuo studente che include alloggio,\nsuggerimenti, obiettivi intelligenti e molto altro ancora. L'Assistente IEP è davvero un punto di svolta quando si creano\npiani educativi personalizzati, garantendo che ognuno dei tuoi studenti riceva il supporto di cui ha bisogno. Se stai cercando un modo divertente e coinvolgente per imparare per i tuoi\nstudenti, devi provare la nostra funzione Poesia di riepilogo della classe divertente. È un modo ritmico unico per riassumere le lezioni per i tuoi studenti. Proviamolo. Quando seleziono il pulsante, Khanmigo vuole che chieda ai miei studenti cosa hanno imparato oggi. Tutti gridano \"Quadrilateri!\" e sono così emozionato che si\nricordino quel nome. Quindi, Khanmigo vuole che\nchieda loro una parola divertente che ispirerà la nostra poesia. Uno studente grida \"Fluffy\"; Penso che abbiano preso un nuovo gatto. Poi Khanmigo farà il resto. E in pochi secondi, Khanmigo crea la nostra divertente poesia di classe. Quadrilateri, oh così soffici. Quattro lati, nessuno troppo soffocante. Rettangolo, quadrati e trapezio. In geometria, sono difficili da evitare. Rombo, aquilone, parallelogramma. Tutti facenti parte del quadrilatero fam. Quindi ricorda, non arrabbiarti. I quadrilateri sono soffici, non resistenti! Come puoi vedere, non è solo una poesia. È un potenziatore della memoria,\nun potenziatore della creatività e uno strumento di apprendimento fantastico che i\ntuoi studenti adoreranno. Grazie, Khanmigo. Come puoi vedere, l' integrazione di Khanmigo nella\nroutine della tua classe ti consente di adattare le\nidee e i suggerimenti di Khanmigo al tuo curriculum, tenendo conto\ndelle esigenze degli studenti, degli obiettivi di apprendimento\ne delle risorse creative. Khanmigo's Insights non solo arricchirà l'esperienza di apprendimento\ndi tutti i tuoi studenti, ma ti libererà anche tempo, permettendoti di concentrarti\nsu ciò che conta veramente: i tuoi studenti. Grazie, Khanmigo. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come Khanmigo può supportare te e i tuoi\nstudenti in classe, segui i collegamenti sullo schermo. E per non perdere mai gli entusiasmanti annunci sui nuovi materiali dei corsi gratuiti\nsu Khan Academy, assicurati di iscriverti."
}