{
    "source": "Ak-1MtnbzUg",
    "youtubelink": "https://www.youtube.com/watch?v=Ak-1MtnbzUg",
    "t_english": "- Hi, I'm Michelle, a professional learning specialist here at Khan Academy, and a former classroom teacher just like you. Meet Khanmigo, your AI driven companion who's revolutionizing teaching for a more engaging and efficient experience. Khanmigo has many exciting features that support teachers, and this video will showcase ways that you can use Khanmigo to create core specific science content to enhance the learning experience for all of your students. Throughout this video, we'll explore ways Khanmigo can assist you with creating unique and engaging lesson plans and student-centered activities that get students excited about science while saving you time. Ready to see the teaching assistant you've always wanted? Let's take a look. This is Khanmigo's dashboard. It's filled with a plethora of unique and helpful features designed to enhance your teaching experience and save you time. Let's start with the lesson hook feature. Igniting a passion for science in students can be challenging, but it's profoundly impactful and a definite game changer when successful. With Khanmigo's assistance, I can craft captivating lesson openers that ignite student curiosity and science. My next unit is going to be about erosion and weathering, so I'm gonna go ahead and type that here. I am a sixth grade teacher, and then I'm going to just ask Khanmigo to write some lesson hooks for me, and in a matter of seconds, Khanmigo comes up with three fantastic lesson hooks that I can use with my students. If for some reason I don't like one of them, no worries at all. All I have to do is highlight it and ask Khanmigo for assistance. With Khanmigo, I can chat about it. I can ask Khanmigo to make changes to it, or I just don't like it, so I can ask Khanmigo to try something different and Khanmigo will oblige. These ideas are great. My students are gonna be super excited about starting our new unit on erosion and weathering. Thanks, Khanmigo. Now that I've piqued my students' interest in this topic, it's time to plan my lesson. Khanmigo's lesson plan feature will assist me with creating a detailed lesson plan tailored to my curriculum and my students' needs. When I select the lesson plan button, Khanmigo prompts me to describe the topic I'm planning to teach. Once Khanmigo has that information, a list of available topics from one of the amazing Khan Academy courses populates for me to select from. If my topic isn't available on Khan Academy, no worries, Khanmigo lets me select my own content. Here's a video that I'm interested in having my students watch. I'm going to select it. As soon as I make my choice, Khanmigo springs into action to create a structured and detailed lesson plan tailored to my curriculum and student needs. Once the lesson plan is created, I'm able to view the objectives, the materials needed, activities, assessments, and so, so, so much more, ensuring a comprehensive learning experience for my students. Also, the lesson plans are fully customizable. You can easily modify any part of the lesson plan to better suit your needs and preferences. You can simply click on the part of the lesson you wanna change and ask Khanmigo for help, or you can just edit it directly. Whether it's the warmup, the objectives, the activity, the assessments, you have full control over the content. Once you are completely satisfied with your lesson, you have the ability to print your lesson directly, or you can export it to a Microsoft Word, a PDF, or save it to your Google Drive. This saved me so much time. Thank you so much, Khanmigo. As an educator, I aim to bridge classroom learning with real life scenarios to enhance my students' engagement with the topic. Khanmigo's real world context generator will do just that for me in a matter of seconds boosting my students' interest and investment in the topic. All I have to do is let Khanmigo know my grade level and the topic. We are currently working on the water cycle and Khanmigo instantly is going to give me some ideas. These ideas are great. I know that sometime in their lives, my students have either boiled water themselves or have seen someone boil water. They all know what plants are, and they've all experienced a rainy day. These ideas are fantastic. Thanks, Khanmigo. Another cool feature is the leveler, which lets me customize the complexity of text to align with my students' reading levels, allowing me to personalize instruction and effectively address each student's needs. Once I open the leveler, I just have to let Khanmigo know the title of the text. Ionic Compound Structure. This is for my 11th grade chemistry class, and then I just copy and paste the original text into the box and let Khanmigo know the level that I'd like this text rewritten for. This is for one of my students who's currently reading on a seventh grade level, and as soon as I hit the button, Khanmigo will revise the text for me at a seventh grade reading level. As you can see, integrating Khanmigo into your classroom routine empowers you to tailor Khanmigo's ideas and suggestions to your science curriculum while factoring in student needs, learning objectives and creative resources. Khanmigo's insights will not only enrich the learning experience for all of your students, but it will also free up your time, enabling you to concentrate on what truly matters, your students. Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen. And to never miss exciting announcements about new free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، \nیہاں خان اکیڈمی میں ایک پیشہ ور سیکھنے کی ماہر ہوں، اور آپ کی طرح ایک سابقہ ​​کلاس روم\nٹیچر ہوں۔ خانمیگو سے ملیں، جو آپ کے AI سے چلنے والے ساتھی ہیں جو زیادہ پرکشش اور موثر تجربے کے لیے تدریس میں انقلاب برپا کر رہے ہیں۔\n Khanmigo میں بہت ساری دلچسپ\nخصوصیات ہیں جو اساتذہ کی مدد کرتی ہیں، اور یہ ویڈیو ان طریقوں کو ظاہر کرے گی\nجن سے آپ اپنے تمام طلباء کے لیے سیکھنے کے تجربے کو بڑھانے کے لیے بنیادی مخصوص سائنس مواد بنانے کے لیے Khanmigo کو استعمال کر سکتے ہیں۔ \n اس پورے ویڈیو کے دوران،\nہم ان طریقوں کی کھوج کریں گے جن سے Khanmigo منفرد اور دل چسپ اسباق کے منصوبے بنانے میں آپ کی مدد کر سکتا ہے اور\nطلباء پر مبنی سرگرمیاں جو آپ کا وقت بچانے کے ساتھ ساتھ طلباء کو سائنس کے بارے میں پرجوش کرتی ہیں۔ اس ٹیچنگ اسسٹنٹ کو دیکھنے کے لیے تیار ہیں جسے\nآپ ہمیشہ چاہتے ہیں؟ آئیے ایک نظر ڈالتے ہیں۔ یہ Khanmigo کا ڈیش بورڈ ہے۔ یہ آپ کے تدریسی تجربے کو بڑھانے\nاور آپ کا وقت بچانے کے لیے ڈیزائن کردہ منفرد اور مددگار خصوصیات سے بھرا ہوا ہے۔ آئیے سبق ہک کی خصوصیت کے ساتھ شروع کریں۔ طالب علموں میں سائنس کے لیے جنون کو بھڑکانا مشکل ہو سکتا ہے، لیکن کامیاب ہونے پر یہ گہرا اثر انگیز اور یقینی گیم\nچینجر ہے۔ خانمیگو کی مدد سے، میں دلکش اسباق کو تیار کر سکتا ہوں جو طلباء کے تجسس اور سائنس کو بھڑکاتے ہیں۔ میرا اگلا یونٹ\nکٹاؤ اور موسم کے بارے میں ہونے والا ہے، لہذا میں آگے بڑھ کر اسے یہاں ٹائپ کرنے والا ہوں۔ میں چھٹی جماعت کا استاد ہوں، اور پھر میں خانمیگو سے صرف میرے لیے کچھ اسباق کے ہکس لکھنے کو کہوں گا، اور چند ہی سیکنڈوں میں، خانمیگو\nتین شاندار اسباق کے ہکس لے کر آتا ہے جو میں اپنے طلباء کے ساتھ استعمال کر سکتا ہوں۔ اگر کسی وجہ سے میں ان میں\nسے ایک کو پسند نہیں کرتا ہوں تو کوئی فکر نہیں۔ مجھے بس اسے اجاگر کرنا ہے اور خانمیگو سے مدد کے لیے کہنا ہے۔ خانمیگو کے ساتھ، میں اس کے بارے میں بات کر سکتا ہوں۔ میں Khanmigo سے اس میں تبدیلیاں کرنے کے لیے کہہ سکتا ہوں، یا مجھے یہ پسند نہیں ہے،\nاس لیے میں Khanmigo سے کچھ مختلف کرنے کو کہہ سکتا ہوں \nاور Khanmigo اس کی پابندی کرے گا۔ یہ خیالات بہت اچھے ہیں۔ میرے طلباء\n کٹاؤ اور موسمیاتی تبدیلی پر ہماری نئی یونٹ شروع کرنے کے بارے میں بہت پرجوش ہوں گے۔ شکریہ، خانمیگو۔ اب جب کہ میں نے اپنے\nطلباء کی اس موضوع میں دلچسپی پیدا کردی ہے، اب وقت آگیا ہے کہ میں اپنے سبق کی منصوبہ بندی کروں۔ Khanmigo کے سبق کے منصوبے کی\nخصوصیت میرے نصاب\nاور میرے طلباء کی ضروریات کے مطابق ایک تفصیلی سبقی منصوبہ بنانے میں میری مدد کرے گی۔ جب میں سبق کی منصوبہ بندی کا بٹن منتخب کرتا ہوں، خانمیگو مجھے اس موضوع کی وضاحت کرنے کا اشارہ کرتا ہے جسے میں پڑھانے کا سوچ رہا ہوں۔ خانمیگو کے پاس یہ معلومات ہونے کے بعد، خان اکیڈمی کے حیرت انگیز کورسز میں سے ایک کے دستیاب عنوانات کی فہرست\n \nمیرے لیے منتخب کرنے کے لیے تیار ہو جاتی ہے۔ اگر میرا موضوع\nخان اکیڈمی پر دستیاب نہیں ہے، تو پریشان ہونے کی کوئی بات نہیں، خانمیگو مجھے اپنا مواد خود منتخب کرنے دیتا ہے۔ یہ ایک ویڈیو ہے جسے میں اپنے طلباء کو دیکھنے میں دلچسپی رکھتا ہوں۔ میں اسے منتخب کرنے جا رہا ہوں۔ جیسے ہی میں اپنا انتخاب کرتا ہوں، خانمیگو میرے نصاب اور طلباء کی ضروریات کے مطابق\nایک منظم اور تفصیلی سبق کا منصوبہ بنانے کے لیے حرکت میں آتا ہے۔\n ایک بار سبق کا منصوبہ بن جانے کے بعد، میں اپنے طلباء کے لیے ایک جامع سیکھنے کے تجربے کو یقینی بنانے کے لیے مقاصد، درکار مواد، سرگرمیاں، تشخیصات، اور اسی طرح بہت کچھ دیکھنے کے قابل ہو جاتا ہوں۔  اس کے \n علاوہ، سبق کے منصوبے\nمکمل طور پر حسب ضرورت ہیں۔ آپ\n اپنی ضروریات اور ترجیحات کے مطابق سبق کے منصوبے کے کسی بھی حصے میں آسانی سے ترمیم کر سکتے ہیں۔ آپ اس سبق کے اس حصے پر کلک کر سکتے ہیں جسے آپ تبدیل کرنا چاہتے ہیں\nاور خانمیگو سے مدد طلب کر سکتے ہیں، یا آپ اسے براہ راست ترمیم کر سکتے ہیں۔ چاہے یہ وارم اپ ہو، مقاصد،\nسرگرمی، تشخیص، آپ کو مواد پر مکمل کنٹرول حاصل ہے۔ ایک بار جب آپ\nاپنے سبق سے پوری طرح مطمئن ہو جاتے ہیں، تو آپ\nاپنے اسباق کو براہ راست پرنٹ کرنے کی صلاحیت رکھتے ہیں، یا آپ اسے Microsoft Word، PDF میں برآمد کر سکتے ہیں،\n یا اسے اپنی Google Drive میں محفوظ کر سکتے ہیں۔ اس سے میرا بہت وقت بچ گیا۔ آپ کا بہت شکریہ، خانمیگو۔ ایک معلم کے طور پر، میرا مقصد\nکلاس روم کی تعلیم کو حقیقی زندگی کے منظرناموں کے ساتھ ملانا ہے تاکہ موضوع کے ساتھ\nاپنے طلباء کی مصروفیت کو بڑھایا جا سکے۔ Khanmigo کا حقیقی دنیا کے سیاق و سباق کا جنریٹر میرے لیے\nکچھ ہی لمحوں میں اس موضوع میں میرے طلباء کی دلچسپی\nاور سرمایہ کاری کو بڑھاوا دے گا۔ مجھے صرف اتنا کرنا ہے کہ\nخانمیگو کو میرے گریڈ لیول اور موضوع سے آگاہ کریں۔ ہم فی الحال\nواٹر سائیکل پر کام کر رہے ہیں اور Khanmigo فوری طور پر\nمجھے کچھ خیالات دینے والا ہے۔ یہ خیالات بہت اچھے ہیں۔ میں جانتا ہوں کہ اپنی زندگی میں کبھی کبھی، میرے طالب علموں نے یا تو\nخود پانی اُبالا ہے یا کسی کو پانی اُبلتے ہوئے دیکھا ہے۔ وہ سب جانتے ہیں کہ پودے کیا ہیں، اور ان سب نے بارش کے دن کا تجربہ کیا ہے۔ یہ خیالات لاجواب ہیں۔ شکریہ، خانمیگو۔ ایک اور عمدہ خصوصیت لیولر ہے، جو مجھے\nمتن کی پیچیدگی کو اپنے طلباء کے پڑھنے کی سطح کے مطابق بنانے کی اجازت دیتا ہے، جس سے مجھے ہدایات کو ذاتی بنانے اور\nہر طالب علم کی ضروریات کو مؤثر طریقے سے پورا کرنے کی اجازت ملتی ہے۔ ایک بار جب میں لیولر کھولتا ہوں، مجھے صرف خانمیگو کو\nمتن کا عنوان بتانا ہوتا ہے۔ آئنک کمپاؤنڈ ڈھانچہ۔ یہ میری 11ویں جماعت کی کیمسٹری کلاس کے لیے ہے، اور پھر میں\nاصل متن کو باکس میں کاپی اور پیسٹ کرتا ہوں اور\nخانمیگو کو اس سطح سے آگاہ کرتا ہوں جس کے لیے میں اس متن کو دوبارہ لکھنا چاہتا ہوں۔ یہ میرے ایک طالب علم کے لیے ہے\nجو فی الحال ساتویں جماعت کی سطح پر پڑھ رہا ہے، اور جیسے ہی میں بٹن دباؤں گا، Khanmigo میرے لیے ساتویں جماعت کے پڑھنے کی سطح پر متن پر نظر ثانی کرے گا۔ جیسا کہ آپ دیکھ سکتے ہیں، خانمیگو کو اپنے کلاس روم کے معمولات میں ضم کرنے سے آپ کو\n \nطالب علم کی ضروریات، سیکھنے کے مقاصد\nاور تخلیقی وسائل کو مدنظر رکھتے ہوئے اپنے سائنس کے نصاب کے مطابق خانمیگو کے خیالات اور تجاویز کو تیار کرنے کا اختیار ملتا ہے۔ Khanmigo کی بصیرتیں نہ صرف \nآپ کے تمام طلبہ کے لیے سیکھنے کے تجربے کو مزید تقویت بخشیں گی، بلکہ یہ آپ کا وقت بھی خالی کرے گی، جس سے آپ اس بات پر توجہ مرکوز کر سکیں گے کہ آپ کے طلبہ\nکیا واقعی اہم ہیں۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ\nخانمیگو کلاس روم میں آپ اور آپ کے طلباء کی کس طرح مدد کر سکتا ہے، اپنی اسکرین پر موجود لنکس پر عمل کریں۔ اور خان اکیڈمی پر\nنئے مفت کورس کے مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں، سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola, soy Michelle, una especialista en aprendizaje profesional\naquí en Khan Academy y ex\nmaestra de aula como tú. Conozca a Khanmigo, su compañero impulsado por IA que está revolucionando la enseñanza para brindar una experiencia más atractiva y\neficiente. Khanmigo tiene muchas\nfunciones interesantes que apoyan a los profesores, y este video mostrará\nformas en que puede utilizar Khanmigo para crear contenido científico básico específico para mejorar la experiencia de aprendizaje\nde todos sus estudiantes. A lo largo de este video,\nexploraremos las formas en que Khanmigo puede ayudarlo a crear planes de lecciones únicos y atractivos y\nactividades centradas en los estudiantes que los entusiasmen con la ciencia y, al mismo tiempo, le ahorren tiempo.  ¿ Listo para ver al\nasistente de enseñanza que siempre quisiste? Vamos a ver. Este es el panel de Khanmigo. Está repleto de una gran cantidad de funciones únicas y útiles diseñadas para mejorar su experiencia docente\ny ahorrarle tiempo. Comencemos con la función de gancho de lección. Despertar la pasión por la ciencia en los estudiantes puede ser un desafío, pero tiene un profundo impacto y definitivamente\ncambia las reglas del juego cuando se logra. Con la ayuda de Khanmigo, puedo crear lecciones cautivadoras que despierten la curiosidad y la ciencia de los estudiantes. Mi próxima unidad será\nsobre la erosión y la meteorización, así que seguiré escribiendo eso aquí. Soy profesor de sexto grado y luego le pediré a Khanmigo que me escriba algunos ganchos de lecciones y, en cuestión de segundos, Khanmigo presenta\ntres fantásticos ganchos de lecciones que puedo usar con mis alumnos. Si por alguna razón\nno me gusta alguno de ellos, no te preocupes. Todo lo que tengo que hacer es resaltarlo y pedirle ayuda a Khanmigo. Con Khanmigo puedo charlar sobre ello. Puedo pedirle a Khanmigo que le haga cambios, o simplemente no me gusta,\nasí que puedo pedirle a Khanmigo que pruebe algo diferente\ny Khanmigo lo hará. Estas ideas son geniales. Mis alumnos estarán\nmuy emocionados de comenzar nuestra nueva unidad sobre erosión y meteorización. Gracias, Khanmigo. Ahora que he despertado el\ninterés de mis alumnos en este tema, es hora de planificar mi lección.  La función de plan de lección de Khanmigo\nme ayudará a crear un plan de lección detallado adaptado a mi plan de estudios\ny a las necesidades de mis alumnos. Cuando selecciono el botón del plan de lección, Khanmigo me pide que describa el tema que planeo enseñar. Una vez que Khanmigo tiene esa información, aparece una lista de temas disponibles\nde uno de los increíbles cursos de Khan Academy\npara que yo pueda seleccionarlos. Si mi tema no está disponible\nen Khan Academy, no te preocupes, Khanmigo me permite seleccionar mi propio contenido. Aquí hay un video que me interesa que vean mis alumnos. Voy a seleccionarlo. Tan pronto como hago mi elección, Khanmigo entra en acción\npara crear un plan de lección estructurado y detallado\nadaptado a mi plan de estudios y a las necesidades de mis estudiantes. Una vez creado el plan de lección, puedo ver los objetivos, los materiales necesarios, las actividades, las evaluaciones y mucho más, asegurando una\nexperiencia de aprendizaje integral para mis alumnos. Además, los planes de lecciones\nson totalmente personalizables. Puede modificar fácilmente cualquier\nparte del plan de lección para adaptarlo mejor a sus necesidades y preferencias. Puedes simplemente hacer clic en la parte de la lección que deseas cambiar\ny pedirle ayuda a Khanmigo, o simplemente puedes editarla directamente. Ya sea el calentamiento, los objetivos, la\nactividad, las evaluaciones, tienes control total sobre el contenido. Una vez que esté completamente\nsatisfecho con su lección, podrá\nimprimirla directamente o exportarla a\nMicrosoft Word, PDF o guardarla en su Google Drive. Esto me ahorró mucho tiempo. Muchas gracias Khanmigo. Como educador, mi objetivo es\nunir el aprendizaje en el aula con escenarios de la vida real para\nmejorar la participación de mis alumnos con el tema.  El generador de contexto del mundo real de Khanmigo hará precisamente eso por mí\nen cuestión de segundos, aumentando el interés\ny la inversión de mis alumnos en el tema. Todo lo que tengo que hacer es\ninformarle a Khanmigo mi nivel de grado y el tema. Actualmente estamos trabajando\nen el ciclo del agua y Khanmigo inmediatamente\nme dará algunas ideas. Estas ideas son geniales. Sé que en algún momento de sus vidas, mis alumnos han\nhervido agua ellos mismos o han visto a alguien hervir agua. Todos saben qué son las plantas y todos han experimentado un día lluvioso. Estas ideas son fantásticas. Gracias, Khanmigo. Otra característica interesante es el nivelador, que me permite personalizar\nla complejidad del texto para alinearlo con los niveles de lectura de mis alumnos, lo que me permite personalizar la instrucción y abordar de manera efectiva las\nnecesidades de cada estudiante. Una vez que abro el nivelador, solo tengo que informarle a Khanmigo\nel título del texto. Estructura del compuesto iónico. Esto es para mi clase de química de 11º grado, y luego copio y\npego el texto original en el cuadro y le digo a\nKhanmigo para qué nivel me gustaría reescribir este texto. Esto es para uno de mis alumnos\nque actualmente está leyendo en un nivel de lectura de séptimo grado, y tan pronto como presione el botón, Khanmigo revisará el texto por mí en un nivel de lectura de séptimo grado. Como puede ver, integrar Khanmigo en su rutina de clase le permite adaptar las\nideas y sugerencias de Khanmigo a su plan de estudios de ciencias, teniendo en cuenta las\nnecesidades de los estudiantes, los objetivos de aprendizaje\ny los recursos creativos.  Los conocimientos de Khanmigo no solo enriquecerán la experiencia de aprendizaje\nde todos sus estudiantes, sino que también le liberarán tiempo, permitiéndole concentrarse\nen lo que realmente importa: sus estudiantes. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus alumnos en el aula, siga los enlaces en su pantalla. Y para no perderse nunca\nanuncios interesantes sobre nuevos materiales de cursos gratuitos en Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- مرحبًا، أنا ميشيل، أخصائية تعلم محترفة\nهنا في أكاديمية خان، ومعلمة سابقة\nمثلك تمامًا. تعرف على Khanmigo، رفيقك الذي يعتمد على الذكاء الاصطناعي والذي أحدث ثورة في التدريس من أجل تجربة أكثر جاذبية\nوكفاءة. يحتوي Khanmigo على العديد من\nالميزات المثيرة التي تدعم المعلمين، وسيعرض هذا الفيديو\nالطرق التي يمكنك من خلالها استخدام Khanmigo لإنشاء محتوى علمي أساسي محدد لتعزيز تجربة التعلم\nلجميع طلابك. خلال هذا الفيديو،\nسنستكشف الطرق التي يمكن أن يساعدك بها Khanmigo في إنشاء خطط دروس فريدة وجذابة\nوأنشطة تتمحور حول الطلاب والتي تجعل الطلاب متحمسين للعلوم مع توفير الوقت.  هل أنت مستعد لرؤية\nمساعد التدريس الذي طالما أردته؟ لنلقي نظرة. هذه لوحة تحكم خانميغو. إنها مليئة بعدد كبير من الميزات الفريدة والمفيدة المصممة لتحسين تجربة التدريس الخاصة بك\nوتوفير وقتك. لنبدأ بميزة ربط الدرس.  قد يكون إشعال شغف العلوم لدى الطلاب أمرًا صعبًا، ولكنه ذو تأثير عميق ويغير قواعد اللعبة بشكل واضح\nعند النجاح. بمساعدة خانميغو، يمكنني صياغة افتتاحيات جذابة للدروس تثير فضول الطلاب وحثهم على العلم. ستكون وحدتي التالية\nحول التآكل والتجوية، لذا سأمضي قدمًا وأكتبها هنا. أنا مدرس للصف السادس، ثم سأطلب من خانميغو أن يكتب لي بعض روابط الدروس، وفي غضون ثوانٍ، يأتي خانميغو بثلاثة\nروابط دروس رائعة يمكنني استخدامها مع طلابي. إذا لم أحب أحدهم لسبب ما\n، فلا داعي للقلق على الإطلاق. كل ما علي فعله هو تسليط الضوء عليه وطلب المساعدة من خانميغو. مع خانميغو، يمكنني الدردشة حول هذا الموضوع. يمكنني أن أطلب من خانميغو إجراء تغييرات عليه، أو لا يعجبني ذلك،\nلذا يمكنني أن أطلب من خانميغو تجربة شيء مختلف\nوسيستجيب خانميغو. هذه الأفكار عظيمة. سيكون طلابي\nمتحمسين جدًا لبدء وحدتنا الجديدة حول التآكل والتجوية. شكرا خانميجو. الآن بعد أن أثارت\nاهتمام طلابي بهذا الموضوع، فقد حان الوقت لتخطيط الدرس.  ستساعدني ميزة خطة الدرس في Khanmigo\n في إنشاء خطة درس مفصلة مصممة خصيصًا لمنهجي الدراسي\nواحتياجات طلابي. عندما أحدد زر خطة الدرس، يطالبني خانميغو بوصف الموضوع الذي أخطط لتدريسه. بمجرد حصول خانميغو على هذه المعلومات، ستظهر لي قائمة بالموضوعات المتاحة\nمن إحدى دورات أكاديمية خان الرائعة\nللاختيار من بينها. إذا لم يكن موضوعي متاحًا\nفي Khan Academy، فلا داعي للقلق، فإن Khanmigo يسمح لي باختيار المحتوى الخاص بي. إليك مقطع فيديو يهمني أن يشاهده طلابي. انا ذاهب لاختياره. بمجرد أن أقوم باختياري، يبدأ خانميغو في العمل\nلإنشاء خطة درس منظمة ومفصلة مصممة\nخصيصًا لتناسب مناهجي الدراسية واحتياجات الطلاب. بمجرد إنشاء خطة الدرس، أكون قادرًا على عرض الأهداف والمواد المطلوبة والأنشطة والتقييمات وما إلى ذلك، وأكثر من ذلك بكثير، مما يضمن\nتجربة تعليمية شاملة لطلابي. كما أن خطط الدروس\nقابلة للتخصيص بالكامل. يمكنك بسهولة تعديل أي\nجزء من خطة الدرس ليناسب احتياجاتك وتفضيلاتك بشكل أفضل. يمكنك ببساطة النقر على جزء الدرس الذي تريد تغييره\nوطلب المساعدة من خانميغو، أو يمكنك فقط تعديله مباشرة. سواء كان الأمر يتعلق بالإحماء، أو الأهداف، أو\nالنشاط، أو التقييمات، فلديك السيطرة الكاملة على المحتوى. بمجرد أن تكون\nراضيًا تمامًا عن الدرس، لديك القدرة على\nطباعة الدرس مباشرة، أو يمكنك تصديره إلى ملف\nMicrosoft Word أو PDF أو حفظه على Google Drive. هذا وفر لي الكثير من الوقت. شكرا جزيلا لك، خانميجو. كمعلم، أهدف إلى\nربط التعلم في الفصل الدراسي بسيناريوهات الحياة الواقعية\nلتعزيز تفاعل طلابي مع الموضوع.  سيفعل منشئ سياق العالم الحقيقي الخاص بـ Khanmigo ذلك\nفي غضون ثوانٍ لتعزيز اهتمام طلابي\nواستثمارهم في الموضوع. كل ما علي فعله هو إخبار\nخانميغو بمستوى صفي والموضوع. نحن نعمل حاليًا\nعلى دورة المياه \nوسيقدم لي خانميغو بعض الأفكار على الفور. هذه الأفكار عظيمة. أعلم أنه في وقت ما من حياتهم، قام طلابي إما\nبغلي الماء بأنفسهم أو رأوا شخصًا يغلي الماء. جميعهم يعرفون ما هي النباتات، وقد مروا جميعًا بيوم ممطر. هذه الأفكار رائعة. شكرا خانميجو. ميزة أخرى رائعة هي أداة التسوية، والتي تتيح لي تخصيص مدى\nتعقيد النص ليتوافق مع مستويات القراءة لدى طلابي، مما يسمح لي بتخصيص التعليمات ومعالجة\nاحتياجات كل طالب بشكل فعال. بمجرد أن أفتح أداة التسوية، يجب علي فقط أن أسمح لخانميغو\nبمعرفة عنوان النص. هيكل المركب الأيوني. هذا مخصص لفصل الكيمياء للصف الحادي عشر، ثم أقوم فقط بنسخ\nالنص الأصلي ولصقه في المربع\nوإعلام خانميغو بالمستوى الذي أرغب في إعادة كتابة هذا النص له. هذا لأحد طلابي\nالذي يقرأ حاليًا في مستوى القراءة في الصف السابع، وبمجرد الضغط على الزر، سيقوم خانميجو بمراجعة النص لي في مستوى القراءة في الصف السابع. كما ترون، فإن دمج Khanmigo في روتين الفصل الدراسي الخاص بك يمكّنك من تصميم\nأفكار واقتراحات Khanmigo لمناهج العلوم الخاصة بك مع\nالأخذ في الاعتبار احتياجات الطلاب وأهداف التعلم\nوالموارد الإبداعية. لن تعمل رؤى خانميغو على إثراء تجربة التعلم\nلجميع طلابك فحسب، بل ستوفر أيضًا وقتك، مما يتيح لك التركيز\nعلى ما يهم حقًا، أي طلابك. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد حول كيفية\nدعم Khanmigo لك ولطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك. وحتى لا تفوت أبدًا\nالإعلانات المثيرة حول المواد الدراسية المجانية الجديدة في أكاديمية خان، تأكد من الاشتراك.",
    "t_italian": "- Ciao, sono Michelle, una specialista dell'apprendimento professionale\nqui alla Khan Academy e un'ex\ninsegnante di classe proprio come te. Incontra Khanmigo, il tuo compagno guidato dall'intelligenza artificiale che sta rivoluzionando l'insegnamento per un'esperienza più coinvolgente ed\nefficiente. Khanmigo ha molte\nfunzionalità interessanti che supportano gli insegnanti e questo video mostrerà i\nmodi in cui puoi utilizzare Khanmigo per creare contenuti scientifici specifici di base per migliorare l'esperienza di apprendimento\nper tutti i tuoi studenti. In questo video\nesploreremo i modi in cui Khanmigo può aiutarti a creare programmi di lezioni unici e coinvolgenti e\nattività incentrate sugli studenti che entusiasmano gli studenti per la scienza facendoti risparmiare tempo. Pronto a vedere l'\nassistente didattico che hai sempre desiderato? Diamo un'occhiata. Questa è la dashboard di Khanmigo. È ricco di numerose funzionalità uniche e utili progettate per migliorare la tua esperienza di insegnamento\ne farti risparmiare tempo. Cominciamo con la funzione di hook della lezione. Accendere la passione per la scienza negli studenti può essere impegnativo, ma ha un profondo impatto e,\nin caso di successo, rappresenta una svolta decisiva. Con l'aiuto di Khanmigo, posso creare accattivanti aperture di lezione che accendono la curiosità e la scienza degli studenti. La mia prossima unità\nriguarderà l'erosione e gli agenti atmosferici, quindi andrò avanti e lo scriverò qui. Sono un insegnante di prima media, quindi chiederò semplicemente a Khanmigo di scrivere alcuni riassunti delle lezioni per me e, in pochi secondi, Khanmigo mi fornirà\ntre fantastici riassunti delle lezioni che posso usare con i miei studenti. Se per qualche motivo\nnon mi piace uno di loro, non preoccuparti affatto. Tutto quello che devo fare è evidenziarlo e chiedere assistenza a Khanmigo. Con Khanmigo posso parlarne. Posso chiedere a Khanmigo di apportare modifiche, oppure semplicemente non mi piace,\nquindi posso chiedere a Khanmigo di provare qualcosa di diverso\ne Khanmigo lo accontenterà. Queste idee sono fantastiche.  I miei studenti saranno\nsuper entusiasti di iniziare la nostra nuova unità sull'erosione e gli agenti atmosferici. Grazie, Khanmigo. Ora che ho suscitato l'\ninteresse dei miei studenti per questo argomento, è tempo di pianificare la mia lezione.  La funzione del piano di lezione di Khanmigo\nmi aiuterà a creare un piano di lezione dettagliato su misura per il mio curriculum\ne le esigenze dei miei studenti. Quando seleziono il pulsante del programma della lezione, Khanmigo mi chiede di descrivere l'argomento che intendo insegnare. Una volta che Khanmigo ha queste informazioni, viene visualizzato un elenco di argomenti disponibili\nda uno degli straordinari corsi della Khan Academy tra cui\nposso scegliere. Se il mio argomento non è disponibile\nsu Khan Academy, non preoccuparti, Khanmigo mi consente di selezionare i miei contenuti. Ecco un video che mi interessa far guardare ai miei studenti. Lo selezionerò. Non appena faccio la mia scelta, Khanmigo entra in azione\nper creare un piano di lezioni strutturato e dettagliato su\nmisura per il mio curriculum e le esigenze degli studenti. Una volta creato il programma della lezione, posso visualizzare gli obiettivi, i materiali necessari, le attività, le valutazioni e molto altro ancora, garantendo un'esperienza di apprendimento completa\n per i miei studenti. Inoltre, i piani delle lezioni\nsono completamente personalizzabili. Puoi modificare facilmente qualsiasi\nparte del programma della lezione per adattarlo meglio alle tue esigenze e preferenze. Puoi semplicemente fare clic sulla parte della lezione che desideri modificare\ne chiedere aiuto a Khanmigo, oppure puoi semplicemente modificarla direttamente. Che si tratti del riscaldamento, degli obiettivi, dell'attività\n, delle valutazioni, hai il pieno controllo sui contenuti. Una volta che sei completamente\nsoddisfatto della tua lezione, hai la possibilità di\nstamparla direttamente oppure puoi esportarla in\nMicrosoft Word, PDF o salvarla sul tuo Google Drive. Questo mi ha fatto risparmiare così tanto tempo. Grazie mille, Khanmigo. Come educatore, miro a\ncollegare l'apprendimento in classe con scenari di vita reale per\nmigliorare il coinvolgimento dei miei studenti con l'argomento.  Il generatore di contesto del mondo reale di Khanmigo farà proprio questo per me\nin pochi secondi, aumentando l'interesse\ne l'investimento dei miei studenti nell'argomento. Tutto quello che devo fare è far\nsapere a Khanmigo il mio livello scolastico e l'argomento. Attualmente stiamo lavorando\nsul ciclo dell'acqua e Khanmigo\nmi darà immediatamente alcune idee. Queste idee sono fantastiche. So che qualche volta nella loro vita, i miei studenti hanno\nbollito l'acqua da soli o hanno visto qualcuno bollire l'acqua. Sanno tutti cosa sono le piante e tutti hanno vissuto una giornata piovosa. Queste idee sono fantastiche. Grazie, Khanmigo. Un'altra caratteristica interessante è il livellatore, che mi consente di personalizzare\nla complessità del testo per allinearlo ai livelli di lettura dei miei studenti, permettendomi di personalizzare l'istruzione e soddisfare in modo efficace le\nesigenze di ogni studente. Una volta aperto il livellatore non mi resta che comunicare a Khanmigo\nil titolo del testo. Struttura dei composti ionici. Questo è per la mia lezione di chimica dell'undicesimo grado, quindi copio e\nincollo il testo originale nella casella e faccio\nsapere a Khanmigo il livello per il quale vorrei che questo testo fosse riscritto. Questo è per uno dei miei studenti\nche attualmente sta leggendo a un livello di lettura di seconda media e non appena premo il pulsante, Khanmigo rivedrà il testo per me a un livello di lettura di seconda media. Come puoi vedere, l'integrazione di Khanmigo nella routine della tua classe ti consente di adattare le\nidee e i suggerimenti di Khanmigo al tuo curriculum scientifico, tenendo conto\ndelle esigenze degli studenti, degli obiettivi di apprendimento\ne delle risorse creative.  Gli approfondimenti di Khanmigo non solo arricchiranno l'esperienza di apprendimento\ndi tutti i tuoi studenti, ma ti libereranno anche tempo, permettendoti di concentrarti\nsu ciò che conta veramente: i tuoi studenti. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo. E per non perdere mai gli entusiasmanti\nannunci sui nuovi materiali dei corsi gratuiti su Khan Academy, assicurati di iscriverti."
}