{
    "source": "AqZdQFW6KdQ",
    "youtubelink": "https://www.youtube.com/watch?v=AqZdQFW6KdQ",
    "t_english": "- Hi, I'm Michelle, a Professional Learning Specialist here at Khan Academy, and a former classroom teacher just like you. Meet Khanmigo, your AI power teaching ally who's transforming education into an immersive journey. We're excited to tell you that Khanmigo is now free for educators and boosted with some brand new features. Let's take a look. Features like the Lesson Hook. Igniting your student's excitement for math is easily done by selecting a grade level than a topic, and with just one click, Khanmigo will create three engaging lesson hooks that will be sure to capture students' attention. Now, let's have Khanmigo whip up a lesson plan that effortlessly aligns to your curriculum, whether it's district-driven or your own. When I select the topic, I can choose one of Khan Academy's rich course offerings or one of my own. In a matter of seconds, Khanmigo generates a structured detailed lesson plan that's fully customizable and tailored to my students' interests. Feeling rusty on a topic? No problem. Khanmigo's Refresh My Knowledge feature provides self quizzes and engaging conversations to brush up on your skills. Khanmigo is designed to never just give the answer, And the Discussion Prompts feature ignites meaningful grade level dialogue. I can even quickly summarize what we'll be learning in class by having Khanmigo turn the lesson into a poem. Khanmigo can give you so much of your time back. Ready to revolutionize your classroom? Experience Khanmigo's power firsthand, completely free. Follow the links on your screen and embark on a new era of teaching excellence. (bright music)\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، یہاں خان اکیڈمی میں ایک\nپروفیشنل لرننگ اسپیشلسٹ، اور آپ کی طرح ایک سابقہ ​​کلاس روم\nٹیچر ہوں۔ خانمیگو سے ملیں، آپ کے AI پاور ٹیچنگ اتحادی جو تعلیم کو\nایک عمیق سفر میں تبدیل کر رہے ہیں۔ ہمیں آپ کو یہ بتاتے ہوئے خوشی ہو رہی ہے\nکہ Khanmigo اب معلمین کے لیے مفت ہے اور\nکچھ بالکل نئی خصوصیات کے ساتھ بڑھا ہوا ہے۔ آئیے ایک نظر ڈالتے ہیں۔ لیسن ہک جیسی خصوصیات۔  ریاضی کے لیے آپ کے طالب علم کے\nجوش و خروش کو بھڑکانا کسی موضوع کے مقابلے میں گریڈ لیول کا انتخاب کرکے آسانی سے کیا جاتا ہے، اور صرف ایک کلک کے ساتھ، Khanmigo تین\nدلکش اسباق کے ہکس بنائے گا جو یقینی طور پر\nطلبہ کی توجہ حاصل کریں گے۔ اب، آئیے خانمیگو کو\nایک سبقی منصوبہ تیار کریں جو آسانی کے ساتھ\nآپ کے نصاب کے مطابق ہو، چاہے وہ ضلع سے چلنے والا ہو یا آپ کا اپنا۔ جب میں موضوع کا انتخاب کرتا ہوں، تو میں خان\nاکیڈمی کے بھرپور کورس کی پیشکشوں میں سے کسی ایک کا انتخاب کرسکتا ہوں یا اپنا کوئی ایک۔ چند سیکنڈوں میں، Khanmigo ایک\nمنظم تفصیلی سبق کا منصوبہ تیار کرتا ہے جو مکمل طور پر حسب ضرورت اور میرے طلباء کی دلچسپیوں کے مطابق ہے۔ کسی موضوع پر زنگ لگ رہا ہے؟  کوئی مسئلہ نہیں۔ خانمیگو کی ریفریش مائی نالج فیچر آپ کی صلاحیتوں کو نکھارنے کے لیے سیلف کوئز اور پرکشش گفتگو فراہم کرتا ہے۔\n Khanmigo کو اس لیے ڈیزائن کیا گیا ہے کہ کبھی\nصرف جواب نہ دیا جائے، اور Discussion Prompts فیچر بامعنی گریڈ لیول ڈائیلاگ کو بھڑکاتا ہے۔  خانمیگو کے سبق کو نظم میں بدل کر ہم کلاس میں کیا سیکھیں گے اس کا خلاصہ بھی میں جلدی سے بیان کر سکتا ہوں۔\n \n خانمیگو آپ کو\nاپنا بہت سا وقت واپس دے سکتا ہے۔ اپنے کلاس روم میں انقلاب لانے کے لیے تیار ہیں؟ خانمیگو کی طاقت کا خود تجربہ کریں\n، مکمل طور پر مفت۔ اپنی اسکرین پر موجود لنکس کی پیروی کریں اور تدریسی فضیلت کے ایک نئے دور کا آغاز کریں۔\n (روشن موسیقی)",
    "t_spanish": "- Hola, soy Michelle, una\nespecialista en aprendizaje profesional aquí en Khan Academy y ex\nmaestra de aula como tú. Conozca a Khanmigo, su poderoso aliado de enseñanza de IA que está transformando la educación\nen un viaje inmersivo.  Nos complace informarle\nque Khanmigo ahora es gratuito para los educadores y cuenta\ncon algunas funciones completamente nuevas. Vamos a ver. Funciones como el gancho de lección. \nEs fácil encender el entusiasmo de su estudiante por las matemáticas seleccionando un nivel de grado en lugar de un tema, y ​​con solo un clic, Khanmigo creará tres\ninteresantes ganchos de lecciones que seguramente\ncaptarán la atención de los estudiantes. Ahora, hagamos que Khanmigo\nelabore un plan de lección que se alinee sin esfuerzo\ncon su plan de estudios, ya sea impulsado por el distrito o el suyo propio. Cuando selecciono el tema, puedo elegir uno de los\nvariados cursos que ofrece Khan Academy o uno propio. En cuestión de segundos, Khanmigo genera un\nplan de lección estructurado y detallado que es totalmente personalizable y adaptado a los intereses de mis alumnos.  ¿ Te sientes oxidado con un tema? Ningún problema.  La función Actualizar mis conocimientos de Khanmigo ofrece autoevaluaciones y\nconversaciones interesantes para repasar sus habilidades. Khanmigo está diseñado para\nnunca simplemente dar la respuesta, y la función de mensajes de discusión inicia un diálogo significativo a nivel de grado. Incluso puedo resumir rápidamente\nlo que aprenderemos en clase haciendo que Khanmigo convierta\nla lección en un poema. Khanmigo puede devolverle gran\nparte de su tiempo.  ¿ Listo para revolucionar tu aula? Experimenta el poder de Khanmigo\nde primera mano, completamente gratis. Siga los enlaces en su pantalla y embárquese en una nueva era\nde excelencia docente. (música brillante)",
    "t_arabic": "- مرحبًا، أنا ميشيل،\nأخصائية تعلم احترافية هنا في أكاديمية خان، ومعلمة سابقة\nمثلك تمامًا. تعرف على Khanmigo، حليفك التعليمي القوي القائم على الذكاء الاصطناعي والذي يحول التعليم\nإلى رحلة غامرة. يسعدنا أن نخبرك\nأن خانميغو أصبح الآن مجانيًا للمعلمين ومعززًا\nببعض الميزات الجديدة تمامًا. لنلقي نظرة. ميزات مثل خطاف الدرس.  يمكن \nبسهولة إثارة حماسة طلابك في الرياضيات عن طريق اختيار مستوى الصف بدلاً من الموضوع، وبنقرة واحدة فقط، سيقوم Khanmigo بإنشاء ثلاثة\nدروس جذابة ستجذب\nانتباه الطلاب بالتأكيد. الآن، لنطلب من Khanmigo\nإعداد خطة درس تتوافق بسهولة\nمع المنهج الدراسي الخاص بك، سواء كان ذلك حسب المنطقة أو المنهج الخاص بك. عندما أحدد الموضوع، يمكنني اختيار إحدى\nالدورات التدريبية الغنية التي تقدمها أكاديمية خان أو واحدة من عروضي الخاصة. في غضون ثوانٍ، يقوم Khanmigo بإنشاء\nخطة درس مفصلة ومنظمة وقابلة للتخصيص بالكامل ومصممة خصيصًا لتناسب اهتمامات طلابي. شعور صدئ على الموضوع؟ لا مشكلة.  توفر ميزة تحديث معرفتي في Khanmigo اختبارات ذاتية\nومحادثات جذابة لتحسين مهاراتك.  تم تصميم Khanmigo بحيث\nلا يقتصر على مجرد تقديم الإجابة، كما تعمل ميزة \"مطالبات المناقشة\" على إشعال حوار هادف على مستوى الصف الدراسي. يمكنني حتى أن ألخص بسرعة\nما سنتعلمه في الفصل من خلال جعل خانميغو يحول\nالدرس إلى قصيدة. بإمكان خانميغو أن يعيد لك\nالكثير من وقتك.  هل أنت مستعد لإحداث ثورة في الفصل الدراسي الخاص بك؟ استمتع بتجربة قوة Khanmigo\nمباشرة، مجانًا تمامًا. اتبع الروابط التي تظهر على شاشتك وابدأ عصرًا جديدًا\nمن التميز في التدريس. (موسيقى مشرقة)",
    "t_italian": "- Ciao, sono Michelle, una\nspecialista dell'apprendimento professionale qui alla Khan Academy e un'ex\ninsegnante di classe proprio come te. Incontra Khanmigo, il tuo alleato didattico sull'intelligenza artificiale che sta trasformando l'istruzione\nin un viaggio coinvolgente. Siamo entusiasti di dirti\nche Khanmigo è ora gratuito per gli educatori e potenziato\ncon alcune nuove funzionalità. Diamo un'occhiata. Funzionalità come il Lesson Hook. Accendere l'entusiasmo dei tuoi studenti\nper la matematica è facile selezionando un livello scolastico piuttosto che un argomento e, con un solo clic, Khanmigo creerà tre\ncoinvolgenti ganci di lezione che cattureranno sicuramente l'\nattenzione degli studenti. Ora, lasciamo che Khanmigo\nprepari un programma di lezioni che si allinei facilmente\nal tuo curriculum, sia esso guidato dal distretto o il tuo. Quando seleziono l'argomento, posso scegliere uno dei\nnumerosi corsi offerti da Khan Academy o uno dei miei. In pochi secondi, Khanmigo genera un\npiano di lezione strutturato e dettagliato, completamente personalizzabile e adattato agli interessi dei miei studenti.  Ti senti arrugginito su un argomento? Nessun problema.  La funzione Aggiorna le mie conoscenze di Khanmigo fornisce auto-quiz e\nconversazioni coinvolgenti per rispolverare le tue abilità. Khanmigo è progettato per non limitarsi\nmai a fornire la risposta e la funzione Suggerimenti per la discussione attiva dialoghi significativi a livello scolastico. Posso anche riassumere rapidamente\nciò che impareremo in classe chiedendo a Khanmigo di trasformare\nla lezione in una poesia. Khanmigo può\nrestituirti tantissimo tempo. Pronto a rivoluzionare la tua classe? Sperimenta\nin prima persona il potere di Khanmigo, in modo completamente gratuito. Segui i collegamenti sullo schermo e intraprendi una nuova era\ndi eccellenza nell'insegnamento. (musica brillante)"
}