{
    "source": "BbslbG2ReLE",
    "youtubelink": "https://www.youtube.com/watch?v=BbslbG2ReLE",
    "t_english": "- Hello everyone. Good afternoon. We are slowly welcoming folks into the room. Thanks for taking the time to join us. My name is Felipe Escamilla, I'm the Video Manager here at Khan Academy. Shortly we will be joined by Sal Khan, the CEO and Founder of Khan Academy. He'll tell you a little bit about our mission, our AI tool, and teacher assistant and student tutor called Khanmigo. We also have two senior product managers that'll be joining us, Gintas Bradunas and Sarah Robertson. I'm gonna go ahead and introduce Sarah and Gintas now, tell you a little bit about their roles and what they do here at Khan Academy and some of the things, a little preview, what they'll be presenting today. Hi, Sarah. Hi, Gintas. - Hey, Felipe. Welcome everybody, I'm Sarah Robertson. As Felipe mentioned, I'm a Senior Product Manager here at Khan Academy. I am a former English teacher many years ago. Also previously worked for CommonLit, another EdTech nonprofit company. And I've been at Khan Academy now for a little over a year. Mostly I've been focusing on our literacy-related initiatives, so building out content and tools and resources for ELA and humanities teachers. Most exciting thing that we've been working on lately is our Writing Coach tool, which I will show you in detail in a little bit and I'll let Gintas share about himself. - Sure, thanks, Sarah. Hi everyone, my name is Gintas. I'm a Senior Product Manager on our Teacher Experience Team. And like Sarah, I was a teacher in a past life, so I was a middle school English teacher, taught sixth and seventh grade ELA, and then got pulled into the world of product. And my team, as the name suggests, is focused primarily on everything and anything we can do to make the lives of teachers easier and to make it possible for teachers to, of course help their students reach their learning goals and their needs. So it's a fun team to be on. It's got a lot of other former educators on it, also a lot of English teachers. We do go down the rabbit hole sometimes with our metaphors. So yeah, really excited to show you today about our Khanmigo tools and what we've been working on to make Khanmigo the ideal teacher's assistant. - I just wanted to thank everyone for joining, I'll just give a little bit of background and then hand it over to the Khan Academy team to go much deeper into things. But I'm assuming most folks here are somewhat familiar with Khan Academy, nonprofit mission, free, world-class education for anyone anywhere. And probably a lot of y'all know how Khan Academy got started and I used to talk about the origin story just as a fun, quirky way that I got involved in Khan Academy, but I now talk about it because I think it's very relevant to some of what we're gonna talk about with AI and beyond. You know, back in the day I started tutoring cousins, word spreads in my family, free tutoring's going on before I know it, I'm tutoring many cousins. I start trying to scale those types of personalized one-on-one interactions. I start making writing exercises for them, teacher tools. I was the first user of the teacher tools so that I could keep track of what students were doing and make assignments to my cousins. A friend suggested I make videos. Once again, that was a way to scale some of these mini lessons that I was giving for my cousins. And then you fast forward to now, or a couple of years ago, Khan Academy is obviously now much more than than me, but as a not-for-profit, what we've really, everything we've been doing, even though we're now at 160 million plus users, is that same idea. How do we really try to scale the type of attention, personalization, mastery learning, which is just that if students haven't learned something yet, they should get more of an opportunity and incentive to learn it. How do we scale that to more and more students and how do we support teachers and educators and school leaders and superintendents in order to better support their students in all of those things? So those were the teacher tools and the professional development that we've run over the years. You fast forward to about a year and a half ago, and this is when OpenAI first reached out to us. We were curious but skeptical. We have been monitoring what's been going on in the AI world for a while. It didn't seem ready for primetime, at least in 2022. But then when we saw what GPT-4 could do, and just to give a little bit of clarification on some of the terminology, a lot of people know ChatGPT, ChatGPT is an application that they later created originally on an older model. Now, you could access it on GPT-4 if you pay money, but the models are the GPT-3, GPT-4, Google has models like Gemini, et cetera, and then you have the applications. But when we saw what GPT-4 was capable of, even though it had its rough spots, we said, \"Wow, this could get us that much further to being able to scale the type of personalization that we want to do for students. And it could be that much more powerful for supporting teachers.\" All of these tasks that teachers need to do, clearly they have to get reporting on how their students are doing, but they also are doing things like lesson plans, exit tickets, progress reports, et cetera, et cetera. Maybe it could be part of, it could be a tutor for every student and a teaching assistant for every teacher. So that's the journey we started to go on. There was obviously a lot of questions about how you handle safety, privacy, cheating, and we're working on all of those and we think we have good answers, but we're gonna show you is especially many of the tools that are teacher facing that we're very excited about, and we've recently done a pretty significant revamp and we've made it far more accessible to a lot more educators, but also recognize that this is a journey that we're hoping that many of y'all want to go on with us, that it can be immediately useful to you right now, but as y'all use it and we learn from how you're using it, we can make it better and better so that we can support you and we can support your students. So with that, I'll pass it to the team so they can show you a little bit of what we've been to. - All right, thanks, Sal. I will get us started with our teacher tools. So this is our new Khanmigo teacher tools page. As I mentioned in the introduction, I am a former middle school English teacher and my team's charge is quite simply to make the lives of teachers easier. And when we all think back to our teaching days, I still say it's the hardest job that I ever did, that any of us ever did. And the only way a teacher often can make it through their teaching experience is by leaning on others, by leaning on their support network. So in my case, it was a lot of other first, second, third year teachers. It was a veteran teacher across the hall, Mrs. Hall who I could see into her classroom and brainstorm ideas for the lesson the next day. And so in building out Khanmigo, we want to add another piece to that support network. So in the same way you would go across the hall to ask a teacher for ideas, you can now go to Khanmigo and work with Khanmigo to make your lessons better, to come up with ideas on how to make sure you're engaging your students. So to show you what this might look like, I can go in here and say, \"I have a lesson tomorrow that I'm teaching and I'm already dreading it because it is what I know is a topic that my students don't necessarily love all that much. And in this case, let's say it's adding fractions. It's a topic that my students might not find all that engaging, but we are in Baltimore, and Baltimore for once has a really good baseball team. So I'm gonna say my class is a collection of baseball fans. They're actually Orioles fans. And I'm gonna say, can you make it relevant to my students who might care more about baseball than adding fractions? And so this would be the same idea of going across the hallway and being like, \"Hey, what did you do with your class yesterday that was so cool? Why were they so engaged? Why were they so into your lesson?\" And here we can see a couple ideas on using baseball card statistics, averages, to teach fractions, and this is great, but of course I'm a little bit biased. I'm a baseball fan myself and that might not apply to all of my students. And so this is where it really gets exciting using Khanmigo where Khanmigo is really your partner here and can work with you to customize the content to fit the needs of students. So looking at this, I can ask Khanmigo to make changes to this, try something different, discuss this. In this case I'm gonna say make changes to this. And I know that in my class I have a couple Taylor Swift fans. So I'm gonna say, make this about Taylor Swift instead. And I have no idea how this is going to work because I have no idea how you connect Taylor Swift to fractions, and Khanmigo will give me some ideas here, possibly tying it to track lengths, collaborations, to her sales. There was a previous case where Khanmigo gave me an example of finding fractions in the lyrics of Taylor Swift. These are ideas I would've never come up with or never had if I wasn't brainstorming with Khanmigo. So first and foremost, Khanmigo's a great thought partner. It's also a great lesson plan partner. If I go here and I select lesson plan, I can say, you know, adding fractions and it will pull from our content here on Khan Academy. And so I'll see adding and subtracting negative fractions create lesson plan and it will create a full five-part lesson plan that includes differentiation. And this is where our prompt engineering team, a lot of former educators on that team have worked to design an experience where Khanmigo is providing the strategies that your fellow teacher would suggest to another teacher to include in their classrooms. Last, but certainly not least, Khanmigo can also do things like recommend assignments. So if I am day before class just thinking about what I should be working with my students, they might've been working on a couple topics, but I'm not really sure what's next, I always had questions about scope and sequence and what makes sense to teach after what, I can just ask Khanmigo in this case. And Khanmigo will give me a couple ideas as to what to work with my students on tomorrow and say, assign to group one and I can assign it directly from Khanmigo and that will be in my students' accounts the next day for them to be working on. So really, really excited about where Khanmigo has gone in terms of the teacher use case. Really useful already today. We as a team have whiteboards upon whiteboards of future tools and ideas on where to take Khanmigo next. So stay tuned for that. But that's my update for today and I'll pass it over to Sarah to share a little bit more about Writing Coach. - Thanks, Gintas. Alright, so I think most of you know, Khan Academy is very well known for its STEM content, it's excellent videos and articles and exercises and mastery learning. We are really excited about some of the advancements that we're seeing when it comes to AI and ELA and humanities. And we've been working really hard in the past year at applying some of this innovation and this opportunity to the ELA and humanities teacher use cases. So what I'm gonna share is a project that we are calling Writing Coach. This is something that is not available quite yet. We are launching it for this back to school season. Right now, there is a feature that is kind of a preview of Writing Coach that you can see if you have Khanmigo access for students. And that's called our academic essay feedback activity. But I'm gonna give you a preview of what Writing Coach will look like this back to school season in a moment. But really quick, if you, and I think many of you are probably familiar with this quandary of writing instruction in schools right now. Research tells us that students need to be spending 60 minutes a day writing in classrooms, middle and high school students. Fewer than 10% of students are actually reaching that goal. We also know that in order to improve in writing instructions, students need specific, actionable feedback on their writing that is delivered in as timely a manner as possible. This is almost never what happens in reality. And as a result, teachers don't assign quite enough writing. They get super burnt out if they even try to provide personalized feedback on every essay, so it's kind of no wonder that students are behind in their writing skills. As I mentioned earlier, I'm a former English teacher, assigning one essay to my 100 students would take 17 hours for me to provide personalized feedback on all their essays. So what I think is particularly exciting about Writing Coach is first of all the features that it provides for students. So one thing that we know is obviously students need feedback in order to become better writers, but many of the teachers that we've spoken to have told us, \"It's great that your current feedback tool gives feedback on essays, but I can't even get most of my students to the point where they have a first draft.\" That whole getting started piece, outlining, it's like pulling teeth. It is really hard to even get students to produce something to begin with. And I also, like, that was my experience as well, I remember that moment of looking around and students just feeling so stuck. So with the Writing Coach tool, it actually supports students through the entire writing process from the very beginning. The very first step that Writing Coach does is it talks to the student. Khanmigo will talk to the student about the essay prompt. It will make sure that they understand what the expectations are and that if there are any words that they're unfamiliar with, Khanmigo will help them understand what is a rebuttal, how do I write a counter argument? Those kinds of things. So this preview right here shows that initial prompt review stage before the student even begins writing, where they have a casual and kind of low pressure conversation with Khanmigo to get them thinking about the essay assignment. And then of course one of the next steps is outlining. So one of the benefits of having Khanmigo support students through the outlining process is Khanmigo knows what the teacher's assignment was. So Khanmigo knows how many paragraphs the teacher expects, what kind of citations the teacher wants to see, what sort of details they want students to include. And when the student is working on their outline, Khanmigo can make sure that they're on track. And if the student has questions, Khanmigo knows how to respond. And if you have students who are completely lost when it comes to writing a thesis, Khanmigo has been trained to support students through writing and drafting these different elements of an outline without actually doing any of that work for them. When it comes to drafting, obviously Khanmigo now has the students outline that it worked on with the student. So it can help the student kind of plug that into their draft and flesh it out more. And of course, like with all other features, it will not do the writing for the student, but it's there if they get stuck and they need a little bit of help. There's also other things happening behind the scenes as a student's drafting that the student can't always see that you will see in a moment on the teacher end. And for revising, the student can submit their draft to Khanmigo for feedback. Khanmigo generates suggestions in five main feedback areas that are aligned to most major rubrics. Students can ask Khanmigo about the feedback that they got, but most excitingly they can also revise their essay on the page and get follow up feedback from Khanmigo in real time so they can find out immediately, did my revision address the suggestion that you gave me? And for teachers, I think this is where Writing Coach, where the magic really starts to show. So because students are interacting with Khanmigo through the whole writing process, we are then able to synthesize that and report it back to the teacher and give them really helpful insights into what students were able to do, what they struggled with. So some of the things that teachers will be able to see include, of course where in the assignment every student is, so-and-so is working on their outline. This person's already in revising, they can see how much time was spent drafting versus revising or outlining versus drafting. They can see current word count, they can see high level data about the feedback distribution. So you know, most students got feedback related to evidence. Maybe that's something that you should focus on for instruction later. And then these potential originality concerns or these flags. So these are the things that I mentioned when a student is drafting or even outlining or revising, if they're pasting a large amount of text into the experience and Khanmigo doesn't know where it came from, it didn't come from the outline or didn't come from that conversation, we will raise a flag for the teacher that they can then go in and investigate and see exactly what was pasted, see what happened, kind of dig into that, which from the conversations I've had with teachers having to do this, you know, using Google Docs or draft back Chrome Extensions one student at a time can be unbelievably time-consuming in itself. And with ChatGPT, I think this is as big of a problem as teachers have ever seen. So we are really excited about the student benefits of Writing Coach, but then also a lot of these teacher features that will come with that. - Before we go to Sal for questions 'cause I'm sure you have a lot of stuff for him, just wanna let you know that I head up our partnerships team here at Khan Academy working with schools, school districts, and now even states on some level to partner for our Khan Academy districts offering as well as Khanmigo. So a lot of our content and tools are free and totally accessible for your students and teachers to use. Just about every district in the country has their teachers using the free version of Khan Academy 'cause it's a fantastic supplemental resource. If you want additional letters of support and you want your students to have access to Khanmigo, you can partner with my team, which is the Khan Academy District's partnership team to allow you to basically get support for Khan Academy courses and content, but also let your students and teacher access Khanmigo. Student access for Khanmigo is only available as part of our district partnerships. And so the way it works is you're basically gonna get rostering services, you're gonna get data analytics and you're gonna get professional learning both for the core Khan Academy offering but also for Khanmigo. And the professional learning is really key because obviously this AI is new to all of us. So we wanna make sure this is a journey we're going through together so we have really robust professional learning resources for you as part of our district partnership. Our partnership start as small as 250 students. So if you're a smaller district or maybe you're a larger district and just wanted to dip your toe in the water, we can partner for as few as 250 student licenses up through as many as you would like. We only charge for the student licenses, so if you're partnering for us at the district offering and paying for the student licenses, the teacher licenses are gonna be free, which is great. And again, like we talked about, there's the implementation support where we're gonna hold your hand and walk you through kind of best practices, how to leverage Khan Academy, how to leverage Khanmigo, train your teachers, train your staff, train your admin so that everybody's on board for how the platform should be used. I will say that professional learning with Khanmigo is mandatory because this is so new and everybody's learning as we go. We insist that you have some sort of PL as part of the partnership with us. And the PL is gonna depend on the scope of the partnership. For the smaller partnerships, it might be on demand PD that your teachers can do async up through live virtual hours and even recommended in-person PL days that we can come out to your district and train your staff depending on the PL calendar. But the idea in here is we want to support everyone, support all your teachers and kind of best practices with AI Khanmigo so that your students and teachers are getting the most out of the platform. And if you're interested, two things you can do here. You can email us directly at districts@khanacademy.org or there's a QR code here, which will take you to our district's landing page, which has a bunch of information about our district offering Khanmigo, et cetera. So we're on standby now. My team's ready to help, but whether you just want a more detailed demo, we're happy to provide that or more detailed information on pricing, happy to provide that with either one of these touch points, but looking forward to speaking with you if you have any questions. And now I'd love to throw it back to Sal so we have as much time as possible with him to answer your questions. - Thanks, Jason. So yes, I and others here, not just me, happy to answer any questions and any ideas that y'all might have. - We do have a couple questions that are in right now. Does the Writing Coach have the capabilities to create text-based writing prompts where excepts are inserted for students to read and to analyze? Do you wanna go a little bit more in depth with that? - One thing I'll say is that we specifically do support literary analysis essays. You know, structurally, I think Khanmigo does a very good job at helping students with that. If the essay is about anything that is well known that was published prior to 2023, which is when GPT-4's knowledge base goes up to, then students actually get support from Khanmigo analyzing the text. So if the student is like, \"I really don't understand this theme or this character, or something that happened in the story,\" Khanmigo is aware of that text and can support them with that. So you can't actually upload your own text yet. Although I think we will be able to support something like that fairly soon. But it can help students if the texts are fairly well known. - And then also there's a question, do we have a DSA? - We have versions of that with multiple districts. Most of the day sharing agreements that I'm familiar with are the ones where we have partnered with the school district and we wanna understand the efficacy results better. So we have several districts there and so that way we can help analyze whether we are hopefully moving the dial the way that many of our efficacy studies indicate that they would. But yeah, we are obviously, I think we're the leaders when it comes to data privacy and solid use of data, only using it to personalize experience, measure efficacy, et cetera. But yes, pretty much. - Yeah, John, you can email the districts@khanacademy.org email address and we can sort out with you, we have state level agreements, we have consortium agreements, DSAs and DPAs, we provide directly to districts as well. So we can definitely sort you out. But Sal maybe it's useful to talk about what we share or don't share with OpenAI in terms of that learning and usage on the platform in terms of the data sharing and student usage. - Sure. Yeah, I'll speak a little bit generally about data. Obviously there's a lot of opportunity with artificial intelligence, but there's some fears here. There's a cheating fear, there's a fear of students doing shady things with the AI and then there's fears of, do these conversations somehow get incorporated into the training data for future models? And so could that somehow create a data privacy risk especially with something very sensitive, like student data. So I'll go in that order. It's already been alluded to, for students, Khan Academy does not support, it will not just answer the question. It really acts as an ethical tutor. Sarah showed you a little bit of this, there's a TED Talk I gave last year that goes into a lot more depth on that, but we're very clear. Now, teachers have a teacher mode and if they put it on student mode, they see what students would see, if they put it in teacher mode, it actually not only supports teachers with answers, it acts like a super teacher's guide. It can help them with all the things that Gintas was showing, lesson plans, lesson hooks, et cetera, et cetera. Another area, a guardrail that we have is when students interact with Khanmigo, those interactions are all observable by teachers. And then we also have a moderation API or a moderation AI. So if the student has a conversation, they're saying they want to, heaven forbid, build a bomb or they wanna harm themselves, it's gonna shut down those conversations and actively notify teachers and administrators. Now the data, and this is a principle for Khan Academy well before generative AI, is that we only use data, and this is one of the reasons we're a not-for-profit, so we're not even tempted to try to monetize data in some shady way. We only use data to measure our impact, personalize the experience, improve the experience, or inform key trusted stakeholders like teachers or districts, those are our only uses for data. So when it comes into the AI realm, as I just mentioned, we are storing the student conversations. We're only using that for teacher reporting or our own evaluation of what is happening and how we can make it better. We do not allow those conversations, and these are agreements that we have with the underlying AI companies that data cannot be used for the general purpose training of future models. So none of students' private information can make its way into, let's call it the public realm. We might use that information to fine tune or train our own versions to once again personalize or be more effective for students. But once again, that will stay within this garden of Khan Academy, not for the broader world. So we take that very, very seriously. And you know, to be clear, there's a ton of people, if we were a for-profit company, every day, I have some AI company offering to pay us for that data and we are saying no. So you could imagine what might be happening if our governance was a little bit different. - Yeah, and Sal brings up a great point, as you all are looking at AI products, whether it's Khanmigo or the other companies out there, I would really encourage you to actually read privacy policies. There's these companies are popping up every day. There's tons of startups out there, we don't know who's behind 'em. We don't know if there's educational folks looking at the pedagogy and learning of this. There's a bunch of folks out there right now whose names you will know, go read their privacy policies and they specifically say, we will not share or sell student data unless we get acquired or go out of business, which is going to be 95% of these companies. And so what are they gonna do when they start running out of money or they're acquired? Do they have those same guardrails that a company like Khan Academy does in terms of sharing? So be very careful as you're looking at products in the space right now, what they are doing in terms of data sharing, data privacy, data governance 'cause I think it's really key decision making, a choice for y'all. - [Narrator] Thank you all for joining us today and watching this video and being a part of the Khan Academy learner and teacher community. If you'd like to see more about how Khanmigo is supercharging learning in classrooms right now, click on the links on your screen and to stay in touch and never miss an announcement about free, world-class education for anyone anywhere, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- سب کو سلام۔ صبح بخیر ہم آہستہ آہستہ\nلوگوں کو کمرے میں خوش آمدید کہہ رہے ہیں۔ ہمارے ساتھ شامل ہونے کے لیے وقت نکالنے کا شکریہ۔ میرا نام Felipe Escamilla ہے، میں\nیہاں خان اکیڈمی میں ویڈیو مینیجر ہوں۔ جلد ہی ہمارے ساتھ خان اکیڈمی کے سی ای او اور بانی سال خان بھی شامل ہوں گے۔ وہ آپ کو\nہمارے مشن، ہمارے AI ٹول، اور ٹیچر اسسٹنٹ اور طالب علم کے ٹیوٹر کے بارے میں تھوڑا سا بتائے گا جسے Khanmigo کہتے ہیں۔ ہمارے پاس دو سینئر پروڈکٹ مینیجر بھی ہیں جو ہمارے ساتھ شامل ہوں گے، Gintas Bradunas اور Sarah Robertson۔ میں\nاب آگے بڑھ کر سارہ اور گینٹاس کا تعارف کرانے جا رہا ہوں، آپ کو ان کے کرداروں کے بارے میں اور خان اکیڈمی میں کیا کرتے ہیں اور کچھ چیزوں کے بارے میں تھوڑا سا بتاؤں گا، تھوڑا سا پیش نظارہ، وہ آج کیا پیش کریں گے۔ ہیلو، سارہ.  ہیلو، Gintas. - ارے، فیلیپ. سب کو خوش آمدید، میں سارہ رابرٹسن ہوں۔ جیسا کہ فیلیپ نے بتایا، میں یہاں خان اکیڈمی میں سینئر پروڈکٹ مینیجر ہوں۔\n میں کئی سال پہلے انگریزی کا ایک سابق استاد ہوں۔  اس سے\n قبل ایک اور EdTech غیر منافع بخش کمپنی CommonLit کے لیے بھی کام کر چکے ہیں۔ اور اب میں خان اکیڈمی میں\nایک سال سے کچھ زیادہ عرصے سے ہوں۔ میں زیادہ تر خواندگی سے متعلق اپنے اقدامات پر توجہ مرکوز کرتا رہا ہوں، اس لیے\nELA اور ہیومینٹیز کے اساتذہ کے لیے مواد اور اوزار اور وسائل تیار کر رہا ہوں۔ سب سے دلچسپ چیز جس\nپر ہم حال ہی میں کام کر رہے ہیں وہ ہمارا رائٹنگ کوچ ٹول ہے، جسے میں آپ کو\nتھوڑی دیر میں تفصیل سے دکھاؤں گا اور میں گینٹاس کو اپنے بارے میں شیئر کرنے دوں گا۔ - ضرور، شکریہ، سارہ۔ سب کو ہیلو، میرا نام گینٹاس ہے۔ میں ہماری ٹیچر تجربہ ٹیم میں ایک سینئر پروڈکٹ مینیجر ہوں۔\n اور سارہ کی طرح، میں\nپچھلی زندگی میں ٹیچر تھا، اس لیے میں مڈل اسکول میں انگلش ٹیچر تھا، چھٹی اور ساتویں جماعت کو ELA پڑھایا، اور پھر\nپروڈکٹ کی دنیا میں چلا گیا۔ اور میری ٹیم، جیسا کہ نام سے پتہ چلتا ہے، بنیادی طور پر ہر اس چیز پر مرکوز ہے اور ہم\nاساتذہ کی زندگیوں کو آسان بنانے اور اساتذہ کے لیے یقیناً اپنے طلباء کو ان کے\nسیکھنے کے اہداف اور ان کی ضروریات تک پہنچنے میں مدد کرنے کے لیے یہ ممکن بنانے کے لیے کر سکتے ہیں۔ تو یہ ایک تفریحی ٹیم ہے۔ \nاس پر بہت سے دوسرے سابق اساتذہ بھی شامل ہیں، انگریزی کے اساتذہ بھی۔ ہم\nکبھی کبھی اپنے استعاروں کے ساتھ خرگوش کے سوراخ سے نیچے جاتے ہیں۔ تو ہاں، آج آپ کو اپنے Khanmigo ٹولز کے بارے میں بتاتے ہوئے واقعی پرجوش ہوں اور ہم\nKhanmigo کو مثالی استاد کا معاون بنانے کے لیے کیا کام کر رہے ہیں۔ - میں صرف شامل ہونے کے لیے سب کا شکریہ ادا کرنا چاہتا ہوں،\n میں بس تھوڑا سا پس منظر بتاؤں گا اور پھر اسے\nخان اکیڈمی کی ٹیم کے حوالے کر دوں گا تاکہ باتوں کی گہرائی میں جا سکے۔ لیکن میں فرض کر رہا ہوں کہ یہاں کے زیادہ تر لوگ خان اکیڈمی، غیر منافع بخش مشن، مفت،\nعالمی معیار کی تعلیم سے کہیں بھی واقف ہیں۔ اور شاید آپ بہت سے لوگ جانتے ہیں کہ خان اکیڈمی کی شروعات کیسے ہوئی اور میں\nاصل کہانی کے بارے میں صرف ایک تفریحی، نرالا انداز میں بات کرتا تھا کہ میں\nخان اکیڈمی میں شامل ہوا، لیکن اب میں اس کے بارے میں بات کرتا ہوں کیونکہ میرے خیال میں یہ بہت متعلقہ ہے۔  ان میں سے کچھ جن کے بارے میں ہم AI اور اس سے آگے کے بارے میں بات کرنے والے ہیں۔ آپ جانتے ہیں، جس دن\nمیں نے کزنز کو ٹیوشن دینا شروع کیا، میرے خاندان میں بات پھیل گئی، مجھے معلوم ہونے سے پہلے ہی مفت ٹیوشن چل رہی ہے، میں\nبہت سے کزنز کو ٹیوشن کر رہا ہوں۔ میں ان قسم کے ذاتی نوعیت کے ون آن ون تعاملات کو پیمانہ کرنے کی کوشش کرنا شروع کرتا ہوں۔ میں ان کے لیے لکھنے کی مشقیں، استاد کے اوزار بنانا شروع کرتا ہوں۔\n میں ٹیچر ٹولز کا پہلا صارف تھا تاکہ میں اس بات پر نظر رکھ سکوں کہ\nطلباء کیا کر رہے ہیں اور اپنے کزنز کو اسائنمنٹس دے سکتا ہوں۔ ایک دوست نے مجھے ویڈیو بنانے کا مشورہ دیا۔ ایک بار پھر، یہ ان چھوٹے اسباق میں سے کچھ کو پیمانہ کرنے کا ایک طریقہ تھا جو میں اپنے کزنز کے لیے دے رہا تھا۔ اور پھر آپ اب کی طرف تیزی سے آگے بڑھ رہے ہیں، یا چند سال پہلے، خان اکیڈمی ظاہر ہے کہ\nاب مجھ سے کہیں زیادہ ہے، لیکن ایک غیر منافع بخش کے طور پر، جو ہم واقعی کر رہے ہیں، وہ\nسب کچھ جو ہم کر رہے ہیں، اگرچہ  اب ہم\n160 ملین پلس صارفین پر ہیں، یہی خیال ہے۔ ہم واقعی\nتوجہ، شخصیت سازی، مہارت سیکھنے کی قسم کو کس طرح پیمانہ کرنے کی کوشش کرتے ہیں، جو صرف یہ ہے کہ اگر طلباء نے ابھی\nتک کچھ نہیں سیکھا ہے، تو انہیں اسے سیکھنے کا زیادہ موقع اور ترغیب ملنی چاہیے۔ ہم اس کو\nزیادہ سے زیادہ طلباء تک کیسے پہنچاتے ہیں اور ان تمام چیزوں میں اپنے طلباء کی بہتر مدد کرنے کے لیے ہم اساتذہ اور معلمین اور اسکول کے سربراہان اور سپرنٹنڈنٹ کی کس طرح مدد کرتے ہیں \n؟ لہذا وہ اساتذہ کے اوزار اور پیشہ ورانہ ترقی تھی جو ہم نے سالوں میں چلائی ہے۔ آپ تقریباً\nڈیڑھ سال پہلے تیزی سے آگے بڑھتے ہیں، اور یہ وہ وقت ہے جب OpenAI\nپہلی بار ہم تک پہنچا۔ ہم متجسس تھے لیکن شکی تھے۔ ہم تھوڑی دیر سے\n AI دنیا میں کیا ہو رہا ہے اس کی نگرانی کر رہے ہیں۔ یہ کم از کم 2022 میں پرائم ٹائم کے لیے تیار نہیں لگتا تھا۔\n لیکن پھر جب ہم نے دیکھا کہ GPT-4 کیا کر سکتا ہے، اور صرف\nکچھ اصطلاحات پر تھوڑی سی وضاحت کرنے کے لیے، بہت\nسے لوگ ChatGPT کو جانتے ہیں، ChatGPT  ایک ایپلی کیشن جسے انہوں نے بعد میں\nاصل میں ایک پرانے ماڈل پر بنایا۔ اب،\nاگر آپ رقم ادا کرتے ہیں تو آپ GPT-4 پر اس تک رسائی حاصل کر سکتے ہیں، لیکن ماڈل GPT-3، GPT-4 ہیں، Google کے پاس Gemini، وغیرہ جیسے ماڈل ہیں، اور پھر آپ کے پاس ایپلیکیشنز ہیں۔ لیکن جب ہم نے دیکھا کہ GPT-4 کیا صلاحیت رکھتا ہے، حالانکہ اس کے\nکھردرے دھبے تھے، تو ہم نے کہا، \"واہ، یہ ہمیں اس \nقسم کی پرسنلائزیشن کی پیمائش کرنے کے قابل بنا سکتا ہے جو ہم طلباء کے لیے کرنا چاہتے ہیں۔ اور اساتذہ کی حمایت کے لیے یہ بہت زیادہ طاقتور ہو سکتا ہے۔\" یہ تمام کام جو\nاساتذہ کو کرنے کی ضرورت ہے، واضح طور پر انہیں اس بارے میں رپورٹنگ حاصل کرنی ہوگی کہ ان کے طلباء کیسے کر رہے ہیں، لیکن وہ\nاسباق کے منصوبے، ایگزٹ ٹکٹ، پیشرفت\nرپورٹس، وغیرہ وغیرہ جیسے کام بھی کر رہے ہیں۔ ہو سکتا ہے کہ یہ اس کا حصہ ہو، یہ ہر طالب علم کے لیے ٹیوٹر اور\nہر استاد کے لیے تدریسی معاون ہو سکتا ہے۔ تو یہ وہ سفر ہے جس پر ہم نے جانا شروع کیا۔ واضح طور پر اس\nبارے میں بہت سارے سوالات تھے کہ آپ حفاظت، رازداری، دھوکہ دہی کو کس طرح سنبھالتے ہیں، اور ہم ان سب پر کام کر رہے ہیں اور ہمیں لگتا ہے کہ ہمارے پاس اچھے جوابات ہیں، لیکن ہم آپ کو یہ دکھائیں گے کہ\nخاص طور پر بہت سے ایسے اوزار ہیں جو استاد ہیں۔  اس بات کا سامنا کرتے ہوئے کہ\nہم بہت پرجوش ہیں، اور ہم نے حال ہی میں ایک\nبہت اہم اصلاح کی ہے اور ہم نے اسے بہت زیادہ اساتذہ کے لیے قابل رسائی بنایا ہے، لیکن یہ بھی تسلیم کریں کہ یہ ایک ایسا سفر ہے جس کی ہم امید کر رہے ہیں کہ بہت سے\nآپ سب ہمارے ساتھ آگے بڑھنا چاہتے ہیں، کہ یہ ابھی آپ کے لیے فوری طور پر\nمفید ہو سکتا ہے، لیکن جیسا کہ آپ سب اسے استعمال کریں گے اور ہم اس سے سیکھتے ہیں کہ آپ اسے کیسے استعمال کر رہے ہیں، ہم اسے بہتر سے بہتر بنا سکتے ہیں تاکہ ہم  آپ کی مدد کریں اور ہم آپ کے طلباء کی مدد کر سکتے ہیں۔ تو اس کے ساتھ، میں اسے ٹیم کو دے دوں گا\nتاکہ وہ آپ کو تھوڑا سا دکھا سکیں کہ ہم کیا کر چکے ہیں۔ - ٹھیک ہے، شکریہ، سال. میں ہمیں\nاپنے ٹیچر ٹولز کے ساتھ شروع کروں گا۔ تو یہ ہمارا نیا خانمیگو\nٹیچر ٹولز پیج ہے۔ جیسا کہ میں نے تعارف میں ذکر کیا ہے، میں مڈل\nاسکول کا انگلش کا سابق استاد ہوں اور میری ٹیم کا چارج اساتذہ کی زندگیوں کو آسان بنانا ہے۔ اور جب ہم سب\nاپنے تدریسی دنوں کے بارے میں سوچتے ہیں، میں اب بھی کہتا ہوں کہ یہ سب سے مشکل کام ہے جو میں نے کبھی کیا ہے، جو ہم میں سے کسی نے کیا ہے۔ اور ایک استاد اکثر اپنے تدریسی تجربے کے ذریعے اسے بنا سکتا ہے\n دوسروں پر جھکاؤ، ان کے سپورٹ نیٹ ورک پر جھکاؤ۔ تو میرے معاملے میں، یہ\nپہلے، دوسرے، تیسرے سال کے بہت سارے اساتذہ تھے۔ یہ پورے ہال میں ایک تجربہ کار ٹیچر تھیں، مسز ہال جنہیں میں\nان کے کلاس روم میں دیکھ سکتا تھا اور اگلے دن کے اسباق کے لیے خیالات کو ذہن میں رکھ سکتا تھا۔\n اور یوں Khanmigo کی تعمیر میں، ہم\nاس سپورٹ نیٹ ورک میں ایک اور ٹکڑا شامل کرنا چاہتے ہیں۔ تو اسی طرح آپ\nہال میں جا کر استاد سے آئیڈیاز پوچھیں گے،\nاب آپ خانمیگو جا سکتے ہیں اور\nاپنے اسباق کو بہتر بنانے کے لیے خانمیگو کے ساتھ کام کر سکتے ہیں، تاکہ یہ یقینی بنایا جا سکے کہ آپ اپنے طلباء کو کس طرح مشغول کر رہے ہیں۔  . تو آپ کو یہ بتانے کے لیے کہ یہ کیسا لگ سکتا ہے، میں یہاں جا سکتا ہوں اور کہہ سکتا ہوں، \" میرے پاس کل ایک سبق ہے\nجو میں پڑھا رہا ہوں اور میں پہلے ہی اس سے خوفزدہ ہوں کیونکہ یہ وہ موضوع ہے جس کے بارے میں میں جانتا ہوں\nکہ میرے طالب علم نہیں جانتے۔  t ضروری طور پر اتنا پسند کرتا ہوں اور اس معاملے میں،\n یہ ایک ایسا موضوع ہے جو شاید میرے طلباء کو وہ سب کچھ دلکش نہ لگے،\nلیکن ہم بالٹیمور میں ہیں، اور بالٹیمور کی\nایک بہت اچھی ٹیم ہے۔ میں کہوں گا کہ میری کلاس\nبیس بال کے شائقین ہیں اور میں کہوں گا، کیا آپ اس کو میرے ان طلباء کے لیے متعلقہ بنا سکتے ہیں جو بیس بال کے بارے میں زیادہ خیال رکھتے ہیں اور\n ایسا ہی ہوگا۔  دالان کے اس پار جانے\nاور اس طرح ہونے کا ایک ہی خیال، \"ارے، آپ نے\nکل اپنی کلاس کے ساتھ کیا کیا جو بہت اچھا تھا؟ وہ اتنے مصروف کیوں تھے؟ وہ آپ کے اسباق میں کیوں تھے؟\" اور یہاں ہم بیس بال کارڈ کے\nاعدادوشمار، اوسط، کو کسر سکھانے کے لیے استعمال کرنے کے بارے میں کچھ خیالات دیکھ سکتے ہیں، اور یہ بہت اچھا ہے، لیکن یقیناً میں تھوڑا متعصب ہوں۔ میں بیس بال ہوں  اپنے آپ کو پسند کرتا ہوں اور یہ\nمیرے تمام طلباء پر لاگو نہیں ہوتا ہے اور اس لیے یہ وہ جگہ ہے\n جہاں Khanmigo واقعی آپ کا پارٹنر ہے اور آپ کے ساتھ مل کر\n طلباء کی ضروریات کو پورا کرنے کے لیے کام کر سکتا ہے۔ اس میں، میں خانمیگو سے\nاس میں تبدیلی کرنے کے لیے کہہ سکتا ہوں، اس معاملے میں میں\nکہوں گا کہ اس میں تبدیلیاں کریں اور میں جانتا ہوں کہ میری کلاس میں ٹیلر سوئفٹ کے ایک جوڑے ہیں۔ میں کہوں گا، اس کے\nبجائے یہ ٹیلر سوئفٹ کے بارے میں کریں اور مجھے نہیں معلوم کہ\nیہ کیسے کام کرے گا کیونکہ مجھے نہیں معلوم کہ آپ کس طرح ٹیلر سوئفٹ کو فریکشنز سے جوڑتے ہیں، اور خانمیگو مجھے یہاں کچھ آئیڈیاز دیں گے، ممکنہ طور پر اس کی\nلمبائی کو ٹریک کریں۔  , collaborations, to his sales ایک پچھلا معاملہ تھا جہاں\nKhanmigo نے مجھے Taylor Swift کی دھن میں فرق تلاش کرنے کی ایک مثال دی۔\n یہ وہ آئیڈیاز ہیں جن کے\nساتھ میں کبھی نہیں آتا اور نہ ہی کبھی آتا اگر میں\nخانمیگو کے ساتھ ذہن سازی نہ کرتا۔ تو سب سے پہلے اور سب سے اہم بات یہ ہے کہ خانمیگو\nایک بہترین سوچ کا ساتھی ہے۔ یہ سبق کی منصوبہ بندی کا ایک بہترین پارٹنر بھی ہے۔ اگر میں یہاں جاتا ہوں اور سبق کی منصوبہ بندی کا انتخاب کرتا ہوں، تو میں کہہ سکتا ہوں، آپ جانتے ہیں، مختلف حصوں کو شامل کرنا اور یہ ہمارے\nیہاں خان اکیڈمی کے مواد سے کھینچ لے گا۔ اور اس طرح میں دیکھوں گا کہ منفی حصوں کو جوڑنا اور گھٹانا سبق کا منصوبہ بناتا ہے اور یہ ایک مکمل\nپانچ حصوں پر مشتمل سبق کا منصوبہ بنائے گا جس میں تفریق شامل ہے۔ اور یہ وہ جگہ ہے جہاں ہماری\nفوری انجینئرنگ ٹیم، اس ٹیم کے بہت سے سابق اساتذہ نے ایک تجربہ ڈیزائن کرنے کے لیے کام کیا ہے جہاں Khanmigo وہ حکمت عملی فراہم کر رہا ہے جو آپ کے ساتھی استاد دوسرے استاد کو اپنے کلاس رومز میں شامل کرنے کے لیے تجویز کریں گے۔ آخری، لیکن یقینی طور پر کم از کم، Khanmigo اسائنمنٹس تجویز کرنے جیسے کام بھی کر سکتا ہے۔\n لہذا اگر میں کلاس سے پہلے صرف اس بارے میں سوچ رہا ہوں کہ مجھے اپنے طلباء کے ساتھ کیا کام کرنا چاہئے، تو وہ شاید\nایک دو عنوانات پر کام کر رہے ہوں گے، لیکن مجھے واقعی یقین نہیں ہے کہ آگے کیا ہے، میرے پاس ہمیشہ\nگنجائش اور ترتیب کے بارے میں سوالات تھے اور کیا  کیا کے بعد سکھانے کے لئے سمجھ میں آتا ہے، میں صرف اس معاملے میں Khanmigo سے پوچھ سکتا ہوں. اور خانمیگو مجھے کچھ آئیڈیاز دے گا کہ کل کو اپنے طلباء کے ساتھ کیا کام کرنا ہے\n اور کہے گا کہ گروپ ون کو تفویض کریں اور میں اسے خانمیگو سے براہ راست تفویض کر سکتا ہوں اور یہ اگلے دن میرے طلباء کے کھاتوں میں ان کے کام کرنے کے لیے ہو جائے گا۔  پر لہٰذا واقعی، اس بارے میں بہت پرجوش ہوں کہ استاد کے استعمال کے معاملے میں خانمیگو کہاں گیا ہے۔ آج ہی واقعی مفید ہے۔ ایک ٹیم کے طور پر ہمارے پاس مستقبل کے ٹولز اور آئیڈیاز کے\nوائٹ بورڈز پر وائٹ بورڈز ہیں کہ \nخانمیگو کو آگے کہاں لے جانا ہے۔ تو اس کے لئے دیکھتے رہیں. لیکن یہ میری آج کی تازہ کاری ہے اور میں اسے\n لکھنے والے کوچ کے بارے میں تھوڑا سا اشتراک کرنے کے لیے سارہ کے حوالے کروں گا۔ - شکریہ، Gintas. ٹھیک ہے، تو مجھے لگتا ہے کہ آپ میں سے اکثر جانتے ہیں، خان اکیڈمی\nاپنے STEM مواد کے لیے بہت مشہور ہے، یہ بہترین ویڈیوز اور مضامین اور مشقیں اور مہارت سیکھنے کے لیے ہیں۔ ہم ان کچھ پیشرفتوں کے بارے میں واقعی پرجوش ہیں\n جو ہم دیکھ رہے ہیں جب بات AI اور ELA اور ہیومینٹیز کی ہو۔ اور ہم\nپچھلے ایک سال میں اس جدت اور اس موقع کو ELA اور ہیومینیٹیز ٹیچر کے استعمال کے معاملات میں لاگو کرنے کے لیے بہت محنت کر رہے ہیں۔ تو میں جو شئیر کرنے والا ہوں وہ ایک پروجیکٹ ہے جسے ہم رائٹنگ کوچ کہہ رہے ہیں۔ یہ ایسی چیز ہے جو ابھی\nتک دستیاب نہیں ہے۔ ہم اسے\nاسکول کے اس سیزن کے لیے شروع کر رہے ہیں۔ اس وقت، ایک خصوصیت موجود ہے\nجو کہ رائٹنگ کوچ کے پیش نظارہ کی طرح ہے جسے آپ دیکھ سکتے ہیں کہ آیا آپ کے پاس طلباء کے لیے Khanmigo تک رسائی ہے۔ اور اس کو ہماری تعلیمی\nمضمون فیڈ بیک سرگرمی کہا جاتا ہے۔ لیکن میں آپ کو ایک\nپیش نظارہ دینے والا ہوں کہ \nایک لمحے میں رائٹنگ کوچ اسکول کے موسم میں اس طرح کی نظر آئے گی۔ لیکن واقعی جلدی، اگر آپ، اور مجھے لگتا ہے کہ آپ میں سے بہت سے لوگ اس وقت اسکولوں میں\n تحریری ہدایات کے اس جھنجھٹ سے واقف ہیں۔ تحقیق ہمیں بتاتی ہے کہ طلباء کو \nکلاس رومز، مڈل اور ہائی اسکول کے طلباء میں لکھنے میں روزانہ 60 منٹ گزارنے کی ضرورت ہوتی ہے۔ 10% سے بھی کم طلباء\nدرحقیقت اس مقصد تک پہنچ رہے ہیں۔ ہم یہ بھی جانتے ہیں کہ تحریری ہدایات میں بہتری لانے کے لیے، طلباء کو اپنی تحریر پر مخصوص، قابل عمل تاثرات کی ضرورت ہوتی ہے\n جو\nممکن حد تک بروقت پہنچائی جاتی ہے۔ ایسا تقریباً کبھی نہیں ہوتا\nجو حقیقت میں ہوتا ہے۔ اور نتیجے کے طور پر، اساتذہ\nکافی تحریر تفویض نہیں کرتے ہیں۔ اگر وہ ہر مضمون پر ذاتی رائے دینے کی کوشش بھی کرتے ہیں تو وہ بہت جل جاتے ہیں، \n لہذا یہ کوئی تعجب کی بات نہیں ہے کہ طلباء اپنی تحریری صلاحیتوں میں پیچھے ہیں۔ جیسا کہ میں نے پہلے ذکر کیا، میں انگریزی کا ایک سابق\nاستاد ہوں، اپنے 100 طلباء کو ایک مضمون تفویض کرنے میں\nمجھے \nان کے تمام مضامین پر ذاتی رائے فراہم کرنے میں 17 گھنٹے لگیں گے۔ تو میرے خیال میں\nرائٹنگ کوچ کے بارے میں جو خاص طور پر دلچسپ ہے وہ سب سے پہلے وہ خصوصیات ہیں\nجو یہ طلباء کو فراہم کرتی ہیں۔ لہذا ایک چیز جو ہم جانتے ہیں کہ ظاہر ہے کہ طلباء کو بہتر مصنف بننے کے لیے فیڈ بیک کی ضرورت ہوتی ہے، لیکن ہم نے جن اساتذہ سے بات کی ہے ان میں سے بہت سے اساتذہ نے\nہمیں بتایا، \"یہ بہت اچھا ہے کہ آپ کا\nموجودہ فیڈ بیک ٹول مضامین پر رائے دیتا ہے، لیکن میں کر سکتا ہوں\"  یہاں تک کہ میرے زیادہ تر طالب علموں کو اس مقام تک پہنچانا نہیں ہے جہاں ان کے\nپاس پہلا مسودہ ہو۔\" وہ مکمل\nآغاز کا ٹکڑا، خاکہ، یہ دانت کھینچنے کے مترادف ہے۔ یہاں تک کہ طلباء کو شروع کرنے کے لئے کچھ پیدا کرنے کے لئے حاصل کرنا واقعی مشکل ہے۔ اور میں بھی، جیسا کہ، یہ\nمیرا تجربہ بھی تھا، مجھے اپنے اردگرد دیکھنے کا وہ لمحہ یاد ہے اور طالب علموں کو بس اتنا پھنسا ہوا محسوس ہوتا ہے۔ لہذا رائٹنگ کوچ ٹول کے ساتھ، یہ اصل میں \nشروع سے ہی تمام تحریری عمل میں طلباء کی مدد کرتا ہے۔ پہلا قدم\nجو رائٹنگ کوچ کرتا ہے وہ طالب علم سے بات کرتا ہے۔ خانمیگو\nطالب علم سے مضمون کے پرامپٹ کے بارے میں بات کرے گا۔ یہ اس بات کو یقینی بنائے گا کہ وہ سمجھتے ہیں کہ توقعات کیا ہیں اور اگر کوئی ایسے الفاظ ہیں جن سے وہ ناواقف ہیں، Khanmigo ان کی یہ\nسمجھنے میں مدد کرے گا کہ تردید کیا ہے، میں جوابی دلیل کیسے لکھوں؟ اس قسم کی چیزیں۔ لہٰذا یہ پیش نظارہ یہ ظاہر کرتا ہے کہ طالب علم کے لکھنا شروع کرنے سے پہلے ابتدائی فوری جائزہ کا مرحلہ، جہاں وہ خانمیگو کے ساتھ ایک آرام دہ اور کم دباؤ والی\nبات چیت کرتے ہیں تاکہ وہ مضمون کی تفویض کے بارے میں سوچ سکیں۔\n اور پھر یقیناً\nاگلے مراحل میں سے ایک خاکہ بنانا ہے۔ لہٰذا\n خاکہ نگاری کے\nعمل کے ذریعے خانمیگو کے طلباء کی مدد کرنے کا ایک فائدہ یہ ہے کہ خانمیگو جانتا ہے کہ استاد کی تفویض کیا تھی۔ لہٰذا خانمیگو جانتا ہے کہ\nاستاد کو کتنے پیراگراف کی توقع ہے، استاد کس قسم کے اقتباسات\nدیکھنا چاہتا ہے، وہ طالب علموں کو کس قسم کی تفصیلات شامل کرنا چاہتے ہیں۔ اور جب طالب علم\nاپنے خاکہ پر کام کر رہا ہوتا ہے، Khanmigo یقینی بنا سکتا ہے\nکہ وہ ٹریک پر ہیں۔ اور اگر طالب علم کے پاس سوالات ہیں، تو خانمیگو جانتا ہے کہ کس طرح جواب دینا ہے۔ اور اگر آپ کے پاس ایسے طالب علم ہیں\nجو تھیسس لکھنے کی بات کرتے وقت مکمل طور پر کھو چکے ہیں، Khanmigo کو تربیت دی گئی ہے کہ وہ طالب علموں کے لیے کوئی کام کیے بغیر خاکہ کے ان مختلف عناصر کو لکھنے اور ڈرافٹ کرنے کے ذریعے مدد کرے۔\n \n جب مسودہ تیار کرنے کی بات آتی ہے، ظاہر ہے کہ خانمیگو کے پاس اب\nطلباء کا خاکہ ہے جس پر اس نے طالب علم کے ساتھ کام کیا ہے۔ لہذا یہ\nطالب علم کی اس قسم کی مدد کر سکتا ہے کہ اسے ان کے مسودے میں پلگ کر اور اسے مزید باہر نکال سکے۔ اور بلاشبہ،\nدیگر تمام خصوصیات کی طرح، یہ\nطالب علم کے لیے تحریر نہیں کرے گا، لیکن اگر وہ پھنس جاتے ہیں اور انہیں تھوڑی بہت مدد کی ضرورت ہوتی ہے تو یہ موجود ہے۔ \n ایک طالب علم کی ڈرافٹنگ کے طور پر پردے کے پیچھے دوسری چیزیں بھی ہو رہی ہیں جو طالب علم ہمیشہ نہیں دیکھ سکتا کہ\nآپ استاد کے اختتام پر ایک لمحے میں دیکھیں گے۔ اور نظر ثانی کے لیے، طالب علم اپنا\nمسودہ خانمیگو کو فیڈ بیک کے لیے جمع کرا سکتا ہے۔ Khanmigo\nفیڈ بیک کے پانچ اہم شعبوں میں تجاویز تیار کرتا ہے جو زیادہ تر اہم روبرکس سے منسلک ہوتے ہیں۔ طلباء خانمیگو سے اپنے حاصل کردہ تاثرات کے بارے میں پوچھ سکتے ہیں،\n لیکن سب سے زیادہ پرجوش بات یہ ہے کہ وہ صفحہ پر اپنے مضمون پر نظر ثانی کر سکتے ہیں\n اور حقیقی وقت میں Khanmigo سے فالو اپ فیڈ بیک حاصل کر سکتے ہیں\n تاکہ وہ فوری طور پر جان سکیں، کیا میری نظرثانی نے اس\nتجویز پر توجہ دی جو آپ نے مجھے دی تھی؟  ? اور اساتذہ کے لیے، مجھے لگتا ہے کہ\nیہ وہ جگہ ہے جہاں رائٹنگ کوچ، جہاں واقعی جادو دکھانا شروع ہوتا ہے۔ لہذا چونکہ طلباء\n پورے تحریری عمل کے ذریعے خانمیگو کے ساتھ بات چیت کر رہے ہیں، اس کے بعد ہم اس کی ترکیب کر سکتے ہیں اور اس کی اطلاع استاد کو واپس کر سکتے ہیں اور انہیں واقعی مددگار بصیرت فراہم کرتے ہیں کہ طلباء کیا کرنے کے قابل تھے، انہوں نے کس چیز کے ساتھ جدوجہد کی۔ تو کچھ چیزیں جو اساتذہ دیکھ سکیں گے ان میں شامل ہیں، یقیناً اسائنمنٹ میں جہاں\nہر طالب علم ہے، فلاں فلاں اپنے خاکہ پر کام کر رہا ہے۔ یہ شخص پہلے سے ہی نظر ثانی کر رہا ہے، وہ دیکھ سکتا ہے کہ مسودہ تیار کرنے کے\n مقابلے میں ترمیم کرنے یا\nخاکہ بنانے میں کتنا وقت صرف ہوا۔ وہ موجودہ الفاظ کی گنتی دیکھ سکتے ہیں، وہ فیڈ بیک کی تقسیم کے بارے میں اعلیٰ سطح کا ڈیٹا دیکھ سکتے ہیں۔ تو آپ جانتے ہیں، زیادہ تر طلباء نے\nشواہد سے متعلق رائے حاصل کی۔ شاید یہ وہ چیز ہے جس پر آپ کو\nبعد میں ہدایات کے لیے توجہ دینی چاہیے۔ اور پھر یہ ممکنہ\nاصلیت کے خدشات یا یہ جھنڈے۔ تو یہ وہ چیزیں ہیں جن کا میں نے تذکرہ کیا جب ایک طالب علم ڈرافٹنگ کر رہا ہو یا\nخاکہ بنا رہا ہو یا نظر ثانی کر رہا ہو، اگر وہ تجربے میں متن کی ایک بڑی مقدار چسپاں کر رہا ہے اور خانمیگو کو نہیں\nمعلوم کہ یہ کہاں سے آیا ہے، یہ کہاں سے آیا ہے۔  خاکہ اس بات چیت سے آیا یا نہیں آیا، ہم استاد کے لیے ایک جھنڈا اٹھائیں گے کہ پھر وہ اندر جا کر چھان بین کر سکتے ہیں اور دیکھ سکتے ہیں کہ کیا چسپاں کیا گیا تھا، دیکھیں کہ کیا ہوا، اس میں ایک قسم کی کھدائی، جو بات چیت\nمیں نے کی ہے۔  اساتذہ کو یہ کرنا پڑا، آپ\nجانتے ہیں، گوگل ڈاکس یا ڈرافٹ بیک کروم ایکسٹینشنز کا استعمال کرتے ہوئے\nایک وقت میں ایک طالب علم اپنے آپ میں ناقابل یقین حد تک\nوقت گزار سکتا ہے۔ اور ChatGPT کے ساتھ، میرے خیال میں\nیہ اتنا ہی بڑا مسئلہ ہے جتنا کہ اساتذہ نے دیکھا ہے۔ لہذا ہم تحریری کوچ کے\nطلباء کے فوائد کے بارے میں واقعی پرجوش ہیں، لیکن پھر\nان اساتذہ کی بہت سی خصوصیات جو اس کے ساتھ آئیں گی۔ - اس سے پہلے کہ ہم سوالات کے لیے سال جائیں 'کیونکہ مجھے یقین ہے کہ آپ کے پاس\nاس کے لیے بہت ساری چیزیں ہیں، بس آپ کو یہ بتانا چاہتا ہوں کہ میں\n یہاں خان اکیڈمی میں اسکولوں، اسکولوں کے اضلاع اور اب ریاستوں کے ساتھ کام کرنے والی اپنی شراکتی ٹیم کی سربراہی کرتا ہوں۔ ہماری خان اکیڈمی کے اضلاع کے ساتھ ساتھ خانمیگو کی پیشکش کرنے کے لیے کچھ سطح پر۔ لہذا ہمارے بہت سے مواد اور ٹولز مفت ہیں اور آپ کے طلباء اور اساتذہ کے استعمال کے لیے مکمل طور پر قابل رسائی ہیں۔ ملک کے تقریباً ہر ضلع میں ان کے اساتذہ\nخان اکیڈمی کا مفت ورژن استعمال کر رہے ہیں کیونکہ یہ ایک شاندار\nاضافی وسیلہ ہے۔ اگر آپ معاونت کے اضافی خطوط چاہتے ہیں اور آپ چاہتے ہیں کہ آپ کے طلباء کو\nKhanmigo تک رسائی حاصل ہو، تو آپ میری ٹیم کے ساتھ شراکت کر سکتے ہیں، جو کہ خان اکیڈمی\nڈسٹرکٹ کی پارٹنرشپ ٹیم ہے جو کہ آپ کو بنیادی طور پر خان اکیڈمی کے کورسز اور مواد کے لیے تعاون حاصل کرنے کی اجازت دیتی ہے، بلکہ  آپ کے طلباء\nاور اساتذہ خانمیگو تک رسائی حاصل کرتے ہیں۔ Khanmigo کے لیے طالب علم کی رسائی صرف\nہماری ضلعی شراکت داری کے حصے کے طور پر دستیاب ہے۔ اور اس طرح اس کے کام کرنے کا طریقہ یہ ہے کہ آپ بنیادی طور پر\nروسٹرنگ سروسز حاصل کرنے والے ہیں، آپ کو ڈیٹا اینالیٹکس حاصل کرنے والے ہیں اور آپ کو خان ​​اکیڈمی کی پیش کش کے ساتھ ساتھ خانمیگو کے لیے بھی پیشہ ورانہ تعلیم حاصل کرنے والے ہیں۔ اور پیشہ ورانہ\nتعلیم واقعی اہم ہے کیونکہ ظاہر ہے کہ یہ\nAI ہم سب کے لیے نیا ہے۔ لہذا ہم اس بات کو یقینی بنانا چاہتے ہیں کہ یہ ایک ایسا سفر ہے جس سے ہم ایک ساتھ گزر رہے ہیں\nلہذا ہمارے پاس اپنی ضلعی شراکت کے حصے کے طور پر آپ کے لیے واقعی مضبوط پیشہ ورانہ سیکھنے کے وسائل موجود ہیں۔ ہماری شراکت داری\n250 طلباء سے شروع ہوتی ہے۔ لہذا اگر آپ ایک چھوٹا ضلع ہیں یا شاید آپ ایک بڑا ضلع ہیں اور صرف\nاپنے پیر کو پانی میں ڈبونا چاہتے ہیں، تو ہم آپ کی مرضی کے مطابق 250 طالب علموں کے لائسنسوں کے لیے شراکت کر سکتے ہیں۔\n ہم صرف طالب علم کے لائسنس کے لیے چارج کرتے ہیں، اس لیے اگر آپ\nضلعی پیشکش میں ہمارے لیے شراکت دار ہیں اور طلبہ کے لائسنس کے لیے ادائیگی کر رہے ہیں، تو اساتذہ کے لائسنس\nمفت ہوں گے، جو کہ بہت اچھی بات ہے۔ اور ایک بار پھر، جیسا کہ ہم نے بات کی، عمل درآمد کی حمایت ہے جہاں ہم آپ کا ہاتھ پکڑ کر آپ کو\nبہترین طریقوں سے گزاریں گے، خان اکیڈمی سے کیسے فائدہ اٹھایا جائے،\nخانمیگو کو کیسے فائدہ اٹھایا جائے، اپنے اساتذہ کو تربیت دیں، اپنے عملے کو تربیت دیں، اپنے عملے کو تربیت دیں۔  منتظم تاکہ\nہر کوئی اس بات کے لیے بورڈ میں موجود ہو کہ پلیٹ فارم کو کس طرح استعمال کیا جانا چاہیے۔ میں یہ کہوں گا کہ خانمیگو کے ساتھ پیشہ ورانہ تعلیم لازمی ہے کیونکہ یہ بہت نیا ہے اور ہر کوئی سیکھتا ہے جیسے ہم جاتے ہیں۔ ہمارا اصرار ہے کہ ہمارے ساتھ شراکت داری کے حصے کے طور پر آپ کے پاس کسی قسم کی PL ہے۔ اور PL\nشراکت داری کے دائرہ کار پر منحصر ہے۔ چھوٹی پارٹنرشپس کے لیے، یہ ڈیمانڈ PD پر ہو سکتا ہے کہ آپ کے اساتذہ لائیو ورچوئل اوقات کے ذریعے اسائنک کر سکتے ہیں اور یہاں تک کہ ذاتی طور پر PL دنوں کی سفارش کر سکتے ہیں کہ ہم آپ کے ضلع میں آ سکتے ہیں اور PL کیلنڈر کے لحاظ سے آپ کے عملے کو تربیت دے سکتے ہیں۔\n لیکن یہاں کا خیال یہ ہے کہ ہم\nسب کو سپورٹ کرنا چاہتے ہیں، آپ کے تمام اساتذہ کو سپورٹ کرنا چاہتے ہیں\nاور AI Khanmigo کے ساتھ بہترین طرز عمل کرنا چاہتے ہیں تاکہ\nآپ کے طلباء اور اساتذہ اس پلیٹ فارم سے زیادہ سے زیادہ فائدہ اٹھا سکیں۔ اور اگر آپ دلچسپی رکھتے ہیں، تو\nآپ یہاں دو چیزیں کر سکتے ہیں۔ آپ ہمیں براہ راست districts@khanacademy.org پر ای میل کر سکتے ہیں\n یا یہاں ایک QR کوڈ ہے، جو آپ کو ہمارے\nضلع کے لینڈنگ پیج پر لے جائے گا، جس میں ہمارے ضلع کی پیشکش خانمیگو، وغیرہ کے بارے میں معلومات کا ایک گروپ ہے۔\n تو ہم ابھی اسٹینڈ بائی پر ہیں۔ میری ٹیم مدد کرنے کے لیے تیار ہے، لیکن چاہے آپ\nمزید تفصیلی ڈیمو چاہتے ہیں، ہمیں قیمتوں کے بارے میں وہ یا مزید تفصیلی معلومات فراہم کرنے میں خوشی ہے، ان میں سے کسی ایک ٹچ پوائنٹ کے ساتھ فراہم کرنے میں خوشی ہے،\n لیکن آپ سے بات کرنے کے منتظر ہیں اگر  آپ کے کوئی سوال ہیں اور اب میں اسے واپس سال میں پھینکنا پسند کروں گا تاکہ ہمارے پاس آپ کے سوالات کے جوابات دینے کے لیے اس کے پاس زیادہ سے زیادہ وقت ہو۔ - شکریہ، جیسن. تو ہاں، میں اور یہاں کے دیگر، نہ صرف میں، کسی بھی سوال اور آپ کے ذہن میں آنے والے کسی بھی خیالات کا جواب دینے میں خوش ہوں۔ - ہمارے پاس کچھ سوالات ہیں\nجو ابھی موجود ہیں۔ کیا تحریری کوچ کے\nپاس متن پر مبنی تحریری اشارے بنانے کی صلاحیت ہے جہاں طلباء کو پڑھنے اور تجزیہ کرنے کے لیے استثناء داخل کیا جاتا ہے؟ کیا آپ\nاس کے ساتھ تھوڑا سا مزید گہرائی میں جانا چاہتے ہیں؟ - ایک بات میں کہوں گا کہ ہم خاص طور پر\nادبی تجزیہ مضامین کی حمایت کرتے ہیں۔ آپ جانتے ہیں، ساختی طور پر، میرے خیال میں خانمیگو طلباء کی مدد کرنے میں بہت اچھا کام کرتا ہے۔ اگر مضمون کسی ایسی چیز کے بارے میں ہے\nجو اچھی طرح سے مشہور ہے جو 2023 سے پہلے شائع ہوئی تھی، جو کہ GPT-4 کے\nعلم کی بنیاد تک پہنچ جاتی ہے، تو طالب علموں کو حقیقت میں متن کا تجزیہ کرنے میں\nKhanmigo سے تعاون حاصل ہوتا ہے۔ لہذا اگر طالب علم اس طرح ہے، \"میں واقعی\nاس تھیم یا اس کردار کو نہیں سمجھتا، یا کہانی میں ہوا کچھ،\" خانمیگو اس متن سے واقف ہے اور اس میں ان کی مدد کر سکتا ہے۔ لہذا آپ اصل میں ابھی\nتک اپنا متن اپ لوڈ نہیں کر سکتے۔ اگرچہ مجھے لگتا ہے کہ ہم جلد ہی اس طرح کی کسی چیز کی حمایت کر سکیں گے۔\n لیکن یہ طلباء کی مدد کر سکتا ہے اگر متن کافی اچھی طرح سے معلوم ہوں۔ - اور پھر ایک\nسوال بھی ہے، کیا ہمارے پاس DSA ہے؟ - ہمارے پاس متعدد اضلاع کے ساتھ اس کے ورژن ہیں۔\n زیادہ تر دن کے اشتراک کے معاہدے جن سے میں واقف ہوں وہ ہیں جہاں ہم نے اسکول ڈسٹرکٹ کے ساتھ شراکت کی ہے اور ہم\nافادیت کے نتائج کو بہتر طور پر سمجھنا چاہتے ہیں۔ لہذا ہمارے پاس وہاں کئی اضلاع ہیں اور اس طرح ہم تجزیہ کرنے میں مدد کر سکتے ہیں کہ آیا ہم امید کے ساتھ ڈائل کو اس طرح منتقل کر رہے ہیں جس طرح ہمارے بہت سے افادیت کے مطالعے سے پتہ چلتا ہے کہ وہ کریں گے۔ لیکن ہاں، ہم واضح طور پر ہیں، مجھے لگتا ہے کہ\nجب ڈیٹا پرائیویسی اور ڈیٹا کے ٹھوس استعمال کی بات آتی ہے تو ہم رہنما ہوتے ہیں، صرف اسے ذاتی نوعیت کے تجربے، افادیت کی پیمائش، وغیرہ کے لیے استعمال کرتے ہیں۔ لیکن ہاں، بہت زیادہ۔ - ہاں، جان، آپ\ndistricts@khanacademy.org ای میل ایڈریس پر ای میل کر سکتے ہیں اور ہم\nآپ کے ساتھ حل کر سکتے ہیں، ہمارے پاس ریاستی سطح کے معاہدے ہیں، ہمارے پاس کنسورشیم کے\nمعاہدے ہیں، DSAs اور DPAs، ہم براہ راست اضلاع کو بھی فراہم کرتے ہیں۔ تو ہم یقینی طور پر آپ کو چھانٹ سکتے ہیں۔ لیکن سال شاید اس\nبارے میں بات کرنا مفید ہو کہ ہم اوپن اے آئی کے ساتھ کیا شیئر کرتے ہیں یا نہیں جو ڈیٹا شیئرنگ اور طلباء کے استعمال کے لحاظ سے \nپلیٹ فارم پر اس سیکھنے اور استعمال کے لحاظ سے۔ \n - ضرور. ہاں، میں\nعام طور پر ڈیٹا کے بارے میں تھوڑی بات کروں گا۔ ظاہر ہے کہ مصنوعی ذہانت کے ساتھ بہت سارے مواقع ہیں، لیکن یہاں کچھ خوف بھی ہے۔ دھوکہ دہی کا خوف ہے، طالب علموں کا\nAI کے ساتھ مشکوک کام کرنے کا خوف ہے اور پھر اس بات کا خدشہ ہے، کیا یہ گفتگو\nکسی طرح مستقبل کے ماڈلز کے تربیتی ڈیٹا میں شامل ہو جاتی ہے؟ اور اس طرح یہ کسی طرح سے\nڈیٹا کی رازداری کا خطرہ پیدا کر سکتا ہے خاص طور پر کسی انتہائی حساس چیز کے ساتھ، جیسے کہ طالب علم کا ڈیٹا۔ تو میں اس ترتیب میں جاؤں گا۔ طالب علموں کے لیے، خان\nاکیڈمی سپورٹ نہیں کرتی، اس سے صرف سوال کا جواب نہیں ملے گا۔ یہ واقعی ایک اخلاقی ٹیوٹر کے طور پر کام کرتا ہے۔ سارہ نے آپ کو اس میں سے تھوڑا سا دکھایا، ایک ٹی ای ڈی ٹاک ہے جو میں نے پچھلے سال دی تھی جو اس پر بہت زیادہ گہرائی میں جاتی ہے، لیکن ہم بہت واضح ہیں۔ اب، اساتذہ کے پاس ٹیچر موڈ ہے اور اگر وہ اسے سٹوڈنٹ موڈ پر رکھتے ہیں، تو وہ دیکھتے ہیں کہ طلباء کیا دیکھیں گے، اگر وہ اسے ٹیچر موڈ میں رکھتے ہیں، تو یہ درحقیقت نہ صرف\nجوابات کے ساتھ اساتذہ کی مدد کرتا ہے، بلکہ یہ ایک سپر ٹیچر کے گائیڈ کی طرح کام کرتا ہے۔ یہ ان تمام چیزوں میں مدد کر سکتا ہے جو Gintas دکھا رہا تھا، سبق کے منصوبے، سبق کے ہکس،\nوغیرہ وغیرہ۔ ایک اور علاقہ، ایک گارڈریل جو ہمارے پاس ہے جب طلباء خانمیگو کے ساتھ بات چیت کرتے ہیں، تو وہ تمام تعاملات\nاساتذہ کے ذریعہ قابل مشاہدہ ہوتے ہیں۔ اور پھر ہمارے پاس ایک\nماڈریشن API یا ایک اعتدال AI بھی ہے۔ لہذا اگر طالب علم کے ساتھ بات چیت ہوتی ہے، تو وہ کہہ رہے ہیں کہ وہ\nچاہتے ہیں، جنت منع ہے، بم بنانا چاہتے ہیں یا وہ\nخود کو نقصان پہنچانا چاہتے ہیں، یہ ان گفتگو کو بند کر دے گا اور\nاساتذہ اور منتظمین کو فعال طور پر مطلع کر دے گا۔ اب ڈیٹا، اور یہ\nخان اکیڈمی کے لیے جنریٹیو AI سے پہلے ایک اصول ہے، یہ ہے\nکہ ہم صرف ڈیٹا کا استعمال کرتے ہیں، اور یہ ایک وجہ ہے کہ\nہم غیر منافع بخش ہیں، اس لیے ہمیں کوشش کرنے کا لالچ بھی نہیں آتا۔\n کسی مشکوک طریقے سے ڈیٹا منیٹائز کرنے کے لیے۔ ہم صرف اپنے اثرات کی پیمائش کرنے، تجربے کو ذاتی بنانے،\nتجربے کو بہتر بنانے، یا کلیدی بھروسہ مند\nاسٹیک ہولڈرز جیسے اساتذہ یا اضلاع کو مطلع کرنے کے لیے ڈیٹا کا استعمال کرتے ہیں، یہ ڈیٹا کے لیے ہمارے صرف استعمال ہیں۔ لہذا جب یہ AI دائرے میں آتا ہے،\nجیسا کہ میں نے ابھی ذکر کیا ہے، ہم طلباء کی گفتگو کو محفوظ کر رہے ہیں۔ ہم اسے صرف\nاساتذہ کی رپورٹنگ کے لیے استعمال کر رہے ہیں یا جو کچھ ہو رہا ہے اور ہم اسے کیسے بہتر بنا سکتے ہیں اس کی اپنی تشخیص کے لیے کر رہے ہیں۔ ہم ان بات چیت کی اجازت نہیں دیتے ہیں، اور یہ وہ معاہدے ہیں جو ہمارے پاس بنیادی AI کمپنیوں کے ساتھ ہیں\nکہ ڈیٹا کو مستقبل کے ماڈلز کے عمومی مقصد کی تربیت کے لیے استعمال نہیں کیا جا سکتا۔\n لہذا طلباء کی کوئی بھی نجی معلومات اس میں داخل نہیں ہو سکتی، آئیے\nاسے عوامی دائرے کا نام دیں۔ ہم اس معلومات کو ایک \nبار پھر ذاتی بنانے یا طالب علموں کے لیے زیادہ موثر بنانے کے لیے اپنے ورژن کو بہتر بنانے یا تربیت دینے کے لیے استعمال کر سکتے ہیں۔ لیکن ایک بار پھر، وہ خان اکیڈمی کے اس باغ میں رہے گا، وسیع دنیا کے لیے نہیں۔ تو ہم اسے بہت سنجیدگی سے لیتے ہیں۔ اور آپ جانتے ہیں، واضح طور پر، بہت\nسارے لوگ ہیں، اگر ہم ایک منافع بخش\nکمپنی ہوتے، ہر روز، میرے پاس کچھ AI کمپنی ہے جو\nہمیں اس ڈیٹا کے لیے ادائیگی کرنے کی پیشکش کرتی ہے اور ہم نہیں کہہ رہے ہیں۔ تو آپ تصور کر سکتے ہیں کہ\n اگر ہمارا طرز حکمرانی\nتھوڑا سا مختلف ہوتا تو کیا ہوتا۔ - ہاں، اور سال ایک بہت اچھا نقطہ پیش کرتا ہے، جیسا کہ آپ سب AI پروڈکٹس کو دیکھ رہے ہیں، چاہے وہ Khanmigo ہو یا\nوہاں کی دوسری کمپنیاں، میں واقعی میں آپ کو رازداری کی پالیسیوں کو پڑھنے کی ترغیب دوں گا۔ وہاں یہ کمپنیاں\nہر روز پاپ اپ ہو رہی ہیں۔ وہاں بہت سارے اسٹارٹ اپس ہیں، ہم نہیں جانتے کہ ان کے پیچھے کون ہے۔ ہم نہیں جانتے کہ کیا تعلیمی لوگ \nاس کی تعلیم اور سیکھنے کو دیکھ رہے ہیں۔  ابھی وہاں لوگوں کا ایک گروپ ہے\n جن کے نام آپ کو معلوم ہوں گے،\nان کی پرائیویسی پالیسیوں کو پڑھیں اور وہ خاص طور پر کہتے ہیں، ہم طلباء کا ڈیٹا اس وقت تک شیئر یا فروخت نہیں کریں گے جب تک کہ ہم حاصل نہیں کر لیتے\nیا کاروبار سے باہر نہیں جاتے، جو کہ\n95% ہونے والا ہے۔  ان کمپنیوں کے. اور اس طرح وہ کیا کریں گے جب ان کے پاس\nپیسہ ختم ہو جائے یا وہ حاصل ہو جائیں؟ کیا ان کے پاس وہی گارڈریل ہیں جو خان ​​اکیڈمی جیسی کمپنی\nشیئرنگ کے معاملے میں کرتی ہے؟ لہذا بہت محتاط رہیں کیونکہ\nآپ ابھی خلا میں موجود مصنوعات کو دیکھ رہے ہیں، وہ \nڈیٹا شیئرنگ، ڈیٹا پرائیویسی، ڈیٹا گورننس کے حوالے سے کیا کر رہے ہیں کیونکہ میرے خیال میں یہ واقعی\nاہم فیصلہ سازی ہے، آپ سب کے لیے انتخاب۔ - [راوی]\nآج ہمارے ساتھ شامل ہونے اور اس ویڈیو کو دیکھنے اور خان اکیڈمی کے سیکھنے\nاور اساتذہ کی کمیونٹی کا حصہ بننے کے لیے آپ سب کا شکریہ۔ اگر آپ مزید دیکھنا چاہتے ہیں کہ\nKhanmigo \nابھی کلاس رومز میں سیکھنے کو کس طرح سپرچارج کر رہا ہے، تو اپنی اسکرین پر موجود لنکس پر کلک کریں\nاور رابطے میں رہنے کے لیے اور کہیں بھی کسی کے لیے مفت، عالمی معیار کی تعلیم کے بارے میں اعلان سے محروم نہ ہوں ، تو یقینی بنائیں۔  سبسکرائب۔",
    "t_spanish": "- Hola a todos. Buenas tardes. Poco a poco estamos dando la bienvenida a la\ngente a la sala. Gracias por tomarse el tiempo de unirse a nosotros. Mi nombre es Felipe Escamilla, soy el Gerente de Video\naquí en Khan Academy.  En breve nos acompañará Sal Khan, director ejecutivo y fundador de Khan Academy. Él le contará un\npoco sobre nuestra misión, nuestra herramienta de inteligencia artificial y el asistente de maestro y tutor de estudiantes llamado Khanmigo. También contamos con dos gerentes de producto senior que se unirán a nosotros, Gintas Bradunas y Sarah Robertson. Voy a seguir adelante y\npresentarles a Sarah y Gintas ahora, contarles un poco sobre sus roles y lo que hacen aquí en Khan Academy y algunas de las cosas, un pequeño adelanto, de lo que presentarán hoy. Hola Sarah.  Hola Gintas. - Hola, Felipe. Bienvenidos a todos, soy Sarah Robertson. Como mencionó Felipe, soy gerente senior de productos\naquí en Khan Academy. Soy un ex\nprofesor de inglés hace muchos años. También trabajó anteriormente para CommonLit, otra empresa de tecnología educativa sin fines de lucro. Y llevo\npoco más de un año en Khan Academy. Principalmente me he centrado en nuestras iniciativas relacionadas con la alfabetización, por lo que he desarrollado contenido,\nherramientas y recursos para profesores de ELA y humanidades.  Lo más interesante en lo que\nhemos estado trabajando últimamente es nuestra herramienta Entrenador de escritura, que les mostraré en\ndetalle en un momento y dejaré que Gintas comparta sobre sí mismo. - Claro, gracias, Sara. Hola a todos, mi nombre es Gintas. Soy gerente senior de productos\nen nuestro equipo de experiencia docente. Y al igual que Sarah, fui\nmaestra en una vida pasada, así que fui maestra de inglés en la escuela secundaria, enseñé ELA en sexto y séptimo grado y luego me introdujeron en\nel mundo del producto. Y mi equipo, como sugiere el nombre, se centra principalmente en todo lo que podamos hacer para facilitar\nla vida de los profesores y hacer posible que, por supuesto, ayuden a sus alumnos a\nalcanzar sus objetivos de aprendizaje y sus necesidades. Así que es un equipo divertido. Tiene muchos otros\nex educadores involucrados, también muchos profesores de inglés.  A veces nos hundimos en la madriguera del conejo\ncon nuestras metáforas. Así que sí, estoy muy emocionado de mostrarles hoy nuestras herramientas Khanmigo y en qué hemos estado\ntrabajando para hacer de Khanmigo el asistente de profesor ideal. - Solo quería agradecer a\ntodos por unirse, solo les daré un poco de historia y luego se lo entregaré\nal equipo de Khan Academy para que profundice mucho más en las cosas. Pero supongo que la mayoría de la gente aquí está algo familiarizada con Khan Academy, una misión sin fines de lucro, educación gratuita y de primer nivel\n para cualquier persona en cualquier lugar. Y probablemente muchos de ustedes sepan cómo comenzó Khan Academy y yo solía hablar sobre la\nhistoria del origen simplemente como una forma divertida y peculiar en la que me\ninvolucré en Khan Academy, pero ahora hablo de ello porque creo que es muy relevante. a algo de lo que vamos a hablar con la IA y más allá.  Ya sabes, en el pasado\ncomencé a dar clases particulares a primos, se corrió la voz en mi familia, las clases particulares gratuitas comenzaron antes de que me diera cuenta, estoy\ndando clases particulares a muchos primos. Empiezo a intentar ampliar ese tipo de interacciones personalizadas uno a uno. Empiezo a hacer ejercicios de escritura\npara ellos, herramientas para el profesor. Fui el primer usuario de las herramientas para profesores para poder realizar un seguimiento\nde lo que hacían los estudiantes y asignar tareas a mis primos. Un amigo me sugirió hacer videos. Una vez más, esa fue una forma de ampliar algunas de estas mini lecciones que les estaba dando a mis primos. Y luego, si avanzamos rápidamente hasta ahora, o hace un par de años, Khan Academy es obviamente\nmucho más que yo, pero como una organización sin fines de lucro, lo que realmente hemos hecho,\ntodo lo que hemos estado haciendo, a pesar de  Ahora tenemos\nmás de 160 millones de usuarios, es la misma idea.  ¿ Cómo intentamos realmente\nescalar el tipo de atención, personalización y dominio del aprendizaje, que es simplemente que si los estudiantes aún no han\naprendido algo, deberían tener más oportunidades e incentivos para aprenderlo?  ¿ Cómo escalamos eso a\nmás y más estudiantes y cómo apoyamos a los maestros, educadores, líderes escolares y superintendentes para apoyar mejor a sus\nestudiantes en todas esas cosas? Esas fueron las herramientas docentes y el desarrollo profesional que hemos realizado a lo largo de los años. Avanzamos rápidamente hasta\nhace aproximadamente un año y medio, y fue entonces cuando OpenAI se\nacercó a nosotros por primera vez. Teníamos curiosidad pero escepticismo. Llevamos un tiempo monitoreando\nlo que está sucediendo en el mundo de la IA. No parecía listo para el\nhorario estelar, al menos en 2022. Pero luego, cuando vimos lo que podía hacer GPT-4, y solo para\naclarar un poco parte de la terminología, mucha\ngente conoce ChatGPT, ChatGPT es  una aplicación que luego crearon\noriginalmente en un modelo anterior. Ahora, puedes acceder a él\nen GPT-4 si pagas dinero, pero los modelos son GPT-3, GPT-4, Google tiene modelos como Gemini, etc., y luego tienes las aplicaciones. Pero cuando vimos de qué era capaz GPT-4, a pesar de que tenía sus\npuntos difíciles, dijimos: \"Vaya, esto podría llevarnos mucho más lejos para poder escalar el\ntipo de personalización que queremos hacer para los estudiantes\". Y podría ser mucho más poderoso para apoyar a los docentes\". Todas estas tareas que los\nmaestros deben hacer, claramente tienen que informar sobre cómo les está yendo a sus estudiantes, pero también están haciendo\ncosas como planes de lecciones, boletos de salida,\ninformes de progreso, etcétera, etcétera. Tal vez podría ser parte, podría ser un tutor para cada estudiante y un asistente de enseñanza\npara cada maestro. Así que ese es el viaje que empezamos a emprender. Obviamente hubo\nmuchas preguntas sobre cómo manejar la seguridad, la privacidad y las trampas, y estamos trabajando en todas ellas y creemos que tenemos buenas respuestas, pero les mostraremos\nespecialmente muchas de las herramientas que son útiles para los maestros.\nEstamos muy emocionados de enfrentar eso, y recientemente hemos realizado una\nrenovación bastante significativa y lo hemos hecho mucho más accesible para muchos más educadores, pero también reconocemos que este es un viaje que esperamos que muchos de\nTodos quieren continuar con nosotros, que puede serles\nútil de inmediato ahora mismo, pero a medida que lo usen y aprendamos de cómo lo usan, podemos hacerlo cada vez mejor para que podamos  lo apoyamos y nosotros podemos apoyar a sus estudiantes. Entonces con eso, se lo pasaré al equipo\npara que puedan mostrarles un poco de lo que hemos estado. - Está bien, gracias, Sal. Voy a empezar\ncon nuestras herramientas para profesores. Esta es nuestra nueva\npágina de herramientas para profesores de Khanmigo. Como mencioné en la introducción, soy un ex\nprofesor de inglés en una escuela secundaria y la tarea de mi equipo es simplemente hacer la vida de los profesores más fácil. Y cuando todos\nrecordamos nuestros días como docentes, sigo diciendo que es el trabajo más difícil que he hecho jamás, que cualquiera de nosotros ha hecho. Y la única manera en que un docente puede superar\nsu experiencia docente es apoyándose en otros, apoyándose en su red de apoyo. Entonces, en mi caso, fueron\nmuchos otros profesores de primer, segundo y tercer año. Había una maestra veterana al otro lado del pasillo, la Sra. Hall, a quien podía\nver en su salón de clases y pensar en ideas para\nla lección del día siguiente.  Por eso, al desarrollar Khanmigo, queremos agregar otra pieza\na esa red de apoyo. Entonces, de la misma manera que\ncruzarías el pasillo para pedirle ideas a un maestro,\nahora puedes ir a Khanmigo y trabajar con Khanmigo para\nmejorar tus lecciones y generar ideas sobre cómo asegurarte de involucrar a tus estudiantes.  . Entonces, para mostrarles cómo se vería esto, puedo entrar aquí y decir: \"Mañana tengo una lección\nque voy a enseñar y ya me da miedo porque sé que\nes un tema que mis alumnos no conocen\".  No necesariamente me encanta mucho. Y en este caso,\ndigamos que es sumar fracciones. Es un tema que mis alumnos tal vez no encuentren muy atractivo,\npero estamos en Baltimore, y Baltimore por primera vez tiene\nun equipo de béisbol realmente bueno. Voy a decir que mi clase es\nun grupo de fanáticos del béisbol. En realidad son fanáticos de los Orioles. Y voy a decir, ¿ pueden hacerlo relevante para mis estudiantes que podrían preocuparse más por el\nbéisbol que por sumar fracciones? la misma idea de cruzar el\npasillo y decir: \"Oye, ¿qué hiciste\nayer en tu clase que fue tan genial?  ¿ Por qué estaban tan comprometidos?  ¿ Por qué estaban tan interesados ​​en tu lección?\" Y aquí podemos ver un par de ideas sobre el uso de estadísticas de tarjetas de béisbol\n, promedios, para enseñar fracciones, y esto es genial, pero, por supuesto, soy un poco parcial. Soy un jugador de béisbol.  Me fanático y es posible que eso no se aplique\na todos mis estudiantes. Y aquí es donde se\nvuelve realmente emocionante usar Khanmigo, donde Khanmigo es realmente su socio aquí y puede trabajar con usted\npara personalizar el contenido para que se ajuste a las necesidades de los estudiantes. esto, puedo pedirle a Khanmigo que\nhaga cambios en esto, pruebe algo diferente, discuta esto. En este caso, voy a\ndecir que haga cambios en esto. Y sé que en mi clase tengo un par de fanáticos de Taylor Swift. Voy a decir, en\nsu lugar, haga esto sobre Taylor Swift. Y no tengo idea de cómo\nva a funcionar porque no tengo idea de cómo se conecta Taylor Swift con fracciones, y Khanmigo me dará algunas ideas aquí, posiblemente relacionándolas con la\nduración de las pistas.  , colaboraciones, hasta sus ventas. Hubo un caso anterior en el que\nKhanmigo me dio un ejemplo de cómo encontrar fracciones en\nlas letras de Taylor Swift. Estas son ideas que\nnunca se me habrían ocurrido o que nunca habría tenido si no hubiera estado\nintercambiando ideas con Khanmigo. Ante todo, Khanmigo es\nun gran compañero de pensamiento. También es un excelente compañero para el plan de lecciones. Si voy aquí y selecciono el plan de lección, puedo decir, ya sabes, sumar fracciones y se extraerá de nuestro\ncontenido aquí en Khan Academy. Y entonces veré cómo sumar y restar fracciones negativas crean un plan de lección y creará un\nplan de lección completo de cinco partes que incluye la diferenciación. Y aquí es donde nuestro\nequipo de ingeniería inmediata, muchos ex educadores de ese equipo, han trabajado para diseñar una experiencia en la que Khanmigo proporciona las estrategias que su compañero maestro sugeriría a otro maestro para incluir en sus aulas. Por último, pero no menos importante, Khanmigo también puede hacer cosas\ncomo recomendar tareas. Entonces, si estoy el día antes de clase pensando en lo que debería trabajar con mis alumnos, es posible que hayan estado trabajando\nen un par de temas, pero no estoy realmente seguro de qué sigue, siempre tuve preguntas\nsobre el alcance y la secuencia y qué  Tiene sentido enseñar después de qué, en este caso puedo preguntarle a Khanmigo. Y Khanmigo me dará un par de ideas sobre en qué trabajar con\nmis alumnos mañana y me dirá, asigne al grupo uno y puedo asignarlo directamente desde Khanmigo y eso estará en las cuentas de mis alumnos al día siguiente para que estén trabajando.  en. Estoy muy, muy entusiasmado con el avance de Khanmigo en términos del caso de uso docente. Realmente útil ya hoy. Nosotros, como equipo, tenemos\npizarras blancas con herramientas e ideas futuras sobre\ndónde llevar a Khanmigo a continuación. Así que estad atentos a eso. Pero esa es mi actualización de hoy y se la pasaré a Sarah\npara que comparta un poco más sobre Writing Coach. - Gracias, Gintas. Muy bien, creo que la mayoría de ustedes saben que Khan Academy es muy\nconocida por su contenido STEM, sus excelentes videos, artículos, ejercicios y aprendizaje de dominio. Estamos muy entusiasmados con\nalgunos de los avances que estamos viendo en lo que respecta a IA, ELA y humanidades. Y hemos estado trabajando\nmuy duro el año pasado para aplicar parte de esta innovación y esta oportunidad a los casos de uso de docentes de ELA y humanidades. Entonces, lo que voy a compartir es un proyecto que llamaremos Entrenador de escritura. Esto es algo que\naún no está disponible. Lo estamos lanzando para\nesta temporada de regreso a clases. En este momento, hay una función\nque es una especie de vista previa de Writing Coach que puedes ver si tienes acceso a Khanmigo para estudiantes. Y eso se llama nuestra\nactividad de retroalimentación de ensayos académicos. Pero en un momento les daré una\nvista previa de cómo se verá el entrenador de escritura en esta temporada de regreso a\nclases. Pero muy rápido, si ustedes, y creo que muchos de ustedes\nprobablemente estén familiarizados con este dilema de la enseñanza de la escritura en las escuelas en este momento. Las investigaciones nos dicen que los estudiantes deben dedicar 60 minutos\nal día a escribir en las aulas, en los estudiantes de secundaria y preparatoria.  En realidad, menos del 10% de los estudiantes están\nalcanzando esa meta. También sabemos que para mejorar las instrucciones de escritura, los estudiantes necesitan comentarios específicos y prácticos\nsobre su escritura que se entreguen de la\nmanera más oportuna posible. Esto casi nunca es\nlo que sucede en la realidad. Y como resultado, los profesores no\nasignan suficiente escritura.  Se agotan mucho incluso si intentan brindar\ncomentarios personalizados en cada ensayo, por lo que no es de extrañar que los estudiantes estén atrasados ​​​​en sus habilidades de escritura. Como mencioné anteriormente, soy un ex\nprofesor de inglés, asignar un ensayo a mis 100 alumnos\nme tomaría 17 horas para brindarles\ncomentarios personalizados sobre todos sus ensayos. Entonces, lo que creo que es particularmente\ninteresante de Writing Coach son, en primer lugar, las funciones\nque ofrece a los estudiantes. Una cosa que sabemos es que, obviamente, los estudiantes necesitan retroalimentación para convertirse en mejores escritores, pero muchos de los profesores con los que\nhemos hablado nos han dicho: \"Es genial que su\nherramienta de retroalimentación actual brinde retroalimentación sobre los ensayos, pero yo no puedo\".  Ni siquiera logro que la mayoría de mis alumnos lleguen al punto en que\ntengan un primer borrador\". Toda esa\npieza de introducción, delinear, es como sacarse los dientes. Es realmente difícil incluso lograr que los estudiantes produzcan algo para empezar. Y también, esa\nfue mi experiencia, recuerdo ese momento en el que miraba a mi alrededor y los estudiantes se sentían tan estancados. Entonces, con la herramienta Writing Coach, en realidad apoya a los estudiantes durante todo el\nproceso de escritura desde el principio. El primer paso\nque da el Entrenador de Escritura es hablar con el estudiante. Khanmigo hablará con el\nestudiante sobre la pauta del ensayo.  Se asegurará de que comprendan cuáles son las expectativas y que, si hay alguna palabra con la que no están familiarizados, Khanmigo les ayudará a\ncomprender qué es una refutación. ¿ Cómo escribo un contraargumento? Ese tipo de cosas. Entonces, esta vista previa aquí muestra esa etapa de revisión inicial antes de que el estudiante comience a escribir, donde tiene una conversación informal y de baja presión\ncon Khanmigo para que piense en\nla tarea del ensayo. Y luego, por supuesto, uno de\nlos siguientes pasos es delinear. Entonces, uno de los beneficios de\nque Khanmigo apoye a los estudiantes durante el\nproceso de delineación es que Khanmigo sabe cuál fue la tarea del maestro. Entonces Khanmigo sabe cuántos\npárrafos espera el maestro, qué tipo de citas\nquiere ver, qué tipo de detalles quiere que incluyan los estudiantes. Y cuando el estudiante está\ntrabajando en su esquema, Khanmigo puede asegurarse de\nque vaya por buen camino. Y si el alumno tiene dudas, Khanmigo sabe cómo responder. Y si tiene estudiantes\nque están completamente perdidos cuando se trata de escribir una tesis, Khanmigo ha sido capacitado para ayudarlos a escribir y redactar estos diferentes\nelementos de un esquema sin tener que hacer\nnada de ese trabajo por ellos. En lo que respecta a la redacción, obviamente Khanmigo ahora les\nda a los estudiantes un esquema en el que trabajó con el estudiante. Por lo tanto, puede ayudar al\nestudiante a incluir eso en su borrador y desarrollarlo más. Y, por supuesto, como ocurre\ncon todas las demás funciones, no\nescribirá por el estudiante, pero estará ahí si se queda atascado y necesita un poco de ayuda. También suceden otras cosas\ndetrás de escena, como el borrador de un estudiante, que el estudiante no siempre puede ver y que\nusted verá en un momento por parte del maestro. Y para revisarlo, el estudiante puede enviar su\nborrador a Khanmigo para recibir comentarios. Khanmigo genera sugerencias\nen cinco áreas principales de retroalimentación que están alineadas con la mayoría de las rúbricas principales. Los estudiantes pueden preguntarle a Khanmigo sobre\nlos comentarios que recibieron, pero lo más interesante es que también pueden revisar\nsu ensayo en la página y recibir comentarios de seguimiento\nde Khanmigo en tiempo real para que puedan averiguar de inmediato si mi revisión abordó la\nsugerencia que me diste.  ? Y para los profesores, creo que\naquí es donde Writing Coach, donde la magia realmente comienza a mostrarse. Entonces, debido a que los estudiantes\ninteractúan con Khanmigo durante todo el proceso de escritura, podemos sintetizar eso e informarlo al maestro y brindarle información realmente útil sobre lo que los estudiantes pudieron hacer y con qué tuvieron dificultades. Entonces, algunas de las cosas que los maestros podrán ver incluyen, por supuesto, en qué parte de la\ntarea se encuentra cada estudiante, y tal o cual está trabajando en su esquema. Esta persona ya está revisando, puede ver cuánto\ntiempo se dedicó a redactar versus revisar o\ndelinear versus redactar. Pueden ver el recuento de palabras actual y pueden ver datos de alto nivel sobre la distribución de comentarios. Ya sabes, la mayoría de los estudiantes recibieron\ncomentarios relacionados con la evidencia. Tal vez sea algo en lo que deberías concentrarte\npara recibir instrucciones más adelante. Y luego estas posibles\npreocupaciones sobre la originalidad o estas banderas. Entonces, estas son las cosas que mencioné cuando un estudiante está redactando o\nincluso delineando o revisando, si están pegando una gran cantidad de texto en la experiencia y Khanmigo no\nsabe de dónde vino, no vino del  esquema o no surgió de esa conversación, levantaremos una bandera para que el maestro pueda entrar e investigar y ver exactamente lo que se pegó, ver qué sucedió, profundizar en eso, lo cual de las conversaciones que\nhe  Tuve que los profesores tuvieran que hacer esto, ya\nsabes, usar Google Docs o borradores de Extensiones de Chrome\nun estudiante a la vez puede\nllevar increíblemente tiempo en sí mismo. Y con ChatGPT, creo que\neste es el problema más grande que los profesores hayan visto jamás. Así que estamos muy entusiasmados\ncon los beneficios para los estudiantes de Writing Coach, pero también con muchas de las\ncaracterísticas para profesores que vendrán con eso. - Antes de acudir a Sal para hacerle preguntas porque estoy seguro de que tienes\nmuchas cosas para él, solo quiero que sepas que\ndirijo nuestro equipo de asociaciones aquí en Khan Academy, que trabaja con escuelas, distritos escolares y ahora incluso estados.  en algún nivel, asociarnos con nuestra oferta de distritos de Khan Academy, así como con Khanmigo. Por lo tanto, gran parte de nuestro contenido y herramientas son gratuitos y totalmente accesibles para que los utilicen sus estudiantes y profesores. Casi todos los distritos del país tienen maestros que utilizan la\nversión gratuita de Khan Academy porque es un\nrecurso complementario fantástico. Si desea cartas de apoyo adicionales y desea que sus estudiantes\ntengan acceso a Khanmigo, puede asociarse con mi equipo, que es el\nequipo de asociación del Distrito de Khan Academy para permitirle básicamente obtener apoyo para los cursos y el contenido de Khan Academy, pero también dejar que  sus alumnos\ny profesores acceden a Khanmigo.  El acceso de estudiantes a Khanmigo solo está disponible como parte de\nnuestras asociaciones con el distrito. Y entonces, la forma en que funciona es que básicamente\nobtendrás servicios de listas, obtendrás análisis de datos y obtendrás aprendizaje profesional tanto para la oferta principal de Khan Academy como para Khanmigo. Y el\naprendizaje profesional es realmente clave porque, obviamente, esta\nIA es nueva para todos nosotros. Así que queremos asegurarnos de que este sea un viaje que vamos a recorrer juntos\npara tener recursos de aprendizaje profesional realmente sólidos para ustedes como parte de nuestra asociación distrital. Nuestra asociación comienza con tan\nsolo 250 estudiantes. Entonces, si usted es un distrito más pequeño o tal vez es un distrito más grande y solo quiere\nsumergirse en el agua, podemos asociarnos para obtener desde tan\nsolo 250 licencias de estudiantes hasta tantas como desee. Solo cobramos por las licencias para estudiantes, por lo que si se asocia con\nnosotros en el distrito ofreciendo y pagando las licencias para estudiantes, las licencias para maestros\nserán gratuitas, lo cual es fantástico. Y nuevamente, como hablamos, está el soporte de implementación donde lo tomaremos de la mano y lo guiaremos a través de las\nmejores prácticas, cómo aprovechar Khan Academy,\ncómo aprovechar Khanmigo, capacitar a sus maestros, capacitar a su personal, capacitar a sus  admin para que\ntodos estén de acuerdo sobre cómo se debe utilizar la plataforma. Diré que el aprendizaje profesional con Khanmigo es obligatorio porque esto es muy nuevo y todos aprenden sobre la marcha. Insistimos en que tenga algún tipo de PL como parte de la asociación con nosotros. Y el PL dependerá del\nalcance de la asociación. Para las asociaciones más pequeñas, podría ser desarrollo profesional a pedido que sus maestros pueden hacer de forma asincrónica a través de horas virtuales en vivo e incluso días recomendados de PL en persona que podemos ir a su distrito y capacitar a su personal\nsegún el calendario de PL. Pero la idea aquí es que\nqueremos apoyar a todos, apoyar a todos sus profesores\ny aplicar las mejores prácticas con AI Khanmigo para que\nsus estudiantes y profesores aprovechen al máximo la plataforma. Y si estás interesado,\ndos cosas que puedes hacer aquí. Puede enviarnos un correo electrónico directamente\na distritos@khanacademy.org o hay un código QR aquí, que lo llevará a la\npágina de inicio de nuestro distrito, que tiene mucha información sobre nuestro distrito que ofrece\nKhanmigo, etc. Así que ahora estamos en espera. Mi equipo está listo para ayudar, pero ya sea que solo desee\nuna demostración más detallada, estaremos encantados de brindarle esa información o información más detallada sobre los precios, estaremos encantados de brindarle\ncualquiera de estos puntos de contacto, pero esperamos hablar con usted si  tienes alguna pregunta. Y ahora me encantaría devolvérselo a Sal para que tengamos el mayor tiempo posible con él para responder sus preguntas. - Gracias, Jason. Así que sí, yo y otros aquí, no solo yo, estaremos encantados de responder cualquier pregunta e idea que puedan tener. - Tenemos un par de preguntas\nque están en este momento.  ¿Tiene el instructor de escritura\nla capacidad de crear indicaciones de escritura basadas en texto donde se insertan excepciones para que los estudiantes lean y analicen?  ¿ Quieres profundizar un\npoco más en eso? - Una cosa que diré es que apoyamos específicamente\nensayos de análisis literario.  Ya sabes, estructuralmente, creo que Khanmigo hace un muy buen trabajo ayudando a los estudiantes con eso. Si el ensayo trata sobre\nalgo bien conocido que se publicó antes de 2023, que es cuando llega la base de conocimientos de GPT-4,\n entonces los estudiantes realmente\nreciben apoyo de Khanmigo al analizar el texto. Entonces, si el estudiante dice: \"Realmente no entiendo\neste tema o este personaje, o algo que sucedió en la historia\", Khanmigo conoce ese texto y puede apoyarlo con eso. Así que todavía no puedes\nsubir tu propio texto. Aunque creo que podremos soportar algo\nasí bastante pronto. Pero puede ayudar a los estudiantes si los textos son bastante conocidos. - Y luego también surge la\npregunta: ¿tenemos un DSA? - Tenemos versiones de eso\ncon distritos múltiples. La mayoría de los acuerdos de uso compartido del día con los que estoy familiarizado son aquellos en los que nos hemos asociado con el distrito escolar y queremos comprender\nmejor los resultados de eficacia. Tenemos varios distritos allí y de esa manera podemos ayudar a analizar si, con suerte, estamos moviendo el dial de la manera en que muchos de nuestros estudios de eficacia indican que lo harían. Pero sí, obviamente lo somos, creo que somos líderes\nen lo que respecta a la privacidad de los datos y el uso sólido de los datos, usándolos solo para personalizar la experiencia, medir la eficacia, etc. Pero sí, más o menos. - Sí, John, puedes enviar un correo electrónico a\nla dirección de correo electrónico distritos@khanacademy.org y\npodemos arreglarlo contigo, tenemos acuerdos a nivel estatal, tenemos\nacuerdos de consorcio, DSA y DPA, también proporcionamos directamente a los distritos. Entonces definitivamente podemos solucionarlo. Pero Sal, tal vez sea útil\nhablar sobre lo que compartimos o no con OpenAI en términos de ese aprendizaje\ny uso en la plataforma en términos de\nintercambio de datos y uso de los estudiantes. - Seguro. Sí, hablaré un\npoco en general sobre datos. Obviamente, la inteligencia artificial ofrece muchas oportunidades , pero también hay algunos temores. Existe el temor de hacer trampa, existe el temor de que los estudiantes\nhagan cosas turbias con la IA y luego existe el temor de si estas conversaciones\nde alguna manera se incorporan a los datos de entrenamiento para futuros modelos. Y eso podría de alguna manera\ncrear un riesgo para la privacidad de los datos, especialmente con algo muy sensible, como los datos de los estudiantes. Entonces iré en ese orden. Ya se ha mencionado que Khan\nAcademy no apoya a los estudiantes, no solo responderá la pregunta. Realmente actúa como un tutor ético. Sarah les mostró un poco de esto, hay una charla TED que di el año pasado que profundiza mucho más en eso, pero somos muy claros. Ahora, los profesores tienen un modo de profesor y si lo ponen en modo de estudiante, ven lo que verían los estudiantes, si lo ponen en modo de profesor, en realidad no sólo ayuda a los\nprofesores con respuestas, sino que actúa como una súper guía para profesores. Puede ayudarlos con todas las cosas que Gintas estaba mostrando, planes de lecciones, ganchos de lecciones,\netcétera, etcétera. Otra área, una barrera de seguridad que tenemos es cuando los estudiantes interactúan con Khanmigo, todas esas interacciones son\nobservables por los maestros. Y luego también tenemos una\nAPI de moderación o una IA de moderación. Entonces, si el estudiante tiene una conversación y dice que\nquiere, Dios no lo quiera, construir una bomba o que\nquiere hacerse daño, se cerrarán esas conversaciones y se notificará activamente a los\nmaestros y administradores. Ahora bien, los datos, y este es un\nprincipio de Khan Academy mucho antes de la IA generativa,\nes que solo usamos datos, y esta es una de las razones por las que\nsomos una organización sin fines de lucro, por lo que ni siquiera estamos tentados\na intentarlo.  monetizar datos de alguna manera turbia. Solo utilizamos datos para medir nuestro impacto, personalizar la experiencia,\nmejorarla o informar\na partes interesadas clave y confiables, como maestros o distritos; esos son nuestros únicos usos para los datos. Entonces, cuando se trata del\námbito de la IA, como acabo de mencionar, almacenamos las conversaciones de los estudiantes. Solo lo usamos\npara informes de los maestros o para nuestra propia evaluación de lo que está sucediendo y cómo podemos mejorarlo. No permitimos esas conversaciones, y estos son acuerdos que tenemos con las empresas de IA subyacentes de que los\ndatos no se pueden utilizar para el entrenamiento de propósito general\nde modelos futuros. Así que ninguna información privada de los estudiantes puede llegar al,\nllamémoslo, ámbito público. Podríamos usar esa información para afinar o entrenar nuestras propias versiones\npara personalizarlas una vez más o ser más efectivas para los estudiantes. Pero una vez más, eso quedará dentro de este jardín de Khan Academy, no para el resto del mundo. Así que nos lo tomamos muy, muy en serio. Y sabes, para ser claros,\nhay un montón de personas, si fuéramos una empresa con fines de lucro\n, todos los días, tengo alguna empresa de inteligencia artificial que se ofrece\na pagarnos por esos datos y nosotros decimos que no. Así que podemos imaginar\nlo que podría estar sucediendo si nuestra gobernanza fuera\nun poco diferente. - Sí, y Sal plantea un gran punto: como todos ustedes están analizando productos de inteligencia artificial, ya sea Khanmigo u\notras compañías, realmente los animo a que lean las políticas de privacidad. Estas empresas\naparecen todos los días. Hay toneladas de nuevas empresas por ahí, no sabemos quién está detrás de ellas. No sabemos si hay gente educativa que esté mirando la pedagogía\ny el aprendizaje de esto. Hay un montón de personas en\neste momento cuyos nombres sabrá,\nlea sus políticas de privacidad y dicen específicamente que no compartiremos ni venderemos datos de los estudiantes a menos que nos adquieran\no cierremos el negocio, lo cual será el\n95%.  de estas empresas. Entonces, ¿qué van a hacer cuando empiecen a quedarse sin\ndinero o cuando los adquieran?  ¿ Tienen las mismas barreras que tiene una empresa como Khan Academy\nen términos de compartir? Así que tengan mucho cuidado al\nobservar los productos en el espacio en este momento, lo que están haciendo en\ntérminos de intercambio de datos, privacidad de datos, gobernanza de datos porque creo que es realmente una\ntoma de decisiones clave, una elección para todos ustedes. - [Narrador] Gracias a\ntodos por acompañarnos hoy, ver este video y ser parte de la\ncomunidad de estudiantes y maestros de Khan Academy. Si desea ver\nmás sobre cómo Khanmigo está potenciando el aprendizaje\nen las aulas en este momento, haga clic en los enlaces en su\npantalla y, para mantenerse en contacto y no perderse nunca un anuncio sobre educación gratuita y de primer nivel para cualquier persona en cualquier lugar, asegúrese de  suscribir.",
    "t_arabic": "- أهلا بالجميع. مساء الخير. نحن نرحب ببطء\nبالناس في الغرفة. شكرا لأخذ الوقت للانضمام إلينا. اسمي فيليبي إسكاميلا، أنا مدير الفيديو\nهنا في أكاديمية خان.  سينضم إلينا قريبًا سال خان، الرئيس التنفيذي ومؤسس أكاديمية خان. سيخبرك\nقليلاً عن مهمتنا، وأداة الذكاء الاصطناعي الخاصة بنا، ومساعد المعلم ومعلم الطلاب المسمى خانميغو. لدينا أيضًا اثنان من كبار مديري المنتجات سينضمون إلينا، جينتاس برادوناس وسارة روبرتسون. سأمضي قدمًا\nوأقدم سارة وجينتاس الآن، وأخبركم قليلاً عن أدوارهما وما يفعلانه هنا في أكاديمية خان وبعض الأشياء، معاينة بسيطة، ما سيقدمانه اليوم. مرحبا سارة.  مرحبًا جينتاس. - مهلا، فيليبي. مرحبًا بالجميع، أنا سارة روبرتسون. كما ذكر فيليبي، أنا مدير أول للمنتجات\nهنا في أكاديمية خان. أنا مدرس لغة إنجليزية سابق\nمنذ سنوات عديدة. عملت أيضًا سابقًا لدى CommonLit، وهي شركة أخرى غير ربحية لتكنولوجيا التعليم. وأنا في أكاديمية خان\nالآن منذ أكثر من عام بقليل.  لقد كنت أركز في الغالب على مبادراتنا المتعلقة بمحو الأمية، لذلك أقوم ببناء المحتوى\nوالأدوات والموارد لمعلمي اللغة الإنجليزية ومعلمي العلوم الإنسانية. الشيء الأكثر إثارة الذي\nعملنا عليه مؤخرًا هو أداة \"مدرب الكتابة\" الخاصة بنا، والتي سأعرضها لكم بالتفصيل\nقليلًا وسأدع جينتاس يتحدث عن نفسه. - أكيد، شكرًا سارة. مرحباً بالجميع، اسمي جينتاس. أنا مدير منتج أول\nفي فريق خبرة المعلمين لدينا. ومثل سارة، كنت\nمعلمًا في حياتي الماضية، لذلك كنت مدرسًا للغة الإنجليزية في المدرسة الإعدادية، وقمت بتدريس الصف السادس والسابع في برنامج اللغة الإنجليزية، ثم انجذبت إلى\nعالم المنتجات.  ويركز فريقي، كما يوحي الاسم، في المقام الأول على كل شيء وأي شيء يمكننا القيام به لجعل\nحياة المعلمين أسهل ولتمكين المعلمين من مساعدة طلابهم بالطبع على\nتحقيق أهدافهم التعليمية واحتياجاتهم. لذلك، من الممتع الانضمام إلى الفريق.  لقد ضم الكثير من\nالمعلمين السابقين الآخرين، وكذلك الكثير من معلمي اللغة الإنجليزية. نحن ننزلق في حفرة الأرانب\nأحيانًا باستخدام استعاراتنا. لذا نعم، أنا متحمس جدًا لأعرض لكم اليوم أدوات خانميغو الخاصة بنا وما كنا\nنعمل عليه لجعل خانميغو مساعد المعلم المثالي. - أردت فقط أن أشكر\nالجميع على الانضمام، وسأقدم القليل من المعلومات الأساسية ثم أسلمها\nإلى فريق أكاديمية خان للتعمق أكثر في الأمور. لكنني أفترض أن معظم الناس هنا على دراية إلى حد ما بأكاديمية خان، والمهمة غير الربحية،\nوالتعليم المجاني ذي المستوى العالمي لأي شخص في أي مكان. وربما يعرف الكثير منكم كيف بدأت أكاديمية خان وكنت أتحدث عن\nالقصة الأصلية كطريقة ممتعة وغريبة شاركت فيها\nفي أكاديمية خان، لكنني الآن أتحدث عنها لأنني أعتقد أنها وثيقة الصلة بالموضوع إلى بعض ما سنتحدث عنه مع الذكاء الاصطناعي وما بعده.  كما تعلمون، في اليوم الذي بدأت فيه\nتدريس أبناء عمومتي، انتشرت الأخبار في عائلتي، وكانت الدروس الخصوصية مستمرة قبل أن أعرف ذلك، وأنا أقوم\nبتدريس العديد من أبناء عمومتي. أبدأ بمحاولة توسيع نطاق هذه الأنواع من التفاعلات الشخصية الفردية. أبدأ في عمل تمارين الكتابة\nلهم، أدوات المعلم.  لقد كنت أول مستخدم لأدوات المعلم حتى أتمكن من تتبع\nما كان يفعله الطلاب وأقوم بواجبات لأبناء عمومتي. اقترح أحد الأصدقاء أن أقوم بعمل مقاطع فيديو. ومرة أخرى، كانت تلك طريقة لتوسيع نطاق بعض هذه الدروس الصغيرة التي كنت أقدمها لأبناء عمومتي. وبعد ذلك، انتقل سريعًا إلى الآن، أو قبل بضع سنوات، من الواضح أن أكاديمية خان أصبحت\nالآن أكثر مني بكثير، ولكن كمنظمة غير ربحية، ما قمنا به حقًا،\nكل ما كنا نفعله، على الرغم من  نحن الآن نمتلك\nأكثر من 160 مليون مستخدم، هل هذه هي نفس الفكرة. كيف نحاول حقًا\nقياس نوع الاهتمام، والتخصيص، والتعلم المتقن، وهو أنه إذا لم\nيتعلم الطلاب شيئًا ما بعد، فيجب أن يحصلوا على المزيد من الفرص والحوافز لتعلمه. كيف يمكننا توسيع نطاق ذلك ليشمل\nالمزيد والمزيد من الطلاب وكيف ندعم المعلمين والمعلمين وقادة المدارس والمشرفين من أجل دعم طلابهم بشكل أفضل\nفي كل هذه الأشياء؟ تلك كانت أدوات المعلم والتطوير المهني الذي قمنا به على مر السنين. ننتقل سريعًا إلى ما يقرب من\nعام ونصف مضت، وهذا هو الوقت الذي\nتواصلت فيه OpenAI معنا لأول مرة. كنا فضوليين ولكن متشككين.  لقد كنا نراقب\nما يحدث في عالم الذكاء الاصطناعي منذ فترة. لم يبدو جاهزًا\nللتشغيل، على الأقل في عام 2022. ولكن بعد ذلك عندما رأينا ما يمكن أن يفعله GPT-4، ولمجرد تقديم\nالقليل من التوضيح حول بعض المصطلحات،\nيعرف الكثير من الأشخاص ChatGPT، ChatGPT هو  تطبيق قاموا بإنشائه لاحقًا في\nالأصل على نموذج أقدم. الآن، يمكنك الوصول إليه\nعلى GPT-4 إذا كنت تدفع المال، ولكن النماذج هي GPT-3، GPT-4، لدى Google نماذج مثل Gemini، وما إلى ذلك، ثم لديك التطبيقات. لكن عندما رأينا ما يستطيع GPT-4 فعله، على الرغم من أنه كان يعاني من\nنقاط صعبة، قلنا: \"رائع، هذا يمكن أن يقودنا إلى أبعد من ذلك بكثير لنكون قادرين على توسيع نطاق\nنوع التخصيص الذي نريد القيام به للطلاب. ويمكن أن يكون أكثر قوة لدعم المعلمين.\" كل هذه المهام التي\nيتعين على المعلمين القيام بها، من الواضح أنه يتعين عليهم الحصول على تقارير حول أداء طلابهم، لكنهم يقومون أيضًا\nبأشياء مثل خطط الدروس، وتذاكر الخروج،\nوتقارير التقدم، وما إلى ذلك، وما إلى ذلك. ربما يمكن أن يكون جزءًا من ذلك، يمكن أن يكون مدرسًا لكل طالب ومساعد تدريس\nلكل معلم. إذن هذه هي الرحلة التي بدأناها.  من الواضح أنه كان هناك\nالكثير من الأسئلة حول كيفية التعامل مع السلامة والخصوصية والغش، ونحن نعمل على كل هذه الأسئلة ونعتقد أن لدينا إجابات جيدة، ولكننا سنوضح لك بشكل\nخاص العديد من الأدوات التي تعتبر معلمًا\nنحن متحمسون جدًا لمواجهة هذه المشكلة، وقد قمنا مؤخرًا\nبتجديد كبير جدًا وجعلناها في متناول عدد أكبر بكثير من المعلمين، ولكننا ندرك أيضًا أن هذه رحلة نأمل أن يكون الكثير منها\nتريدون جميعًا الاستمرار معنا، لأنه يمكن أن يكون\nمفيدًا لك على الفور في الوقت الحالي، ولكن بما أنكم تستخدمونه جميعًا ونتعلم من كيفية استخدامكم له، يمكننا أن نجعله أفضل وأفضل حتى نتمكن من ذلك  ندعمك ويمكننا دعم طلابك. لذا، سأمررها إلى الفريق\nحتى يتمكنوا من إظهار القليل مما قمنا به. - حسنًا، شكرًا سال. سأبدأ\nباستخدام أدوات المعلم لدينا. هذه هي\nصفحتنا الجديدة لأدوات المعلم في خانميغو. كما ذكرت في المقدمة، أنا\nمدرس لغة إنجليزية سابق في المدرسة الإعدادية ومهمة فريقي هي ببساطة تسهيل حياة المعلمين. وعندما نفكر جميعًا\nفي أيام التدريس، ما زلت أقول إنها أصعب وظيفة قمت بها على الإطلاق، والتي قام بها أي منا على الإطلاق. والطريقة الوحيدة التي يستطيع بها المعلم في كثير من الأحيان تحقيق النجاح في\nتجربته التعليمية هي الاعتماد على الآخرين، وذلك من خلال الاعتماد على شبكة الدعم الخاصة بهم. لذا، في حالتي، كان هناك\nالكثير من معلمي السنوات الأولى والثانية والثالثة. كانت المعلمة المخضرمة في جميع أنحاء القاعة، السيدة هول، هي التي تمكنت من\nرؤيتها في فصلها الدراسي وتبادل الأفكار حول\nالدرس في اليوم التالي. ولذا، أثناء بناء خانميغو، نريد إضافة قطعة أخرى\nإلى شبكة الدعم تلك. لذا بنفس الطريقة التي تذهب بها\nعبر القاعة لتطلب من المعلم أفكارًا،\nيمكنك الآن الذهاب إلى خانميجو والعمل مع خانميجو\nلتحسين دروسك، وللتوصل إلى أفكار حول كيفية التأكد من أنك تجذب طلابك  . لذا لأوضح لكم كيف قد يبدو هذا، يمكنني أن أدخل هنا وأقول، \"لدي درس\nسأقوم بتدريسه غدًا وأنا أخاف منه بالفعل لأنه ما أعرف\nأنه موضوع لا يدرسه طلابي\"  لا أحب بالضرورة كل هذا كثيرًا وفي هذه الحالة،\nلنفترض أن الأمر يتعلق بجمع الكسور، وهو موضوع قد لا يجده طلابي مثيرًا للاهتمام،\nولكننا في بالتيمور، ولمرة واحدة كان لدى بالتيمور\nفريق بيسبول جيد حقًا سأقول أن صفي عبارة عن\nمجموعة من مشجعي لعبة البيسبول. وهم في الواقع من مشجعي الأوريولز. وسأقول، هل يمكنك جعل ذلك مناسبًا لطلابي الذين قد يهتمون\nبالبيسبول أكثر من إضافة الكسور؟ نفس فكرة المرور عبر\nالردهة والقول، \"مرحبًا، ماذا فعلت\nبصفك بالأمس وكان رائعًا جدًا؟ لماذا كانوا منخرطين جدا؟ لماذا كانوا مهتمين جدًا بدرسك؟\" وهنا يمكننا أن نرى بعض الأفكار حول استخدام إحصائيات بطاقة البيسبول\n، والمتوسطات، لتعليم الكسور، وهذا رائع، ولكن بالطبع أنا متحيز بعض الشيء. أنا لاعب بيسبول  أنا معجب بهذا وقد لا ينطبق ذلك\nعلى جميع طلابي، وهذا هو المكان الذي\nيصبح فيه الأمر مثيرًا حقًا باستخدام Khanmigo حيث يكون Khanmigo شريكك حقًا هنا ويمكنه العمل معك\nلتخصيص المحتوى ليناسب احتياجات الطلاب هذا، يمكنني أن أطلب من خانميغو\nإجراء تغييرات على هذا، وتجربة شيء مختلف، ومناقشة هذا في هذه الحالة، سأقول\nإجراء تغييرات على هذا وأنا أعلم أنه في صفي لدي عدد من معجبي تايلور سويفت. سأقول، اجعل هذا\nحول تايلور سويفت بدلاً من ذلك وليس لدي أي فكرة عن كيفية\nعمل هذا لأنه ليس لدي أي فكرة عن كيفية ربط تايلور سويفت بالكسور، وسيعطيني خانميجو بعض الأفكار هنا، ربما ربطها بتتبع\nالأطوال.  ، التعاون، لمبيعاتها. كانت هناك حالة سابقة حيث\nأعطاني خانميغو مثالاً على العثور على الكسور في\nكلمات تايلور سويفت. هذه هي الأفكار التي\nلم أكن لأتوصل إليها أبدًا أو لم أكن لأحصل عليها أبدًا إذا لم أكن أقوم\nبالعصف الذهني مع خانميجو. أولاً وقبل كل شيء، خانميغو\nشريك فكري عظيم. إنه أيضًا شريك رائع لخطة الدرس. إذا ذهبت هنا واخترت خطة الدرس، يمكنني أن أقول، كما تعلمون، إضافة الكسور وسيتم سحبها من المحتوى الخاص بنا\nهنا في أكاديمية خان. ولذا سأرى أن إضافة وطرح الكسور السالبة سيشكل خطة درس وسيؤدي ذلك إلى إنشاء\nخطة درس كاملة مكونة من خمسة أجزاء تتضمن التمايز. وهذا هو المكان الذي عمل فيه\nفريقنا الهندسي الفوري، والعديد من المعلمين السابقين في هذا الفريق، على تصميم تجربة يقدم فيها خانميجو الاستراتيجيات التي قد يقترحها زملائك المعلم على معلم آخر لتضمينها في فصولهم الدراسية. أخيرًا، وليس آخرًا، يمكن لـ Khanmigo أيضًا القيام بأشياء\nمثل التوصية بالمهام. لذا، إذا كنت قبل يوم من الفصل أفكر فقط في ما يجب أن أعمله مع طلابي، فربما كانوا يعملون\nعلى موضوعين، لكنني لست متأكدًا حقًا مما هو التالي، كانت لدي دائمًا أسئلة\nحول النطاق والتسلسل وما هو  من المنطقي التدريس بعد ماذا، يمكنني فقط أن أسأل خانميجو في هذه الحالة. وسيقدم لي خانميغو بعض الأفكار حول ما يجب العمل عليه مع\nطلابي غدًا، ويقول، قم بتعيين المجموعة الأولى ويمكنني تعيينها مباشرة من خانميغو وسيكون ذلك في حسابات طلابي في اليوم التالي حتى يتمكنوا من العمل  على. لذا، أنا متحمس حقًا بشأن ما وصل إليه خانميجو فيما يتعلق بحالة استخدام المعلم. مفيدة حقا بالفعل اليوم. نحن كفريق واحد لدينا\nألواح بيضاء فوق ألواح بيضاء للأدوات والأفكار المستقبلية حول\nالمكان الذي سنأخذ فيه خانميغو بعد ذلك. لذلك ترقبوا ذلك. ولكن هذا هو تحديثي لهذا اليوم وسأنقله إلى سارة\nلمشاركة المزيد حول مدربة الكتابة. - شكرا، جينتاس. حسنًا، أعتقد أن معظمكم يعرف أن أكاديمية خان\nمعروفة جدًا بمحتوى العلوم والتكنولوجيا والهندسة والرياضيات (STEM)، فهي عبارة عن مقاطع فيديو ومقالات وتمارين ممتازة وتعلم متقن. نحن متحمسون حقًا لبعض\nالتطورات التي نشهدها عندما يتعلق الأمر بالذكاء الاصطناعي وتعلم اللغة الإنجليزية والعلوم الإنسانية. ولقد بذلنا\nجهدًا كبيرًا في العام الماضي لتطبيق بعض من هذا الابتكار وهذه الفرصة على حالات استخدام معلمي اللغة الإنجليزية (ELA) والعلوم الإنسانية. إذن ما سأشاركه هو مشروع نطلق عليه \"مدرب الكتابة\". وهذا شيء\nغير متوفر تماما بعد. نحن نطلقه\nلموسم العودة إلى المدرسة.  في الوقت الحالي، هناك ميزة\nتمثل نوعًا من المعاينة لـ Writing Coach والتي يمكنك معرفة ما إذا كان لديك إمكانية الوصول إلى Khanmigo للطلاب. وهذا ما يسمى\nنشاط ردود الفعل على المقالات الأكاديمية. لكنني سأعطيكم\nلمحة عما سيبدو عليه برنامج Writing Coach مع العودة إلى\nالموسم الدراسي بعد قليل. لكن سريعًا جدًا، إذا كنتم، وأعتقد أن العديد منكم على\nالأرجح على دراية بمأزق تعليم الكتابة في المدارس في الوقت الحالي. تخبرنا الأبحاث أن الطلاب بحاجة إلى قضاء 60 دقيقة\nيوميًا في الكتابة في الفصول الدراسية وطلاب المدارس المتوسطة والثانوية. أقل من 10٪ من الطلاب\nيصلون بالفعل إلى هذا الهدف. نحن نعلم أيضًا أنه من أجل تحسين تعليمات الكتابة، يحتاج الطلاب إلى تعليقات محددة وقابلة للتنفيذ\nحول كتاباتهم والتي يتم تسليمها في\nالوقت المناسب قدر الإمكان. وهذا ما لا\nيحدث أبدًا في الواقع. ونتيجة لذلك، لا\nيخصص المعلمون ما يكفي من الكتابة. إنهم يشعرون بالإرهاق الشديد إذا حاولوا تقديم\nتعليقات شخصية على كل مقال، لذلك فلا عجب أن يكون الطلاب متأخرين في مهاراتهم الكتابية. كما ذكرت سابقًا، أنا مدرس سابق للغة الإنجليزية\n، وتكليف مقال واحد لطلابي البالغ عددهم 100 طالب\nسيستغرق 17 ساعة لتقديم\nتعليقات شخصية على جميع مقالاتهم. لذا فإن ما أعتقد أنه\nمثير بشكل خاص في برنامج Writing Coach هو في المقام الأول الميزات\nالتي يوفرها للطلاب. لذا فإن الشيء الوحيد الذي نعرفه هو أنه من الواضح أن الطلاب يحتاجون إلى تعليقات لكي يصبحوا كتابًا أفضل، لكن العديد من المعلمين الذين\nتحدثنا إليهم قالوا لنا: \"من الرائع أن\nأداة التعليقات الحالية الخاصة بك تقدم تعليقات على المقالات، لكنني أستطيع\"  حتى أنني لا أوصل معظم طلابي إلى النقطة التي يكون\nلديهم فيها المسودة الأولى.\"  قطعة البداية هذه بأكملها\n، الخطوط العريضة، هي مثل خلع الأسنان.  من الصعب حقًا إقناع الطلاب بإنتاج شيء ما للبدء به. وأنا أيضًا،\nكانت تلك تجربتي أيضًا، أتذكر تلك اللحظة التي نظرت فيها حولي وشعر الطلاب بأنهم عالقون جدًا. لذلك، باستخدام أداة \"مدرب الكتابة\"، فإنها تدعم الطلاب فعليًا خلال عملية الكتابة بأكملها\nمنذ البداية. الخطوة الأولى\nالتي يقوم بها برنامج Writing Coach هي التحدث إلى الطالب. سوف يتحدث خانميجو مع\nالطالب حول رسالة المقال. سوف يتأكد من أنهم يفهمون ما هي التوقعات وأنه إذا كانت هناك أي كلمات غير مألوفة لهم، فسوف يساعدهم خانميغو على\nفهم ما هو الدحض، وكيف أكتب حجة مضادة؟ تلك الأنواع من الأشياء. لذا فإن هذه المعاينة هنا توضح مرحلة المراجعة السريعة الأولية قبل أن يبدأ الطالب في الكتابة، حيث يجرون محادثة غير رسمية ومنخفضة الضغط\nمع خانميجو لجعلهم يفكرون في\nمهمة المقال. ومن ثم، بالطبع، إحدى\nالخطوات التالية هي الخطوط العريضة. لذا فإن إحدى فوائد\nقيام خانميغو بدعم الطلاب من خلال\nعملية التخطيط هو أن خانميغو يعرف ما هي مهمة المعلم. لذا يعرف خانميغو عدد\nالفقرات التي يتوقعها المعلم، ونوع الاستشهادات التي\nيريد المعلم رؤيتها، ونوع التفاصيل التي يريد أن يدرجها الطلاب. وعندما\nيعمل الطالب على المخطط التفصيلي الخاص به، يمكن لـ Khanmigo التأكد\nمن أنهم يسيرون على المسار الصحيح. وإذا كان لدى الطالب أسئلة، فإن خانميغو يعرف كيفية الرد. وإذا كان لديك طلاب\nضائعون تمامًا عندما يتعلق الأمر بكتابة الأطروحة، فقد تم تدريب Khanmigo على دعم الطلاب من خلال كتابة وصياغة هذه\nالعناصر المختلفة للمخطط دون القيام فعليًا\nبأي من هذا العمل لهم. عندما يتعلق الأمر بالصياغة، فمن الواضح أن خانميغو الآن\nلديه الخطوط العريضة التي عمل عليها مع الطلاب. لذلك يمكن أن يساعد\nالطالب على دمج ذلك في مسودته وتوضيحها بشكل أكبر. وبطبيعة الحال، كما هو الحال\nمع جميع الميزات الأخرى، فإنه لن يقوم\nبالكتابة للطالب، ولكنه موجود إذا تعثروا وكانوا بحاجة إلى القليل من المساعدة. هناك أيضًا أشياء أخرى\nتحدث خلف الكواليس أثناء صياغة الطالب والتي لا يستطيع الطالب دائمًا رؤيتها والتي\nستراها في لحظة عند نهاية المعلم. وللمراجعة، يمكن للطالب إرسال\nمسودته إلى خانميغو للحصول على تعليقات.  يقوم Khanmigo بإنشاء اقتراحات\nفي خمسة مجالات رئيسية للتعليقات التي تتماشى مع معظم عناوين التقييم الرئيسية. يمكن للطلاب أن يسألوا خانميغو عن\nالتعليقات التي حصلوا عليها، ولكن الأمر الأكثر إثارة هو أنه يمكنهم أيضًا مراجعة\nمقالتهم على الصفحة والحصول على تعليقات متابعة\nمن خانميغو في الوقت الفعلي حتى يتمكنوا من معرفة ذلك على الفور، هل عالجت مراجعتي\nالاقتراح الذي قدمته لي  ؟ وبالنسبة للمعلمين، أعتقد أن\nهذا هو المكان الذي يبدأ فيه برنامج Writing Coach، حيث يبدأ السحر بالظهور حقًا. لذا نظرًا لأن الطلاب\nيتفاعلون مع خانميجو خلال عملية الكتابة بأكملها، فإننا نكون قادرين بعد ذلك على تجميع ذلك وإبلاغ المعلم به ومنحهم رؤى مفيدة حقًا حول ما كان الطلاب قادرين على فعله، وما واجهوا صعوبة فيه. لذا فإن بعض الأشياء التي سيتمكن المعلمون من رؤيتها تشمل، بالطبع، مكان وجود\nكل طالب في المهمة، ويعمل فلان على الخطوط العريضة الخاصة به.  يقوم هذا الشخص بالفعل بالمراجعة، ويمكنه معرفة مقدار\nالوقت الذي قضاه في الصياغة مقابل المراجعة أو\nالتخطيط مقابل الصياغة. يمكنهم رؤية عدد الكلمات الحالي، ويمكنهم رؤية بيانات عالية المستوى حول توزيع التعليقات. وكما تعلم، حصل معظم الطلاب على\nتعليقات تتعلق بالأدلة. ربما هذا شيء يجب عليك التركيز عليه\nللحصول على التعليمات لاحقًا. ثم هذه\nالمخاوف المتعلقة بالأصالة المحتملة أو هذه الأعلام. هذه هي الأشياء التي ذكرتها عندما يقوم الطالب بصياغة أو\nحتى الخطوط العريضة أو المراجعة، إذا كانوا يلصقون كمية كبيرة من النص في التجربة ولا\nيعرف خانميغو من أين جاء، فهو لم يأت من  الخطوط العريضة أو لم تأت من تلك المحادثة، سنرفع علامة للمعلم حتى يتمكنوا بعد ذلك من الدخول والتحقيق ورؤية ما تم لصقه بالضبط، ومعرفة ما حدث، نوع من البحث في ذلك، والذي من المحادثات التي\nقمت بها  كان يتعين على المعلمين القيام بذلك، كما\nتعلمون، باستخدام مستندات Google أو إعادة صياغة ملحقات Chrome لكل\nطالب في كل مرة يمكن أن\nيستغرق وقتًا طويلاً بشكل لا يصدق في حد ذاته. ومع ChatGPT، أعتقد أن\nهذه مشكلة كبيرة لم يشهدها المعلمون من قبل. لذلك نحن متحمسون حقًا\nبشأن فوائد برنامج Writing Coach للطلاب، ولكن أيضًا الكثير من\nميزات المعلم التي ستأتي مع ذلك. - قبل أن نذهب إلى سال لطرح الأسئلة لأنني متأكد من أن لديك\nالكثير من الأشياء له، فقط أريد أن أخبرك أنني\nأرأس فريق الشراكات لدينا هنا في أكاديمية خان وأعمل مع المدارس والمناطق التعليمية، والآن حتى الولايات  على مستوى ما للدخول في شراكة مع مناطق أكاديمية خان التي نقدمها بالإضافة إلى خانميغو. لذا فإن الكثير من المحتوى والأدوات الخاصة بنا مجانية ويمكن الوصول إليها بشكل كامل ليستخدمها الطلاب والمعلمون. تقريبًا كل منطقة في البلاد لديها معلموها الذين يستخدمون\nالنسخة المجانية من أكاديمية خان لأنها\nمصدر تكميلي رائع. إذا كنت تريد خطابات دعم إضافية وتريد أن يتمكن طلابك\nمن الوصول إلى Khanmigo، فيمكنك الشراكة مع فريقي، وهو\nفريق الشراكة التابع لمنطقة أكاديمية خان للسماح لك بالحصول على الدعم بشكل أساسي لدورات ومحتوى أكاديمية خان، ولكن أيضًا السماح  يمكن لطلابك\nومعلمك الوصول إلى Khanmigo. وصول الطلاب إلى Khanmigo متاح فقط كجزء من\nشراكات المنطقة لدينا. وبالتالي فإن الطريقة التي تعمل بها هي أنك ستحصل بشكل أساسي على\nخدمات إعداد القوائم، وستحصل على تحليلات البيانات وستحصل على تعليم احترافي لكل من عرض أكاديمية خان الأساسي ولكن أيضًا لـ Khanmigo. \nوالتعلم المهني هو أمر أساسي حقًا لأنه من الواضح أن هذا\nالذكاء الاصطناعي جديد بالنسبة لنا جميعًا. لذلك نريد التأكد من أن هذه هي الرحلة التي نخوضها معًا\nحتى يكون لدينا موارد تعليمية مهنية قوية حقًا لك كجزء من شراكتنا في المنطقة. تبدأ شراكتنا بـ\n250 طالبًا. لذا، إذا كنت منطقة أصغر أو ربما كنت منطقة أكبر وأردت فقط أن تغمس\nإصبعك في الماء، فيمكننا أن نتشارك مع ما لا يقل\nعن 250 ترخيصًا للطلاب من خلال العدد الذي تريده. نحن نفرض رسومًا فقط على تراخيص الطلاب، لذلك إذا كنت شريكًا\nلنا في المنطقة التي تقدم تراخيص الطلاب وتدفع ثمنها، فستكون تراخيص المعلمين\nمجانية، وهو أمر رائع. ومرة أخرى، كما تحدثنا، هناك دعم التنفيذ حيث سنمسك بيدك ونرشدك عبر\nأفضل الممارسات، وكيفية الاستفادة من أكاديمية خان،\nوكيفية الاستفادة من خانميغو، وتدريب معلميك، وتدريب موظفيك، وتدريب موظفيك  admin بحيث يكون\nالجميع على دراية بكيفية استخدام النظام الأساسي. سأقول أن التعلم المهني مع خانميجو أمر إلزامي لأن هذا جديد جدًا ويتعلمه الجميع مع تقدمنا. نحن نصر على أن يكون لديك نوع من PL كجزء من الشراكة معنا. وسيعتمد PL على\nنطاق الشراكة. بالنسبة للشراكات الأصغر، قد يكون التطوير المهني عند الطلب حيث يمكن لمدرسيك إجراء المزامنة خلال ساعات العمل الافتراضية المباشرة وحتى أيام PL الشخصية الموصى بها حتى نتمكن من الحضور إلى منطقتك وتدريب موظفيك\nاعتمادًا على تقويم PL. لكن الفكرة هنا هي أننا\nنريد دعم الجميع، ودعم جميع معلميك\nونوعًا من أفضل الممارسات مع AI Khanmigo حتى يتمكن\nطلابك ومعلموك من تحقيق أقصى استفادة من المنصة. وإذا كنت مهتمًا، هناك\nشيئين يمكنك القيام بهما هنا. يمكنك مراسلتنا عبر البريد الإلكتروني مباشرة\nعلى District@khanacademy.org أو يوجد رمز الاستجابة السريعة هنا، والذي سينقلك إلى\nالصفحة المقصودة لمنطقتنا، والتي تحتوي على مجموعة من المعلومات حول منطقتنا التي تقدم\nخانميغو، وما إلى ذلك. لذلك نحن على أهبة الاستعداد الآن. فريقي على استعداد للمساعدة، ولكن سواء كنت تريد فقط\nعرضًا توضيحيًا أكثر تفصيلاً، يسعدنا تقديم ذلك أو معلومات أكثر تفصيلاً عن الأسعار، ويسعدنا تقديم ذلك مع\nأي من نقاط الاتصال هذه، ولكننا نتطلع إلى التحدث معك إذا  هل عندك أي سؤال. والآن أود أن أعيدها إلى سال حتى يكون لدينا معه أكبر قدر ممكن من الوقت للإجابة على أسئلتك. - شكرا، جيسون. لذا، نعم، أنا والآخرون هنا، وليس أنا فقط، سعداء بالإجابة على أي أسئلة وأي أفكار قد تكون لديكم جميعًا. - لدينا بعض الأسئلة\nالموجودة الآن.  هل يتمتع مدرب الكتابة\nبالقدرات اللازمة لإنشاء مطالبات كتابية قائمة على النص حيث يتم إدراج استثناءات للطلاب للقراءة والتحليل؟  هل تريد أن\nتتعمق أكثر في ذلك؟ - شيء واحد سأقوله هو أننا ندعم على وجه التحديد\nمقالات التحليل الأدبي.  كما تعلمون، من الناحية الهيكلية، أعتقد أن خانميجو يقوم بعمل جيد جدًا في مساعدة الطلاب في ذلك. إذا كان المقال يدور حول\nأي شيء معروف تم نشره قبل عام 2023، وهو الوقت الذي ترتفع فيه قاعدة معارف GPT-4،\n فإن الطلاب\nيحصلون فعليًا على دعم من خانميجو في تحليل النص. لذلك إذا قال الطالب، \"أنا حقًا لا أفهم\nهذا الموضوع أو هذه الشخصية، أو شيئًا حدث في القصة،\" خانميجو على علم بهذا النص ويمكنه دعمه بذلك. لذلك لا يمكنك فعليًا\nتحميل النص الخاص بك بعد. على الرغم من أنني أعتقد أننا سنكون قادرين على دعم شيء\nكهذا قريبًا إلى حد ما. ولكن يمكن أن يساعد الطلاب إذا كانت النصوص معروفة إلى حد ما. - ثم هناك أيضًا\nسؤال، هل لدينا DSA؟ - لدينا إصدارات من ذلك\nمع مناطق متعددة. معظم اتفاقيات المشاركة اليومية التي أعرفها هي تلك التي عقدنا فيها شراكة مع المنطقة التعليمية ونريد أن نفهم\nنتائج الفعالية بشكل أفضل. إذن لدينا العديد من المناطق هناك، وبهذه الطريقة يمكننا المساعدة في تحليل ما إذا كنا نأمل في تحريك القرص بالطريقة التي تشير إليها العديد من دراسات الفعالية لدينا . لكن نعم، من الواضح أننا أعتقد أننا القادة\nعندما يتعلق الأمر بخصوصية البيانات والاستخدام القوي للبيانات، ونستخدمها فقط لتخصيص الخبرة وقياس الفعالية وما إلى ذلك. ولكن نعم، إلى حد كبير. - نعم، جون، يمكنك إرسال بريد إلكتروني إلى\n عنوان البريد الإلكتروني District@khanacademy.org وسنقوم\nبالتسوية معك، فلدينا اتفاقيات على مستوى الولاية، ولدينا\nاتفاقيات كونسورتيوم، وDSAs، وDPAs، ونقدمها مباشرة إلى المقاطعات أيضًا. لذلك يمكننا بالتأكيد فرزك. ولكن ربما يكون من المفيد\nأن نتحدث عما نشاركه أو لا نشاركه مع OpenAI فيما يتعلق بالتعلم\nوالاستخدام على النظام الأساسي من حيث\nمشاركة البيانات واستخدام الطلاب. - بالتأكيد. نعم، سأتحدث قليلاً بشكل\nعام عن البيانات. من الواضح أن هناك الكثير من الفرص مع الذكاء الاصطناعي، ولكن هناك بعض المخاوف هنا. هناك خوف من الغش، وهناك خوف من قيام الطلاب\nبأشياء مشبوهة باستخدام الذكاء الاصطناعي، ثم هناك مخاوف، هل يتم دمج هذه المحادثات\nبطريقة ما في بيانات التدريب للنماذج المستقبلية؟  ومن الممكن أن يؤدي ذلك بطريقة أو بأخرى إلى\nخلق خطر على خصوصية البيانات خاصة مع شيء حساس للغاية، مثل بيانات الطلاب. لذلك سأذهب بهذا الترتيب.  لقد تمت الإشارة إليه بالفعل، بالنسبة للطلاب،\nلا تدعم أكاديمية خان، ولن تجيب على السؤال فقط. انها حقا بمثابة المعلم الأخلاقي.  لقد أوضحت لكم سارة القليل من هذا، هناك محادثة TED ألقيتها العام الماضي والتي تعمقت كثيرًا في هذا الأمر، لكننا واضحون جدًا. الآن، لدى المعلمين وضع المعلم وإذا وضعوه في وضع الطالب، فإنهم يرون ما سيراه الطلاب، وإذا وضعوه في وضع المعلم، فهو في الواقع لا يدعم\nالمعلمين بالإجابات فحسب، بل يعمل كدليل معلم ممتاز. يمكن أن يساعدهم في كل الأشياء التي كانت جينتاس تعرضها، خطط الدروس، وملحقات الدروس، وما إلى\nذلك، وما إلى ذلك. مجال آخر، حاجز حماية لدينا، هو أنه عندما يتفاعل الطلاب مع خانميجو، فإن هذه التفاعلات كلها يمكن\nملاحظتها من قبل المعلمين. ثم لدينا أيضًا واجهة برمجة\nالتطبيقات للإشراف أو الذكاء الاصطناعي للإشراف. لذا، إذا أجرى الطالب محادثة، يقولون إنهم\nيريدون، لا سمح الله، بناء قنبلة أو\nيريدون إيذاء أنفسهم، فسيؤدي ذلك إلى إغلاق تلك المحادثات وإخطار\nالمعلمين والإداريين بشكل فعال. الآن البيانات، وهذا هو\nالمبدأ الذي كانت تتبعه أكاديمية خان قبل وقت طويل من الذكاء الاصطناعي التوليدي،\nوهو أننا نستخدم البيانات فقط، وهذا أحد أسباب\nكوننا مؤسسة غير ربحية، لذلك لا نميل حتى\nإلى المحاولة  لتحقيق الدخل من البيانات بطريقة مشبوهة. نحن نستخدم البيانات فقط لقياس تأثيرنا، أو تخصيص التجربة، أو\nتحسينها، أو إبلاغ أصحاب المصلحة الرئيسيين الموثوقين\nمثل المعلمين أو المناطق، وهذه هي استخداماتنا الوحيدة للبيانات. لذلك عندما يتعلق الأمر بعالم الذكاء الاصطناعي،\nكما ذكرت للتو، فإننا نقوم بتخزين محادثات الطلاب. نحن نستخدم ذلك فقط\nلإعداد تقارير المعلمين أو تقييمنا لما يحدث وكيف يمكننا تحسينه. نحن لا نسمح بهذه المحادثات، وهذه هي الاتفاقيات التي أبرمناها مع شركات الذكاء الاصطناعي الأساسية والتي تنص على أنه\nلا يمكن استخدام البيانات \nلتدريب النماذج المستقبلية للأغراض العامة. لذا، لا يمكن لأي من المعلومات الخاصة للطلاب أن تجد طريقها إلى\nالمجال العام، دعنا نسميها. قد نستخدم هذه المعلومات لضبط أو تدريب إصداراتنا الخاصة\nلتخصيصها مرة أخرى أو لتكون أكثر فعالية للطلاب. ولكن مرة أخرى، سيبقى ذلك داخل حديقة أكاديمية خان هذه، وليس للعالم الأوسع. لذلك نحن نأخذ ذلك على محمل الجد. وكما تعلمون، لكي نكون واضحين،\nهناك الكثير من الأشخاص، إذا كنا شركة هادفة للربح\n، كل يوم، لدي شركة ذكاء اصطناعي تعرض علينا أن\nتدفع لنا مقابل تلك البيانات ونحن نقول لا. لذلك يمكنك أن تتخيل\nما يمكن أن يحدث إذا كانت حكمنا\nمختلفة قليلاً. - نعم، وقد طرح سال نقطة رائعة، حيث أنكم جميعًا تنظرون إلى منتجات الذكاء الاصطناعي، سواء كانت شركة Khanmigo أو\nالشركات الأخرى الموجودة هناك، أود أن أشجعكم حقًا على قراءة سياسات الخصوصية فعليًا. هناك هذه الشركات\nتظهر كل يوم. هناك الكثير من الشركات الناشئة، ولا نعرف من يقف وراءها. لا نعرف ما إذا كان هناك أشخاص تربويون ينظرون إلى أصول التدريس\nويتعلمون ذلك. هناك مجموعة من الأشخاص في الوقت\nالحالي ستعرف أسمائهم، اذهب\nلقراءة سياسات الخصوصية الخاصة بهم ويقولون على وجه التحديد، لن نشارك أو نبيع بيانات الطلاب إلا إذا استحوذنا عليها\nأو توقفنا عن العمل، وهو ما سيكون\n95٪  من هذه الشركات. فماذا سيفعلون عندما تنفد\nأموالهم أو يتم الاستحواذ عليهم؟ هل لديهم نفس حواجز الحماية التي تمتلكها شركة مثل أكاديمية خان\nفيما يتعلق بالمشاركة؟ لذا كن حذرًا للغاية\nوأنت تنظر إلى المنتجات الموجودة في المجال الآن، وما يفعلونه فيما\nيتعلق بمشاركة البيانات، وخصوصية البيانات، وإدارة البيانات، لأنني أعتقد أن هذا هو حقًا\nاتخاذ القرار الرئيسي، وهو خيار لكم جميعًا. - [الراوي] شكرًا لكم\nجميعًا على انضمامكم إلينا اليوم ومشاهدة هذا الفيديو وكونكم جزءًا من مجتمع المتعلمين والمدرسين في أكاديمية خان\n. إذا كنت ترغب في معرفة\nالمزيد حول كيفية قيام Khanmigo بتعزيز التعلم\nفي الفصول الدراسية في الوقت الحالي، فانقر على الروابط الموجودة على\nشاشتك وللبقاء على اتصال ولا تفوت أبدًا أي إعلان حول التعليم المجاني ذي المستوى العالمي لأي شخص في أي مكان، تأكد من ذلك  يشترك.",
    "t_italian": "- Ciao a tutti. Buon pomeriggio. Stiamo lentamente accogliendo le\npersone nella stanza. Grazie per aver dedicato del tempo per unirti a noi. Mi chiamo Felipe Escamilla, sono il responsabile video\nqui alla Khan Academy. A breve si unirà a noi Sal Khan, CEO e fondatore di Khan Academy. Ti parlerà un po'\ndella nostra missione, del nostro strumento di intelligenza artificiale e dell'assistente insegnante e tutor degli studenti chiamato Khanmigo. Abbiamo anche due product manager senior che si uniranno a noi, Gintas Bradunas e Sarah Robertson.  Adesso andrò avanti e\nvi presenterò Sarah e Gintas, vi parlerò un po' dei loro ruoli e di cosa fanno qui alla Khan Academy e di alcune cose, una piccola anteprima, di ciò che presenteranno oggi. Ciao, Sara.  Ciao, Gintas. - Ehi, Filippo. Benvenuti a tutti, sono Sarah Robertson. Come ha detto Felipe, sono Senior Product Manager\nqui alla Khan Academy. Sono un ex\ninsegnante di inglese molti anni fa. In precedenza ha lavorato anche per CommonLit, un'altra società no-profit EdTech. E sono alla Khan Academy\normai da poco più di un anno. Principalmente mi sono concentrato sulle nostre iniziative legate all'alfabetizzazione, creando quindi contenuti,\nstrumenti e risorse per gli insegnanti di ELA e di materie umanistiche.  La cosa più interessante su cui\nabbiamo lavorato ultimamente è il nostro strumento Writing Coach, che ti mostrerò in\ndettaglio tra poco e lascerò che Gintas condivida se stesso. - Certo, grazie, Sarah. Ciao a tutti, mi chiamo Gintas. Sono un Senior Product Manager\nnel nostro Teacher Experience Team. E come Sarah, ero\nun'insegnante in una vita passata, quindi ero un'insegnante di inglese alla scuola media, insegnavo ELA di prima e seconda media, e poi sono stata trascinata nel\nmondo del prodotto. E il mio team, come suggerisce il nome, si concentra principalmente su tutto ciò che possiamo fare per\nsemplificare la vita degli insegnanti e per consentire agli insegnanti, ovviamente, di aiutare i loro studenti a\nraggiungere i loro obiettivi di apprendimento e le loro esigenze. Quindi è una squadra divertente in cui far parte.  Ci sono molti altri\nex educatori e anche molti insegnanti di inglese.  A volte scendiamo nella tana del coniglio\ncon le nostre metafore. Quindi sì, sono davvero entusiasta di mostrarti oggi i nostri strumenti Khanmigo e su cosa abbiamo\nlavorato per rendere Khanmigo l'assistente ideale dell'insegnante. - Volevo solo ringraziare\ntutti per essersi uniti, darò solo un po' di background e poi lo consegnerò\nal team della Khan Academy per approfondire le cose. Ma suppongo che la maggior parte delle persone qui abbiano una certa familiarità con la Khan Academy, una missione senza scopo di lucro,\nun'istruzione gratuita di livello mondiale per chiunque, ovunque. E probabilmente molti di voi sanno come è nata la Khan Academy e io parlavo della\nstoria delle origini proprio come un modo divertente e bizzarro con cui sono stato\ncoinvolto nella Khan Academy, ma ora ne parlo perché penso che sia molto rilevante ad alcuni degli argomenti di cui parleremo con l'intelligenza artificiale e oltre. Sai, quando\nho iniziato a dare lezioni ai cugini, la voce si è sparsa nella mia famiglia, le lezioni gratuite sono iniziate prima che me ne rendessi conto, sto\ndando lezioni a molti cugini. Comincio a provare ad ampliare questi tipi di interazioni individuali personalizzate. Comincio a realizzare\nper loro esercizi di scrittura, strumenti per insegnanti. Sono stato il primo utente degli strumenti dell'insegnante in modo da poter tenere traccia\ndi ciò che stavano facendo gli studenti e assegnare compiti ai miei cugini. Un amico mi ha suggerito di fare dei video.  Ancora una volta, quello era un modo per ridimensionare alcune di queste mini lezioni che stavo dando ai miei cugini. E poi avanziamo velocemente fino ad oggi, o un paio di anni fa, la Khan Academy è ovviamente\nmolto più di me, ma come organizzazione no-profit, quello che abbiamo veramente,\ntutto quello che abbiamo fatto, anche se  ora siamo a\noltre 160 milioni di utenti, è la stessa idea. Come proviamo davvero a\nscalare il tipo di attenzione, personalizzazione, apprendimento della padronanza, ovvero se gli studenti non hanno\nancora imparato qualcosa, dovrebbero avere più opportunità e incentivi per impararlo. Come possiamo estenderlo a un numero\nsempre maggiore di studenti e come supportiamo insegnanti, educatori, dirigenti scolastici e sovrintendenti al fine di supportare meglio i loro\nstudenti in tutte queste cose? Quindi questi erano gli strumenti per gli insegnanti e lo sviluppo professionale che abbiamo portato avanti nel corso degli anni. Facciamo un salto avanti fino a circa\nun anno e mezzo fa, ed è allora che OpenAI\nci ha contattato per la prima volta. Eravamo curiosi ma scettici. Stiamo monitorando\n da un po' cosa sta succedendo nel mondo dell'intelligenza artificiale. Non sembrava pronto per il\ndebutto, almeno nel 2022. Ma poi quando abbiamo visto cosa poteva fare GPT-4, e giusto per dare un\npo' di chiarimenti su parte della terminologia, molte\npersone conoscono ChatGPT, ChatGPT è  un'applicazione che hanno successivamente creato\noriginariamente su un modello precedente. Ora, potresti accedervi\nsu GPT-4 se paghi, ma i modelli sono GPT-3, GPT-4, Google ha modelli come Gemini, eccetera, e poi hai le applicazioni. Ma quando abbiamo visto di cosa era capace GPT-4, anche se aveva i suoi\npunti deboli, abbiamo detto: \"Wow, questo potrebbe portarci molto più in là e riuscire ad ampliare il\ntipo di personalizzazione che vogliamo fare per gli studenti. E potrebbe essere molto più potente per sostenere gli insegnanti.\" Tutti questi compiti che gli\ninsegnanti devono svolgere, chiaramente devono ottenere rapporti su come stanno andando i loro studenti, ma stanno anche facendo\ncose come programmi di lezione, biglietti di uscita, rapporti sui progressi\n, eccetera, eccetera. Magari potrebbe farne parte, potrebbe essere un tutor per ogni studente e un assistente didattico\nper ogni insegnante. Quindi questo è il viaggio che abbiamo iniziato a intraprendere. Ovviamente c'erano\nmolte domande su come gestisci la sicurezza, la privacy, gli imbrogli e stiamo lavorando su tutte queste e pensiamo di avere buone risposte, ma ti mostreremo\nsoprattutto molti degli strumenti che sono insegnanti  di fronte a ciò\nsiamo molto entusiasti e recentemente abbiamo apportato un\nrinnovamento piuttosto significativo e lo abbiamo reso molto più accessibile a molti più educatori, ma riconosciamo anche che questo è un viaggio che speriamo che molti di\nvolete continuare con noi, che possa esservi immediatamente\nutile in questo momento, ma man mano che lo usate e noi impariamo da come lo usate, possiamo renderlo sempre migliore in modo da poter  supportarti e noi possiamo supportare i tuoi studenti. Detto questo, lo passerò al team\nin modo che possano mostrarvi un po' di quello che abbiamo fatto. - Va bene, grazie, Sal. Inizieremo\ncon i nostri strumenti per insegnanti. Quindi questa è la nostra nuova\npagina degli strumenti per insegnanti di Khanmigo. Come ho accennato nell'introduzione, sono un ex\ninsegnante di inglese della scuola media e il compito del mio team è semplicemente quello di semplificare la vita degli insegnanti. E quando tutti\nripensiamo ai nostri giorni da insegnante, continuo a dire che è il lavoro più difficile che io abbia mai fatto, che chiunque di noi abbia mai fatto. E l’unico modo in cui un insegnante spesso riesce a superare la\npropria esperienza di insegnamento è appoggiandosi agli altri, appoggiandosi alla loro rete di supporto. Quindi nel mio caso c'erano\nmolti altri insegnanti del primo, secondo e terzo anno. Dall'altra parte del corridoio c'era un'insegnante veterana, la signora Hall, che potevo\nvedere nella sua classe e raccogliere idee per\nla lezione del giorno successivo. E così, nel costruire Khanmigo, vogliamo aggiungere un altro pezzo\na quella rete di supporto. Quindi, nello stesso modo in cui\nandresti dall'altra parte della sala per chiedere idee a un insegnante,\nora puoi andare a Khanmigo e lavorare con Khanmigo per migliorare le\ntue lezioni, per trovare idee su come assicurarti di coinvolgere i tuoi studenti  . Quindi, per mostrarti come potrebbe essere, posso entrare qui e dire: \"Domani ho una lezione\nche terrò e la sto già temendo perché è quello che so essere\nun argomento che i miei studenti non conoscono\"  Non mi piace necessariamente così tanto. E in questo caso,\ndiciamo che si tratta di aggiungere frazioni. È un argomento che i miei studenti potrebbero non trovare così coinvolgente,\nma siamo a Baltimora, e per una volta Baltimora ha\nuna squadra di baseball davvero buona dirò che la mia classe è\nun insieme di appassionati di baseball. In realtà sono fan degli Orioles. E dirò, puoi renderlo rilevante per i miei studenti che potrebbero interessarsi più al\nbaseball che all'addizione delle frazioni la stessa idea di attraversare il\ncorridoio e dire: \"Ehi, cosa hai fatto di\n così bello ieri in classe? Perché erano così fidanzati? Perché erano così presi dalla tua lezione?\" E qui possiamo vedere un paio di idee su come usare le statistiche delle figurine del baseball\n, le medie, per insegnare le frazioni, e questo è grandioso, ma ovviamente sono un po' di parte. Sono un tipo da baseball  fan me stesso e questo potrebbe non applicarsi\na tutti i miei studenti. Ed è qui che\ndiventa davvero emozionante usare Khanmigo dove Khanmigo è davvero il tuo partner qui e può lavorare con te\nper personalizzare il contenuto per soddisfare le esigenze degli studenti questo, posso chiedere a Khanmigo di\napportare modifiche a questo, provare qualcosa di diverso, discuterne. In questo caso\ndirò di apportare modifiche a questo e so che nella mia classe ho un paio di fan di Taylor Swift Quindi...  Dirò,\ninvece, di farlo su Taylor Swift E non ho idea di come\nfunzionerà perché non ho idea di come collegare Taylor Swift alle frazioni, e Khanmigo mi darà alcune idee qui, possibilmente legandole alle\nlunghezze delle tracce.  , collaborazioni, alle sue vendite C'è stato un caso precedente in cui\nKhanmigo mi ha fornito un esempio di come trovare le frazioni nei\ntesti di Taylor Swift. Queste sono idee che\nnon mi sarebbero mai venute o che non avrei mai avuto se non avessi fatto un\nbrainstorming con Khanmigo. Quindi, innanzitutto, Khanmigo è\nun ottimo partner di pensiero. È anche un ottimo partner per il piano di lezione. Se vado qui e seleziono il programma della lezione, posso dire, sai, aggiungendo le frazioni e attingerò dai nostri\ncontenuti qui su Khan Academy. E quindi vedrò l'aggiunta e la sottrazione delle frazioni negative creare un piano di lezione e creerà un\npiano di lezione completo in cinque parti che include la differenziazione. Ed è qui che il nostro\ntempestivo team di ingegneri, molti ex educatori di quel team, hanno lavorato per progettare un'esperienza in cui Khanmigo fornisce le strategie che il tuo collega insegnante suggerirebbe a un altro insegnante di includere nelle loro classi. Ultimo, ma certamente non meno importante, Khanmigo può anche fare cose\ncome consigliare incarichi. Quindi, se il giorno prima della lezione penso solo a cosa dovrei lavorare con i miei studenti, potrebbero aver lavorato\nsu un paio di argomenti, ma non sono proprio sicuro di cosa verrà dopo, ho sempre domande\nsull'ambito, sulla sequenza e su cosa  ha senso insegnare, dopodiché posso semplicemente chiedere a Khanmigo in questo caso. E Khanmigo mi darà un paio di idee su cosa lavorare con i\nmiei studenti domani e dirà, assegnalo al gruppo uno e posso assegnarlo direttamente da Khanmigo e questo sarà negli account dei miei studenti il ​​giorno successivo affinché possano lavorare  SU. Sono davvero, davvero entusiasta di dove è arrivato Khanmigo in termini di caso d'uso dell'insegnante. Davvero utile già oggi. Noi come squadra abbiamo\nlavagne su lavagne di strumenti futuri e idee su\ndove portare Khanmigo in seguito. Quindi rimanete sintonizzati per questo. Ma questo è il mio aggiornamento di oggi e lo passerò a Sarah\nper condividere qualcosa in più sul Coach di scrittura. - Grazie, Gintas. Va bene, quindi penso che molti di voi sappiano che Khan Academy è molto\nconosciuta per i suoi contenuti STEM, i suoi video, articoli ed esercizi eccellenti e l'apprendimento della padronanza. Siamo davvero entusiasti di\nalcuni dei progressi che stiamo vedendo quando si tratta di intelligenza artificiale, ELA e discipline umanistiche. E abbiamo lavorato\nmolto duramente nell'ultimo anno per applicare parte di questa innovazione e questa opportunità ai casi d'uso degli insegnanti di ELA e di materie umanistiche. Quindi quello che condividerò è un progetto che chiameremo Writing Coach. Questo è qualcosa che\nnon è ancora disponibile. Lo stiamo lanciando per la\nstagione del ritorno a scuola. In questo momento, c'è una funzionalità\nche è una sorta di anteprima di Writing Coach che puoi vedere se disponi dell'accesso a Khanmigo per gli studenti. E questa si chiama la nostra\nattività di feedback sui saggi accademici. Ma tra un attimo ti darò\nun'anteprima di come sarà il Writing Coach durante il rientro a\nscuola. Ma molto velocemente, se tu, e penso che molti di voi\nprobabilmente abbiano familiarità con questo dilemma dell'insegnamento della scrittura nelle scuole in questo momento. La ricerca ci dice che gli studenti devono trascorrere 60 minuti\nal giorno a scrivere in classe, tra gli studenti delle scuole medie e superiori. Meno del 10% degli studenti sta\neffettivamente raggiungendo questo obiettivo. Sappiamo anche che per migliorare le istruzioni scritte, gli studenti hanno bisogno di feedback specifici e attuabili\nsulla loro scrittura, che vengano forniti nel\nmodo più tempestivo possibile. Questo non è quasi mai\nciò che accade nella realtà. E di conseguenza, gli insegnanti non\nassegnano abbastanza scritti.  Si esauriscono moltissimo anche solo provando a fornire un\nfeedback personalizzato su ogni saggio, quindi non c'è da meravigliarsi che gli studenti siano indietro nelle loro capacità di scrittura. Come ho detto prima, sono un ex\ninsegnante di inglese, per assegnare un saggio ai miei 100 studenti mi\noccorrerebbero 17 ore per fornire un\nfeedback personalizzato su tutti i loro saggi. Quindi quello che penso sia particolarmente\nentusiasmante di Writing Coach sono innanzitutto le funzionalità\nche mette a disposizione degli studenti. Quindi una cosa che sappiamo è che ovviamente gli studenti hanno bisogno di feedback per diventare scrittori migliori, ma molti degli insegnanti con cui\nabbiamo parlato ci hanno detto: \"È fantastico che il tuo\nattuale strumento di feedback dia feedback sui saggi, ma non posso  Non riesco nemmeno a portare la maggior parte dei miei studenti al punto in cui\nhanno una prima bozza.\" Tutta quella\nparte introduttiva, delineare, è come cavare un dente. È davvero difficile persino convincere gli studenti a produrre qualcosa con cui cominciare. E anche io, quella è\nstata anche la mia esperienza, ricordo quel momento in cui mi guardavo intorno e gli studenti si sentivano così bloccati. Quindi, lo strumento Writing Coach supporta effettivamente gli studenti durante l'intero\nprocesso di scrittura fin dall'inizio. Il primo passo\nche fa Writing Coach è parlare allo studente. Khanmigo parlerà allo\nstudente del suggerimento del saggio. Si assicurerà che capiscano quali sono le aspettative e che se ci sono parole con cui non hanno familiarità, Khanmigo li aiuterà a\ncapire cos'è una confutazione, come posso scrivere una controargomentazione? Quel genere di cose. Quindi questa anteprima qui mostra quella fase iniziale di revisione tempestiva prima ancora che lo studente inizi a scrivere, in cui hanno una conversazione casuale e di bassa pressione\ncon Khanmigo per convincerli a pensare al\ncompito del saggio. E poi ovviamente uno\ndei passi successivi è la definizione. Quindi uno dei vantaggi di\navere Khanmigo che supporta gli studenti durante il processo di definizione\nè che Khanmigo sa quale era il compito dell'insegnante. Quindi Khanmigo sa quanti\nparagrafi si aspetta l'insegnante, che tipo di citazioni\nvuole vedere, che tipo di dettagli vuole che gli studenti includano. E quando lo studente\nlavora sulla bozza, Khanmigo può assicurarsi\nche sia sulla buona strada. E se lo studente ha delle domande, Khanmigo sa come rispondere. E se hai studenti\nche sono completamente persi quando si tratta di scrivere una tesi, Khanmigo è stato formato per supportare gli studenti nella scrittura e nella stesura di questi diversi\nelementi di uno schema senza fare effettivamente\nnulla di quel lavoro per loro. Quando si tratta di redazione, ovviamente Khanmigo ora\nha agli studenti la bozza su cui ha lavorato con lo studente. Quindi può aiutare lo\nstudente a inserirlo nella bozza e ad arricchirlo maggiormente. E ovviamente, come\ncon tutte le altre funzionalità, non \nscriverà per lo studente, ma è lì se si blocca e ha bisogno di un po' di aiuto. Ci sono anche altre cose\nche accadono dietro le quinte durante la stesura di uno studente che lo studente non può sempre vedere e che\nvedrai tra un momento dall'insegnante. E per la revisione, lo studente può inviare la\nbozza a Khanmigo per un feedback. Khanmigo genera suggerimenti\nin cinque aree principali di feedback allineate alla maggior parte delle rubriche principali. Gli studenti possono chiedere a Khanmigo\nil feedback che hanno ricevuto, ma la cosa più interessante è che possono anche rivedere il\nloro saggio sulla pagina e ricevere feedback\nda Khanmigo in tempo reale in modo che possano scoprire immediatamente, la mia revisione ha risposto al\nsuggerimento che mi hai dato  ? E per gli insegnanti, penso che\nquesto sia il momento in cui Writing Coach, dove la magia inizia davvero a mostrarsi. Quindi, poiché gli studenti\ninteragiscono con Khanmigo durante l'intero processo di scrittura, siamo quindi in grado di sintetizzarlo e riferirlo all'insegnante e fornire loro spunti davvero utili su ciò che gli studenti sono stati in grado di fare e su cosa hanno lottato. Quindi alcune delle cose che gli insegnanti potranno vedere includono, ovviamente, dove si trova\nogni studente nel compito, così e così sta lavorando sulla sua bozza. Questa persona è già in fase di revisione, può vedere quanto\ntempo è stato impiegato nella stesura della bozza rispetto alla revisione o nella\ndefinizione rispetto alla bozza. Possono vedere il conteggio delle parole corrente, possono vedere dati di alto livello sulla distribuzione del feedback. Quindi sai, la maggior parte degli studenti ha ricevuto\nfeedback relativi alle prove. Forse è qualcosa su cui dovresti concentrarti\nper le istruzioni successive. E poi queste potenziali\npreoccupazioni sull'originalità o queste bandiere. Quindi queste sono le cose che ho menzionato quando uno studente sta abbozzando o\naddirittura delineando o rivedendo, se sta incollando una grande quantità di testo nell'esperienza e Khanmigo non\nsa da dove viene, non proviene dal  delineato o non proviene da quella conversazione, alzeremo una bandiera per l'insegnante in modo che possa poi entrare e indagare e vedere esattamente cosa è stato incollato, vedere cosa è successo, in un certo senso approfondire ciò, che dalle conversazioni che\nho  avuto con gli insegnanti che dovevano farlo,\nsai, usare Google Docs o abbozzare le estensioni di Chrome\nuno studente alla volta può richiedere di per\nsé un tempo incredibilmente lungo. E con ChatGPT, penso che\nquesto sia il problema più grande che gli insegnanti abbiano mai visto. Quindi siamo davvero entusiasti\ndei vantaggi per gli studenti di Writing Coach, ma anche di molte di\nqueste funzionalità per gli insegnanti che ne deriveranno. - Prima di andare da Sal per domande, perché sono sicuro che hai\nun sacco di cose per lui, voglio solo farti sapere che\ndirigo il nostro team di partnership qui alla Khan Academy che lavora con scuole, distretti scolastici e ora anche stati  a un certo livello per collaborare per l'offerta dei nostri distretti della Khan Academy e per Khanmigo. Pertanto, molti dei nostri contenuti e strumenti sono gratuiti e totalmente accessibili per i tuoi studenti e insegnanti. Quasi ogni distretto del paese ha i propri insegnanti che utilizzano la\nversione gratuita di Khan Academy perché è una fantastica\nrisorsa supplementare. Se desideri ulteriori lettere di sostegno e desideri che i tuoi studenti\nabbiano accesso a Khanmigo, puoi collaborare con il mio team, che è il\nteam di partenariato del distretto di Khan Academy per consentirti sostanzialmente di ottenere supporto per i corsi e i contenuti di Khan Academy, ma anche lasciare che  i tuoi studenti\ne insegnanti accedono a Khanmigo.  L' accesso degli studenti a Khanmigo è disponibile solo nell'ambito dei\nnostri partenariati distrettuali. E quindi il modo in cui funziona è che fondamentalmente\notterrai servizi di rostering, otterrai analisi dei dati e otterrai un apprendimento professionale sia per l'offerta principale di Khan Academy ma anche per Khanmigo. E l’\napprendimento professionale è davvero fondamentale perché ovviamente questa\nintelligenza artificiale è nuova per tutti noi. Vogliamo quindi assicurarci che questo sia un viaggio che stiamo affrontando insieme,\nquindi disponiamo di risorse di apprendimento professionale davvero solide per te come parte della nostra partnership distrettuale. La nostra partnership inizia con un\npiccolo numero di 250 studenti. Quindi, se sei un distretto più piccolo o magari un distretto più grande e vuoi semplicemente mettere i\npiedi in acqua, possiamo collaborare per un minimo di\n250 licenze per studenti fino a quante ne desideri. Facciamo pagare solo le licenze per studenti, quindi se collabori per\nnoi nel distretto offrendo e pagando le licenze per studenti, le licenze per insegnanti\nsaranno gratuite, il che è fantastico. E ancora, come abbiamo detto, c'è il supporto all'implementazione in cui vi terremo per mano e vi guideremo attraverso le\nmigliori pratiche, come sfruttare Khan Academy,\ncome sfruttare Khanmigo, formare i vostri insegnanti, formare il vostro staff, formare i vostri  amministratore in modo che\ntutti siano d'accordo su come dovrebbe essere utilizzata la piattaforma. Dirò che l'apprendimento professionale con Khanmigo è obbligatorio perché è una novità e tutti imparano man mano che procediamo. Insistiamo affinché tu abbia una sorta di PL come parte della partnership con noi. E il PL dipenderà dalla\nportata della partnership. Per i partenariati più piccoli, potrebbe trattarsi di PD su richiesta che i tuoi insegnanti possono eseguire in modo asincrono tramite ore virtuali dal vivo e persino giornate PL consigliate di persona in cui possiamo venire nel tuo distretto e formare il tuo personale\nin base al calendario PL. Ma l'idea qui è che\nvogliamo supportare tutti, supportare tutti i tuoi insegnanti\ne le migliori pratiche con AI Khanmigo in modo che i\ntuoi studenti e insegnanti ottengano il massimo dalla piattaforma. E se sei interessato,\ndue cose puoi fare qui. Puoi inviarci un'e-mail direttamente\na distretti@khanacademy.org oppure c'è un codice QR qui, che ti porterà alla\npagina di destinazione del nostro distretto, che contiene un sacco di informazioni sul nostro distretto che offre\nKhanmigo, eccetera. Quindi adesso siamo in stand-by.  Il mio team è pronto ad aiutarti, ma se desideri semplicemente\nuna demo più dettagliata, saremo lieti di fornirti questa o informazioni più dettagliate sui prezzi, lieti di fornirtele con\nuno di questi punti di contatto, ma non vediamo l'ora di parlare con te se  hai qualche domanda E ora mi piacerebbe rimandarlo a Sal così avremo più tempo possibile con lui per rispondere alle tue domande. - Grazie, Jason. Quindi sì, io e gli altri qui, non solo io, siamo felici di rispondere a qualsiasi domanda e a qualsiasi idea possiate avere. - Abbiamo un paio di domande\nda fare proprio adesso. Il Coach di scrittura\nha le capacità per creare suggerimenti di scrittura basati su testo in cui vengono inserite eccezioni che gli studenti possono leggere e analizzare? Vuoi andare un\npo' più in profondità con questo? - Una cosa che dirò è che supportiamo specificamente i\nsaggi di analisi letteraria. Sai, strutturalmente, penso che Khanmigo faccia un ottimo lavoro nell'aiutare gli studenti in questo. Se il saggio riguarda\nqualcosa di ben noto che è stato pubblicato prima del 2023, ovvero quando arriva la base di conoscenza di GPT-4,\n gli studenti\nricevono effettivamente supporto da Khanmigo nell'analisi del testo. Quindi, se lo studente dice: \"Non capisco davvero\nquesto tema o questo personaggio, o qualcosa che è successo nella storia\", Khanmigo è a conoscenza di quel testo e può supportarlo in questo. Quindi non puoi\nancora caricare il tuo testo. Anche se penso che saremo in grado di supportare qualcosa\ndel genere abbastanza presto. Ma può aiutare gli studenti se i testi sono abbastanza conosciuti. - E poi c'è anche una\ndomanda: abbiamo un DSA? - Ne abbiamo versioni\ncon multidistretti.  La maggior parte degli accordi di condivisione che conosco sono quelli in cui abbiamo collaborato con il distretto scolastico e vogliamo comprendere\nmeglio i risultati di efficacia. Quindi abbiamo diversi distretti lì e in questo modo possiamo aiutare ad analizzare se si spera che stiamo spostando il quadrante nel modo in cui molti dei nostri studi sull'efficacia indicano che farebbero. Ma sì, ovviamente lo siamo, penso che siamo i leader\nquando si tratta di privacy dei dati e di utilizzo solido dei dati, utilizzandoli solo per personalizzare l'esperienza, misurare l'efficacia, eccetera. Ma sì, più o meno. - Sì, John, puoi inviare un'e-mail\n all'indirizzo e-mail districts@khanacademy.org e\npossiamo risolvere con te, abbiamo accordi a livello statale, abbiamo\naccordi di consorzio, DSA e DPA, forniamo direttamente anche ai distretti. Quindi possiamo sicuramente sistemarti. Ma Sal forse è utile\nparlare di ciò che condividiamo o non condividiamo con OpenAI in termini di apprendimento\ne utilizzo sulla piattaforma in termini di\ncondivisione dei dati e utilizzo da parte degli studenti. - Sicuro. Sì, parlerò un po' in\ngenerale dei dati. Ovviamente ci sono molte opportunità con l'intelligenza artificiale, ma qui ci sono alcuni timori. C'è la paura di imbrogliare, c'è la paura che gli studenti\nfacciano cose losche con l'intelligenza artificiale e poi c'è la paura, queste conversazioni\nvengono in qualche modo incorporate nei dati di addestramento per i modelli futuri? E questo potrebbe in qualche modo\ncreare un rischio per la privacy dei dati, soprattutto con qualcosa di molto sensibile, come i dati degli studenti. Quindi andrò in quest'ordine.  Si è già accennato al fatto che la Khan\nAcademy non supporta gli studenti e non si limiterà a rispondere alla domanda. Agisce davvero come un tutor etico. Sarah vi ha mostrato un po' di questo, c'è un discorso TED che ho tenuto l'anno scorso che va molto più in profondità al riguardo, ma siamo molto chiari. Ora, gli insegnanti hanno una modalità insegnante e se la mettono in modalità studente, vedono cosa vedrebbero gli studenti, se la mettono in modalità insegnante, in realtà non solo supporta gli\ninsegnanti con le risposte, ma agisce come una super guida dell'insegnante. Può aiutarli con tutte le cose che Gintas stava mostrando, programmi di lezione, ganci per le lezioni,\neccetera, eccetera. Un'altra area, un guardrail che abbiamo è quando gli studenti interagiscono con Khanmigo, quelle interazioni sono tutte\nosservabili dagli insegnanti. E poi abbiamo anche\nun'API di moderazione o un'intelligenza artificiale di moderazione. Quindi, se lo studente ha una conversazione, dice che\nvuole, il cielo non voglia, costruire una bomba o\nvuole farsi del male, interromperà quelle conversazioni e avviserà attivamente\ninsegnanti e amministratori. Ora i dati, e questo è un\nprincipio per Khan Academy ben prima dell'intelligenza artificiale generativa,\nè che utilizziamo solo dati, e questo è uno dei motivi per cui\nsiamo un'organizzazione no-profit, quindi non siamo nemmeno tentati\ndi provarci  monetizzare i dati in qualche modo losco. Utilizziamo i dati solo per misurare il nostro impatto, personalizzare l'esperienza,\nmigliorare l'esperienza o informare le principali parti interessate di fiducia\ncome insegnanti o distretti, questi sono i nostri unici usi per i dati. Quindi, quando si entra nel campo dell'intelligenza artificiale\n, come ho appena detto, memorizziamo le conversazioni degli studenti.  Lo usiamo solo\nper i resoconti degli insegnanti o per la nostra valutazione di ciò che sta accadendo e di come possiamo migliorarlo. Non consentiamo tali conversazioni e questi sono accordi che abbiamo con le società di intelligenza artificiale sottostanti secondo\ncui i dati non possono essere utilizzati per la\nformazione generale di modelli futuri. Quindi nessuna delle informazioni private degli studenti può farsi strada nel\nregno, chiamiamolo pubblico. Potremmo utilizzare tali informazioni per perfezionare o addestrare le nostre versioni\nper personalizzare ancora una volta o essere più efficaci per gli studenti. Ma ancora una volta, ciò rimarrà all’interno del giardino della Khan Academy, non per il mondo più ampio. Quindi lo prendiamo molto, molto sul serio. E sai, per essere chiari,\nci sono un sacco di persone, se fossimo un'azienda a scopo di lucro\n, ogni giorno, ho qualche azienda di intelligenza artificiale che si offre\ndi pagarci per quei dati e noi diciamo di no. Quindi puoi immaginare\ncosa potrebbe accadere se la nostra governance fosse\nun po’ diversa. - Sì, e Sal solleva un ottimo punto, dato che tutti voi state guardando i prodotti di intelligenza artificiale, che si tratti di Khanmigo o di\naltre società là fuori, vi incoraggio davvero a leggere effettivamente le politiche sulla privacy. Ci sono queste aziende che\nspuntano fuori ogni giorno. Ci sono tonnellate di startup là fuori, non sappiamo chi c'è dietro di loro. Non sappiamo se ci sono persone educative che guardano alla pedagogia\ne ne apprendono. Ci sono un sacco di persone\nlà fuori in questo momento di cui conoscerai i nomi, vai a\nleggere le loro politiche sulla privacy e dicono specificamente che non condivideremo o venderemo i dati degli studenti a meno che non venissimo acquisiti\no cessassimo l'attività, il che sarà al\n95%  di queste aziende. E quindi cosa faranno quando inizieranno a rimanere senza\nsoldi o verranno acquisiti? Hanno gli stessi guardrail che un'azienda come Khan Academy\nha in termini di condivisione? Quindi state molto attenti mentre\nguardate i prodotti nello spazio in questo momento, cosa stanno facendo in\ntermini di condivisione dei dati, privacy dei dati, governance dei dati perché penso che sia davvero un\nprocesso decisionale chiave, una scelta per tutti voi. - [Narratore] Grazie a\ntutti per esservi uniti a noi oggi, per aver guardato questo video e per aver fatto parte della\ncomunità di studenti e insegnanti della Khan Academy. Se desideri saperne\ndi più su come Khanmigo sta potenziando l'apprendimento\nnelle classi in questo momento, fai clic sui collegamenti sullo\nschermo e per rimanere in contatto e non perdere mai un annuncio sull'istruzione gratuita di livello mondiale per chiunque, ovunque, assicurati di  sottoscrivi."
}