{
    "source": "bLAX3FsC9p4",
    "youtubelink": "https://www.youtube.com/watch?v=bLAX3FsC9p4",
    "t_english": "- Hi, I'm Michelle, a professional learning specialist here at Khan Academy and a former classroom teacher, just like you. I'd like to introduce you to Khanmigo, your AI-driven companion who's revolutionizing teaching for more engaging and efficient experience. Khanmigo has many exciting features that support teachers, and this video will showcase ways that you can use Khanmigo to create course-specific content to enhance the learning experience for all of the students in the classes that you're teaching. Throughout this video, we'll explore ways Khanmigo can assist substitute teachers with creating unique and engaging lesson plans and student-centered activities that get students excited about learning while saving you time. Ready to see the teaching assistant you've always wanted? Let's take a look. This is Khanmigo's dashboard. You can access it anytime you're logged in to your Khan Academy account. Khanmigo is extremely engaging and very knowledgeable. It's like having an experienced master teacher right in your pocket, who has a strong understanding of pedagogical principles, and while conversations with Khanmigo can be whimsical and inspiring, its main goal is to help create the best possible learning experience for students, so it's a perfect resource for substitute teachers, so that the learning never stops when the teacher is away. Let's begin our exploration with the learning objective feature. It's crucial for a substitute teacher to have a learning objective before teaching, because it shapes the lesson's path and makes students' expectations clear. Now, let's put it into action. Once I select the feature, I just have to let Khanmigo know the grade level. This is for fifth grade class, and the topic is multiplying unit fractions and whole numbers. Once I select the buttons, Khanmigo creates a student-facing-learning objective. Now that we have our learning objective, let's move on to the lesson hook, because let's face it, it's not just about teaching. It's about creating memorable, engaging experiences that enhance student understanding and retention. Empowered by Khanmigo, a substitute will be able to design captivating lesson introductions that ignite student curiosity and spark a thirst for knowledge. Once the lesson hook feature is selected, I just have to let Khanmigo know the grade level and the topic, multiplying unit fractions and whole numbers. Then, Khanmigo will do the rest, and in a flash, Khanmigo creates three lesson hooks on multiplying unit fractions and whole numbers that will be sure to get the students excited about this math lesson. Ignited by my students' curiosity, I'm excited and ready to create an amazing lesson plan. Khanmigo's lesson plan tool is my partner in crafting a plan that aligns with my curriculum and the needs of my students. If the topic isn't included, Khanmigo gives me the option to add my own. I'm going to go with this lesson on multiplying fractions. Promptly, Khanmigo generates a thorough lesson plan that aligns with my curriculum and student needs. The plan includes objectives, warmup activities, direct instruction, independent practice, assessments, and so much more, ensuring a well-rounded learning experience for the students. Plus, the lesson plan is fully customizable. I can easily alter any section to better suit the needs of the students, whether it's the objective, activities, assessments, or this exit ticket, all I have to do is select it, Khanmigo appears and gives me the option to make changes, try something different, or I can always discuss it with Khanmigo. I'm not really sure of the type of exit ticket that I want, but I know I don't want this one, so I'm just going to ask Khanmigo to try something different, and in a flash, Khanmigo creates a different exit ticket question that I can use with my students, and I like this one much better. Now that I'm completely satisfied with this lesson, I'm able to print the lesson, or I can always export it to a Word document, a PDF, or save it to my Google Drive. Thanks so much, Khanmigo. With the multiple choice assessment feature from Khanmigo, substitute teachers can effortlessly navigate the world of instruction. This tool allows for interactive evaluation, providing a clear picture of student understanding. It also can help identify learning gaps, so instruction can be adjusted accordingly. Once the feature is selected, Khanmigo wants to know the grade level, how many questions, let's go with five, and the topic. This time, it's for a cooking class, and the topic is components of food safety. Please generate a quiz from me, Khanmigo. And in a matter of seconds, Khanmigo creates a detailed, comprehensive, five-question quiz that includes the answer key, which is something I absolutely will need. So, it's not just a quiz. It's a valuable resource for effective teaching, even when you're stepping in for someone else. Another fantastic Khanmigo tool for substitute teachers is the Refresh My Knowledge feature, which enables you to quickly understand the topic that you're about to teach. It assists with preparing the lesson, answering student questions accurately, and ensuring continuity in the learning process. First, Khanmigo wants to know what topic and what grade level I'd like a refresher on. The topic is conjunctions, and it's for an eighth grade language arts class. Once I provide that information, Khanmigo gives me the option of quizzing me on the topic or learning through conversation. Who doesn't love a great conversation? When I select learning through conversation, Khanmigo gives me five major concepts at this grade level to select from, which helps me review and prepare. As a substitute steps into the role of teacher, the Make It Relevant feature assists with transforming abstract lessons into tangible, real-world scenarios. Once the tool is selected, you just have to let Khanmigo know the learning objective, understanding isotopes, and the class profile. This is for an 11th grade chemistry class. Wow, these are fantastic. With Make It Relevant, substitute teachers aren't just filling in, they're making a difference by igniting curiosity, fostering understanding, and inspiring lifelong learners. The Rubric Generator is another invaluable tool for substitute teachers. It empowers them to establish precise objective grading criteria. This not only ensures fairness, but also guarantees consistent evaluations, maintaining educational integrity even in the absence of the regular teacher. Once the tool is selected, Khanmigo wants to know what you're working on, building a budget. This is for a financial literacy course, and then Khanmigo will work hand in hand, asking you questions to help build the perfect rubric for your students. Khanmigo will then ask me a series of questions throughout this process, so that we're truly collaborating to co-create the perfect rubric that I want. Once I've answered all of Khanmigo's questions, the magic begins. Khanmigo creates a rubric that is detailed and specific so that the students will know exactly what they're being graded on. Once I've answered all of Khanmigo's questions, the magic begins. Khanmigo creates a rubric that's detailed and specific so that the students will know exactly what they're being graded on, and just like everything else, the rubric will always be customizable, so I can change it to what I want. Wow, that's incredible. Thank you so much, Khanmigo. This is awesome. And as always, Khanmigo does what I want, because I'm in charge. This has saved me so much time. Thank you so much, Khanmigo. As you can see, integrating Khanmigo into your classroom routine empowers you to tailor Khanmigo's ideas and suggestions to your curriculum while factoring in student needs, learning objectives, and creative resources. Khanmigo's insights will not only enrich the learning experience for all of your students, but it will also free up your time, enabling you to concentrate on what truly matters: your students. Thanks, Khanmigo. Thank you for watching this video and for being part of our teaching and learning community. To learn more about Khanmigo can support you and your students in the classroom, follow the links on your screen, and to never miss exciting announcements about new, free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، \nیہاں خان اکیڈمی میں ایک پروفیشنل لرننگ اسپیشلسٹ اور ایک سابقہ ​​کلاس روم\nٹیچر، بالکل آپ کی طرح۔ میں آپ کو خانمیگو سے ملوانا چاہتا ہوں، جو آپ کے AI سے چلنے والے ساتھی ہیں\nجو زیادہ دل چسپ اور موثر تجربے کے لیے تدریس میں انقلاب برپا کر رہے ہیں۔\n Khanmigo میں بہت ساری دلچسپ\nخصوصیات ہیں جو اساتذہ کو سپورٹ کرتی ہیں، اور یہ ویڈیو ان\nطریقوں کو ظاہر کرے گی جن سے آپ Khanmigo کو کورس کے لیے مخصوص مواد بنانے کے لیے استعمال کر سکتے ہیں تاکہ آپ جن کلاسز میں پڑھا رہے ہیں ان\nتمام طلباء کے لیے سیکھنے کے تجربے کو بڑھا سکیں۔ اس پورے ویڈیو کے دوران، ہم ان طریقوں کی کھوج کریں گے جن سے Khanmigo متبادل اساتذہ کی مدد کر سکتا ہے انوکھے اور\nپرکشش اسباق کے منصوبے بنانے اور طلباء پر مبنی سرگرمیاں جو آپ کے وقت کی بچت کرتے ہوئے طلباء کو سیکھنے کے لیے پرجوش کرتی ہیں۔ اس ٹیچنگ اسسٹنٹ کو دیکھنے کے لیے تیار ہیں جسے\nآپ ہمیشہ چاہتے ہیں؟ آئیے ایک نظر ڈالتے ہیں۔ یہ Khanmigo کا ڈیش بورڈ ہے۔ آپ اپنے خان اکیڈمی اکاؤنٹ میں لاگ ان ہونے پر کسی بھی وقت اس تک رسائی حاصل کر سکتے ہیں۔ خانمیگو انتہائی پرکشش\nاور بہت علم والا ہے۔ یہ ایسا ہی ہے جیسے آپ کی جیب میں ایک\nتجربہ کار ماسٹر ٹیچر ہے ، جو تدریسی اصولوں کی مضبوط سمجھ رکھتا ہے،\n اور خانمیگو کے ساتھ گفتگو سنسنی خیز اور متاثر کن ہو سکتی ہے، اس کا بنیادی مقصد \nطلباء کے لیے سیکھنے کا بہترین ممکنہ تجربہ پیدا کرنے میں مدد کرنا ہے، لہذا یہ\nمتبادل اساتذہ کے لیے بہترین وسیلہ، تاکہ استاد کے دور ہونے پر سیکھنا کبھی نہیں\nرکتا۔ آئیے سیکھنے کے مقصد کی خصوصیت کے ساتھ اپنی تلاش شروع کریں۔ ایک\nمتبادل استاد کے لیے پڑھانے سے پہلے سیکھنے کا مقصد حاصل کرنا بہت ضروری ہے، کیونکہ یہ سبق کے راستے کو تشکیل دیتا ہے اور طلباء کی توقعات کو واضح کرتا ہے۔ اب، آئیے اسے عملی جامہ پہناتے ہیں۔ ایک بار جب میں فیچر کو منتخب کر لیتا ہوں، مجھے صرف Khanmigo کو\nگریڈ لیول بتانا ہوگا۔ یہ پانچویں جماعت کی کلاس کے لیے ہے،\nاور موضوع یونٹ کے کسر\nاور پورے نمبر کو ضرب دینا ہے۔ ایک بار جب میں بٹنوں کو منتخب کر لیتا ہوں، خانمیگو ایک\nطالب علم کا سامنا کرنے والا سیکھنے کا مقصد بناتا ہے۔ اب جب کہ ہمارا سیکھنے کا مقصد ہے، آئیے سبق کی طرف بڑھتے ہیں،\nکیونکہ آئیے اس کا سامنا کرتے ہیں، یہ صرف پڑھانے کے بارے میں نہیں ہے۔ یہ یادگار، دلکش تجربات تخلیق کرنے کے بارے میں ہے\n جو طالب علم کی\nسمجھ اور برقراری کو بڑھاتے ہیں۔ Khanmigo کی طرف سے بااختیار، ایک\nمتبادل سبق آموز تعارف تیار کرنے کے قابل ہو گا جو طلباء کے تجسس کو بھڑکاتے ہیں اور علم کی پیاس کو جنم دیتے ہیں۔ ایک بار سبق کے ہک کی خصوصیت منتخب ہونے کے بعد، مجھے صرف خانمیگو کو\nگریڈ لیول اور موضوع سے آگاہ کرنا ہے، یونٹ کے\nکسر اور پورے نمبر کو ضرب دینا ہے۔ اس کے بعد، Khanmigo باقی کام کرے گا،\nاور ایک جھٹکے میں، Khanmigo نے اکائیوں کے\nحصوں اور پورے نمبروں کو ضرب دینے پر تین اسباق کے ہکس بنائے ہیں جو یقینی طور پر\nطلباء کو ریاضی کے اس سبق کے بارے میں پرجوش کریں گے۔ اپنے طلباء کے تجسس سے بھڑکتے ہوئے، میں پرجوش ہوں اور\nایک حیرت انگیز سبق کا منصوبہ بنانے کے لیے تیار ہوں۔ خانمیگو کا سبق پلان ٹول ایک ایسا\nمنصوبہ تیار کرنے میں میرا ساتھی ہے جو میرے نصاب\nاور میرے طلباء کی ضروریات کے مطابق ہو۔ اگر موضوع شامل نہیں ہے، تو\nخانمیگو مجھے اپنا مضمون شامل کرنے کا اختیار دیتا ہے۔ میں اس\nسبق کے ساتھ ضربوں کو ضرب دینے جا رہا ہوں۔ فوری طور پر، Khanmigo\nایک مکمل سبق کا منصوبہ تیار کرتا ہے جو میرے\nنصاب اور طالب علم کی ضروریات کے مطابق ہوتا ہے۔  اس منصوبے میں مقاصد،\nوارم اپ سرگرمیاں، براہ راست ہدایات، آزادانہ مشق، تشخیصات، اور بہت کچھ شامل ہے، جس سے \n طلباء کے لیے سیکھنے کے اچھے تجربے کو یقینی بنایا جا سکتا ہے۔  اس کے علاوہ، سبق کا منصوبہ\nمکمل طور پر حسب ضرورت ہے۔ میں طالب علموں کی ضروریات کے مطابق کسی بھی حصے کو آسانی سے تبدیل کر سکتا ہوں، چاہے وہ مقصد ہو،\nسرگرمیاں، تشخیصات، یا یہ ایگزٹ ٹکٹ،\nمجھے بس اسے منتخب کرنا ہے، خانمیگو ظاہر ہوتا ہے اور مجھے\nتبدیلیاں کرنے، کوشش کرنے کا اختیار دیتا ہے۔  کچھ مختلف، یا میں ہمیشہ خانمیگو کے ساتھ اس پر بات کر سکتا ہوں۔ مجھے واقعی ایگزٹ ٹکٹ کی قسم کے بارے میں یقین نہیں ہے\nجو میں چاہتا ہوں، لیکن میں جانتا ہوں کہ مجھے یہ نہیں چاہیے، اس لیے میں خانمیگو سے کچھ مختلف آزمانے کے لیے کہوں گا، اور ایک جھٹکے میں، خانمیگو ایک مختلف تخلیق کرتا ہے۔  ایگزٹ ٹکٹ کا سوال جو میں اپنے طلباء کے ساتھ استعمال کر سکتا ہوں، اور مجھے یہ زیادہ اچھا لگتا ہے۔ اب جبکہ میں\nاس سبق سے پوری طرح مطمئن ہوں، میں اس سبق کو پرنٹ کرنے کے قابل ہوں، یا میں اسے ہمیشہ\nورڈ دستاویز، پی ڈی ایف میں ایکسپورٹ کر سکتا ہوں، یا اسے اپنی گوگل ڈرائیو میں محفوظ کر سکتا ہوں۔ بہت شکریہ، خانمیگو۔ \nKhanmigo کی طرف سے متعدد انتخابی تشخیص کی خصوصیت کے ساتھ، متبادل اساتذہ\nآسانی کے ساتھ تدریس کی دنیا میں تشریف لے جا سکتے ہیں۔ یہ ٹول انٹرایکٹو تشخیص کی اجازت دیتا ہے،\n \nطالب علم کی سمجھ کی واضح تصویر فراہم کرتا ہے۔ اس سے سیکھنے کے فرق کی نشاندہی کرنے میں بھی مدد مل سکتی ہے، لہذا اس کے\nمطابق ہدایات کو ایڈجسٹ کیا جا سکتا ہے۔ فیچر منتخب ہونے کے بعد، Khanmigo گریڈ لیول، کتنے سوالات، آئیے پانچ کے ساتھ، اور موضوع جاننا چاہتا ہے۔ اس بار، یہ کھانا پکانے کی کلاس کے لیے ہے، اور موضوع ہے\nکھانے کی حفاظت کے اجزاء۔ خانمیگو، براہ کرم مجھ سے کوئز تیار کریں۔ اور چند سیکنڈوں میں،\nKhanmigo ایک تفصیلی، جامع، پانچ سوالوں پر مشتمل کوئز بناتا ہے جس میں جواب کی کلید شامل ہوتی ہے، جس کی مجھے بالکل ضرورت ہوگی۔ تو، یہ صرف ایک کوئز نہیں ہے۔ یہ\nموثر تدریس کے لیے ایک قیمتی وسیلہ ہے، یہاں تک کہ جب آپ\nکسی اور کے لیے قدم بڑھا رہے ہوں۔ \nمتبادل اساتذہ کے لیے ایک اور لاجواب خانمیگو ٹول ریفریش مائی نالج فیچر ہے، جو آپ کو\nاس موضوع کو تیزی سے سمجھنے کے قابل بناتا ہے جسے آپ پڑھانے جارہے ہیں۔ یہ سبق کی تیاری، طالب علم کے سوالات کے درست جواب دینے اور سیکھنے کے عمل میں تسلسل کو یقینی بنانے میں مدد کرتا ہے۔\n سب سے پہلے، خانمیگو جاننا چاہتا ہے کہ میں کس موضوع پر اور کس گریڈ کی سطح\nپر ریفریشر چاہتا ہوں۔ موضوع conjunctions ہے، اور یہ آٹھویں\nجماعت کی لینگویج آرٹس کلاس کے لیے ہے۔ ایک بار جب میں وہ معلومات فراہم کرتا ہوں، خانمیگو\nمجھے موضوع پر سوال کرنے یا گفتگو کے ذریعے سیکھنے کا اختیار دیتا ہے۔ کون ایک عظیم گفتگو سے محبت نہیں کرتا؟ جب میں گفتگو کے ذریعے سیکھنے کا انتخاب کرتا ہوں،\n Khanmigo مجھے\nاس گریڈ کی سطح پر پانچ بڑے تصورات دیتا ہے جس میں سے\nمجھے جائزہ لینے اور تیاری میں مدد ملتی ہے۔  استاد کے کردار میں ایک متبادل قدم کے طور پر،\n Make It Relevant فیچر تجریدی اسباق کو ٹھوس، حقیقی دنیا کے منظرناموں میں تبدیل کرنے میں مدد کرتا ہے۔ ٹول کے منتخب ہونے کے بعد، آپ کو خانمیگو کو\nسیکھنے کا مقصد، آاسوٹوپس کو سمجھنا،\nاور کلاس پروفائل بتانا ہوگا۔ یہ 11ویں جماعت کی کیمسٹری کلاس کے لیے ہے۔ واہ، یہ لاجواب ہیں۔ Make It Relevant کے ساتھ، متبادل اساتذہ صرف بھرنا ہی نہیں کر رہے ہیں، بلکہ وہ\nتجسس کو بھڑکا کر، تفہیم کو فروغ دے کر، اور\nتاحیات سیکھنے والوں کو متاثر کر رہے ہیں۔ Rubric جنریٹر متبادل اساتذہ کے لیے\nایک اور انمول ٹول ہے۔ یہ انہیں بااختیار بناتا ہے کہ وہ معروضی درجہ بندی کا درست معیار قائم کریں۔ یہ نہ صرف انصاف پسندی کو یقینی بناتا ہے، بلکہ باقاعدہ استاد کی غیر موجودگی میں بھی\n تعلیمی سالمیت کو برقرار رکھنے، مستقل تشخیص کی ضمانت دیتا ہے۔ \n ٹول کے منتخب ہونے کے بعد، Khanmigo جاننا چاہتا ہے کہ\nآپ کس چیز پر کام کر رہے ہیں، بجٹ بنا رہے ہیں۔ یہ مالیاتی خواندگی کے کورس کے لیے ہے، اور پھر Khanmigo ہاتھ سے کام کرے گا، آپ سے سوالات پوچھے گا تاکہ آپ کے طلباء کے لیے بہترین روبرک بنانے میں مدد ملے۔ خانمیگو اس کے بعد اس سارے عمل میں\nمجھ سے سوالات کا ایک سلسلہ پوچھے گا، \nتاکہ ہم صحیح معنوں میں کامل\nروبرک بنانے کے لیے تعاون کر رہے ہوں جو میں چاہتا ہوں۔  خانمیگو کے تمام سوالات کے جواب دینے کے بعد،\n جادو شروع ہو جاتا ہے۔ Khanmigo ایک روبرک بناتا ہے\nجو تفصیلی اور مخصوص ہوتا ہے تاکہ طلباء کو بخوبی معلوم ہو جائے کہ انہیں کس چیز پر درجہ دیا جا رہا ہے۔  خانمیگو کے تمام سوالات کے جواب دینے کے بعد،\n جادو شروع ہو جاتا ہے۔ Khanmigo ایک روبرک بناتا ہے جو تفصیلی اور مخصوص ہوتا ہے تاکہ\nطلباء کو بالکل پتہ چل جائے کہ انہیں کس چیز پر گریڈ کیا جا رہا ہے، اور ہر چیز کی طرح، روبرک ہمیشہ حسب ضرورت رہے گا، لہذا میں اسے اپنی مرضی کے مطابق تبدیل کر سکتا ہوں۔ واہ، یہ ناقابل یقین ہے۔ آپ کا بہت شکریہ، خانمیگو۔ یہ بہترین ھے۔ اور ہمیشہ کی طرح، خانمیگو وہی کرتا ہے جو میں چاہتا ہوں، کیونکہ میں انچارج ہوں۔ اس سے میرا بہت وقت بچ گیا ہے۔ آپ کا بہت شکریہ، خانمیگو۔ جیسا کہ آپ دیکھ سکتے ہیں، Khanmigo کو اپنے کلاس روم کے معمولات میں ضم کرنا آپ کو \nطالب علم کی ضروریات، سیکھنے کے مقاصد،\nاور تخلیقی وسائل کو مدنظر رکھتے ہوئے اپنے نصاب میں Khanmigo کے خیالات اور تجاویز کو تیار کرنے کا اختیار دیتا ہے۔ Khanmigo کی بصیرت نہ صرف \nآپ کے تمام طلباء کے لیے سیکھنے کے تجربے کو تقویت بخشے گی، بلکہ یہ\nآپ کا وقت بھی خالی کرے گی، جس سے آپ کو اس بات پر توجہ مرکوز کرنے کے قابل بنائے گا کہ واقعی\nاہم: آپ کے طلباء۔ شکریہ، خانمیگو۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  خانمیگو کے بارے میں مزید جاننے کے لیے کہ\n کلاس روم میں آپ اور آپ کے طلبہ کی مدد کر سکتے ہیں، اپنی اسکرین پر موجود لنکس کو فالو کریں، اور\n خان اکیڈمی پر نئے، مفت کورس مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں، سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola, soy Michelle, una especialista en aprendizaje profesional\naquí en Khan Academy y ex\nmaestra de aula, como tú. Me gustaría presentarles a Khanmigo, su compañero impulsado por IA\nque está revolucionando la enseñanza para ofrecer una experiencia más atractiva y\neficiente. Khanmigo tiene muchas\ncaracterísticas interesantes que apoyan a los profesores, y este video mostrará\nformas en que puede usar Khanmigo para crear contenido específico del curso para mejorar la\nexperiencia de aprendizaje de todos los estudiantes en las clases que está enseñando. A lo largo de este video, exploraremos formas en que Khanmigo puede ayudar a los maestros sustitutos a crear\nplanes de lecciones únicos y atractivos y actividades centradas en los estudiantes que los entusiasmen con el aprendizaje y, al mismo tiempo, les ahorren tiempo.  ¿ Listo para ver al\nasistente de enseñanza que siempre quisiste? Vamos a ver. Este es el panel de Khanmigo. Puedes acceder a él en cualquier momento que inicies sesión en tu cuenta de Khan Academy. Khanmigo es extremadamente atractivo\ny tiene mucho conocimiento. Es como tener un\nmaestro experimentado en su bolsillo, que tiene un sólido conocimiento\nde los principios pedagógicos, y si bien las conversaciones con Khanmigo pueden ser caprichosas e inspiradoras, su objetivo principal es ayudar a crear la mejor experiencia de aprendizaje posible\npara los estudiantes, por lo que es una  recurso perfecto\npara profesores sustitutos, para que el aprendizaje nunca se\ndetenga cuando el profesor no está. Comencemos nuestra exploración con la función del objetivo de aprendizaje. Es crucial que un\nmaestro sustituto tenga un objetivo de aprendizaje antes de enseñar, porque da forma al camino de la lección y deja claras las expectativas de los estudiantes. Ahora, pongámoslo en acción. Una vez que selecciono la función, solo tengo que informarle a Khanmigo\nel nivel de grado. Esto es para la clase de quinto grado\ny el tema es multiplicar fracciones unitarias\ny números enteros. Una vez que selecciono los botones, Khanmigo crea un\nobjetivo de aprendizaje orientado al estudiante. Ahora que tenemos nuestro objetivo de aprendizaje, pasemos al\ngancho de la lección, porque seamos realistas, no se trata sólo de enseñar.  Se trata de crear\nexperiencias memorables y atractivas que mejoren la\ncomprensión y la retención de los estudiantes.  Con el apoyo de Khanmigo, un\nsustituto podrá diseñar introducciones cautivadoras a las lecciones que enciendan la curiosidad de los estudiantes y despierten su sed de conocimiento. Una vez seleccionada la función de gancho de lección, solo tengo que informarle a Khanmigo\nel nivel de grado y el tema, multiplicando\nfracciones unitarias y números enteros. Luego, Khanmigo hará\nel resto y, en un instante, Khanmigo crea tres ganchos de lecciones sobre la multiplicación de\nfracciones unitarias y números enteros que seguramente\nentusiasmarán a los estudiantes con esta lección de matemáticas. Impulsado por la curiosidad de mis alumnos, estoy emocionado y listo para\ncrear un plan de lección increíble.  La herramienta de planificación de lecciones de Khanmigo es\nmi socio en la elaboración de un plan que se alinee con mi plan de estudios\ny las necesidades de mis alumnos. Si el tema no está incluido,\nKhanmigo me da la opción de agregar el mío. Voy a continuar con esta\nlección sobre multiplicar fracciones. Rápidamente, Khanmigo genera\nun plan de lección completo que se alinea con mi\nplan de estudios y las necesidades de los estudiantes. El plan incluye objetivos,\nactividades de preparación, instrucción directa, práctica independiente, evaluaciones y mucho más, lo que garantiza una\nexperiencia de aprendizaje integral para los estudiantes. Además, el plan de lecciones\nes totalmente personalizable. Puedo alterar fácilmente cualquier sección para adaptarla mejor a las necesidades de los estudiantes, ya sea el objetivo, las\nactividades, las evaluaciones o este boleto de salida, todo lo que\ntengo que hacer es seleccionarlo, aparece Khanmigo y me da\nla opción de hacer cambios, prueba.  algo diferente, o siempre puedo discutirlo con Khanmigo. No estoy muy seguro del tipo\nde billete de salida que quiero, pero sé que no quiero este, así que le voy a pedir a Khanmigo que pruebe algo diferente y, en un instante, Khanmigo crea un billete de salida diferente.  Pregunta de boleto de salida que puedo usar con mis alumnos, y esta me gusta mucho más. Ahora que estoy completamente\nsatisfecho con esta lección, puedo imprimirla o exportarla\na un documento de Word, PDF o guardarla en mi Google Drive. Muchas gracias Khanmigo. Con la\nfunción de evaluación de opción múltiple de Khanmigo, los maestros sustitutos pueden\nnavegar sin esfuerzo por el mundo de la instrucción. Esta herramienta permite la\nevaluación interactiva, proporcionando una imagen clara\nde la comprensión del estudiante. También puede ayudar a identificar brechas de aprendizaje, de modo que la instrucción pueda\najustarse en consecuencia. Una vez seleccionada la función, Khanmigo quiere saber el nivel de grado, cuántas preguntas (vamos con cinco) y el tema. Esta vez, es para una clase de cocina y el tema son\nlos componentes de la seguridad alimentaria. Por favor genere una prueba de mi parte, Khanmigo. Y en cuestión de segundos,\nKhanmigo crea un cuestionario detallado y completo de cinco preguntas que incluye la clave de respuestas, algo que definitivamente necesitaré. Entonces, no es sólo una prueba. Es un recurso valioso\npara una enseñanza eficaz, incluso cuando usted\nreemplaza a otra persona. Otra fantástica\nherramienta de Khanmigo para profesores sustitutos es la función Actualizar mis conocimientos, que le permite\ncomprender rápidamente el tema que está a punto de enseñar. Ayuda a preparar la lección, responder las preguntas de los estudiantes con precisión y garantizar la continuidad\nen el proceso de aprendizaje. Primero, Khanmigo quiere saber qué tema y en qué grado me\ngustaría un repaso. El tema son conjunciones y es para una\nclase de artes del lenguaje de octavo grado. Una vez que proporciono esa información, Khanmigo me da la opción\nde interrogarme sobre el tema o aprender a través de una conversación.  ¿A quién no le encanta una buena conversación? Cuando selecciono aprender\na través de la conversación, Khanmigo me da cinco\nconceptos principales en este nivel de grado para seleccionar, lo que\nme ayuda a revisar y prepararme. Como sustituto del\nrol de maestro, la función Make It Relevant ayuda a transformar lecciones abstractas en escenarios tangibles del mundo real. Una vez seleccionada la herramienta, solo debes informar a Khanmigo\nel objetivo de aprendizaje, la comprensión de los isótopos\ny el perfil de la clase. Esto es para una clase de química de 11º grado. Vaya, estos son fantásticos. Con Make It Relevant, los profesores sustitutos no sólo están reemplazando, sino que también están marcando la diferencia\nal despertar la curiosidad, fomentar la comprensión e\ninspirar a los estudiantes de por vida. El Generador de Rúbricas es\notra herramienta invaluable para los maestros sustitutos. Les permite establecer criterios de calificación objetivos precisos. Esto no sólo garantiza la equidad, sino que también garantiza\nevaluaciones consistentes, manteniendo la integridad educativa incluso en ausencia\ndel maestro regular. Una vez seleccionada la herramienta, Khanmigo quiere saber en\nqué está trabajando y elaborar un presupuesto. Esto es para un curso de educación financiera y luego Khanmigo trabajará mano a mano y le hará preguntas para ayudar a crear la rúbrica perfecta para sus estudiantes. Luego, Khanmigo\nme hará una serie de preguntas a lo largo de este proceso, de modo\nque realmente colaboremos para cocrear la\nrúbrica perfecta que quiero. Una vez que he respondido todas las\npreguntas de Khanmigo, comienza la magia. Khanmigo crea una rúbrica\ndetallada y específica para que los estudiantes sepan exactamente en qué se les califica. Una vez que he respondido todas las\npreguntas de Khanmigo, comienza la magia. Khanmigo crea una rúbrica detallada y específica para que los\nestudiantes sepan exactamente en qué se les califica y, como todo lo demás, la rúbrica siempre será personalizable, por lo que puedo cambiarla a lo que quiera. Vaya, eso es increíble. Muchas gracias Khanmigo. Esto es asombroso. Y como siempre, Khanmigo hace lo que yo quiero, porque yo estoy a cargo. Esto me ha ahorrado mucho tiempo. Muchas gracias Khanmigo. Como puede ver, integrar Khanmigo en su rutina de clase le permite adaptar las ideas y sugerencias de Khanmigo a su plan de estudios, teniendo en cuenta las\nnecesidades de los estudiantes, los objetivos de aprendizaje\ny los recursos creativos.  Los conocimientos de Khanmigo no solo enriquecerán la experiencia de aprendizaje\nde todos sus estudiantes, sino que también le liberarán\ntiempo, permitiéndole concentrarse en lo que realmente\nimporta: sus estudiantes. Gracias, Khanmigo. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus estudiantes en el aula, siga los enlaces en su pantalla y, para no perderse nunca\nanuncios interesantes sobre materiales de cursos nuevos y gratuitos en Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- مرحبًا، أنا ميشيل، متخصصة في التعلم المهني\nهنا في أكاديمية خان ومعلمة سابقة في الفصل الدراسي\n، مثلك تمامًا. أود أن أقدم لك Khanmigo، رفيقك المعتمد على الذكاء الاصطناعي\nوالذي أحدث ثورة في التدريس من أجل تجربة أكثر جاذبية\nوكفاءة. يحتوي Khanmigo على العديد من\nالميزات المثيرة التي تدعم المعلمين، وسيعرض هذا الفيديو\nالطرق التي يمكنك من خلالها استخدام Khanmigo لإنشاء محتوى خاص بالدورة التدريبية لتعزيز\nتجربة التعلم لجميع الطلاب في الفصول الدراسية التي تقوم بتدريسها. خلال هذا الفيديو، سنستكشف الطرق التي يمكن لـ Khanmigo من خلالها مساعدة المعلمين البدلاء في إنشاء\nخطط دروس فريدة وجذابة وأنشطة تتمحور حول الطلاب والتي تجعل الطلاب متحمسين للتعلم مع توفير الوقت.  هل أنت مستعد لرؤية\nمساعد التدريس الذي طالما أردته؟ لنلقي نظرة. هذه لوحة تحكم خانميغو. يمكنك الوصول إليه في أي وقت تقوم فيه بتسجيل الدخول إلى حساب Khan Academy الخاص بك. خانميغو جذاب للغاية\nوواسع المعرفة. إنه مثل وجود\nمعلم رئيسي ذو خبرة في جيبك، ولديه فهم قوي\nللمبادئ التربوية، وبينما يمكن أن تكون المحادثات مع خانميجو غريبة وملهمة، فإن هدفها الرئيسي هو المساعدة في خلق أفضل تجربة تعليمية ممكنة\nللطلاب، لذلك فهي  مورد مثالي\nللمعلمين البدلاء، بحيث لا يتوقف التعلم أبدًا\nعندما يكون المعلم بعيدًا. لنبدأ استكشافنا بميزة الهدف التعليمي.  من المهم جدًا أن يكون\nلدى المعلم البديل هدف تعليمي قبل التدريس، لأنه يشكل مسار الدرس ويجعل توقعات الطلاب واضحة. الآن، دعونا نضعها موضع التنفيذ. بمجرد تحديد الميزة، يجب علي فقط السماح لـ Khanmigo\nبمعرفة مستوى الصف. هذا للصف الخامس\n، وموضوعه ضرب كسور الوحدة\nوالأعداد الصحيحة. بمجرد تحديد الأزرار، يقوم خانميغو بإنشاء\nهدف تعليمي يواجه الطالب. الآن وبعد أن أصبح لدينا هدفنا التعليمي، فلننتقل إلى\nرابط الدرس، لأننا لنواجه الأمر، فالأمر لا يتعلق بالتدريس فقط. يتعلق الأمر بإنشاء تجارب لا تُنسى\nوجذابة تعمل على تعزيز\nفهم الطلاب واستبقائهم. وبدعم من خانميغو،\nسيتمكن البديل من تصميم مقدمات دروس آسرة تثير فضول الطلاب وتثير التعطش للمعرفة. بمجرد تحديد ميزة ربط الدرس، يجب علي فقط السماح لـ Khanmigo\nبمعرفة مستوى الصف والموضوع، وضرب\nكسور الوحدة والأعداد الصحيحة. بعد ذلك، سيقوم خانميغو\nبالباقي، وفي لمح البصر، يقوم خانميغو بإنشاء ثلاثة دروس خطافية حول ضرب\nكسور الوحدة والأعداد الصحيحة التي من المؤكد أنها\nستثير حماسة الطلاب بشأن درس الرياضيات هذا.  لقد أشعلني فضول طلابي، وأنا متحمس ومستعد\nلإنشاء خطة درس مذهلة.  إن أداة خطة الدروس الخاصة بـ Khanmigo هي\nشريكي في صياغة خطة تتوافق مع المنهج الدراسي الخاص بي\nواحتياجات طلابي. إذا لم يتم تضمين الموضوع، فإن\nخانميغو يمنحني خيار إضافة الموضوع الخاص بي. سأبدأ بهذا\nالدرس حول ضرب الكسور. على الفور، يقوم Khanmigo بإنشاء\nخطة درس شاملة تتوافق مع\nالمنهج الدراسي الخاص بي واحتياجات الطلاب. تتضمن الخطة أهدافًا\nوأنشطة إحماء وتعليمًا مباشرًا وممارسة مستقلة وتقييمات وغير ذلك الكثير، مما يضمن\nتجربة تعليمية شاملة للطلاب. بالإضافة إلى ذلك، فإن خطة الدرس قابلة\nللتخصيص بالكامل. يمكنني بسهولة تغيير أي قسم ليناسب احتياجات الطلاب بشكل أفضل، سواء كان الهدف أو\nالأنشطة أو التقييمات أو تذكرة الخروج هذه، كل ما\nعلي فعله هو تحديده، ويظهر خانميغو ويعطيني\nخيار إجراء التغييرات، والمحاولة  شيء مختلف، أو يمكنني دائمًا مناقشة الأمر مع خانميجو. لست متأكدًا حقًا من نوع\nتذكرة الخروج التي أريدها، لكنني أعلم أنني لا أريد هذه، لذلك سأطلب فقط من خانميجو تجربة شيء مختلف، وفي لمح البصر، يخلق خانميجو مختلفة  سؤال تذكرة الخروج الذي يمكنني استخدامه مع طلابي، وأنا أحب هذا السؤال أكثر بكثير. الآن بعد أن أصبحت\nراضيًا تمامًا عن هذا الدرس، أصبح بإمكاني طباعة الدرس، أو يمكنني دائمًا تصديره\nإلى مستند Word، أو PDF، أو حفظه على Google Drive. شكرا جزيلا، خانميجو. مع\nميزة تقييم الاختيارات المتعددة من Khanmigo، يمكن للمدرسين البديلين\nالتنقل بسهولة في عالم التدريس. تسمح هذه الأداة\nبالتقييم التفاعلي، مما يوفر صورة واضحة\nعن فهم الطلاب. كما يمكن أن يساعد في تحديد فجوات التعلم، بحيث يمكن\nتعديل التعليمات وفقًا لذلك. بمجرد تحديد الميزة، يريد خانميغو معرفة مستوى الصف، وعدد الأسئلة، فلنبدأ بخمسة، والموضوع. هذه المرة، لدروس الطبخ، والموضوع هو\nمكونات سلامة الغذاء. يرجى إنشاء اختبار مني، خانميغو. وفي غضون ثوانٍ، يقوم\nKhanmigo بإنشاء اختبار تفصيلي وشامل مكون من خمسة أسئلة يتضمن مفتاح الإجابة، وهو شيء سأحتاجه بالتأكيد. لذا، فهو ليس مجرد اختبار. إنه مورد قيم\nللتدريس الفعال، حتى عندما تتدخل نيابة\nعن شخص آخر.  هناك أداة أخرى رائعة من\nأدوات Khanmigo للمدرسين البدلاء وهي ميزة Refresh My Knowledge، والتي تمكنك من\nفهم الموضوع الذي أنت على وشك تدريسه بسرعة. يساعد في إعداد الدرس، والإجابة على أسئلة الطلاب بدقة، وضمان الاستمرارية\nفي عملية التعلم. أولاً، يريد خانميغو معرفة الموضوع والمستوى الدراسي الذي\nأرغب في تجديد المعلومات عنه. الموضوع هو أدوات العطف، وهو مخصص\nلفصل فنون اللغة للصف الثامن. بمجرد تقديم هذه المعلومات، يمنحني Khanmigo خيار\nاستجوابي حول الموضوع أو التعلم من خلال المحادثة. من لا يحب المحادثة الرائعة؟ عندما أختار التعلم\nمن خلال المحادثة، يمنحني خانميغو خمسة\nمفاهيم رئيسية في هذا المستوى الدراسي للاختيار من بينها، مما يساعدني في\nالمراجعة والتحضير. كخطوات بديلة\nفي دور المعلم، تساعد ميزة Make It Relevant في تحويل الدروس المجردة إلى سيناريوهات ملموسة في العالم الحقيقي. بمجرد تحديد الأداة، عليك فقط السماح لـ Khanmigo\nبمعرفة هدف التعلم وفهم النظائر\nوملف تعريف الفصل. هذا بالنسبة لصف الكيمياء للصف الحادي عشر. واو، هذه رائعة. مع برنامج Make It Relevant، لا يقوم المعلمون البديلون بملء الفراغ فحسب، بل يصنعون فرقًا\nمن خلال إثارة الفضول وتعزيز الفهم\nوإلهام المتعلمين مدى الحياة. يعد Rubric Generator\nأداة أخرى لا تقدر بثمن للمعلمين البدلاء. إنها تمكنهم من وضع معايير تصنيف موضوعية دقيقة. وهذا لا يضمن العدالة فحسب، بل يضمن أيضًا إجراء\nتقييمات متسقة، والحفاظ على النزاهة التعليمية حتى في غياب\nالمعلم العادي. بمجرد تحديد الأداة، يريد Khanmigo معرفة\nما تعمل عليه، وبناء الميزانية. هذا من أجل دورة محو الأمية المالية، وبعد ذلك سيعمل خانميغو جنبًا إلى جنب، ويطرح عليك أسئلة للمساعدة في بناء نموذج التقييم المثالي لطلابك. سيطرح عليّ خانميغو بعد ذلك\nسلسلة من الأسئلة خلال هذه العملية،\nبحيث نتعاون حقًا للمشاركة في إنشاء\nنموذج التقييم المثالي الذي أريده. بمجرد أن أجيب على جميع\nأسئلة خانميغو، يبدأ السحر.  يقوم Khanmigo بإنشاء نموذج تقييم\nمفصل ومحدد حتى يعرف الطلاب بالضبط ما يتم تقييمهم عليه. بمجرد أن أجيب على جميع\nأسئلة خانميغو، يبدأ السحر.  يقوم Khanmigo بإنشاء نموذج تقييم مفصل ومحدد بحيث\nيعرف الطلاب بالضبط ما يتم تقديرهم عليه، وكما هو الحال مع أي شيء آخر، سيكون نموذج التقييم دائمًا قابلاً للتخصيص، حتى أتمكن من تغييره إلى ما أريد. واو، هذا لا يصدق. شكرا جزيلا لك، خانميجو. هذا رائع. وكما هو الحال دائمًا، خانميغو يفعل ما أريد، لأنني المسؤول.  لقد وفر لي هذا الكثير من الوقت. شكرا جزيلا لك، خانميجو. كما ترون، فإن دمج Khanmigo في روتين الفصل الدراسي الخاص بك يمكّنك من تصميم أفكار واقتراحات Khanmigo لتناسب منهجك الدراسي مع\nالأخذ في الاعتبار احتياجات الطلاب وأهداف التعلم\nوالموارد الإبداعية. لن تعمل رؤى خانميغو على إثراء تجربة التعلم\nلجميع طلابك فحسب، بل ستوفر أيضًا\nوقتك، مما يتيح لك التركيز على ما\nيهم حقًا: طلابك. شكرا خانميجو. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد عن\nKhanmigo يمكنه دعمك أنت وطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك، وحتى لا تفوت أبدًا\nالإعلانات المثيرة حول مواد الدورة التدريبية الجديدة والمجانية في Khan Academy، تأكد من الاشتراك.",
    "t_italian": "- Ciao, sono Michelle, una specialista dell'apprendimento professionale\nqui alla Khan Academy ed ex\ninsegnante di classe, proprio come te. Vorrei presentarti Khanmigo, il tuo compagno basato sull'intelligenza artificiale\nche sta rivoluzionando l'insegnamento per un'esperienza più coinvolgente ed\nefficiente. Khanmigo ha molte\nfunzionalità interessanti che supportano gli insegnanti e questo video mostrerà i\nmodi in cui puoi utilizzare Khanmigo per creare contenuti specifici del corso per migliorare l'\nesperienza di apprendimento per tutti gli studenti delle classi in cui insegni. In questo video esploreremo i modi in cui Khanmigo può assistere gli insegnanti supplenti nella creazione di\npiani di lezione unici e coinvolgenti e di attività incentrate sullo studente che stimolano gli studenti ad apprendere e fanno risparmiare tempo. Pronto a vedere l'\nassistente didattico che hai sempre desiderato? Diamo un'occhiata. Questa è la dashboard di Khanmigo. Puoi accedervi ogni volta che accedi al tuo account Khan Academy. Khanmigo è estremamente coinvolgente\ne molto ben informato. È come avere un\ninsegnante esperto a portata di mano, che ha una forte conoscenza\ndei principi pedagogici e, sebbene le conversazioni con Khanmigo possano essere stravaganti e stimolanti, il suo obiettivo principale è contribuire a creare la migliore esperienza di apprendimento possibile\nper gli studenti, quindi è un  risorsa perfetta\nper gli insegnanti supplenti, in modo che l'apprendimento non si\ninterrompa mai quando l'insegnante è assente. Iniziamo la nostra esplorazione con la funzionalità dell'obiettivo di apprendimento. Per un supplente è fondamentale\navere un obiettivo di apprendimento prima dell'insegnamento, perché modella il percorso della lezione e rende chiare le aspettative degli studenti. Ora mettiamolo in azione. Una volta selezionata la funzione, devo solo comunicare a Khanmigo\nil livello del voto. Questo è per la classe quinta\ne l'argomento è la moltiplicazione di frazioni unitarie\ne numeri interi. Una volta selezionati i pulsanti, Khanmigo crea un\nobiettivo di apprendimento rivolto agli studenti. Ora che abbiamo il nostro obiettivo di apprendimento, passiamo alla lezione\n, perché diciamocelo, non si tratta solo di insegnare.  Si tratta di creare\nesperienze memorabili e coinvolgenti che migliorino la\ncomprensione e la fidelizzazione degli studenti. Grazie al potere di Khanmigo, un\nsostituto sarà in grado di progettare accattivanti introduzioni alle lezioni che accendono la curiosità degli studenti e suscitano la sete di conoscenza. Una volta selezionata la funzione di hook della lezione, devo solo comunicare a Khanmigo\nil livello del voto e l'argomento, moltiplicando le\nfrazioni unitarie e i numeri interi. Quindi, Khanmigo farà\nil resto e, in un lampo, Khanmigo crea tre lezioni sulla moltiplicazione di\nfrazioni unitarie e numeri interi che sicuramente\nentusiasmeranno gli studenti per questa lezione di matematica. Acceso dalla curiosità dei miei studenti, sono entusiasta e pronto a\ncreare un fantastico programma di lezioni.  Lo strumento per la pianificazione delle lezioni di Khanmigo è\nil mio partner nella creazione di un piano in linea con il mio curriculum\ne le esigenze dei miei studenti. Se l'argomento non è incluso,\nKhanmigo mi dà la possibilità di aggiungerne uno mio. Continuerò questa\nlezione sulla moltiplicazione delle frazioni. Khanmigo genera tempestivamente\nun piano di lezioni completo che si allinea al mio\ncurriculum e alle esigenze degli studenti. Il piano include obiettivi,\nattività di riscaldamento, istruzioni dirette, pratica indipendente, valutazioni e molto altro ancora, garantendo un'esperienza di apprendimento a tutto tondo\n per gli studenti. Inoltre, il programma delle lezioni\nè completamente personalizzabile. Posso facilmente modificare qualsiasi sezione per adattarla meglio alle esigenze degli studenti, che si tratti dell'obiettivo,\ndelle attività, delle valutazioni o di questo biglietto d'uscita, tutto quello che\ndevo fare è selezionarlo, appare Khanmigo e mi dà\nla possibilità di apportare modifiche, provare  qualcosa di diverso, oppure posso sempre discuterne con Khanmigo. Non sono proprio sicuro del tipo\ndi biglietto d'uscita che voglio, ma so che non voglio questo, quindi chiederò semplicemente a Khanmigo di provare qualcosa di diverso e, in un lampo, Khanmigo creerà un diverso  domanda sul biglietto d'uscita che posso usare con i miei studenti e questa mi piace molto di più. Ora che sono completamente\nsoddisfatto di questa lezione, posso stamparla oppure posso sempre esportarla\nin un documento Word, PDF o salvarla sul mio Google Drive. Grazie mille, Khanmigo. Con la\nfunzionalità di valutazione a scelta multipla di Khanmigo, gli insegnanti supplenti possono\nnavigare senza sforzo nel mondo dell'istruzione. Questo strumento consente una\nvalutazione interattiva, fornendo un quadro chiaro\ndella comprensione degli studenti. Può anche aiutare a identificare le lacune di apprendimento, quindi l’istruzione può essere\nadattata di conseguenza. Una volta selezionata la funzione, Khanmigo vuole sapere il livello del voto, quante domande, andiamo con cinque, e l'argomento. Questa volta si tratta di un corso di cucina e l'argomento riguarda i\ncomponenti della sicurezza alimentare. Per favore genera un quiz da parte mia, Khanmigo. E in pochi secondi,\nKhanmigo crea un quiz dettagliato e completo di cinque domande che include la chiave di risposta, che è qualcosa di cui avrò assolutamente bisogno. Quindi non è solo un quiz. È una risorsa preziosa\nper un insegnamento efficace, anche quando stai\nsostituendo qualcun altro. Un altro fantastico\nstrumento Khanmigo per gli insegnanti supplenti è la funzione Aggiorna le mie conoscenze, che ti consente di\ncomprendere rapidamente l'argomento che stai per insegnare. Aiuta a preparare la lezione, a rispondere accuratamente alle domande degli studenti e a garantire la continuità\nnel processo di apprendimento. Per prima cosa, Khanmigo vuole sapere su quale argomento e su quale livello scolastico\nvorrei un ripasso. L'argomento sono le congiunzioni, ed è per un\ncorso di arti linguistiche di terza media. Una volta fornite tali informazioni, Khanmigo mi dà la possibilità\ndi interrogarmi sull'argomento o di imparare attraverso la conversazione. Chi non ama una bella conversazione? Quando scelgo l'apprendimento\nattraverso la conversazione, Khanmigo mi fornisce cinque\nconcetti principali a questo livello scolastico tra cui scegliere, il che\nmi aiuta a ripassare e prepararmi. Quando un sostituto entra\nnel ruolo di insegnante, la funzione Make It Relevant aiuta a trasformare le lezioni astratte in scenari tangibili e reali. Una volta selezionato lo strumento, devi solo comunicare a Khanmigo\nl'obiettivo di apprendimento, la comprensione degli isotopi\ne il profilo della classe. Questo è per un corso di chimica dell'11° grado. Wow, sono fantastici. Con Make It Relevant, gli insegnanti supplenti non si limitano a sostituire, ma fanno la differenza\naccendendo la curiosità, favorendo la comprensione e\nispirando gli studenti che imparano per tutta la vita. Il Rubric Generator è\nun altro strumento prezioso per gli insegnanti supplenti. Permette loro di stabilire precisi criteri oggettivi di classificazione. Ciò non solo garantisce l’equità, ma garantisce anche\nvalutazioni coerenti, mantenendo l’integrità didattica anche in assenza\ndell’insegnante titolare. Una volta selezionato lo strumento, Khanmigo vuole sapere su\ncosa stai lavorando, costruendo un budget. Questo è per un corso di alfabetizzazione finanziaria, e poi Khanmigo lavorerà fianco a fianco, ponendoti domande per aiutarti a costruire la rubrica perfetta per i tuoi studenti. Khanmigo mi farà quindi\nuna serie di domande durante questo processo, in modo\nche collaboriamo davvero per co-creare la\nrubrica perfetta che desidero. Una volta che avrò risposto a tutte le\ndomande di Khanmigo, la magia avrà inizio. Khanmigo crea una rubrica\ndettagliata e specifica in modo che gli studenti sappiano esattamente su cosa verranno valutati. Una volta che avrò risposto a tutte le\ndomande di Khanmigo, la magia avrà inizio. Khanmigo crea una rubrica dettagliata e specifica in modo che gli\nstudenti sappiano esattamente su cosa verranno valutati e, proprio come tutto il resto, la rubrica sarà sempre personalizzabile, quindi posso cambiarla come voglio. Wow, è incredibile. Grazie mille, Khanmigo. Questo e spettacolare. E come sempre, Khanmigo fa quello che voglio, perché comando io. Questo mi ha fatto risparmiare così tanto tempo. Grazie mille, Khanmigo. Come puoi vedere, l'integrazione di Khanmigo nella routine della tua classe ti consente di adattare le idee e i suggerimenti di Khanmigo al tuo curriculum tenendo conto delle\nesigenze degli studenti, degli obiettivi di apprendimento\ne delle risorse creative.  Gli approfondimenti di Khanmigo non solo arricchiranno l'esperienza di apprendimento\ndi tutti i tuoi studenti, ma ti libereranno anche\ntempo, permettendoti di concentrarti su ciò che\nconta veramente: i tuoi studenti. Grazie, Khanmigo. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo e, per non perdere mai\nannunci entusiasmanti sui nuovi materiali gratuiti dei corsi su Khan Academy, assicurati di iscriverti."
}