{
    "source": "dBrdd7xg-dg",
    "youtubelink": "https://www.youtube.com/watch?v=dBrdd7xg-dg",
    "t_english": "hello there can you see us yes I can see  you how can I assist you today so um I'm  here with my son and I'd love to see if  you could drive a conversation that  could help us get to know each other  better and so ask us questions and also  ask us follow-up questions to just  really keep the conversation going and  for us to dig a little bit deeper and  hopefully connect a little bit  absolutely let's start with something  light can each of you share a fun fact  about yourselves that the person might  not  know  okay  um well I used to not like broccoli that  much but  now it's I'm starting to like it more so  I don't think you knew that that  actually is news my wife will be very  happy to hear that we thought he hated  broccoli that's a great piece of news  now dad can you share something about  yourself that uh your son might find  surprising in or interesting oh boy um I  used to be the lead singer in a heavy  metal band I think you know that yeah  but it's very I was very surprised when  I found  out that's an exciting surprise now that  we've got the ball rolling let's delve a  little deeper if you could spend a day  doing anything you wanted together what  would that day look  like  h i love to eat ice cream so maybe we  put that in somewhere we go get ice  cream and then I know you like to go  swimming I'm not like a huge swimmer but  I enjoy swimming sometimes so I think we  would go swimming and then I'd like to  play video games so maybe you would play  video games with  me that sounds like an amazing day  swimming ice cream and video games are a  fun combination what kind of video games  do you like to play together or would  you like to try playing  together um I play Mario Kart with him  sometimes I enjoy it I think I think he  enjoys it too so yeah probably that I  enjoyed it when I had a chance of  winning Mario Kart is a fantastic choice  it can be a lot of fun and  competitive what's one thing you both  appreciate about each other that you  might not say often but feel it's  important  okay um one thing I've noticed that you  do very differently than other people  and I like it is that even when I'm  trying new stuff um that might not  necessarily be perfectly in line with  what you want me to be spending my time  on you're still um you're still  relatively supportive and you like you  don't um you're open to a lot of  different things and you're you're open  to me trying out a lot of different  things so I appreciate that thank you  you you know for you I think um I you  know agre I think there's some teenagers  that feel like they're too cool for  school sometimes and that you know but  imran's not that you you definitely I've  seen you work really well with four year  olds all the way up to 30 year olds so I  I'm really impressed with that thank you  that's a wonderful compliment to your  son it's great to hear how much you  appreciate about each other keep these  conversations going and you'll Contin to  discover more about each other if you  want to explore other topics feel free  to  ask no this was fun thank  you you're very welcome I'm glad you  enjoyed it remember the key to deepening  your connection is through open and  honest communication feel free to reach  out anytime you want to have more  conversations like this we will this was  just an experiment but I think we should  do this every  day that sounds like a wonderful idea  regular check-ins can really strengthen  your bond have fun with your daily  conversations and keep exploring new  topics to learn more about each other if  you need more conversation starters or  anything else feel free to ask",
    "t_urdu": "ہیلو کیا آپ ہمیں دیکھ سکتے ہیں ہاں میں آپ کو دیکھ سکتا ہوں کہ میں آج آپ کی مدد کیسے کر سکتا ہوں تو ام میں یہاں اپنے بیٹے کے ساتھ ہوں اور میں یہ دیکھنا پسند کروں گا کہ کیا آپ کوئی ایسی گفتگو کر سکتے ہیں جس سے ہمیں ایک دوسرے کو بہتر طور پر جاننے میں مدد مل سکے۔ اس لیے ہم سے سوالات پوچھیں اور ہم سے فالو اپ سوالات بھی پوچھیں تاکہ بات چیت کو واقعی جاری رکھا جا سکے اور ہم تھوڑا سا گہرا کھودیں اور امید ہے کہ تھوڑا سا جڑیں، آئیے کچھ روشنی کے ساتھ شروع کریں کیا آپ میں سے ہر ایک اپنے بارے میں ایک دلچسپ حقیقت شیئر کر سکتا ہے۔ کہ وہ شخص شاید نہیں جانتا کہ ٹھیک ہے مجھے پہلے بروکولی اتنی پسند نہیں تھی لیکن اب میں اسے زیادہ پسند کرنے لگا ہوں لہذا مجھے نہیں لگتا کہ آپ کو معلوم ہے کہ یہ حقیقت میں ایک خبر ہے میری بیوی یہ سن کر بہت خوش ہوگی۔  ہم نے سوچا کہ اسے بروکولی سے نفرت ہے یہ ایک بہت اچھی خبر ہے اب والد صاحب کیا آپ اپنے بارے میں کچھ بتا سکتے ہیں جو آپ کے بیٹے کو حیران کن یا دلچسپ لگے اوہ بوائے ام میں ایک ہیوی میٹل بینڈ میں مرکزی گلوکار ہوا کرتا تھا مجھے لگتا ہے کہ آپ جانتے ہیں کہ ہاں لیکن یہ بہت حیران کن تھا جب مجھے پتہ چلا کہ یہ ایک دلچسپ حیرت ہے کہ اب ہمارے پاس گیند چل رہی ہے آئیے تھوڑا سا گہرائی سے جائزہ لیں اگر آپ ایک دن ایسا کچھ بھی کر سکتے ہیں جو آپ اکٹھے کرنا چاہتے ہو تو اس دن کیسا لگے گا جیسے میں کھانا پسند کرتا ہوں۔  آئس کریم تو ہو سکتا ہے کہ ہم اسے کہیں رکھ دیں ہم آئس کریم لینے جاتے ہیں اور پھر میں جانتا ہوں کہ آپ تیراکی کرنا پسند کرتے ہیں میں بہت بڑا تیراک نہیں ہوں لیکن مجھے کبھی کبھی تیراکی کا مزہ آتا ہے تو مجھے لگتا ہے کہ ہم تیراکی کریں گے اور پھر میں چاہوں گا ویڈیو گیمز کھیلیں تو شاید آپ میرے ساتھ ایسے ویڈیو گیمز کھیلیں جو ایک حیرت انگیز دن کی سوئمنگ آئس کریم کی طرح لگتا ہے اور ویڈیو گیمز ایک تفریحی امتزاج ہیں آپ کس قسم کے ویڈیو گیمز اکٹھے کھیلنا پسند کرتے ہیں یا کیا آپ ایک ساتھ کھیلنے کی کوشش کرنا چاہیں گے ماریو کارٹ کے ساتھ کبھی کبھی میں اس سے لطف اندوز ہوتا ہوں مجھے لگتا ہے کہ مجھے لگتا ہے کہ وہ بھی اس سے لطف اندوز ہوتا ہے لہذا ہاں شاید میں نے اس سے لطف اٹھایا جب مجھے ماریو کارٹ جیتنے کا موقع ملا یہ ایک بہترین انتخاب ہے یہ بہت مزہ اور مسابقتی ہو سکتا ہے جو ایک چیز ہے آپ دونوں ایک دوسرے کے بارے میں تعریف کریں جو آپ اکثر نہیں کہتے لیکن محسوس کرتے ہیں کہ یہ ضروری ہے ٹھیک ہے ام ایک چیز میں نے محسوس کی ہے کہ آپ دوسرے لوگوں سے بہت مختلف کرتے ہیں اور مجھے یہ پسند ہے کہ جب میں نئی ​​چیزوں کی کوشش کر رہا ہوں تو یہ ضروری نہیں ہے  بالکل اس کے مطابق جو آپ چاہتے ہیں کہ میں آپ پر اپنا وقت گزاروں اور آپ ابھی بھی نسبتاً معاون ہیں اور آپ کو پسند ہے کہ آپ بہت سی مختلف چیزوں کے لیے کھلے ہیں اور آپ ہیں بہت سی مختلف چیزیں آزمانے کے لیے میرے لیے کھلا تو میں اس کی تعریف کرتا ہوں کہ آپ کا شکریہ آپ کو آپ کے بارے میں معلوم ہے، مجھے لگتا ہے کہ میں آپ کو جانتا ہوں، مجھے لگتا ہے کہ کچھ نوجوان ایسے ہیں جو محسوس کرتے ہیں کہ وہ اسکول کے لیے بہت اچھے ہیں اور آپ جانتے ہیں کہ عمران کا  ایسا نہیں ہے کہ آپ یقینی طور پر میں نے آپ کو 30 سال کی عمر تک کے چار سال کے بچوں کے ساتھ بہت اچھا کام کرتے دیکھا ہے لہذا میں اس سے بہت متاثر ہوا ہوں آپ کا شکریہ یہ آپ کے بیٹے کے لئے ایک شاندار تعریف ہے یہ سن کر بہت اچھا لگا کہ آپ کتنے ایک دوسرے کی تعریف کرتے رہیں ان بات چیت کو جاری رکھیں اور آپ ایک دوسرے کے بارے میں مزید دریافت کرنا جاری رکھیں گے اگر آپ دوسرے موضوعات کو دریافت کرنا چاہتے ہیں تو بلا جھجھک پوچھیں کہ نہیں یہ مزہ آیا شکریہ آپ کا بہت خیرمقدم ہے مجھے خوشی ہے کہ آپ نے اس سے لطف اندوز ہوا آپ کے رابطے کو گہرا کرنے کی کلید کھلی اور ایماندارانہ بات چیت کے ذریعے ہے جب بھی آپ اس طرح کی مزید گفتگو کرنا چاہتے ہیں تو بلا جھجھک رابطہ کریں ہم کریں گے کہ یہ صرف ایک تجربہ تھا لیکن میرے خیال میں ہمیں یہ ہر روز کرنا چاہیے جو کہ ایک شاندار آئیڈیا کی طرح لگتا ہے۔ ins واقعی آپ کے بانڈ کو مضبوط بنا سکتے ہیں آپ کی روزمرہ کی گفتگو کے ساتھ تفریح ​​​​کریں اور ایک دوسرے کے بارے میں مزید جاننے کے لیے نئے عنوانات کی تلاش جاری رکھیں اگر آپ کو مزید گفتگو شروع کرنے والوں یا کسی اور چیز کی ضرورت ہو تو بلا جھجک پوچھیں۔",
    "t_spanish": "Hola, ¿puedes vernos? Sí, puedo verte. ¿ Cómo puedo ayudarte hoy? Estoy aquí con mi hijo y me encantaría ver si pudieras iniciar una conversación que pudiera ayudarnos a conocernos mejor.  Así que háganos preguntas y también haganos preguntas de seguimiento para mantener realmente la conversación y para que podamos profundizar un poco más y, con suerte, conectarnos un poco. Absolutamente, comencemos con algo ligero. ¿Puede cada uno de ustedes compartir un dato divertido sobre sí mismos?  que la persona tal vez no lo sepa, bueno, bueno, antes no me gustaba mucho el brócoli, pero ahora me está empezando a gustar más, así que no creo que supieras que eso en realidad es una noticia, mi esposa estará muy feliz de escuchar eso.  Pensábamos que odiaba el brócoli, esa es una gran noticia, papá, ¿puedes compartir algo sobre ti que a tu hijo le pueda parecer sorprendente o interesante? Oh, vaya, yo solía ser el cantante principal de una banda de heavy metal. Creo que lo sabes, sí. pero es muy Me sorprendió mucho cuando descubrí que es una sorpresa emocionante ahora que tenemos todo en marcha, profundicemos un poco más si pudieran pasar un día haciendo lo que quisieran juntos, ¿cómo sería ese día? Me encanta comer.  helado, así que tal vez lo pongamos en algún lugar, vayamos a comprar helado y luego sé que te gusta ir a nadar. No soy un gran nadador, pero a veces disfruto nadar, así que creo que iríamos a nadar y luego me gustaría jugar videojuegos así que tal vez jugarías videojuegos conmigo eso suena como un día increíble nadar helado y los videojuegos son una combinación divertida ¿qué tipo de videojuegos les gusta jugar juntos o les gustaría intentar jugar juntos um yo juego?  Mario Kart con él a veces lo disfruto Creo que creo que él también lo disfruta, así que sí, probablemente lo disfruté cuando tuve la oportunidad de ganar Mario Kart es una elección fantástica, puede ser muy divertido y competitivo, ¿qué es lo que los dos tienen? se aprecian el uno al otro, eso tal vez no lo digan a menudo, pero sienten que es importante, está bien, una cosa que he notado que lo hacen de manera muy diferente a otras personas y me gusta es que incluso cuando estoy probando cosas nuevas, eso no necesariamente es así.  perfectamente en línea con lo que quieres que pase mi tiempo todavía estás um todavía eres relativamente comprensivo y te gusta no lo haces estás abierto a muchas cosas diferentes y estás  abierto a mí para probar muchas cosas diferentes, así que aprecio que gracias, lo sabes por ti. Creo que, ya sabes, estoy de acuerdo. Creo que hay algunos adolescentes que a veces sienten que son demasiado geniales para la escuela y eso ya lo sabes, pero Imran.  No es que tú, definitivamente, te he visto trabajar muy bien con niños de cuatro años hasta los de 30, así que estoy realmente impresionado con ese agradecimiento. Es un maravilloso cumplido para tu hijo. Es fantástico escuchar lo mucho que se aprecian el uno al otro sigan con estas conversaciones y continuarán descubriendo más el uno del otro si quieren explorar otros temas no duden en preguntar no, esto fue divertido gracias de nada. Me alegra que lo hayan disfrutado recuerden el  La clave para profundizar su conexión es a través de una comunicación abierta y honesta. Siéntase libre de comunicarse cuando quiera para tener más conversaciones como esta. Esto fue solo un experimento, pero creo que deberíamos hacer esto todos los días. Suena como una idea maravillosa. Verifique periódicamente.  Los ins realmente pueden fortalecer su vínculo, diviértanse con sus conversaciones diarias y sigan explorando nuevos temas para aprender más unos de otros si necesitan más temas para iniciar una conversación o cualquier otra cosa, no duden en preguntar.",
    "t_arabic": "مرحبًا، هل يمكنك رؤيتنا نعم أستطيع رؤيتك كيف يمكنني مساعدتك اليوم، لذا أنا هنا مع ابني وأود أن أرى ما إذا كان بإمكانك إجراء محادثة يمكن أن تساعدنا في التعرف على بعضنا البعض بشكل أفضل و  لذا اطرحوا علينا أسئلة واطرحوا علينا أيضًا أسئلة متابعة لمواصلة المحادثة حقًا ولكي نتعمق قليلاً ونأمل أن نتواصل قليلاً، فلنبدأ بشيء خفيف، هل يمكن لكل واحد منكم مشاركة حقيقة ممتعة عن أنفسكم  أن الشخص قد لا يعرف جيدًا أنني كنت لا أحب البروكلي كثيرًا ولكن الآن بدأت أحبه أكثر، لذا لا أعتقد أنك تعلم أن هذا في الواقع خبر ستكون زوجتي سعيدة جدًا لسماع ذلك  كنا نظن أنه يكره البروكلي، وهذا خبر رائع الآن يا أبي، هل يمكنك مشاركة شيء عن نفسك قد يجده ابنك مفاجئًا أو مثيرًا للاهتمام. يا فتى، اعتدت أن أكون المغني الرئيسي في فرقة هيفي ميتال، أعتقد أنك تعرف ذلك نعم لكن الأمر كان مفاجئًا جدًا، لقد فوجئت جدًا عندما اكتشفت أنها مفاجأة مثيرة الآن بعد أن بدأنا الكرة، دعنا نتعمق قليلاً إذا كان بإمكانك قضاء يوم في فعل أي شيء تريده معًا، كيف سيبدو ذلك اليوم عندما أحب الأكل  الآيس كريم لذلك ربما نضع ذلك في مكان ما نذهب للحصول على الآيس كريم وبعد ذلك أعلم أنك تحب السباحة أنا لست سباحًا ماهرًا ولكني أستمتع بالسباحة أحيانًا لذلك أعتقد أننا سنذهب للسباحة وبعد ذلك أود ذلك لعب ألعاب الفيديو، لذا ربما تلعب معي ألعاب الفيديو التي تبدو وكأنها يوم رائع، آيس كريم السباحة وألعاب الفيديو مزيج ممتع. ما نوع ألعاب الفيديو التي تحب لعبها معًا أو هل ترغب في تجربة اللعب معًا أم أنا ألعبها؟  أحيانًا أستمتع به مع ماريو كارت، وأعتقد أنه يستمتع به أيضًا، لذا نعم ربما استمتعت به عندما أتيحت لي فرصة الفوز، ماريو كارت هو خيار رائع، يمكن أن يكون ممتعًا وتنافسيًا للغاية، وهو شيء واحد بينكما نقدر بعضنا البعض وهو ما قد لا تقوله كثيرًا ولكنك تشعر أنه من المهم، حسنًا، هناك شيء واحد لاحظت أنك تفعله بشكل مختلف تمامًا عن الأشخاص الآخرين، ويعجبني ذلك هو أنه حتى عندما أحاول أشياء جديدة قد لا تكون بالضرورة كذلك  يتماشى تمامًا مع ما تريد مني أن أقضي وقتي فيه، وما زلت داعمًا نسبيًا ولا تحب ذلك، وأنت منفتح على الكثير من الأشياء المختلفة وأنت كذلك  منفتح بالنسبة لي لتجربة الكثير من الأشياء المختلفة، لذا فأنا أقدر ذلك، شكرًا لك، فأنت تعرف ذلك، وأعتقد أن هناك بعض المراهقين الذين يشعرون أنهم رائعون جدًا بالنسبة للمدرسة أحيانًا، وهذا ما تعرفه ولكن عمران  لا يعني ذلك أنك بالتأكيد رأيتك تعمل بشكل جيد مع الأطفال الذين تتراوح أعمارهم بين أربع سنوات وحتى سن 30 عامًا، لذا فأنا معجب حقًا بهذا، شكرًا لك، هذه مجاملة رائعة لابنك، ومن الرائع أن أسمع مدى اهتمامك بها نقدر بعضكم البعض، استمروا في هذه المحادثات وستستمرون في اكتشاف المزيد عن بعضكم البعض إذا كنت ترغب في استكشاف مواضيع أخرى، فلا تتردد في طرح السؤال \" لا\"، لقد كان هذا ممتعًا، شكرًا لك، فنحن نرحب بك جدًا، أنا سعيد لأنك استمتعت بها، تذكر  المفتاح لتعميق اتصالك هو من خلال التواصل المفتوح والصادق، فلا تتردد في التواصل معنا في أي وقت تريد إجراء المزيد من المحادثات مثل هذه، فسنقوم بذلك، لقد كانت هذه مجرد تجربة ولكن أعتقد أننا يجب أن نفعل ذلك كل يوم، فهذه فكرة رائعة، تحقق بشكل منتظم-  يمكن أن تقوي الروابط بينكما حقًا، استمتعا بمحادثاتكما اليومية واستمرا في استكشاف موضوعات جديدة لمعرفة المزيد عن بعضكما البعض إذا كنت بحاجة إلى المزيد من المحادثات المبتدئة أو أي شيء آخر فلا تتردد في طرحه",
    "t_italian": "ciao, puoi vederci sì, posso vederti come posso aiutarti oggi quindi sono qui con mio figlio e mi piacerebbe vedere se potresti condurre una conversazione che possa aiutarci a conoscerci meglio e  quindi fateci domande e fateci anche domande di follow-up per continuare davvero la conversazione e per permetterci di scavare un po' più a fondo e, si spera, connetterci un po', assolutamente iniziamo con qualcosa di leggero, ognuno di voi può condividere un fatto divertente su di voi  che la persona potrebbe non saperlo okay um beh prima non mi piacevano molto i broccoli ma ora iniziano a piacermi di più quindi non credo che tu sapessi che in realtà è una novità mia moglie sarà molto felice di saperlo  pensavamo che odiasse i broccoli, questa è una bella notizia adesso, papà, puoi condividere qualcosa di te che tuo figlio potrebbe trovare sorprendente o interessante, oh ragazzo, ero il cantante di una band heavy metal, penso che tu lo sappia, sì ma è molto Sono rimasto molto sorpreso quando ho scoperto che è una sorpresa entusiasmante ora che abbiamo avviato le cose, approfondiamo un po' più a fondo se potessi trascorrere una giornata facendo tutto ciò che volevi insieme come sarebbe quella giornata ciao, adoro mangiare  gelato quindi forse lo mettiamo da qualche parte e andiamo a prendere il gelato e poi so che ti piace andare a nuotare Non sono un grande nuotatore ma a volte mi piace nuotare quindi penso che potremmo andare a nuotare e poi mi piacerebbe giocare ai videogiochi, quindi forse potresti giocare ai videogiochi con me, sembra una giornata fantastica nuotando, gelato e i videogiochi sono una combinazione divertente che tipo di videogiochi ti piace giocare insieme o ti piacerebbe provare a giocare insieme, ehm, io gioco  Mario Kart con lui a volte mi diverto, penso che penso che si diverta anche a lui, quindi sì, probabilmente mi sono divertito quando ho avuto la possibilità di vincere Mario Kart è una scelta fantastica, può essere molto divertente e competitivo, qual è una cosa per entrambi Apprezziamo l'uno dell'altro, cosa che magari non dite spesso, ma ritenete che sia importante okay, um una cosa che ho notato che fate in modo molto diverso dalle altre persone e mi piace è che anche quando provo cose nuove, um, potrebbe non essere necessariamente così  perfettamente in linea con ciò su cui vuoi che io spenda il mio tempo sei ancora um sei ancora relativamente di supporto e ti piace no um sei aperto a un sacco di cose diverse e sei  aperto a me che provo un sacco di cose diverse quindi apprezzo che grazie lo sai per te penso che um lo sai d'accordo penso che ci siano alcuni adolescenti che a volte si sentono troppo bravi per la scuola e tu lo sai ma imran  non che tu tu sicuramente ti ho visto lavorare molto bene con bambini dai 4 anni fino ai 30 anni quindi sono davvero impressionato da questo grazie è un complimento meraviglioso per tuo figlio è bello sapere quanto tu apprezzatevi l'uno dell'altro continuate queste conversazioni e continuerete a scoprire di più l'uno dell'altro se volete esplorare altri argomenti non esitate a chiedere no è stato divertente grazie siete i benvenuti sono felice che vi sia piaciuto ricordate il  la chiave per approfondire la tua connessione è attraverso una comunicazione aperta e onesta, sentiti libero di contattarci ogni volta che vuoi avere più conversazioni come questa, lo faremo, era solo un esperimento, ma penso che dovremmo farlo ogni giorno, sembra un'idea meravigliosa, controlla regolarmente-  gli in possono davvero rafforzare il vostro legame divertitevi con le vostre conversazioni quotidiane e continuate a esplorare nuovi argomenti per conoscervi meglio se avete bisogno di ulteriori spunti di conversazione o qualsiasi altra cosa non esitate a chiedere"
}