{
    "source": "DHG61XPuWyk",
    "youtubelink": "https://www.youtube.com/watch?v=DHG61XPuWyk",
    "t_english": "- [Instructor] Check out this beautiful photo from the Hubble Telescope. It's so many stars with so many different colors. Why do they have different colors? Well, it turns out that the ones that are reddish or orangish are actually relatively cooler stars. They are at lower temperatures. And the ones that are whitish, like white color over here, you can see, those turn out to be slightly hotter. And the ones that are bluish turn out to be the hottest over here. But my question is, how did we figure this out? I mean, how can we sit on earth and say that, \"Hey, the red stars must be cooler and the blue stars must be hotter.\" Well, that's because we studied the black body radiation. But what exactly is this and what has black body got anything to do with these stars? Well, let's find out. Let's start with what are black bodies and why should we care about them? For that, let's keep an apple outside on a sunny day in a broad daylight, so there's sunlight falling onto it. Remember that sunlight is white light, which make is made of all the colors of the rainbow. The question for us now is what happens to the light once it falls on the apple? Well, some of the light gets reflected, a lot of it is red color, and that's why we see apple to be red color. But what happens to the rest of the colors? Well, they get absorbed. And what we mean by getting absorbed is that remember that light is an electromagnetic wave, which contains electric fields and magnetic fields as well, but we haven't shown the oscillating magnetic fields. But these are the oscillating electric fields. But once they fall on the apple, the electric fields, they will make the electrons jiggle. And as a result, notice the energy from the electromagnetic wave is going into the jiggling energy of the electrons. And this is how the energy from the electromagnetic wave gets converted into the jiggling motion of the electrons or thermal energy of the electrons. And as a result, the temperature of the apple would increase. But wait a second, wait a second. If this was the case, then if you continuously shine light on the apple, its temperature should continuously increase. But that doesn't happen, right? Why doesn't that happen? Well, that's because as the electrons are jiggling, they're gonna produce their own electromagnetic waves. Remember, any accelerated charge will produce electromagnetic waves and therefore, the jiggling electrons will produce their own electromagnetic waves. And we call these electromagnetic waves thermal radiation because that radiation is coming from the thermal motion of the electrons, and because of the thermal radiation, it's losing energy. And so you can see what's going on. It's absorbing energy from the sunlight, but it's also losing energy at the same rate from the thermal radiation. And a balance is achieved, and we say this apple will be at thermal equilibrium, meaning its energy will neither increase nor decrease, so its temperature will stay the same. All the objects that you see around you, something very similar is happening is that thermal equilibrium and they're all giving out thermal radiation. You may be wondering why we can't see the thermal radiation, as we will see in a while, most of this thermal radiation lies in the infrared region, not in the visible region. That's why we can't see it. That's why what you're seeing most cases is just the reflected light, okay? But here's the thing, the light that comes from the star, guess what? It's also thermal radiation. It's coming due to the temperature of the star. Another example is a light that comes from the filament of the bulb. That's also thermal radiation. It's coming because of the temperature of the filament, because of the thermal motion of the electrons inside the filament of the bulb, which means to analyze the stars, I need to analyze the thermal radiations coming from the objects. But the reflected light is a problem. So I only want to analyze objects that do not reflect any light. What kind of objects are those? Ooh, ooh, black objects. If I paint this apple black, the reason it looks black is because it's not reflecting any light. It'll absorb all the light that's incident on it. That's one of the reasons why if you're wearing black clothes in a hot sunny day, it becomes much warmer because it doesn't reflect any light. It absorbs all of it. Now if, of course, it doesn't absorb completely all the color, it does reflect a little bit. That's why you can still see some features. You can still see some reflection of it, but you get the point, right? If this was ideally perfectly black, then it wouldn't reflect any light, and then the only light that I could get from it would be thermal radiation. That's why we love to analyze black bodies because they only give thermal radiation. And therefore, this radiation is also called the black body radiation. And you know what's the cool thing about the black body radiation, it's spectrum, meaning the colors, the different colors that come out and the brightness at which all the different colors come out, all of those details, it only depends on the temperature of the black body. It does not depend upon, say for example, what light will shine on it or it doesn't depend upon, for example, what material it is made of. None of that matters. The characteristics of a black body thermal radiation only depends upon its temperature, which is awesome because that means now I can apply it to stars. Stars also are very similar. They're only also giving out thermal radiation, so I can apply it to the stars, and that's what we'll do now. We'll analyze the thermal radiation that's coming from not properly this apple because I want to increase this temperature and this apple would burn. But maybe we'll take some metal, we'll take some black metal, we'll change its temperature, we'll analyze this black body radiation, and then we can now apply it to the stars. So let's analyze the thermal radiation coming from a metallic box so we can increase its temperature to very high values and it probably wouldn't melt. And how do you analyze it? Well, we can just, you know, find the spectrum using a diffraction grating or a prism that splits all the colors. And of course, because there's also light coming in the invisible region, we also need some detectors for that. But don't worry too much about the practicality. Let's say we all do that. Once we do that, we draw a graph, okay? On the x-axis, we will plot the different wavelengths. So you can see, for example, these are very long wavelengths, which are in the infrared region, which might even go into microwave, it can also go into radio waves, and then here is the visible light. So you have the red part of the spectrum. And then as that wavelength becomes smaller, you have the violet part of the spectrum, and then eventually, it becomes, again, invisible, you go into the ultraviolet. So this is the wavelength. And on the y-axis, we want to plot at what intensity light comes out near each of these wavelengths. And so on the y-axis, we're going to plot the intensity. Technically, intensity represents the amount of radiation energy coming out per second per meter square area of this box. So this way, I don't care about the size of the box. I'm only figuring out, I'm only gonna write down how much each meter square gives out energy per second. That's what we're gonna plot over here. But technically, you can see it's not just intensity, it's intensity per micrometer, which means intensity per wavelength. That's basically what we're talking about. For each wavelength near that region, what is the intensity of light that's coming out? That's why it's intensity per micrometer. But for our purposes, you can just think of this as brightness near each of these wavelengths. So let's begin now, and let's start at very low temperatures, at about 20 degree Celsius. You can see there's also K over here that stands for kelvin. That's another unit of temperature. In fact, that's the standard unit of temperature. And how you go from degree Celsius to kelvin is you just add 273. So 20 plus 273 is 293 kelvin. To go from kelvin to degree Celsius, subtract 273, and there you have it, okay? So what does the graph look like at very low temperatures? Well, it turns out the graph looks like this. What you can immediately see is that not all the wavelengths get the same intensity. In fact, the wavelengths over here gets zero and pretty much zero. It's not technically zero, but for all practical purposes, it is zero. And that's the reason why you can't even see visible light coming out over here. And that's why most things at 20 degrees Celsius, nothing at 10-20 degrees Celsius glows because they do not glow in the invisible light. They glow, however, in the infrared region, and that's how you can detect them with infrared cameras. And a characteristic thing that you see, the curve is, because of the curve, you can see that there will always be one particular wavelength at which you will get the peak value, you get the maximum intensity. For about 20 degrees Celsius, that happens to be somewhere in the long infrared region. Okay, now just let's increase the temperature. Let's heat it up all the way to 3000 kelvin. Again, to convert it into degrees Celsius, just subtract 273, you get about 2,700 something, right, degrees Celsius. But anyways, what does the graph look like now? Well, the graph looks like this. (laughs) What we now find is that the intensities are so, so high that I can even draw it in the same scale. And that kind of makes sense. At very high temperatures, the thermal energy is so high, the electrons are jiggling with such high energies, the thermal radiation comes out with very high energies, therefore, all the wavelengths of light now are gonna give you much higher energies than before. And therefore, the intensities will be much higher, so we can't draw it in the same graph. So we're gonna zoom out. And once we zoom out, this is what it's gonna look like. So the earlier graph, you can imagine it's somewhere over here, very low over here, you can't see it now in the same scale. But now the big change, what big change did we see? Well, first of all, the intensities are much higher than before. But the second big change is that the peak, you can see the peak was earlier over here somewhere. Now it has shifted to the left. At 3000 kelvin, the peak is still in the infrared region. But because the whole graph has shifted, the whole thing has shifted to the left, now a lot of visible light is also coming out. You can see that. And therefore, we will now be able to actually see it glow with our eyes. What color will it look like? Well, all the light is coming out, but not at the same intensity. A lot of brightness, a lot of intensity is in the reddish-orangish region, and therefore, this thing will glow reddish and orangish. So this is what it look like. And now if you look at things like your filament of the bulb or molten steel, pretty much at the same temperature, you can see they glow the same color. We can also understand another thing. Even though filament is giving me that color, it's giving me visible light. Where is the most of the light going? The most of the light coming out from the filament of the bulb is in the infrared region. This is where most of the light is coming out. And look, the visible light is getting, a little bit of energy is coming out. That's why an incandescent bulb actually wastes a lot of electric power because most of it, it just goes out in infrared region. And that's why we switch to LED bulbs because they are much more efficient. Anyways, because the same analysis can apply to the stars, now we can look at some stars, a star which has a similar color, for example, one example of that star is Betelgeuse that you can see from the Earth in the Orion constellation, okay? It has similar color and therefore, we can say the stars that are reddish must be at similar temperature, must be at a lower temperature. This is relatively cool when it comes to stars. All right, now let's increase the temperature even more to about 5,800 kelvin. What does the graph look like? Again, it'll look much higher than before, so I'll have to zoom out. And if I do that, it's gonna look like this. It's the trend remains the same, much higher energies than before. Now the previous graph looks like this. Okay? And another thing, the peak has also shifted more to the left. It has become even shorter. And now notice, the peak is actually somewhere in the visible light, which means it's somewhere near the green region. So at about 5,800 kelvin, the visible light is actually peaking. But what does the color look like? Would it look green? No, because even though a lot of light is coming out from green, you can see there's considerable amount of red and blues and all of the colors are coming out. And as a result, we'll actually see to be pretty much glowing white. So at about 5,800 kelvin, we will see whitish glow. And our sun, for example, is white. It's not yellow. It looks yellow because of the atmosphere. But if you were to go out and look at our sun, it'll actually look about whitish. And guess what? From that, we can say our sun must be pretty much at this temperature. And it turns out to be about at 5,800 kelvin of temperature. And similarly, other stars, which are whitish color must be at similar temperature. And by the way, very quickly, when I say temperature of the star or sun, I'm not talking about the core temperature of the stars. That could be millions of kelvins. Okay? We are talking about the temperature near the outer surface. That is what we're talking about. And that, for sun, is about 5,800 kelvin. We'll do one final temperature increase, let's increase it all the way to about 8,000 kelvin and see what happens. Well, if we do that, now again, you'll get the graph, which is much bigger than before. So I'll again have to zoom out. Same story. And again, you can see the same trend. So this is the earlier graph now, much higher energy than before. And the same trend. Earlier, the peak was near the green light in the visible region. Now, the peak will be somewhere in the ultraviolet, but again, a lot of visible light is still coming out. And this time, notice, because the whole graph has shifted to the left, a lot more energy is coming in the bluish-violetish region. And that's why at very high temperatures, guess what? It will glow bluish-violetish. And therefore, if you now go back to some stars that are bluish in color, for example, this star called Rigel, Rigel, I don't know how you pronounce it, whatever it is. But anyways, it's a bluish star, so I can say that, hey, that must be at a much higher temperature. It must be around 8,000 degrees or 9,000 degree, sorry, 8,000 kelvin or much higher temperature. And there we have it. We can even now draw a color temperature graph, which sort of summarizes, you know, what color we see at different temperatures. So at lower temperatures, it's reddish, orangish, and then it'll go to white, and then it'll start going towards bluish region. This does not represent the peak value. For example, at 5,800, the peak is still green. But because we are seeing multiple colors, this is what the colors will end up looking like to our eyes. If it's too low, then we'll not even be able to see it because most of it will be just in infrared region. This is basically how we can look at the different stars, their colors, and figure out what their temperature is. And when I say temperatures, I'm talking about the temperature in the outer layers, okay? What those temperatures can be. It's a pretty important tool for astronomy.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] ہبل ٹیلی سکوپ سے\nاس خوبصورت تصویر کو دیکھیں۔ یہ بہت سارے ستارے ہیں جن کے\nبہت سے مختلف رنگ ہیں۔ ان کے رنگ مختلف کیوں ہیں؟ ٹھیک ہے، یہ پتہ چلتا ہے کہ جو سرخ یا نارنجی ہیں وہ اصل میں نسبتا ٹھنڈے ستارے ہیں. وہ کم درجہ حرارت پر ہیں۔ اور جو سفید رنگ ہیں،\nجیسے یہاں پر سفید رنگ، آپ دیکھ سکتے ہیں، وہ\nقدرے گرم نکلے ہیں۔ اور جو نیلے ہیں وہ یہاں سب سے زیادہ گرم نکلے ہیں۔ لیکن میرا سوال یہ ہے کہ\nہمیں یہ کیسے معلوم ہوا؟ میرا مطلب ہے، ہم زمین پر بیٹھ کر یہ کیسے کہہ سکتے ہیں کہ، \"ارے،\nسرخ ستاروں کو ٹھنڈے اور نیلے ستاروں کو زیادہ گرم ہونا چاہیے۔\" ٹھیک ہے، اس کی وجہ یہ ہے کہ ہم نے\nبلیک باڈی ریڈی ایشن کا مطالعہ کیا۔ لیکن یہ اصل میں کیا ہے اور بلیک باڈی کا\nان ستاروں سے کیا تعلق ہے؟ اچھا، آئیے معلوم کرتے ہیں۔ آئیے اس بات سے شروع کریں کہ بلیک باڈیز کیا ہیں اور ہمیں ان کی پرواہ کیوں کرنی چاہیے؟ اس کے لیے، آئیے ایک\nسیب کو باہر دھوپ والے دن دن کی روشنی میں رکھیں، تاکہ سورج کی روشنی اس پر پڑے۔ یاد رکھیں کہ سورج کی روشنی سفید روشنی ہے، جو\nقوس قزح کے تمام رنگوں سے بنتی ہے۔ اب ہمارے لیے سوال یہ ہے کہ\n جب روشنی سیب پر پڑتی ہے تو اس کا کیا ہوتا ہے؟ ٹھیک ہے، کچھ روشنی منعکس ہو جاتی ہے، اس کا بہت حصہ سرخ رنگ کا ہوتا ہے، اور اسی لیے ہم\nسیب کو سرخ رنگ کا دیکھتے ہیں۔ لیکن\nباقی رنگوں کا کیا ہوگا؟ ٹھیک ہے، وہ جذب ہو جاتے ہیں. اور جذب ہونے سے ہمارا مطلب یہ ہے کہ یاد رکھیں کہ روشنی\nایک برقی مقناطیسی لہر ہے، جس میں برقی میدان\nاور مقناطیسی میدان بھی شامل ہیں، لیکن ہم نے\nدوغلی مقناطیسی فیلڈز کو نہیں دکھایا۔ لیکن یہ\nدوہری برقی میدان ہیں۔ لیکن ایک بار جب وہ\nسیب یعنی برقی کھیتوں پر گریں گے تو وہ الیکٹران کو ہلچل مچا دیں گے۔ اور نتیجے کے طور پر، دیکھیں کہ\nبرقی مقناطیسی لہر سے توانائی الیکٹرانوں کی جگمگاتی توانائی میں جا رہی ہے۔\n اور اس طرح برقی\nمقناطیسی لہر سے حاصل ہونے والی توانائی \nالیکٹرانوں کی جگمگاتی حرکت یا الیکٹران کی تھرمل توانائی میں تبدیل ہو جاتی ہے۔ اور اس کے نتیجے میں، سیب کا درجہ حرارت\nبڑھ جائے گا. لیکن ایک سیکنڈ انتظار کرو، ایک سیکنڈ انتظار کرو. اگر ایسا تھا، تو اگر آپ\nسیب پر مسلسل روشنی ڈالتے رہیں، تو اس کا درجہ حرارت\nمسلسل بڑھنا چاہیے۔ لیکن ایسا نہیں ہوتا،\nٹھیک ہے؟  ایسا کیوں نہیں ہوتا؟ ٹھیک ہے، اس کی وجہ یہ ہے کہ جیسے جیسے\nالیکٹران ہل رہے ہیں، وہ\nاپنی برقی مقناطیسی لہریں پیدا کرنے والے ہیں۔ یاد رکھیں، کوئی بھی تیز رفتار چارج برقی مقناطیسی لہریں پیدا کرے گا اور اس وجہ سے، ہلنے والے الیکٹران اپنی\nبرقی مقناطیسی لہریں پیدا کریں گے۔ اور ہم ان برقی مقناطیسی\nلہروں کو تھرمل ریڈی ایشن کہتے ہیں کیونکہ یہ تابکاری الیکٹرانوں کی تھرمل حرکت سے آرہی ہے، اور تھرمل ریڈی ایشن کی وجہ سے، یہ توانائی کھو رہی ہے۔ اور اس طرح آپ دیکھ سکتے ہیں کہ کیا ہو رہا ہے۔ یہ سورج کی روشنی سے توانائی جذب کر رہا ہے، لیکن یہ تھرمل تابکاری سے\nاسی شرح سے توانائی کھو رہا ہے۔ اور ایک توازن حاصل ہو جاتا ہے، اور ہم کہتے ہیں کہ یہ سیب\nحرارتی توازن پر ہو گا، یعنی اس کی توانائی\nنہ بڑھے گی اور نہ کم ہو گی، اس لیے اس کا درجہ حرارت ایک جیسا رہے گا۔  وہ تمام اشیاء جو آپ اپنے اردگرد دیکھتے ہیں، کچھ اسی طرح کی ہو رہی ہے وہ ہے تھرمل توازن اور وہ سب\nتھرمل ریڈی ایشن دے رہے ہیں۔ آپ سوچ رہے ہوں گے کہ ہم\nتھرمل ریڈی ایشن کیوں نہیں دیکھ سکتے، جیسا کہ ہم تھوڑی دیر میں دیکھیں گے، اس تھرمل ریڈی ایشن کا زیادہ تر حصہ\nانفراریڈ ریجن میں ہوتا ہے، مرئی علاقے میں نہیں۔  اس لیے ہم اسے نہیں دیکھ سکتے۔ یہی وجہ ہے کہ آپ جو زیادہ تر معاملات دیکھ رہے ہیں وہ صرف منعکس شدہ روشنی ہے، ٹھیک ہے؟ لیکن یہاں بات یہ ہے کہ ستارے سے جو روشنی آتی ہے\n، اس کا اندازہ کیا ہے؟ یہ تھرمل تابکاری بھی ہے۔ یہ\nستارے کے درجہ حرارت کی وجہ سے آ رہا ہے۔ ایک اور مثال ایک روشنی ہے جو بلب کے تنت سے آتی ہے۔ یہ تھرمل تابکاری بھی ہے۔ یہ\nتنت کے درجہ حرارت کی وجہ سے آرہا ہے، \n بلب کے تنت کے اندر الیکٹرانوں کی تھرمل حرکت کی وجہ سے، جس کا مطلب ہے ستاروں کا تجزیہ کرنے کے لیے، مجھے اشیاء سے آنے والی تھرمل شعاعوں کا تجزیہ کرنے کی ضرورت ہے۔ لیکن منعکس روشنی ایک مسئلہ ہے۔ لہذا میں صرف ان چیزوں کا تجزیہ کرنا چاہتا ہوں جو کسی بھی روشنی کو منعکس نہیں کرتی ہیں۔  وہ کس قسم کی اشیاء ہیں\n؟  اوہ، اوہ، کالی اشیاء۔ اگر میں اس سیب کو کالا پینٹ کرتا ہوں تو اس کے سیاہ نظر آنے کی وجہ یہ ہے کہ یہ کسی بھی روشنی کو منعکس نہیں کر رہا ہے۔ یہ اس پر ہونے والی تمام روشنی کو جذب کر لے گا۔\n یہ ایک وجہ ہے کہ اگر آپ\nگرم دھوپ والے دن میں سیاہ کپڑے پہنتے ہیں، تو یہ زیادہ گرم ہو جاتا ہے کیونکہ یہ روشنی کو منعکس نہیں کرتا ہے۔ یہ سب کچھ جذب کر لیتا ہے۔ اب اگر، یقینا، یہ\nمکمل طور پر تمام رنگوں کو جذب نہیں کرتا ہے، یہ تھوڑا سا منعکس کرتا ہے۔  اسی لیے آپ\nاب بھی کچھ خصوصیات دیکھ سکتے ہیں۔ آپ اب بھی اس کی کچھ عکاسی دیکھ سکتے ہیں، لیکن آپ کو نقطہ نظر آتا ہے، ٹھیک ہے؟ اگر یہ مثالی طور پر بالکل سیاہ تھا، تو یہ کسی بھی روشنی کو منعکس نہیں کرے گا، اور پھر صرف روشنی\nجو میں اس سے حاصل کرسکتا ہوں وہ تھرمل ریڈی ایشن ہوگی۔  اسی لیے ہمیں بلیک باڈیز کا تجزیہ کرنا پسند ہے کیونکہ وہ صرف تھرمل ریڈی ایشن دیتے ہیں۔ اور اسی لیے اس تابکاری کو بلیک باڈی ریڈی ایشن بھی کہا جاتا ہے۔ اور آپ جانتے ہیں کہ بلیک باڈی ریڈی ایشن کے بارے میں کیا ٹھنڈی چیز ہے، یہ سپیکٹرم ہے، یعنی رنگ،\nمختلف رنگ جو نکلتے ہیں اور چمک جس پر تمام\nمختلف رنگ نکلتے ہیں، یہ تمام تفصیلات، یہ صرف\nدرجہ حرارت پر منحصر ہے۔  سیاہ جسم. یہ اس پر منحصر نہیں ہے، مثال کے طور پر کہیے کہ\nاس پر کون سی روشنی چمکے گی یا اس پر منحصر نہیں ہے، مثال کے طور پر، یہ کس مواد سے بنا ہے۔ اس سے کوئی فرق نہیں پڑتا۔ \nبلیک باڈی تھرمل ریڈی ایشن کی خصوصیات صرف اس کے\nدرجہ حرارت پر منحصر ہے، جو بہت اچھا ہے کیونکہ اس کا مطلب ہے کہ اب\nمیں اسے ستاروں پر لگا سکتا ہوں۔ ستارے بھی بہت ملتے جلتے ہیں۔ وہ صرف تھرمل تابکاری بھی دے رہے ہیں،\n لہذا میں اسے ستاروں پر لگا سکتا ہوں، اور اب ہم یہی کریں گے۔ ہم اس سیب سے آنے والی تھرمل ریڈی ایشن کا تجزیہ کریں گے کیونکہ میں\nاس درجہ حرارت کو بڑھانا چاہتا ہوں اور یہ سیب جل جائے گا۔ لیکن شاید ہم کچھ دھات لیں گے، ہم کچھ کالی دھات لیں گے، ہم اس کا درجہ حرارت تبدیل کریں گے، ہم اس سیاہ جسم کی تابکاری کا تجزیہ کریں گے، اور پھر اب ہم اسے ستاروں پر لاگو کر سکتے ہیں۔ تو آئیے ایک دھاتی خانے سے\nآنے والی تھرمل تابکاری کا تجزیہ کریں تاکہ ہم اس کے\nدرجہ حرارت کو بہت زیادہ قدروں تک بڑھا سکیں اور یہ شاید پگھل نہ پائے۔ اور آپ اس کا تجزیہ کیسے کرتے ہیں؟ ٹھیک ہے، ہم صرف، آپ\nجانتے ہیں، ڈِفریکشن گریٹنگ یا تمام رنگوں کو تقسیم کرنے والے پرزم کا استعمال کرتے ہوئے سپیکٹرم تلاش کر سکتے ہیں۔ اور ظاہر ہے، کیونکہ پوشیدہ علاقے میں\nروشنی بھی آرہی ہے، ہمیں اس کے لیے کچھ ڈیٹیکٹرز کی بھی ضرورت ہے۔ لیکن عملییت کے بارے میں زیادہ فکر نہ کریں۔\n آئیے کہتے ہیں کہ ہم سب ایسا کرتے ہیں۔ ایک بار جب ہم ایسا کرتے ہیں، ہم ایک گراف کھینچتے ہیں، ٹھیک ہے؟ ایکس محور پر، ہم\nمختلف طول موجوں کو پلاٹ کریں گے۔ تو آپ دیکھ سکتے ہیں، مثال کے طور پر، یہ\nبہت لمبی طول موجیں ہیں، جو انفراریڈ ریجن میں ہیں، جو مائیکرو ویو میں بھی جا سکتی ہیں، یہ ریڈیو لہروں میں بھی جا سکتی ہیں، اور پھر یہاں نظر آنے والی روشنی ہے۔ تو آپ کے پاس سپیکٹرم کا سرخ حصہ ہے۔ اور پھر جیسے جیسے وہ\nطول موج کم ہوتی جاتی ہے، آپ کے پاس سپیکٹرم کا بنفشی حصہ ہوتا ہے، اور پھر آخرکار، یہ\nدوبارہ، پوشیدہ ہو جاتا ہے، آپ الٹرا وایلیٹ میں چلے جاتے ہیں۔ تو یہ طول موج ہے۔ اور y-axis پر، ہم یہ منصوبہ بنانا چاہتے ہیں کہ\n ان طول موجوں میں سے ہر ایک کے قریب روشنی کس شدت سے نکلتی ہے۔ اور اسی طرح y محور پر، ہم شدت کی منصوبہ بندی کرنے جا رہے ہیں۔ تکنیکی طور پر، شدت \n اس باکس کے فی سیکنڈ فی میٹر مربع رقبہ پر نکلنے والی تابکاری توانائی کی مقدار کو ظاہر کرتی ہے۔ تو اس طرح، مجھے\nباکس کے سائز کی پرواہ نہیں ہے۔ میں صرف یہ معلوم کر رہا ہوں، میں صرف یہ لکھنے والا ہوں کہ ہر میٹر مربع\nفی سیکنڈ کتنی توانائی دیتا ہے۔ یہ وہی ہے جو ہم یہاں پر سازش کرنے والے ہیں۔ لیکن تکنیکی طور پر، آپ\nدیکھ سکتے ہیں کہ یہ صرف شدت نہیں ہے، یہ شدت فی مائکرو میٹر ہے، جس کا مطلب ہے شدت فی طول موج۔ یہ بنیادی طور پر ہے جس کے بارے میں ہم بات کر رہے ہیں۔ اس علاقے کے قریب ہر طول موج کے لیے، روشنی کی شدت کتنی ہے\nجو باہر آ رہی ہے؟  اس لیے اس کی شدت فی مائکرو میٹر ہے۔ لیکن ہمارے مقاصد کے لیے، آپ اسے صرف ان طول موجوں میں سے ہر ایک کے قریب چمک کے طور پر سوچ سکتے ہیں۔ تو آئیے اب شروع کرتے ہیں، اور بہت کم درجہ حرارت سے شروع کرتے ہیں، تقریباً 20 ڈگری سیلسیس پر۔ آپ دیکھ سکتے ہیں کہ یہاں K بھی ہے\nجس کا مطلب کیلون ہے۔ یہ درجہ حرارت کی ایک اور اکائی ہے۔ درحقیقت، یہ\nدرجہ حرارت کی معیاری اکائی ہے۔ اور آپ\nڈگری سیلسیس سے کیلون تک کیسے جاتے ہیں، آپ صرف 273 جوڑتے ہیں۔ تو 20 جمع 273 ہے 293 کیلون۔ کیلون سے ڈگری سیلسیس تک جانے کے لیے،\n273 کو گھٹائیں، اور وہاں آپ کے پاس ہے، ٹھیک ہے؟ تو بہت کم درجہ حرارت پر گراف کیسا لگتا ہے؟ ٹھیک ہے، یہ پتہ چلتا ہے کہ\nگراف اس طرح لگتا ہے. جو آپ فوری طور پر دیکھ سکتے ہیں وہ یہ ہے کہ تمام طول موجوں کو ایک\nجیسی شدت نہیں ملتی ہے۔ درحقیقت،\nیہاں پر طول موج صفر ہو جاتی ہے اور بہت زیادہ صفر۔ یہ تکنیکی طور پر صفر نہیں ہے، لیکن تمام عملی مقاصد کے لیے\n، یہ صفر ہے۔ اور یہی وجہ ہے کہ آپ یہاں سے نکلتی ہوئی\nروشنی کو بھی نہیں دیکھ سکتے۔ اور یہی وجہ ہے کہ\n20 ڈگری سینٹی گریڈ پر زیادہ تر چیزیں، 10-20 ڈگری سیلسیس پر کچھ بھی نہیں چمکتا کیونکہ وہ\nغیر مرئی روشنی میں نہیں چمکتی ہیں۔ تاہم، وہ\nاورکت والے خطے میں چمکتے ہیں، اور اسی طرح آپ\nانفراریڈ کیمروں سے ان کا پتہ لگا سکتے ہیں۔ اور ایک خصوصیت\nجو آپ دیکھتے ہیں، وہ ہے، وکر کی وجہ سے، آپ دیکھ سکتے ہیں کہ ہمیشہ\nایک خاص طول موج ہوگی جس پر آپ کو چوٹی کی قدر ملے گی، آپ کو زیادہ سے زیادہ شدت ملے گی۔ تقریباً 20 ڈگری سیلسیس کے لیے، یہ\nلمبے اورکت والے خطے میں کہیں ہوتا ہے۔ ٹھیک ہے، اب صرف\nدرجہ حرارت بڑھاتے ہیں۔ آئیے اسے\n3000 کیلون تک گرم کریں۔ ایک بار پھر، اسے ڈگری سیلسیس میں تبدیل کرنے کے لیے، صرف 273 کو گھٹائیں، آپ کو تقریباً 2700 کچھ ملے گا،\nٹھیک ہے، ڈگری سیلسیس۔ لیکن ویسے بھی،\nگراف اب کیسا لگتا ہے؟ ٹھیک ہے، گراف اس طرح لگتا ہے.  (ہنستا ہے) اب ہمیں جو نظر آتا ہے وہ یہ ہے کہ\nشدت اتنی، اتنی زیادہ ہے کہ میں اسے اسی پیمانے پر کھینچ بھی سکتا ہوں۔ اور اس قسم کا احساس ہوتا ہے۔ بہت زیادہ درجہ حرارت پر، تھرمل انرجی اتنی زیادہ ہوتی ہے، الیکٹران\nاتنی زیادہ توانائیوں سے جگمگا رہے ہوتے ہیں، تھرمل ریڈی ایشن\nبہت زیادہ توانائیوں کے ساتھ نکلتی ہے، اس لیے\nاب روشنی کی تمام طول موجیں آپ کو\nپہلے سے کہیں زیادہ توانائی فراہم کرنے والی ہیں۔ اور اس وجہ سے، شدت\nبہت زیادہ ہوگی، لہذا ہم اسے ایک ہی گراف میں نہیں کھینچ سکتے ہیں۔ تو ہم زوم آؤٹ کرنے والے ہیں۔ اور ایک بار جب ہم زوم آؤٹ کرتے ہیں، تو یہ ایسا ہی\nنظر آئے گا۔ تو پہلے کا گراف، آپ تصور کر سکتے ہیں کہ یہ یہاں کہیں ہے، یہاں بہت کم ہے، اب آپ اسے اسی پیمانے پر نہیں دیکھ سکتے۔ لیکن اب بڑی تبدیلی،\nہم نے کون سی بڑی تبدیلی دیکھی؟ ٹھیک ہے، سب سے پہلے، شدت\nپہلے سے کہیں زیادہ ہے. لیکن دوسری بڑی\nتبدیلی یہ ہے کہ چوٹی، آپ دیکھ سکتے ہیں کہ چوٹی\nپہلے یہیں کہیں تھی۔ اب یہ بائیں طرف منتقل ہو گیا ہے۔ 3000 کیلون پر، چوٹی\nاب بھی انفراریڈ خطے میں ہے۔ لیکن چونکہ سارا گراف شفٹ ہو گیا ہے، ساری چیز بائیں طرف چلی گئی ہے، اب بہت سی\nروشنی بھی نکل رہی ہے۔ آپ اسے دیکھ سکتے ہیں۔ اور اس لیے اب ہم\nاسے اپنی آنکھوں سے چمکتے ہوئے دیکھ سکیں گے۔ یہ کیسا رنگ نظر آئے گا؟ ٹھیک ہے، تمام روشنی باہر آ رہی ہے، لیکن ایک ہی شدت سے نہیں. بہت زیادہ چمک، بہت زیادہ شدت\nسرخی مائل نارنجی خطے میں ہے، اور اس وجہ سے یہ چیز\nسرخی مائل اور نارنجی رنگ میں چمکے گی۔ تو یہ ایسا ہی نظر آتا ہے۔ اور اب اگر آپ اپنے\nبلب یا پگھلے ہوئے اسٹیل کے فلیمنٹ جیسی چیزوں کو دیکھیں، کافی حد تک ایک ہی درجہ حرارت پر، آپ دیکھ سکتے ہیں کہ وہ ایک ہی رنگ میں چمک رہے ہیں۔ ہم ایک اور بات بھی سمجھ سکتے ہیں۔ اگرچہ تنت\nمجھے وہ رنگ دے رہا ہے، یہ مجھے مرئی روشنی دے رہا ہے۔  سب سے زیادہ روشنی کہاں جا رہی ہے؟  بلب کے تنت سے نکلنے والی زیادہ تر روشنی \nانفراریڈ ریجن میں ہوتی ہے۔ یہ وہ جگہ ہے جہاں سے زیادہ تر\nروشنی آتی ہے۔ اور دیکھو، نظر آنے والی روشنی مل رہی ہے، تھوڑی سی توانائی نکل رہی ہے۔ یہی وجہ ہے کہ ایک تاپدیپت بلب درحقیقت بہت زیادہ برقی طاقت ضائع کرتا ہے کیونکہ اس میں سے زیادہ تر، یہ صرف\nانفراریڈ خطے میں نکلتا ہے۔ اور اسی وجہ سے ہم ایل ای ڈی بلب کی طرف جاتے ہیں کیونکہ وہ بہت زیادہ موثر ہیں۔ ویسے بھی، کیونکہ ایک ہی\nتجزیہ ستاروں پر لاگو ہوسکتا ہے، اب ہم کچھ ستاروں کو دیکھ سکتے ہیں، ایک ستارہ جس کا\nرنگ ایک جیسا ہے، مثال کے طور پر، اس ستارے کی ایک مثال Betelgeuse ہے جسے آپ Orion برج میں زمین سے دیکھ سکتے ہیں، ٹھیک ہے؟ اس کا رنگ ایک جیسا ہے اور اس لیے ہم کہہ سکتے ہیں کہ\nسرخی مائل ستارے ایک جیسے درجہ حرارت پر ہونے چاہئیں، کم درجہ حرارت پر ہونے چاہئیں۔  جب ستاروں کی بات آتی ہے تو یہ نسبتاً ٹھنڈا ہوتا ہے۔\n ٹھیک ہے، اب ہم\nدرجہ حرارت کو تقریباً 5,800 کیلون تک بڑھاتے ہیں۔ گراف کیسا لگتا ہے؟  ایک بار پھر، یہ پہلے سے کہیں زیادہ اونچا نظر آئے گا، اس لیے مجھے زوم آؤٹ کرنا پڑے گا۔ اور اگر میں ایسا کرتا ہوں تو یہ اس طرح\nنظر آئے گا۔ یہ رجحان ایک ہی ہے، پہلے سے کہیں زیادہ توانائیاں۔ اب پچھلا گراف اس\nطرح نظر آتا ہے۔  ٹھیک ہے؟ اور ایک اور بات، چوٹی بھی\nزیادہ بائیں طرف منتقل ہو گئی ہے۔ یہ اور بھی چھوٹا ہو گیا ہے۔ اور اب دیکھیں، چوٹی دراصل کہیں\nدکھائی دینے والی روشنی میں ہے، جس کا مطلب ہے کہ یہ\nسبز خطے کے قریب ہے۔ تو تقریباً 5,800 کیلون پر، نظر آنے والی روشنی دراصل عروج پر ہے۔ لیکن رنگ کیسا لگتا ہے\n؟  کیا یہ سبز نظر آئے گا؟ نہیں، کیونکہ اگرچہ سبز رنگ سے بہت زیادہ روشنی نکل رہی ہے، آپ دیکھ سکتے ہیں کہ\nسرخ اور بلیوز کی کافی مقدار ہے اور تمام رنگ نکل رہے ہیں۔ اور نتیجے کے طور پر، ہم اصل میں\nبہت زیادہ چمکدار سفید نظر آئیں گے۔ تو تقریباً 5,800 کیلون پر،\nہم سفید چمک دیکھیں گے۔ اور ہمارا سورج، مثال کے طور پر، سفید ہے۔ یہ پیلا نہیں ہے۔ یہ ماحول کی وجہ سے پیلا لگتا ہے۔ لیکن اگر آپ\nباہر جا کر ہمارے سورج کو دیکھیں تو یہ حقیقت میں سفید نظر آئے گا۔ اور اندازہ کرو کہ کیا؟ اس سے، ہم کہہ سکتے ہیں کہ ہمارا\nسورج اس درجہ حرارت پر بہت زیادہ ہونا چاہیے۔ اور یہ تقریباً\n5,800 کیلون درجہ حرارت پر نکلا۔ اور اسی طرح، دوسرے ستارے، جن کا رنگ سفید ہے،\nاسی درجہ حرارت پر ہونا چاہیے۔ اور ویسے، بہت جلد، جب میں ستارے یا سورج کا درجہ حرارت کہتا ہوں، تو میں\nستاروں کے بنیادی درجہ حرارت کی بات نہیں کر رہا ہوں۔ یہ لاکھوں کیلون ہو سکتے ہیں۔  ٹھیک ہے؟ ہم\nبیرونی سطح کے قریب درجہ حرارت کے بارے میں بات کر رہے ہیں۔ اسی کے بارے میں ہم بات کر رہے ہیں۔ اور وہ، سورج کے لیے، تقریباً 5,800 کیلون ہے۔ ہم درجہ حرارت میں ایک آخری اضافہ کریں گے، آئیے اسے\nتقریباً 8,000 کیلون تک بڑھاتے ہیں اور دیکھتے ہیں کہ کیا ہوتا ہے۔ ٹھیک ہے، اگر ہم ایسا کرتے ہیں، اب دوبارہ، آپ کو گراف ملے گا، جو پہلے سے بہت بڑا ہے۔ تو مجھے دوبارہ\nزوم آؤٹ کرنا پڑے گا۔  ایک ہی کہانی۔ اور پھر، آپ وہی رجحان دیکھ سکتے ہیں۔ تو یہ اب پہلے کا گراف ہے، پہلے سے کہیں زیادہ توانائی۔ اور ایک ہی رجحان۔  اس سے پہلے، چوٹی نظر آنے والے علاقے میں سبز روشنی کے قریب تھی۔ اب، چوٹی\nالٹرا وائلٹ میں کہیں ہوگی، لیکن ایک بار پھر، بہت زیادہ دکھائی دینے والی\nروشنی اب بھی باہر آ رہی ہے۔ اور اس بار، نوٹس کریں، کیونکہ پورا گراف\nبائیں طرف منتقل ہو گیا ہے، نیلے رنگ کے بنفشی خطے میں بہت زیادہ توانائی آ رہی ہے۔\n اور یہی وجہ ہے کہ بہت زیادہ\nدرجہ حرارت پر، کیا لگتا ہے؟ یہ نیلے بنفشی چمک جائے گا. اور اس لیے، اگر\nاب آپ کچھ ایسے ستاروں پر واپس جائیں جن کا رنگ نیلا ہے، مثال کے طور پر، یہ ستارہ جسے\nRigel، Rigel کہتے ہیں، مجھے نہیں معلوم کہ آپ اس کا تلفظ کیسے کرتے ہیں، چاہے وہ کچھ بھی ہو۔ لیکن بہرحال، یہ ایک نیلے رنگ کا ستارہ ہے، اس لیے میں کہہ سکتا ہوں کہ، ارے، یہ\nبہت زیادہ درجہ حرارت پر ہونا چاہیے۔ یہ تقریباً 8,000\nڈگری یا 9,000 ڈگری ہونا چاہیے، معذرت، 8000 کیلون یا اس سے\nکہیں زیادہ درجہ حرارت۔ اور وہاں ہمارے پاس ہے۔ اب ہم\nرنگین درجہ حرارت کا گراف بھی کھینچ سکتے ہیں، جس کا خلاصہ کیا جاتا ہے، آپ جانتے ہیں کہ ہم\nمختلف درجہ حرارت پر کون سا رنگ دیکھتے ہیں۔ تو کم درجہ حرارت پر،\nیہ سرخی مائل، نارنجی، اور پھر سفید ہو جائے گا، اور پھر یہ\nنیلے رنگ کے علاقے کی طرف جانا شروع کر دے گا۔ یہ چوٹی کی قیمت کی نمائندگی نہیں کرتا ہے۔ مثال کے طور پر، 5,800 پر،\nچوٹی اب بھی سبز ہے۔ لیکن چونکہ ہم ایک سے زیادہ رنگ دیکھ رہے ہیں، یہی رنگ ہماری آنکھوں کی طرح نظر آئیں گے۔ اگر یہ بہت کم ہے، تو ہم\nاسے دیکھنے کے قابل بھی نہیں ہوں گے کیونکہ اس کا زیادہ تر حصہ\nانفراریڈ ریجن میں ہوگا۔ بنیادی طور پر یہ ہے کہ ہم\nمختلف ستاروں، ان کے رنگوں کو کس طرح دیکھ سکتے ہیں، اور یہ معلوم کر سکتے ہیں کہ\nان کا درجہ حرارت کیا ہے۔ اور جب میں درجہ حرارت کہتا ہوں، تو میں بیرونی تہوں میں درجہ حرارت کے بارے میں بات کر رہا ہوں\n، ٹھیک ہے؟ وہ درجہ حرارت کیا ہو سکتا ہے۔ یہ\nفلکیات کے لیے ایک بہت اہم ٹول ہے۔",
    "t_spanish": "- [Instructor]\nMira esta hermosa foto del Telescopio Hubble. Son tantas estrellas con\ntantos colores diferentes.  ¿ Por qué tienen diferentes colores? Bueno, resulta que las que son rojizas o anaranjadas son en realidad estrellas relativamente más frías. Están a temperaturas más bajas. Y los que son blanquecinos,\ncomo el color blanco de aquí, como pueden ver,\nresultan ser un poco más calientes. Y los que son azulados resultan ser los más calientes por aquí. Pero mi pregunta es, ¿cómo\ndescubrimos esto? Quiero decir, ¿cómo podemos sentarnos en la Tierra y decir: \"Oye, las\nestrellas rojas deben ser más frías y las estrellas azules deben ser más calientes\"? Bueno, eso es porque estudiamos\nla radiación del cuerpo negro. Pero, ¿qué es esto exactamente y qué tiene que ver el cuerpo negro\ncon estas estrellas? Bueno, averigüémoslo. Empecemos por qué son los cuerpos negros y por qué deberíamos preocuparnos por ellos. Para eso, mantengamos una\nmanzana afuera en un día soleado a plena luz del día, para que la luz del sol caiga sobre ella. Recuerda que la luz del sol es luz blanca, que está formada por todos\nlos colores del arcoíris. La pregunta para nosotros ahora es ¿\nqué sucede con la luz una vez que cae sobre la manzana? Bueno, parte de la luz se refleja, mucha es de color rojo, y es por eso que vemos que la\nmanzana es de color rojo. Pero ¿qué pasa con\nel resto de colores? Bueno, quedan absorbidos. Y lo que queremos decir con ser absorbido es recordar que la luz\nes una onda electromagnética, que contiene campos eléctricos\ny campos magnéticos también, pero no hemos mostrado los\ncampos magnéticos oscilantes. Pero estos son los\ncampos eléctricos oscilantes. Pero una vez que caigan sobre la\nmanzana, los campos eléctricos harán que los electrones se muevan. Y como resultado, observe que la energía de\nla onda electromagnética se convierte en la\nenergía oscilante de los electrones. Y así es como la energía\nde la onda electromagnética se convierte en\nmovimiento oscilante de los electrones o energía térmica de los electrones. Y como resultado, la temperatura de la\nmanzana aumentaría. Pero espera un segundo, espera un segundo. Si este fuera el caso, entonces si iluminas continuamente\nla manzana, su temperatura debería\naumentar continuamente. Pero eso no sucede, ¿\nverdad?  ¿Por qué no sucede eso? Bueno, eso se debe a que a medida que\nlos electrones se mueven, producirán sus\npropias ondas electromagnéticas. Recuerde, cualquier carga acelerada producirá ondas electromagnéticas y, por lo tanto, los electrones que se mueven producirán sus propias\nondas electromagnéticas. Y a estas ondas electromagnéticas las llamamos\nradiación térmica porque esa radiación proviene del movimiento térmico de los electrones y, debido a la radiación térmica, está perdiendo energía. Y así podrás ver lo que está pasando. Está absorbiendo energía de la luz solar, pero también está perdiendo\nenergía al mismo ritmo debido a la radiación térmica. Y se logra un equilibrio, y decimos que esta manzana\nestará en equilibrio térmico, lo que significa que su energía\nno aumentará ni disminuirá, por lo que su temperatura permanecerá igual.  En todos los objetos que ves a tu alrededor sucede algo muy similar: ese equilibrio térmico y todos\nemiten radiación térmica. Quizás se pregunte por qué\nno podemos ver la radiación térmica, como veremos dentro de un tiempo, la mayor parte de esta radiación térmica\nse encuentra en la región infrarroja, no en la región visible.  Por eso no podemos verlo.  Por eso lo que ves en la mayoría de los casos es sólo la luz reflejada, ¿vale? Pero aquí está la cuestión, la luz que proviene de\nla estrella, ¿adivinen qué? También es radiación térmica. Viene debido a la\ntemperatura de la estrella. Otro ejemplo es una luz que proviene del filamento de una bombilla. Eso también es radiación térmica. Viene debido a la\ntemperatura del filamento, debido al\nmovimiento térmico de los electrones dentro del filamento de la bombilla, lo que significa que para analizar las estrellas, necesito analizar las radiaciones térmicas provenientes de los objetos. Pero la luz reflejada es un problema.  Por eso sólo quiero analizar objetos que no reflejen ninguna luz.  ¿ Qué clase de objetos son\nesos?  Oh, ooh, objetos negros. Si pinto esta manzana de negro, la razón por la que parece negra es porque no refleja ninguna luz. Absorberá toda la luz\nque incide sobre él. Esa es una de las razones por las que si usas\nropa negra en un día caluroso y soleado, hace mucho más calor porque no refleja ninguna luz.  Lo absorbe todo. Ahora bien, si claro no absorbe\ncompletamente todo el color, sí refleja un poquito.  Es por eso que \ntodavía puedes ver algunas características. Todavía puedes ver un reflejo de ello, pero entiendes el punto, ¿verdad? Si esto fuera idealmente negro, entonces no reflejaría ninguna luz, y entonces la única luz\nque podría obtener sería radiación térmica.  Por eso nos encanta analizar los cuerpos negros porque sólo dan radiación térmica. Y por eso, esta radiación también se llama radiación de cuerpo negro. Y sabes qué es lo bueno de la radiación del cuerpo negro, su espectro, es decir, los colores, los\ndiferentes colores que salen y el brillo con el que\nsalen los diferentes colores, todos esos detalles, solo depende de la\ntemperatura de  el cuerpo negro. No depende, por ejemplo, de qué\nluz brillará sobre él o no depende, por ejemplo, de qué material está hecho. Nada de eso importa. Las características de la\nradiación térmica de un cuerpo negro sólo dependen de su\ntemperatura, lo cual es asombroso porque eso significa que ahora\npuedo aplicarlo a las estrellas. Las estrellas también son muy similares. También\nemiten radiación térmica, así que puedo aplicarla a las estrellas, y eso es lo que haremos ahora. Analizaremos la radiación térmica que proviene de una manzana incorrecta porque quiero\naumentar esta temperatura y esta manzana se quemaría. Pero tal vez tomemos algo de metal, algo de metal negro, cambiemos su temperatura, analicemos la radiación del cuerpo negro y luego podamos aplicarla a las estrellas. Entonces analicemos la\nradiación térmica proveniente de una caja metálica para que podamos aumentar su\ntemperatura a valores muy altos y probablemente no se derrita.  ¿ Y cómo lo analizas? Bueno, podemos\nencontrar el espectro usando una rejilla de difracción o un prisma que divida todos los colores. Y, por supuesto, como\ntambién llega luz a la región invisible, también necesitamos algunos detectores para eso. Pero no te preocupes demasiado\npor la practicidad. Digamos que todos hacemos eso. Una vez que hacemos eso, dibujamos un gráfico, ¿vale? En el eje x, trazaremos\nlas diferentes longitudes de onda. Como pueden ver, por ejemplo, estas son\nlongitudes de onda muy largas, que están en la región infrarroja, que incluso podrían convertirse en microondas, también pueden convertirse en ondas de radio, y luego aquí está la luz visible. Entonces tienes la parte roja del espectro. Y luego, a medida que esa\nlongitud de onda se hace más pequeña, tenemos la parte violeta del espectro y luego, finalmente, se\nvuelve nuevamente invisible, pasamos al ultravioleta. Entonces esta es la longitud de onda. Y en el eje y, queremos trazar con qué\nintensidad sale la luz cerca de cada una de estas longitudes de onda. Y así, en el eje y, graficaremos la intensidad. Técnicamente, la intensidad representa la cantidad de\nenergía de radiación que sale por segundo por metro cuadrado de área de esta caja.  De esta manera, no me\nimporta el tamaño de la caja. Sólo estoy averiguando, sólo voy a escribir cuánta energía da cada metro cuadrado\npor segundo. Eso es lo que vamos a tramar aquí. Pero técnicamente, se puede\nver que no es sólo intensidad, es intensidad por micrómetro, lo que significa intensidad por longitud de onda. Básicamente de eso estamos hablando. Para cada longitud de onda cerca de esa región, ¿ cuál es la intensidad de\nla luz que sale?  Por eso es intensidad por micrómetro. Pero para nuestros propósitos, podemos considerarlo como un brillo cercano a cada una de estas longitudes de onda. Así que comencemos ahora, y comencemos a temperaturas muy bajas, alrededor de 20 grados Celsius. Puedes ver que también hay una K\naquí que significa kelvin. Esa es otra unidad de temperatura. De hecho, esa es la\nunidad estándar de temperatura. Y la forma de pasar de\ngrados Celsius a kelvin es simplemente sumar 273. Entonces, 20 más 273 son 293 kelvin. Para pasar de kelvin a grados\nCelsius, resta 273 y ahí lo tienes, ¿vale? Entonces, ¿cómo se ve el gráfico a temperaturas muy bajas? Bueno, resulta que el\ngráfico se ve así. Lo que se puede ver inmediatamente es que no todas las longitudes de onda\nobtienen la misma intensidad. De hecho, las longitudes de onda\naquí son cero y prácticamente cero. Técnicamente no es cero, pero a todos los\nefectos prácticos, es cero. Y esa es la razón por la que\nni siquiera puedes ver la luz visible que sale de aquí. Y es por eso que la mayoría de las cosas\na 20 grados Celsius, nada a 10-20 grados Celsius brilla porque no brillan\nen la luz invisible. Sin embargo, brillan en\nla región infrarroja y así es como se pueden detectar\ncon cámaras infrarrojas. Y una cosa característica\nque ven, la curva es que, debido a la curva, pueden ver que siempre habrá\nuna longitud de onda particular en la que obtendrá el valor máximo, obtendrá la intensidad máxima. Durante unos 20 grados Celsius, esto se encuentra en algún lugar de\nla larga región infrarroja. Bien, ahora solo\naumentemos la temperatura. Calentémoslo\nhasta 3000 kelvin. Nuevamente, para convertirlo a grados Celsius, simplemente resta 273, obtienes alrededor de 2700 y tantos,\ncierto, grados Celsius. Pero de todos modos, ¿cómo se\nve el gráfico ahora? Bueno, el gráfico se ve así.  (risas) Lo que encontramos ahora es que las\nintensidades son tan, tan altas que incluso puedo dibujarlas en la misma escala. Y eso tiene sentido. A temperaturas muy altas, la energía térmica es tan alta, los electrones se mueven\ncon energías tan altas, la radiación térmica\nsale con energías muy altas, por lo tanto, todas las\nlongitudes de onda de la luz ahora les darán\nenergías mucho más altas que antes. Y por tanto, las intensidades\nserán mucho mayores, por lo que no podemos dibujarlo en el mismo gráfico. Entonces vamos a alejarnos. Y una vez que nos alejemos, así\nes como se verá. Entonces, el gráfico anterior, pueden imaginar que está en algún lugar por aquí, muy bajo por aquí, no pueden verlo ahora en la misma escala. Pero ahora el gran cambio, ¿\nqué gran cambio vimos? Bueno, primero que nada, las intensidades son\nmucho más altas que antes. Pero el segundo gran\ncambio es que el pico, se puede ver que el pico fue\nantes por aquí en alguna parte. Ahora se ha desplazado hacia la izquierda. El pico, con 3.000 grados Kelvin, se encuentra\ntodavía en la región infrarroja. Pero debido a que todo el gráfico se ha desplazado, todo se ha desplazado hacia la izquierda, ahora\ntambién sale mucha luz visible. Puedes ver eso. Y por lo tanto, ahora\npodremos verlo brillar con nuestros ojos.  ¿De qué color se verá? Bueno, sale toda la luz, pero no con la misma intensidad.  Hay mucho brillo, mucha intensidad en\nla región rojiza-anaranjada y, por lo tanto, esta cosa\nbrillará rojiza y anaranjada. Entonces esto es lo que parece. Y ahora, si miras cosas\ncomo el filamento de la bombilla o el acero fundido, prácticamente a la misma temperatura, puedes ver que brillan del mismo color. También podemos entender otra cosa. Aunque el filamento\nme da ese color, me da luz visible.  ¿ Adónde va la mayor parte de la luz? La mayor parte de la luz que sale del filamento de la bombilla\nse encuentra en la región infrarroja. Aquí es donde sale la mayor parte de\nla luz. Y mire, la luz visible está aumentando, está saliendo un poco de energía.  Es por eso que una bombilla incandescente en realidad desperdicia mucha energía eléctrica porque la mayor parte simplemente se\napaga en la región infrarroja. Y por eso nos pasamos a las bombillas LED porque son mucho más eficientes. De todos modos, debido a que el mismo\nanálisis se puede aplicar a las estrellas, ahora podemos mirar algunas estrellas, una estrella que tiene un\ncolor similar, por ejemplo, un ejemplo de esa estrella es Betelgeuse que se puede ver desde la Tierra en la constelación de Orión.  ¿bueno? Tiene un color similar y por lo tanto, podemos decir que\nlas estrellas que son rojizas deben estar a una temperatura similar, deben estar a una temperatura más baja. Esto es relativamente bueno\ncuando se trata de estrellas. Muy bien, ahora aumentemos\nla temperatura aún más hasta unos 5.800 kelvin.  ¿ Cómo se ve el gráfico? Nuevamente, se verá mucho más alto que antes, así que tendré que alejarme. Y si hago eso, se\nverá así. La tendencia sigue siendo la misma, energías mucho más altas que antes. Ahora el gráfico anterior\nse ve así.  ¿Bueno? Y otra cosa, el pico también se ha\ndesplazado más hacia la izquierda.  Se ha vuelto aún más corto. Y ahora observen, el pico en realidad está en algún lugar de\nla luz visible, lo que significa que está en algún lugar\ncerca de la región verde. Entonces, alrededor de 5.800 kelvin, la luz visible está en realidad alcanzando su punto máximo.  ¿ Pero cómo se ve el color\n?  ¿Se vería verde? No, porque aunque sale mucha luz del verde, puedes ver que hay una\ncantidad considerable de rojo y azul y todos los colores están saliendo. Y como resultado, veremos un\ncolor blanco prácticamente brillante. Entonces, alrededor de 5.800 kelvin,\nveremos un brillo blanquecino. Y nuestro sol, por ejemplo, es blanco. No es amarillo. Se ve amarillo debido a la atmósfera. Pero si\nsalieras y miraras nuestro sol, en realidad se vería blanquecino.  ¿ Y adivina qué? A partir de eso, podemos decir que nuestro\nsol debe estar prácticamente a esta temperatura. Y resulta que está\na unos 5.800 kelvin de temperatura. Y de manera similar, otras estrellas, que son de color blanquecino, deben\nestar a temperatura similar. Y por cierto, muy rápidamente, cuando digo temperatura de la estrella o del sol, no me refiero a la\ntemperatura central de las estrellas. Podrían ser millones de kelvins.  ¿Bueno? Estamos hablando de la\ntemperatura cerca de la superficie exterior.  De eso es de lo que estamos hablando. Y eso, para el sol, es unos 5.800 kelvin. Haremos un último aumento de temperatura, incrementémoslo\nhasta aproximadamente 8.000 kelvin y veremos qué sucede. Bueno, si hacemos eso, ahora nuevamente obtendrás el gráfico, que es mucho más grande que antes. Así que tendré que\nalejarme nuevamente.  La misma historia. Y nuevamente, puedes ver la misma tendencia. Este es el gráfico anterior ahora, con mucha más energía que antes. Y la misma tendencia. Anteriormente, el pico estaba cerca de la luz verde en la región visible. Ahora, el pico estará en\nalgún lugar del ultravioleta, pero nuevamente,\ntodavía sale mucha luz visible. Y esta vez, observen, debido a que todo el gráfico se\nha desplazado hacia la izquierda, mucha más energía está llegando a\nla región violeta azulada. Y por eso a temperaturas muy altas\n, ¿adivinen qué? Brillará de un color violeta azulado. Y por lo tanto, si\nahora regresan a algunas estrellas que son de color azulado, por ejemplo, esta estrella que\nse llama Rigel, Rigel, no sé cómo se pronuncia, sea lo que sea. Pero de todos modos, es una estrella azulada, así que puedo decir que, oye, debe estar a una\ntemperatura mucho más alta. Debe estar alrededor de 8.000\ngrados o 9.000 grados, lo siento, 8.000 kelvin o una\ntemperatura mucho más alta. Y ahí lo tenemos. Incluso ahora podemos dibujar un\ngráfico de temperatura de color, que resume, ya sabes, qué color vemos\na diferentes temperaturas. Entonces, a temperaturas más bajas,\nes rojizo, anaranjado, y luego se vuelve blanco y luego comienza a tornarse\nhacia una región azulada. Esto no representa el valor máximo. Por ejemplo, en 5.800,\nel pico todavía está verde. Pero debido a que estamos viendo múltiples colores, así es como terminarán pareciéndose los colores ante nuestros ojos. Si es demasiado bajo,\nni siquiera podremos verlo porque la mayor parte estará\nsolo en la región infrarroja. Básicamente, así es como podemos\nobservar las diferentes estrellas, sus colores y descubrir\ncuál es su temperatura. Y cuando digo temperaturas, me refiero a la temperatura\nen las capas exteriores, ¿vale? Cuáles pueden ser esas temperaturas. Es una herramienta bastante importante\npara la astronomía.",
    "t_arabic": "- [المدرس]\nشاهد هذه الصورة الجميلة من تلسكوب هابل. إنها نجوم كثيرة\nبألوان مختلفة. لماذا لديهم ألوان مختلفة؟ حسنًا، اتضح أن النجوم ذات اللون المحمر أو البرتقالي هي في الواقع نجوم أكثر برودة نسبيًا. هم في درجات حرارة أقل. وتلك التي تكون بيضاء،\nمثل اللون الأبيض هنا، كما ترون، تصبح أكثر\nسخونة قليلاً.  وتبين أن تلك التي تكون مزرقة هي الأكثر سخونة هنا. لكن سؤالي هو كيف\nاكتشفنا ذلك؟ أعني، كيف يمكننا أن نجلس على الأرض ونقول، \"مرحبًا،\nالنجوم الحمراء يجب أن تكون أكثر برودة والنجوم الزرقاء يجب أن تكون أكثر سخونة.\" حسنًا، هذا لأننا درسنا\nإشعاع الجسم الأسود. ولكن ما هو هذا بالضبط وما علاقة الجسم الأسود\nبهذه النجوم؟ حسنا، دعونا معرفة ذلك. لنبدأ بما هي الأجسام السوداء ولماذا يجب أن نهتم بها؟ من أجل ذلك، دعونا نحتفظ\nبتفاحة بالخارج في يوم مشمس في وضح النهار، حتى تسقط عليها أشعة الشمس. تذكر أن ضوء الشمس هو ضوء أبيض، وهو يتكون من جميع\nألوان قوس قزح. والسؤال المطروح علينا الآن هو\nماذا يحدث للضوء بمجرد سقوطه على التفاحة؟ حسنًا، ينعكس بعض الضوء، وأغلبه باللون الأحمر، ولهذا السبب نرى\nالتفاحة ذات لون أحمر. ولكن ماذا يحدث\nلبقية الألوان؟ حسنًا، لقد تم استيعابهم. وما نعنيه بالامتصاص هو أن نتذكر أن الضوء\nعبارة عن موجة كهرومغناطيسية، تحتوي على مجالات كهربائية\nومجالات مغناطيسية أيضًا، لكننا لم نعرض\nالمجالات المغناطيسية المتذبذبة. لكن هذه هي\nالمجالات الكهربائية المتذبذبة. لكن بمجرد سقوطها على\nالتفاحة، فإن المجالات الكهربائية ستجعل الإلكترونات تهتز. ونتيجة لذلك، لاحظ أن الطاقة الصادرة عن\nالموجة الكهرومغناطيسية تنتقل إلى\nالطاقة المتذبذبة للإلكترونات. وهذه هي الطريقة التي يتم بها تحويل الطاقة الصادرة\nمن الموجة الكهرومغناطيسية إلى\nحركة اهتزازية للإلكترونات أو طاقة حرارية للإلكترونات. ونتيجة لذلك، سترتفع درجة حرارة\nالتفاحة. لكن انتظر ثانية، انتظر ثانية. إذا كان الأمر كذلك، فإذا قمت\nبتسليط الضوء بشكل مستمر على التفاحة، فيجب أن ترتفع درجة حرارتها\nباستمرار. ولكن هذا لا يحدث،\nأليس كذلك؟  لماذا لا يحدث ذلك؟ حسنًا، هذا لأنه عندما\nتهتز الإلكترونات، فإنها ستنتج\nموجات كهرومغناطيسية خاصة بها. تذكر أن أي شحنة متسارعة ستنتج موجات كهرومغناطيسية، وبالتالي فإن الإلكترونات المتذبذبة ستنتج\nموجات كهرومغناطيسية خاصة بها. ونحن نسمي هذه\nالموجات الكهرومغناطيسية بالإشعاع الحراري لأن هذا الإشعاع يأتي من الحركة الحرارية للإلكترونات، وبسبب الإشعاع الحراري، فإنه يفقد الطاقة. وحتى تتمكن من رؤية ما يحدث. إنها تمتص الطاقة من ضوء الشمس، ولكنها تفقد\nالطاقة أيضًا بنفس المعدل من الإشعاع الحراري. ويتحقق التوازن، ونقول أن هذه التفاحة\nستكون في حالة توازن حراري، أي أن طاقتها\nلن تزيد ولا تنقص، فدرجة حرارتها ستبقى كما هي. كل الأشياء التي تراها من حولك، شيء مشابه جدًا يحدث، وهو التوازن الحراري وجميعها\nتصدر إشعاعًا حراريًا. ربما تتساءل لماذا\nلا نستطيع رؤية الإشعاع الحراري، فكما سنرى بعد قليل، معظم هذا الإشعاع الحراري\nيقع في منطقة الأشعة تحت الحمراء، وليس في المنطقة المرئية. لهذا السبب لا نستطيع رؤيته. لهذا السبب فإن ما تراه في معظم الحالات هو مجرد الضوء المنعكس، حسنًا؟ ولكن هذا هو الشيء، الضوء الذي يأتي من\nالنجم، خمن ماذا؟ إنه أيضًا إشعاع حراري. إنه قادم بسبب\nدرجة حرارة النجم. مثال آخر هو الضوء الذي يأتي من فتيل المصباح. وهذا أيضًا إشعاع حراري. إنه يأتي بسبب\nدرجة حرارة الفتيل، بسبب\nالحركة الحرارية للإلكترونات داخل فتيل المصباح، مما يعني أنه لتحليل النجوم، أحتاج إلى تحليل الإشعاعات الحرارية القادمة من الأجسام. لكن الضوء المنعكس يمثل مشكلة. لذلك أريد فقط تحليل الأشياء التي لا تعكس أي ضوء. أي نوع من الأشياء\nتلك؟  أوه، أوه، الأشياء السوداء. إذا قمت بطلاء هذه التفاحة باللون الأسود، فإن سبب ظهورها باللون الأسود هو أنها لا تعكس أي ضوء. سوف يمتص كل الضوء\nالساقط عليه. وهذا أحد الأسباب التي تجعلك ترتدي\nملابس سوداء في يوم مشمس حار، حيث يصبح الجو أكثر دفئًا لأنه لا يعكس أي ضوء. إنه يمتص كل ذلك. الآن، بالطبع، إذا لم يمتص\nاللون بالكامل، فهو يعكس قليلاً. ولهذا السبب لا يزال بإمكانك\nرؤية بعض الميزات. لا يزال بإمكانك رؤية بعض الانعكاس لذلك، لكنك تفهم النقطة، أليس كذلك؟ إذا كان هذا مثاليًا باللون الأسود تمامًا، فلن يعكس أي ضوء، وسيكون الضوء الوحيد\nالذي يمكنني الحصول عليه منه هو الإشعاع الحراري. ولهذا السبب نحب تحليل الأجسام السوداء لأنها تعطي إشعاعًا حراريًا فقط. ولذلك، يسمى هذا الإشعاع أيضًا إشعاع الجسم الأسود. وأنت تعرف ما هو الشيء الرائع في إشعاع الجسم الأسود، فهو الطيف، أي الألوان،\nوالألوان المختلفة التي تخرج والسطوع الذي \nتخرج منه كل الألوان المختلفة، كل هذه التفاصيل، تعتمد فقط على\nدرجة حرارة الجسم.  الجسم الأسود. فهو لا يعتمد، على سبيل المثال، على نوع\nالضوء الذي سيسلط عليه أو لا يعتمد، على سبيل المثال، على المادة المصنوعة منها. لا شيء من هذا يهم. خصائص\nالإشعاع الحراري للجسم الأسود تعتمد فقط على\nدرجة حرارته، وهو أمر رائع لأن هذا يعني أنه\nيمكنني الآن تطبيقه على النجوم. النجوم أيضًا متشابهة جدًا. إنهم يصدرون أيضًا\nإشعاعًا حراريًا فقط، لذا يمكنني تطبيقه على النجوم، وهذا ما سنفعله الآن. سنقوم بتحليل الإشعاع الحراري الذي يأتي من هذه التفاحة بشكل غير صحيح لأنني أريد\nزيادة درجة الحرارة هذه وسوف تحترق هذه التفاحة. لكن ربما سنأخذ بعض المعدن، سنأخذ بعض المعدن الأسود، وسنغير درجة حرارته، وسنقوم بتحليل إشعاع الجسم الأسود هذا، ومن ثم يمكننا الآن تطبيقه على النجوم. لذلك دعونا نحلل\nالإشعاع الحراري القادم من صندوق معدني حتى نتمكن من زيادة\nدرجة حرارته إلى قيم عالية جدًا وعلى الأرجح لن يذوب. وكيف تقوم بتحليلها؟ حسنًا، يمكننا فقط، كما\nتعلمون، إيجاد الطيف باستخدام محزوز الحيود أو المنشور الذي يقسم كل الألوان. وبالطبع، نظرًا لوجود\nضوء قادم أيضًا في المنطقة غير المرئية، نحتاج أيضًا إلى بعض أجهزة الكشف عن ذلك. لكن لا تقلق كثيرًا\nبشأن التطبيق العملي. لنفترض أننا جميعا نفعل ذلك. بمجرد أن نفعل ذلك، سنرسم رسمًا بيانيًا، حسنًا؟ على المحور السيني، سنرسم\nالأطوال الموجية المختلفة. إذًا يمكنك أن ترى، على سبيل المثال، هذه\nأطوال موجية طويلة جدًا، وهي تقع في منطقة الأشعة تحت الحمراء، والتي قد تصل حتى إلى الموجات الميكروية، ويمكن أيضًا أن تنتقل إلى موجات الراديو، وهنا الضوء المرئي. إذن لديك الجزء الأحمر من الطيف. وبعد ذلك عندما\nيصبح هذا الطول الموجي أصغر، يصبح لديك الجزء البنفسجي من الطيف، ثم في النهاية،\nيصبح، مرة أخرى، غير مرئي، وتنتقل إلى الأشعة فوق البنفسجية. إذن هذا هو الطول الموجي. وعلى المحور الصادي، نريد أن نرسم\nشدة الضوء التي يخرج بالقرب من كل من هذه الأطوال الموجية. وهكذا على المحور الصادي، سنرسم الكثافة.  من الناحية الفنية، تمثل الكثافة كمية\nالطاقة الإشعاعية الصادرة في الثانية لكل متر مربع من مساحة هذا الصندوق. وبهذه الطريقة، لا أهتم\nبحجم الصندوق. أنا فقط أكتشف، سأكتب فقط مقدار الطاقة التي يطلقها كل متر مربع\nفي الثانية. هذا ما سنرسمه هنا. لكن من الناحية الفنية، يمكنك أن\nترى أن الأمر لا يتعلق بالشدة فحسب، بل بالكثافة لكل ميكرومتر، وهو ما يعني الكثافة لكل طول موجي. هذا هو في الأساس ما نتحدث عنه. بالنسبة لكل طول موجي قريب من تلك المنطقة، ما شدة\nالضوء الخارج؟ وهذا هو سبب شدتها لكل ميكرومتر. لكن لأغراضنا، يمكنك اعتبار ذلك سطوعًا بالقرب من كل من هذه الأطوال الموجية. فلنبدأ الآن، ولنبدأ بدرجات حرارة منخفضة جدًا، حوالي 20 درجة مئوية. يمكنك أن ترى أن هناك أيضًا حرف K\nهنا والذي يرمز إلى كلفن. وهذه وحدة أخرى لدرجة الحرارة. في الواقع، هذه هي\nالوحدة القياسية لدرجة الحرارة. وكيفية الانتقال من\nالدرجة المئوية إلى كلفن هي أن تضيف فقط 273. إذن، 20 زائد 273 يساوي 293 كلفن. للانتقال من كلفن إلى الدرجة\nالمئوية، اطرح 273، وها هو ذا، حسنًا؟ إذًا، كيف يبدو الرسم البياني عند درجات حرارة منخفضة جدًا؟ حسنًا، اتضح أن\nالرسم البياني يبدو بهذا الشكل. ما يمكنك رؤيته على الفور هو أنه ليست كل الأطوال الموجية\nلها نفس الشدة. في الواقع، الأطوال الموجية\nهنا تصبح صفرًا، بل وتساوي صفرًا تقريبًا. إنها ليست صفرًا من الناحية الفنية، ولكنها\nصفر لجميع الأغراض العملية. وهذا هو السبب وراء\nعدم قدرتك حتى على رؤية الضوء المرئي يخرج من هنا.  ولهذا السبب فإن معظم الأشياء\nعند درجة حرارة 20 درجة مئوية، لا شيء يتوهج عند درجة حرارة 10-20 درجة مئوية لأنها لا تتوهج\nفي الضوء غير المرئي. ومع ذلك، فهي تتوهج في\nمنطقة الأشعة تحت الحمراء، وهذه هي الطريقة التي يمكنك من خلالها\nاكتشافها باستخدام كاميرات الأشعة تحت الحمراء. والشيء المميز\nالذي ترونه هو المنحنى، لأنه بسبب المنحنى، يمكنك أن ترى أنه سيكون هناك دائمًا\nطول موجي معين ستحصل عنده على قيمة الذروة، وتحصل على الحد الأقصى للكثافة. بالنسبة لحوالي 20 درجة مئوية، يحدث ذلك في مكان ما\nفي منطقة الأشعة تحت الحمراء الطويلة. حسنًا، الآن دعونا\nنرفع درجة الحرارة. دعونا نقوم بتسخينه\nحتى درجة حرارة 3000 كلفن. مرة أخرى، لتحويلها إلى درجات مئوية، فقط اطرح 273، وستحصل على حوالي 2700\nدرجة مئوية. لكن على أية حال، كيف\nيبدو الرسم البياني الآن؟ حسنًا، الرسم البياني يبدو هكذا.  (يضحك) ما نجده الآن هو أن\nالشدة عالية جدًا لدرجة أنني أستطيع رسمها بنفس المقياس. وهذا النوع من المنطقي. في درجات الحرارة المرتفعة جدًا، تكون الطاقة الحرارية عالية جدًا، وتهتز الإلكترونات بهذه\nالطاقات العالية، ويخرج الإشعاع الحراري بطاقة\nعالية جدًا، وبالتالي، فإن جميع\nالأطوال الموجية للضوء الآن ستمنحك\nطاقات أعلى بكثير من ذي قبل. وبالتالي فإن الشدة\nستكون أعلى بكثير، لذا لا يمكننا رسمها في نفس الرسم البياني. لذلك سنقوم بالتصغير. وبمجرد تصغير الصورة، هذا\nما سيبدو عليه. لذا فإن الرسم البياني السابق، يمكنك أن تتخيل أنه في مكان ما هنا، منخفض جدًا هنا، ولا يمكنك رؤيته الآن بنفس المقياس. ولكن الآن التغيير الكبير،\nما هو التغيير الكبير الذي رأيناه؟ حسنًا، أولاً وقبل كل شيء، أصبحت الشدة\nأعلى بكثير من ذي قبل. لكن التغيير الكبير الثاني\nهو أن الذروة، كما ترون، كانت في\nوقت سابق هنا في مكان ما. والآن تحولت إلى اليسار. عند 3000 كلفن،\nلا تزال الذروة في منطقة الأشعة تحت الحمراء. ولكن نظرًا لأن الرسم البياني بأكمله قد تحول، فقد تحول كل شيء إلى اليسار، والآن\nيخرج أيضًا الكثير من الضوء المرئي. يمكنك مشاهدة هذا. وبالتالي، سنكون الآن\nقادرين على رؤيته يتوهج بأعيننا. ما اللون سوف تبدو وكأنها؟ حسنًا، كل الضوء يخرج، لكن ليس بنفس الشدة.  يوجد الكثير من السطوع والكثير من الشدة في\nالمنطقة البرتقالية الحمراء، وبالتالي، سيتوهج هذا الشيء\nباللون الأحمر والبرتقالي. إذن هذا هو الشكل الذي يبدو عليه الأمر. والآن إذا نظرت إلى أشياء\nمثل فتيل المصباح أو الفولاذ المنصهر، تقريبًا عند نفس درجة الحرارة، يمكنك أن ترى أنها تتوهج بنفس اللون. يمكننا أيضًا أن نفهم شيئًا آخر. على الرغم من أن الخيوط\nتمنحني ذلك اللون، إلا أنها تمنحني ضوءًا مرئيًا. أين يذهب معظم الضوء؟  يقع معظم الضوء الخارج من فتيل المصباح\nفي منطقة الأشعة تحت الحمراء. هذا هو المكان الذي\nيخرج فيه معظم الضوء. وانظروا، الضوء المرئي يتضاءل، والقليل من الطاقة يخرج. لهذا السبب تهدر اللمبة المتوهجة الكثير من الطاقة الكهربائية لأن معظمها\nينطفئ في منطقة الأشعة تحت الحمراء. ولهذا السبب نتحول إلى مصابيح LED لأنها أكثر كفاءة. على أي حال، لأن نفس\nالتحليل يمكن أن ينطبق على النجوم، الآن يمكننا أن ننظر إلى بعض النجوم، نجم له\nلون مماثل، على سبيل المثال، أحد الأمثلة على هذا النجم هو منكب الجوزاء الذي يمكنك رؤيته من الأرض في كوكبة أوريون،  تمام؟ لها لون مماثل، وبالتالي يمكننا القول أن\nالنجوم ذات اللون الأحمر يجب أن تكون في درجة حرارة مماثلة، ويجب أن تكون في درجة حرارة أقل. هذا رائع نسبيًا\nعندما يتعلق الأمر بالنجوم. حسنًا، الآن دعونا نرفع\nدرجة الحرارة أكثر إلى حوالي 5800 كلفن. كيف يبدو الرسم البياني؟ مرة أخرى، سيبدو أعلى بكثير من ذي قبل، لذا سأضطر إلى التصغير. وإذا فعلت ذلك،\nفسيبدو هكذا. إنه الاتجاه يبقى كما هو، طاقات أعلى بكثير من ذي قبل. الآن يبدو الرسم البياني السابق\nهكذا.  تمام؟ والأمر الآخر هو أن القمة قد\nانتقلت أيضًا نحو اليسار. لقد أصبح أقصر. والآن لاحظوا أن القمة تقع في مكان ما\nفي الضوء المرئي، مما يعني أنها في مكان ما\nبالقرب من المنطقة الخضراء. إذن، عند درجة حرارة 5800 كلفن تقريبًا، يصل الضوء المرئي إلى ذروته بالفعل. ولكن كيف يبدو اللون\n؟  هل ستبدو خضراء؟ لا، لأنه على الرغم من أن الكثير من الضوء يخرج من اللون الأخضر، يمكنك أن ترى أن هناك\nقدرًا كبيرًا من اللون الأحمر والأزرق وكل الألوان تخرج. ونتيجة لذلك، سنرى أن\nاللون الأبيض متوهج إلى حد كبير. إذن، عند درجة حرارة 5800 كلفن تقريبًا،\nسنرى توهجًا أبيض اللون. وشمسنا، على سبيل المثال، بيضاء. انها ليست صفراء. يبدو أصفر بسبب الغلاف الجوي. لكن إذا\nخرجت ونظرت إلى شمسنا، فستبدو في الواقع بيضاء اللون. وتخيل ماذا؟ ومن ذلك يمكننا القول أن\nشمسنا يجب أن تكون بدرجة الحرارة هذه تقريبًا. وتبين أن\nدرجة الحرارة تبلغ حوالي 5800 كلفن. وكذلك النجوم الأخرى ذات اللون الأبيض يجب أن\nتكون على درجة حرارة مماثلة. وبالمناسبة، بسرعة كبيرة، عندما أقول درجة حرارة النجم أو الشمس، فأنا لا أتحدث عن\nدرجة الحرارة الأساسية للنجوم. يمكن أن يكون ذلك ملايين كلفن.  تمام؟ نحن نتحدث عن\nدرجة الحرارة بالقرب من السطح الخارجي. هذا ما نتحدث عنه. وهذه الحرارة بالنسبة للشمس تبلغ حوالي 5800 كلفن. سنجري زيادة أخيرة في درجة الحرارة، لنرفعها بالكامل\nإلى حوالي 8000 كلفن ونرى ما سيحدث. حسنًا، إذا فعلنا ذلك، الآن مرة أخرى، سوف تحصل على الرسم البياني، وهو أكبر بكثير من ذي قبل. لذلك سأضطر مرة أخرى إلى\nالتصغير.  نفس القصة. ومرة أخرى، يمكنك أن ترى نفس الاتجاه. إذن هذا هو الرسم البياني السابق الآن، طاقة أعلى بكثير من ذي قبل. ونفس الاتجاه. وفي وقت سابق، كانت الذروة قريبة من الضوء الأخضر في المنطقة المرئية. الآن، ستكون الذروة في\nمكان ما في الأشعة فوق البنفسجية، ولكن مرة أخرى، لا يزال هناك الكثير من\nالضوء المرئي يخرج. وهذه المرة، لاحظ، نظرًا لأن الرسم البياني بأكمله\nقد تحول إلى اليسار، فإن المزيد من الطاقة تأتي في\nالمنطقة البنفسجية المزرقة. ولهذا السبب في\nدرجات حرارة عالية جدًا، خمن ماذا؟ سوف يتوهج باللون البنفسجي المزرق. وبالتالي، إذا\nرجعت الآن إلى بعض النجوم التي يكون لونها مزرق، على سبيل المثال، هذا النجم\nالمسمى ريجل، ريجل، لا أعرف كيف تنطقه، مهما كان. لكن على أية حال، إنه نجم مزرق، لذا أستطيع أن أقول إنه لا بد أن يكون في\nدرجة حرارة أعلى بكثير. يجب أن تكون حوالي 8000\nدرجة أو 9000 درجة، آسف، 8000 كلفن أو\nدرجة حرارة أعلى بكثير. ويوجد لدينا ذلك. يمكننا حتى الآن رسم\nرسم بياني لدرجة حرارة اللون، والذي يلخص، كما تعلمون، اللون الذي نراه\nفي درجات حرارة مختلفة. لذلك عند درجات الحرارة المنخفضة،\nيكون لونه محمرًا وبرتقاليًا، وبعد ذلك سيتحول إلى اللون الأبيض، وبعد ذلك سيبدأ بالتوجه\nنحو المنطقة الزرقاء. وهذا لا يمثل قيمة الذروة. على سبيل المثال، عند 5800،\nتظل القمة خضراء. ولكن لأننا نرى ألوانًا متعددة، فهذا هو الشكل الذي ستبدو عليه الألوان في نهاية المطاف لأعيننا. إذا كان منخفضًا جدًا، فلن\nنتمكن حتى من رؤيته لأن معظمه سيكون\nفقط في منطقة الأشعة تحت الحمراء. هذه هي الطريقة التي يمكننا من خلالها\nالنظر إلى النجوم المختلفة وألوانها ومعرفة\nدرجة حرارتها. وعندما أقول درجات الحرارة، فأنا أتحدث عن درجة الحرارة\nفي الطبقات الخارجية، حسنًا؟ ما يمكن أن تكون درجات الحرارة تلك. إنها أداة مهمة جدًا\nلعلم الفلك.",
    "t_italian": "- [Istruttore]\nGuarda questa bellissima foto dal telescopio Hubble.  Ci sono così tante stelle con\ncosì tanti colori diversi. Perché hanno colori diversi? Ebbene, si scopre che quelle che sono rossastre o arancioni sono in realtà stelle relativamente più fredde. Sono a temperature più basse. E quelli che sono biancastri,\ncome il colore bianco qui, potete vedere,\nrisultano leggermente più caldi. E quelli bluastri risultano essere i più caldi da queste parti. Ma la mia domanda è: come\nabbiamo fatto a capirlo? Voglio dire, come possiamo sederci sulla terra e dire: \"Ehi, le\nstelle rosse devono essere più fresche e le stelle blu devono essere più calde\". Beh, è ​​perché abbiamo studiato\nla radiazione del corpo nero. Ma cos'è esattamente questo e cosa c'entra il corpo nero\ncon queste stelle? Bene, scopriamolo. Cominciamo con cosa sono i corpi neri e perché dovremmo preoccuparci di loro? Per questo, teniamo una\nmela all'aperto in una giornata soleggiata in pieno giorno, in modo che ci sia la luce del sole che cade su di essa. Ricorda che la luce del sole è luce bianca, composta da tutti\ni colori dell'arcobaleno. La domanda per noi ora è:\ncosa succede alla luce una volta che cade sulla mela? Bene, parte della luce viene riflessa, gran parte è di colore rosso, ed è per questo che vediamo che la\nmela è di colore rosso. Ma cosa succede al\nresto dei colori? Bene, vengono assorbiti. E ciò che intendiamo per essere assorbiti è ricordare che la luce\nè un'onda elettromagnetica, che contiene anche campi elettrici\ne campi magnetici, ma non abbiamo mostrato i\ncampi magnetici oscillanti. Ma questi sono i\ncampi elettrici oscillanti. Ma una volta caduti sulla\nmela, i campi elettrici faranno tremare gli elettroni. Di conseguenza, notate che l'energia\ndell'onda elettromagnetica entra nell'energia tremolante\ndegli elettroni. Ed è così che l'energia\ndell'onda elettromagnetica viene convertita nel\nmovimento oscillante degli elettroni o nell'energia termica degli elettroni. E di conseguenza, la temperatura della\nmela aumenterebbe. Ma aspetta un secondo, aspetta un secondo. Se così fosse, se si\nillumina continuamente la mela, la sua temperatura dovrebbe\naumentare continuamente. Ma ciò non accade,\ngiusto?  Perché ciò non accade? Beh, questo perché mentre\ngli elettroni si muovono, producono le\nproprie onde elettromagnetiche. Ricorda, qualsiasi carica accelerata produrrà onde elettromagnetiche e quindi gli elettroni oscillanti produrranno le proprie\nonde elettromagnetiche. E chiamiamo queste\nonde elettromagnetiche radiazione termica perché quella radiazione proviene dal movimento termico degli elettroni e, a causa della radiazione termica, perde energia. E così puoi vedere cosa sta succedendo. Assorbe energia dalla luce solare, ma perde\nenergia allo stesso ritmo anche dalla radiazione termica. E un equilibrio viene raggiunto, e diciamo che questa mela\nsarà all'equilibrio termico, il che significa che la sua energia\nnon aumenterà né diminuirà, quindi la sua temperatura rimarrà la stessa.  In tutti gli oggetti che vedi intorno a te, sta accadendo qualcosa di molto simile, è l'equilibrio termico e tutti\nemettono radiazione termica. Forse ti starai chiedendo perché\nnon possiamo vedere la radiazione termica, come vedremo tra poco, la maggior parte di questa radiazione termica\nsi trova nella regione dell'infrarosso, non nella regione visibile. Ecco perché non possiamo vederlo. Ecco perché quello che vedi nella maggior parte dei casi è solo la luce riflessa, ok? Ma ecco il punto, la luce che proviene dalla\nstella, indovina un po'? È anche radiazione termica.  Sta arrivando a causa della\ntemperatura della stella. Un altro esempio è la luce che proviene dal filamento della lampadina. Anche questa è radiazione termica. Viene a causa della\ntemperatura del filamento, a causa del\nmovimento termico degli elettroni all'interno del filamento della lampadina, il che significa che per analizzare le stelle ho bisogno di analizzare le radiazioni termiche provenienti dagli oggetti. Ma la luce riflessa è un problema. Quindi voglio analizzare solo oggetti che non riflettono la luce. Che tipo di oggetti sono\nquelli?  Ooh, ooh, oggetti neri. Se dipingo questa mela di nero, il motivo per cui sembra nera è perché non riflette la luce. Assorbirà tutta la luce\nche gli incide. Questo è uno dei motivi per cui se indossi\nabiti neri in una calda giornata soleggiata, diventa molto più caldo perché non riflette la luce.  Lo assorbe tutto. Ora, se, ovviamente, non assorbe\ncompletamente tutto il colore, ne riflette un po'. Ecco perché puoi\nancora vedere alcune funzionalità. Puoi ancora vederne qualche riflesso, ma hai capito il punto, giusto? Se idealmente fosse perfettamente nero, allora non rifletterebbe alcuna luce, e quindi l'unica luce\nche potrei ottenere da esso sarebbe la radiazione termica. Ecco perché amiamo analizzare i corpi neri perché danno solo radiazione termica. E quindi questa radiazione è anche chiamata radiazione del corpo nero. E sapete qual è la cosa bella della radiazione del corpo nero, il suo spettro, ovvero i colori, i\ndiversi colori che escono e la luminosità con cui escono tutti i\ndiversi colori, tutti questi dettagli, dipende solo dalla\ntemperatura del  il corpo nero. Non dipende, ad esempio, da quale\nluce lo illuminerà o non dipende, ad esempio, dal materiale di cui è fatto. Niente di tutto ciò ha importanza. Le caratteristiche della\nradiazione termica di un corpo nero dipendono solo dalla sua\ntemperatura, il che è fantastico perché significa che ora\nposso applicarlo alle stelle. Anche le stelle sono molto simili. Emettono solo\nradiazione termica, quindi posso applicarla alle stelle, ed è quello che faremo ora. Analizzeremo la radiazione termica che proviene non propriamente da questa mela perché voglio\naumentare questa temperatura e questa mela brucerebbe. Ma forse prenderemo del metallo, prenderemo del metallo nero, cambieremo la sua temperatura, analizzeremo questa radiazione del corpo nero e poi potremo applicarla alle stelle. Analizziamo allora la\nradiazione termica proveniente da una scatola metallica in modo da poter aumentare la sua\ntemperatura a valori molto elevati e probabilmente non si scioglierebbe. E come lo analizzi? Beh, possiamo semplicemente\ntrovare lo spettro usando un reticolo di diffrazione o un prisma che divide tutti i colori. E naturalmente, poiché\nc'è anche luce che arriva nella regione invisibile, abbiamo bisogno anche di rilevatori. Ma non preoccuparti troppo\ndella praticità. Diciamo che lo facciamo tutti. Fatto questo, disegniamo un grafico, ok? Sull'asse x tracceremo\nle diverse lunghezze d'onda. Potete vedere, ad esempio, che queste sono\nlunghezze d'onda molto lunghe, che sono nella regione degli infrarossi, che potrebbero anche entrare nelle microonde, possono anche entrare nelle onde radio, e poi ecco la luce visibile. Quindi hai la parte rossa dello spettro. E poi quando la\nlunghezza d'onda si riduce, si ha la parte viola dello spettro, e poi alla fine\ndiventa, di nuovo, invisibile, si va nell'ultravioletto. Quindi questa è la lunghezza d'onda. E sull'asse y vogliamo tracciare con quale\nintensità la luce esce vicino a ciascuna di queste lunghezze d'onda. E quindi sull'asse y tracceremo l'intensità. Tecnicamente, l'intensità rappresenta la quantità di\nenergia radiante che esce al secondo per metro quadrato di area di questa scatola. Quindi in questo modo non mi interessa\nla dimensione della scatola. Sto solo cercando di capire, scriverò solo quanta energia emette ogni metro quadrato\nal secondo.  E' quello che complotteremo qui. Ma tecnicamente, potete\nvedere che non si tratta solo di intensità, ma di intensità per micrometro, che significa intensità per lunghezza d'onda. Questo è fondamentalmente ciò di cui stiamo parlando. Per ogni lunghezza d'onda vicina a quella regione, qual è l'intensità della\nluce che esce? Ecco perché è l'intensità per micrometro. Ma per i nostri scopi, possiamo considerarla semplicemente come la luminosità vicino a ciascuna di queste lunghezze d'onda. Quindi cominciamo adesso, e cominciamo a temperature molto basse, circa 20 gradi Celsius. Puoi vedere che qui c'è anche una K\nche sta per Kelvin. Questa è un'altra unità di temperatura. In effetti, questa è l'\nunità standard di temperatura. E per passare da\ngradi Celsius a Kelvin basta aggiungere 273. Quindi 20 più 273 fa 293 Kelvin. Per passare da Kelvin a gradi\nCelsius, sottrai 273 ed ecco fatto, ok? Allora come appare il grafico a temperature molto basse? Bene, a quanto pare il\ngrafico assomiglia a questo. Ciò che puoi immediatamente vedere è che non tutte le lunghezze d'onda\nottengono la stessa intensità. In effetti, le lunghezze d'onda\nqui diventano zero, praticamente zero. Tecnicamente non è zero, ma a tutti\ngli effetti pratici è zero. Ed è per questo che da qui\nnon si vede nemmeno la luce visibile . Ed è per questo che la maggior parte delle cose\na 20 gradi Celsius, niente a 10-20 gradi Celsius si illumina perché non brillano\nnella luce invisibile. Si illuminano invece nella\nregione degli infrarossi ed è così che è possibile\nrilevarli con le telecamere a infrarossi. E una cosa caratteristica\nche vedete, la curva è che, grazie alla curva, potete vedere che ci sarà sempre\nuna particolare lunghezza d'onda alla quale otterrete il valore di picco, otterrete l'intensità massima. Per circa 20 gradi Celsius, sembra che si trovi da qualche parte\nnella lunga regione dell'infrarosso. Ok, ora\naumentiamo la temperatura. Riscaldiamolo\nfino a 3000 Kelvin. Ancora una volta, per convertirlo in gradi Celsius, basta sottrarre 273, si ottengono circa 2.700 qualcosa,\ngiusto, gradi Celsius. Ma comunque, come\nappare il grafico adesso? Bene, il grafico assomiglia a questo.  (ride) Ciò che ora scopriamo è che le\nintensità sono così, così alte che posso persino disegnarle nella stessa scala. E questo ha senso. A temperature molto elevate, l'energia termica è così alta, gli elettroni si muovono\ncon energie così elevate, la radiazione termica\nesce con energie molto elevate, quindi tutte le\nlunghezze d'onda della luce ora ti daranno\nenergie molto più elevate di prima. Pertanto, le intensità\nsaranno molto più elevate, quindi non possiamo disegnarle nello stesso grafico. Quindi rimpiccioliremo. E una volta rimpiccioliti,\necco come apparirà. Quindi il grafico precedente, potete immaginare che sia da qualche parte qui, molto basso qui, non potete vederlo ora nella stessa scala. Ma ora il grande cambiamento,\nquale grande cambiamento abbiamo visto? Ebbene, prima di tutto, le intensità sono\nmolto più elevate rispetto a prima. Ma il secondo grande\ncambiamento è che il picco, potete vedere che il picco era\nprima qui da qualche parte. Ora si è spostato a sinistra. A 3000 Kelvin il picco è\nancora nella regione degli infrarossi. Ma poiché l'intero grafico si è spostato, tutto si è spostato a sinistra, ora\nesce anche molta luce visibile. Potete vederlo. E quindi ora\npotremo effettivamente vederlo brillare con i nostri occhi.  Di che colore sarà? Ebbene, la luce esce tutta, ma non con la stessa intensità. Molta luminosità, molta intensità è\nnella regione rossastro-arancione e quindi questa cosa\nbrillerà rossastra e arancione. Ecco come appare. E ora se guardate cose\ncome il filamento della lampadina o l'acciaio fuso, più o meno alla stessa temperatura, potete vedere che brillano dello stesso colore. Possiamo capire anche un'altra cosa. Anche se il filamento\nmi dà quel colore, mi dà luce visibile. Dove va la maggior parte della luce? La maggior parte della luce che esce dal filamento della lampadina\nsi trova nella regione degli infrarossi. È da qui che esce la maggior parte\ndella luce. E guardate, la luce visibile sta diventando, un po' di energia sta uscendo. Ecco perché una lampadina a incandescenza spreca molta energia elettrica perché la maggior parte si\nspegne nella regione degli infrarossi. Ed è per questo che passiamo alle lampadine LED perché sono molto più efficienti. Comunque, poiché la stessa\nanalisi può applicarsi alle stelle, ora possiamo guardare alcune stelle, una stella che ha un\ncolore simile, ad esempio, un esempio di quella stella è Betelgeuse che puoi vedere dalla Terra nella costellazione di Orione,  Va bene? Ha un colore simile e quindi, possiamo dire che\nle stelle che sono rossastre devono essere a temperatura simile, devono essere a temperatura inferiore. Questo è relativamente interessante\nquando si tratta di stelle. Va bene, ora aumentiamo\nancora di più la temperatura a circa 5.800 Kelvin. Come appare il grafico? Ancora una volta, sembrerà molto più alto di prima, quindi dovrò rimpicciolire. E se lo faccio,\nsembrerà così. La tendenza rimane la stessa, energie molto più elevate rispetto a prima. Ora il grafico precedente\nappare così.  Va bene? E inoltre il picco si è\nspostato più a sinistra.  È diventato ancora più breve. E ora notate, il picco in realtà è da qualche parte\nnella luce visibile, il che significa che è da qualche parte\nvicino alla regione verde. Quindi a circa 5.800 Kelvin la luce visibile raggiunge effettivamente il picco. Ma che aspetto ha il colore\n?  Sembrerebbe verde? No, perché anche se dal verde esce molta luce, puoi vedere che c'è una notevole\nquantità di rosso e blu e escono tutti i colori. E come risultato, in realtà vedremo un\nbianco brillante. Quindi a circa 5.800 Kelvin\nvedremo un bagliore biancastro. E il nostro sole, ad esempio, è bianco. Non è giallo. Sembra giallo a causa dell'atmosfera. Ma se\nuscissi e guardassi il nostro sole, in realtà sembrerebbe quasi biancastro. E indovina cosa? Da ciò, possiamo dire che il nostro\nsole deve essere più o meno a questa temperatura. E risulta che la\ntemperatura sia di circa 5.800 Kelvin. E allo stesso modo, altre stelle di colore biancastro devono\navere una temperatura simile. E comunque, molto velocemente, quando dico temperatura della stella o del sole, non sto parlando della\ntemperatura interna delle stelle. Potrebbero essere milioni di Kelvin.  Va bene? Stiamo parlando della\ntemperatura vicino alla superficie esterna. Questo è ciò di cui stiamo parlando. E questo, per il sole, è di circa 5.800 Kelvin. Faremo un ultimo aumento della temperatura, aumentiamolo\nfino a circa 8.000 Kelvin e vediamo cosa succede. Bene, se lo facciamo, anche adesso, otterremo il grafico, che è molto più grande di prima. Quindi dovrò\nrimpicciolire di nuovo.  Stessa storia. E ancora, puoi vedere la stessa tendenza. Quindi questo è il grafico precedente ora, con un'energia molto più alta di prima. E la stessa tendenza. In precedenza, il picco era vicino alla luce verde nella regione visibile. Ora, il picco sarà\nda qualche parte nell’ultravioletto, ma ancora una volta\nesce ancora molta luce visibile. E questa volta, notate, poiché l'intero grafico si\nè spostato a sinistra, molta più energia sta arrivando\nnella regione bluastra-viola. Ed è per questo che a temperature molto elevate\n, indovinate un po'?  Si illuminerà di blu-violetto. E quindi, se\nora torni ad alcune stelle che sono di colore bluastro, per esempio, questa stella\nchiamata Rigel, Rigel, non so come la pronunci, qualunque cosa sia. Ma comunque, è una stella bluastra, quindi posso dire che, ehi, deve essere a una\ntemperatura molto più alta. Deve essere intorno agli 8.000\ngradi o 9.000 gradi, scusate, 8.000 Kelvin o una\ntemperatura molto più alta. Ed ecco fatto. Possiamo anche adesso tracciare un\ngrafico della temperatura del colore, che in un certo senso riassume quale colore vediamo\na diverse temperature. Quindi a temperature più basse\ndiventa rossastro, arancione, poi diventerà bianco e poi inizierà a dirigersi\nverso la regione bluastra. Questo non rappresenta il valore di picco. Ad esempio, a 5.800,\nil picco è ancora verde. Ma poiché vediamo più colori, ecco come appariranno i colori ai nostri occhi. Se è troppo basso,\nnon saremo nemmeno in grado di vederlo perché la maggior parte si troverà\nsolo nella regione dell'infrarosso. Questo è fondamentalmente il modo in cui possiamo\nosservare le diverse stelle, i loro colori e capire\nqual è la loro temperatura. E quando dico temperature, mi riferisco alla temperatura\nnegli strati esterni, ok? Quali possono essere quelle temperature. È uno strumento piuttosto importante\nper l'astronomia."
}