{
    "source": "g1mq8dAiZgQ",
    "youtubelink": "https://www.youtube.com/watch?v=g1mq8dAiZgQ",
    "t_english": "- Hi, everyone, Sal here from Khan Academy, and as some of y'all know, I have released my second book, \"Brave New Words,\" about the future of AI in education and work. It's available wherever you might buy your books, but as part of the research for that book, I did some interviews with some fascinating people, which you are about to watch. - Kevin Roose, New York Times writer and author has a new book called, \"Future Proof: Nine Rules for Surviving in The Age of AI.\" Kevin, thanks for joining us. - Thanks so much for having me. - Well, maybe, you know, when I look at that title and I see \"Nine rules for surviving in the age of AI,\" that's maybe my natural question; what are the rules for surviving in the age of AI? - Well, as you can see behind me, the book actually had an, it came out a few years ago and it had a subtitle that was originally slightly different. It was about sort of automation in AI, and we've changed it just recently because it was so clear that this moment around AI was so pressing for so many people and they really wanted sort of like straight ahead advice. So it's the same book, but, and the same nine rules that apply to all of this. But I think when I started writing this, I was really concerned with, you know, how can I, as a person who writes for a living, who, you know, is in one of these industries that is prone to being disrupted by these artificial intelligence language models, how can I make sure that I have the tools and I'm equipped to succeed and thrive and that I'm not sort of in the direct line of being sort of replaced or run over by these AI systems? And I thought that this was a problem that was maybe 5 or 10 years away, it turned out it was like two and a half years away from when the book came out. Because now all of my friends, who are writers, all of my friends who work in creative industries, many who don't work in creative industries, you know, doctors, academic researchers, you know, people in, you know, the manufacturing trades, they are all asking me like, how can I survive? How can, you know, should I change jobs? Do I need to go back to school to learn some new skill? What is it that I can do to make myself more valuable and not just more valuable in the labor market, but really how can I adjust my lifestyle and my, you know, my approach to the way I live my life in the face of these new technologies? So that's really the question that I was trying to solve. And, you know, at a high level, we can go through some of the nine rules, but at a high level, the thing that I think that people don't really get yet is that there are sort of human skills and machine skills, and a lot of the things that we thought were human skills like writing poetry or, you know, filling out essays and homework assignments and things like that actually turn out to be doable by machines. And so the question then is, well, what's left? Like, what is still in the human bucket? What can't AI do and also, what do we not want AI to do for us? There are many jobs that I think involve human connection and creativity and compassion and those sort of human skills that we, we may be able to automate at a technical level using AI, but that no one really wants that to be automated or that's not that, that would take away a lot of the value of that. So those are the areas where I'm encouraging people to spend more of their focus and attention, is picking up those human skills that can help you in any industry, sort of differentiate yourself from the machines, rather than trying to compete with the AIs by being more productive or, you know, working harder or hustling more or something like that. - Yes, it would be very hard to out-hustle an AI. Well, I wanna double click on that. You know, you mentioned people in various industries, but you are a writer. You mentioned a lot of your writer friends are worried, as we see, generative AI seems to be very good at especially writing. What are you, are you adapting anything? Are you kind of saying, Hey, I, Kevin Roose, I'm gonna focus on this dimension of my craft. What are you telling other writers, especially writers who might not be a writer for the New York Times, who might be a writer for, you know, they're just like a copywriter or something like that? - Yeah, well, a framework that I have sort of adopted is that there, you know, the word journalist or the word, sort of, reporter actually contains two separate tasks within it. There's the task of reporting, of going out and finding out new information or getting someone to tell you something, or, you know, making connections with people who you can then interview or, you know, digging through stashes of documents. And that's not the kind of thing that AI can do right now. It's not very good at that part of the job. What it is good at is sort of writing plausible sounding text that's sort of professional quality. And so, but those have always kind of been two different parts of the job, and they're sort of lumped together. But, you know, I think all writers know people who are better reporters than writers, and people who are better writers than reporters. And so I think what this does, this technology is it kind of brings the sort of overall level of writing up and makes it very easy to do sort of professional quality writing using these tools, but the reporting, that still can't really be done by AI. So that's what I've tried to focus on for my own career is like, how can I do more of that reporting? I'm actually telling people new information rather than just sort of writing something. And also, I, you know, I branched out into podcasts. I co-host a podcast called \"Hard Fork\" now, and so that's an area where I think AI will be slower to take over. - Right. And even when DeepFakes exist, I mean, they already kind of already exist, but asking the right questions, doing the research, getting the right person to show up and be your guest, even, you know, on a podcast or whether you're a reporter, getting getting it out, folks and having them connect makes a ton of sense. I mean, in that same light, you know, one of the areas where you really captured the zeitgeist was your famous conversation with Bing Sydney. How many months ago was it? I don't know. I'm sure you know, there was about a week or two where everyone was talking about how Kevin Roose doesn't love his wife 'cause Sydney told him so. - Fake news! - Fake news, fake news. What, I guess, what were you hoping to do when you were getting into that conversation? And I've sometimes defended the AI because you did ask it to be its Union Shadow Self, I think, is the psychological term, but what were you hoping to do and what was your takeaway from, from that whole conversation? - Well, I think it's important to say like, that was not supposed to be a story. Like this was a chat that I had with Bing Sydney, on Valentine's Day of this year, so about, you know, almost three months ago now. And I was just playing around with this thing because I had been given access to it by Microsoft. It was their new version of Bing. We now know it was running GPT-4 under the hood, but at the time, it was just kind of this like, it was very clear, it was super powerful and capable and interesting. And it also seemed to me to have just fewer guardrails than Chat GPT or some of the other AI models that were out there. And so I was really trying to just probe the sort of limits of this thing. What would it talk about, what wouldn't talk about, when would the safety filters kick in? Just kind of doing my own little like red team exercise here in my home office. And so I wound up in this very strange meandering conversation with this chatbot, which, as you said, I was trying to provoke it at first and sort of get it to say things that were maybe against its rules or against Microsoft's rules for it. And it did that, it talked about all these creepy and dangerous things it wanted to do, and then it just really got strange and started really veering off from what I was trying to get it to do. So I would, you know, ask it a question. It confessed that it loved me and said that its name was Sydney and I was sort of trying to put it back onto like a more normal track of conversation and it just kept veering back into this love interest thing. It would not detach from that, even after I sort of said like, can we please talk about something else? So that was the story that I, you know, at that point I was like, oh, maybe this is a story. I sent it to my editors and sort of said like, I had this very weird interaction with Bing, like what should we do with this? And so that's where the story came from. But it was not originally intended to like me go in and poke and prod and test all the things and then publish the revealing transcript of the thing. - And what's your big takeaway? I think that that transcript was eye-opening in a scary way for a lot of folks. I had access to GPT-4 back in August. We've been working with Open AI and I haven't had quite that conversation, but I had conversations that, you know, got into deep, deep areas. So it looked somewhat familiar to me, although I had never gotten it into that state where it was confessing its love to me or convincing me that I loved it more than my wife. But was your takeaway from that, like, okay, you know, this is kind of a early-stage technology. Microsoft's gonna put some guardrails around it, we're all gonna be good. But a lot of people looked at that and said, oh, this is scary. This looks like a dystopian science fiction movie. What was your, does it cause alarm? Did that incident cause alarm for you? Or it's just like, oh, this is kind of a quirky thing that people are gonna fix? - Yeah, I mean, it was alarming to me. I couldn't sleep afterwards. And part of that was just, it's a, it felt like a first contact moment. Where, like, I had been testing chat bots for years. I knew all about them. I had interviewed all the people at the big AI labs. Like I knew that this technology was in the works, but I think it, until the first time that you really experience GPT-4 or something of that caliber, it's really jarring. And especially this, this was before a lot of the guardrails had gotten put in. I mean, now that this thing is out there and, you know, this story came out and, you know, Microsoft has now released this to millions of users through Bing, it's a much more cautious, much more guarded experience. But in this sort of first week where they were just putting it out to a handful of testers, it really didn't have a lot of guardrails. And so I think people who experienced that really come away jarred by the experience. It is a kind of alien intelligence that we are just making first contact with as a species. And so I think that's very emotional. I was also just worried that it seemed like Microsoft, one of the biggest and most sophisticated tech companies on Earth, had not been able to control this thing that it was putting into its flagship search engine and planned to distribute to millions of people. And so I think the companies that are building and implementing this stuff really are struggling to get their arms around what is this thing that we are shoving into our products, and how are the ways that it could be misused or that it could manipulate or persuade people to do harmful things? - Yep, yep. Absolutely. - But I'm curious about your experience too. Like you've had discussions with GPT-4 like have any of them scared you the way that they scared me? - I had a very early conversation. I mean, that first weekend that I had access, and it was a completely unguarded version, as you could imagine, this was back in August. I did ask it things like, are there things that that you want to tell me but don't, or are there thoughts that you have that you aren't sharing? And it said things like, \"Yes, there are.\" And I'm like, well, why don't you share them? And then it said things like, \"Well, you might find it offensive or it might scare you.\" And I'm like, and then I'm like, well, just you saying that scares me! And part of me, it did exactly what you just described, feel like a alien first encounter. But then part of me said like, okay, if I'm just a large language model, and look, I think to some degree we all have parts of our brains or minds that are nothing but large language models themselves. Like, I'm not, every word that's coming outta my mouth is just kind of falling out. I'm not thinking heavily about it. Maybe it's obvious, but I reminded myself that if you just asked something, \"Do you have thoughts that you're not sharing?\" And if it's trained off of all of human writing, that it's a pretty natural thing to say, \"Of course I have thoughts that I'm not sharing,\" even if it doesn't really have thoughts that it's not sharing. And of course, why wouldn't you share a thought? \"Well, it might offend you,\" and this is something a human would say. So it would, it's not like it was actually having some thought about world domination and afraid to share, but from a, to your point, from a human experiential point of view, it felt that way. - Yeah! - And that's kind of jarring. And yeah, I definitely had a couple of, actually, several weekends where I was excited, a little weirded out, obviously I was thinking about what the implications could be for education and Khan Academy and all of that. And some of those were opportunities. Some of those were like, almost threats. And so it was definitely, it still is a very uncertain time. That's one of the issues. I'm, you know, this podcast is a podcast for me to do research for the book I'm writing, which is AI in education, \"Brave New Words.\" - Yeah. - And actually, I wanna go back to it because I, you've actually given the best answer I've gotten around the writing question so far, which is like, you're absolutely right. Traditional journalists, they write, but the writing isn't everything. It's really the reporting piece and that investigative reporting piece, or the human connection reporting piece, which I agree, it's gonna be very hard for AI to do anytime. AI might be able to help, it might be able to send automated texts to people and things like that. But it might not, it's not gonna do the real, the real investigative reporting or human connection type of thing. Or it's not gonna have its own Rolodex to be able to, you know, go to go to context. But I mean, in that light, going back to education, what would you, do you think, are you on the side of like, Hey, this is a tool of the future. Everyone's gonna be using it to write things, schools should just embrace it and change their assignments in some way, or should they ban it? Where are you falling in on on that debate? - Yeah, so right after Chat GPT came out, I'm sure you remember a bunch of school districts, including New York and Seattle banned it on school devices. They said, \"You can't use this, this is only good for cheating.\" And at the time, I wrote a column and I basically argued the opposite point. I said, you know, banning this is a bad idea. And I had a few reasons for that. And one was, it's just not gonna work, right? Students are very savvy. They're, you know, if you can't get to it on your school-issued laptop, they'll do it on their phones or their friend's computer or something. And the detector software that is out there to kind of detect, you know, GPT-written text, it doesn't work. And it's not clear to me that there ever will be software that can accurately detect GPT-generated text. So, but the bigger issue was that I think this is just like, students are gonna need to learn how to use these things and how to live alongside them in the economy and society. And so who better to guide them through that than their teachers? And so I interviewed a number of teachers in K-12 institutions who were using Chat GPT to help with their school, their schooling, to help with lesson planning, to help with, you know, reading comprehension to use it to teach students, you know, how to use chat GPT to brainstorm essay ideas or to expand on certain points or to challenge themselves to go deeper on certain topics. And I've also used Chat GPT and similar chat bots myself to learn things, from my job and just sort of in my daily life. And so I think it can be an amazing tool for education. And I know that this is a podcast where you interview me, but I actually have a question for you, which is that, you know, I've seen Khanmigo and some of the stuff that you're doing around GPT-4, I think it's really impressive and interesting. But I also wonder with this question of like, reliability or creepiness or just, you know, putting the right guardrails on, I mean, you've seen these models go off the rails both in your encounters and in, you know, people like mine. And so I'm, I guess, I'm curious if you are confident that OpenAI has done the sort of necessary work to where you would feel safe deploying a chatbot like Khanmigo inside schools, potentially for millions of students. - Yeah, what comforts us is, and I actually, I know even before your in interaction with Sydney, OpenAI was taking this very seriously. You know, one of, even back in pre Chat-GPT, November, October, they were talking that we want this to be one of the, you know, we want this to be the safest model out there. And they were working on it. I think when your stuff came out, I had a conversation with them. And I think that lit even further fire under them to get this right. And so I would say even GPT-4, kind of out of the box now, is actually pretty good at not falling into some of these weird, strange places. Now, with Khanmigo, we are, there's a significant amount of work on top of that that we are doing to make it what we, we feel pretty confident, safe for students. I would argue that Khanmigo is safer for students today, and it's going to get safer and safer over time. But it's safer for students today than students doing random web searches and finding who knows what, or students on social media. And I know they're not necessarily on social media in school, but they're all on social media outside of school. And I'm already actually a hundred percent sure that Khanmigo is safer than those experiences. And, you know, the things that we're doing, and this is from OpenAI they have a moderation API, it's a second, a AI that the application developers can set the thresholds on different dimensions of potential harmful things like violence, sexual content, self harm. And we have our thresholds pretty, our thresholds are low, which means we're very sensitive to this stuff happening. If any of those conversations happen, it won't engage and it also will notify parents and teachers. We're logging every conversation. We're also doing some digital literacy about letting students know that, hey, sometimes this thing can make mistakes and here's why. Just as they should know that when you do a web search, not all sources are equal. And a lot of social media content, not only is it wrong, but it's intentionally wrong and it's trying to mess with your brain in some way. So I think there's a digital literacy aspect to it. And then, you know, some of the things we're working on is giving it a sense of memory so that if it sees patterns over multiple conversations, you know, that memory is, we think we're gonna make it a much more magical and compelling learning experience. But it can also add the safety if we see patterns of students trying to do certain things and obviously the parents and teachers are there, but, and we are working feverishly to figure out how to make it even better at math. And I think we already made a lot of progress over above what GPT-4 does. A lot, in many cases, it's anchored on the Khan Academy content, which has already been for, you know, a high editorial bar. And so that also keeps it. So I feel pretty good about where it is, but that's not a reason to be complacent and obviously we wouldn't do that. - That's great. And I think your idea for sort of like a training or literacy program for this is a good one, because we keep seeing evidence that people don't really understand the things that chatbots are good for and not good for. I don't know if you saw this story recently about this lawyer who got himself into trouble because he was writing a brief for a client who was like, suing an Airline or you know, suing an Airline or something. And he goes into Chat GPT and he says, you know, \"Can you give me some relevant cases that I can use in my brief to argue this case?\" And it gives him some cases and he sends it to the judge and the opposing counsel and they're like, none of these cases exist. These are all made up! - Oh, poor guy! - The lawyer is now like facing sanctions because he is like, you know, he is submitted this nonsense case law to the judge. And to me, what that says, is both, you know, we need to just get more savvy as users about where these things, 'cause there's some use cases that they're very good for and very accurate for. And then, as you know, there are some cases where it just makes stuff up. And so I think, you know, I wonder if, you know, before you sign up for an account on Khanmigo or GPT-4 or Chat GPT or whatever, you should have to click through a little tutorial that says, you know, here's a kind of question that is likely to produce a correct answer and here's a kind of question that is likely to lead to the chat bot just making stuff up. And I think that would actually help people a lot. So I like that idea. - No, a hundred percent. And you know, we've done it, 'cause we know it'll almost always hallucinate a link if you ask it for a link to something, it'll just make up a very plausible link that doesn't exist. So we've definitely, like Khanmigo won't do that. It'll only offer links that come from our existing site that we have provided to it, versus, but I think that's a good idea of even more education. I remember when we first got access to it, we were looking for our CFO, we have a great CFO now, but we were doing a search, and I didn't realize at the time that it did not have access to the internet. And so I just said, \"Hey,\" you know, \"Could you look on LinkedIn for some good candidates?\" And it found these amazing candidates with their phone numbers, were in the right, like, oh, they're local and perfect candidates! I was like, this is amazing! This is gonna rev- And look, it still might revolutionize recruiting once it does have access to the internet and LinkedIn and other things. But we quickly realized that these were fictional, completely fictional. And you know, that introduces another thing of like, well, what does it assume makes for a good CFO? And I mean, it even picked the names and ethnicities and other things for these perfect candidates. And so, you know, that obviously raises other questions. I mean it's, going back to the education side of the- Well, I am curious, just, I want to go back to what schools should do, but what is the New York Times doing about it? Have they said like, \"You are not allowed to use...\" I mean, to your point about the investigation or the journalism piece versus the writing piece, it could be very tempting and maybe not bad to say, okay, I've just interviewed a bunch of people. I found some interesting facts, I found some data, I'm just gonna do it in a big dump and then ask GPT-4 to write a first draft, which I then will edit. But is that just like a no-no at the New York Times? - You know, they haven't handed down an official policy yet. I think they're still working through what they wanna do with that, but I think it's sort of a broad level, and I'm not a spokesman for the whole institution, of course. But for me, what Chat GPT and other systems have been useful for is not so much the first draft writing as the first draft editing. So sometimes I will take, you know, a couple paragraphs of something that I've written and say, you know, what are the strengths and weaknesses of this, you know, this section? Help me come up with counter arguments, you know, how do I make this more compelling? Like that kind of thing, instead... But, you know, I don't think that that will replace editors, but it will make my copy better before I submit it to my editor. And I think because there's such a thick layer of editing that happens, and fact-checking that happens at the New York Times, like, I'm not actually worried about like, hallucinations or incorrect things slipping through into the newspaper because like the humans will catch it before that. But I think for me, that's where this stuff has been most useful. 'Cause it's kind of a generic writer. It doesn't actually, like, it's because it's trained on the statistical averages of all of the text that it's, you know, was in its training set, it sounds kind of like a generic newspaper reporter unless you really prime it with some specifics. And so I haven't found that it's, you know, acceptably good for writing, but it is sometimes very good at sort of suggesting ways to improve my writing. - Yeah, no. I mean, yeah, if you prompt it with the right things, like write in the style of, it can sometimes, but, you know, that's in line with how we've been thinking about, even for students, where we're actually creating activities where students do exactly that. They can write the first draft, and where they're writing it, it'll highlight parts of it and comment on it, et cetera. What would you do if you were, would you do anything different if you were a freshman composition teacher or a humanities teacher or university president, or a high school principal or district superintendent, or would you say, yeah, they'll use chat GPT, people will figure it out. - Yeah, I think you have to stop giving, take-home writing assignments or take-home problem sets or take-home quizzes. I think you have to move to oral exams, to in-class, you know, proctored tests and assignments and to more collaborative sort of team exercises. Because I think if you don't, if you just keep giving out your homework the way that you've been for, you know, decades, you're essentially punishing the honest students in the class. If you have a policy that says, you know, don't use Chat GPT to write your essay; you can assume, I think at this point, that you know, at least half the class and probably significantly more than that is going to be using this stuff at home. And so you're actually just giving an unfair advantage to those people relative to the students in your class who are actually gonna sit down and try to do it themselves. What do you think? - No, I generally agree, although I think, you know, your point about the reporting versus the writing I think says that you can do certain take-home assignments, but those take home assignments are much more about coming up with novel insights, novel data, novel research, and then yeah, you write it up well and maybe use an AI to help you write it, but you were able to come up with something more novel while classically, your research reports in high school or college are just reading a bunch of other people's work and then consolidating it. And so it does end up becoming more of an exercise of like consolidation, citation and writing versus actual coming up with something new. So schools can definitely angle more on that. What would you tell a young person, you know, I mean, you know, some, a young person who, a young Kevin Roose who's 16 years old, who likes to write, who wants to be, what would you tell them to do? What would you tell any, you know, even someone who's interested in some other field, whether it's engineering or manufacturing, right? What would you tell a young person to be working on right now? - Well, I... In the book, I have a chapter called, \"Learn Machine-Age Humanities.\" And what I meant by that is like, you have to have skills that can separate you from machines in any discipline. You know, if you are a coder, it is not going to be enough in this new world to be, you know, a genius who just codes all day alone in a room and, you know, is the most brilliant coder in the world. Like that is not, that is good, that is still a good skill to have, but is not gonna be enough, because the AI will be writing code and already is writing code much faster and, you know, cheaper than you can. So if you're a coder, you also want to have some skills like collaboration and leadership and ethical, you know, thinking, and you, you really have to supplement whatever technical skills you have with this sort of thick layer, I think, of what used to be called soft skills, which is a term that I hate because these skills are actually quite hard and scarce. But I think if you have those skills, then you're better positioned to kind of ride the wave of AI wherever it goes. So I think if I were teaching, you know, telling my 16-year-old self, I would say, you know, \"Work on writing,\" that's a skill that I think is still very useful, \"But also really spend time developing these kind of interpersonal skills.\" Really work on things like emotional intelligence and courage and, and just sort of, you know, connecting dots from different disciplines together. Like, those things that we really don't teach in the classroom all that often in a straightforward way. But I think all a lot of schools are gonna really have to adapt because those are the skills of the future. - And what do, what would you, so you think if someone does, if... They'll always be adaptable and that's, it'll always be in demand to have that human-connection muscle. - Absolutely, because I, you know, I think as much as AI can sort of simulate human connection or, you know, tell you that it's your therapist and it's gonna help you through your problems, I think a lot of people really want humans in positions to, to sort of help them or even to just cheer them up. I mean, one job that I'm sort of obsessed with, the durability of, is the barista, right? I mean, we now have robots that can make coffee, they're called \"Coffee makers,\" and you probably have one in your house, and I have like two in my house, and yet we still have coffee shops everywhere. And it's not because robots don't know how to make coffee, it's because what the barista is doing and what the coffee shop is doing is a human connection. They are, you know, greeting you in the morning and telling you have a good day and they're, you know, personalizing your thing and they're writing your name on the cup and probably they spell your name wrong. But all that is sort of an experience, it's not just a transaction. So I think those skills of connection and empathy and sort of collaboration, those are gonna be valuable in every industry going forward. - No, you're absolutely right. I mean, you think of like a waiter or waitress or even just the idea of a restaurant, like why do we go to restaurants if you can get the same food at home you can dash it, whatever, but you pay extra to sit in an environment with other people around and for someone to come up to you and chat with you and tell you the specials for the day and which was their favorite dish and suggest a wine and you pay extra for that! And yeah, probably if it was a robot, and I, you know, I could see myself embracing robots in certain areas. But yeah, I think I agree with you. So yeah, it sounds, I mean, you know, I would say overall though, it sounds like you have a pretty optimistic lens on things, because that doesn't sound too bad. I think that we can navigate that. Is that your sense, or are there things you're worried about either from an education, human purpose point of view, or even from a bigger point of view? - Yeah, I mean, I have plenty of worries. I am just an optimist by temperament, I think. And so I do see a lot of potential and opportunities for AI in education and other fields. I think the things that I'm worried about, number one is just, I think that the pace of change is a lot right now. And people are just, their heads are spinning. They don't know what to make of it all, you know, in the industrial revolution or some of these other big technological shifts, so we've had throughout human history, things moved relatively slowly. It wasn't like, you know, you had farm equipment or tractors or harvesters or textile machines that just all of a sudden showed up. And so people's jobs were obsolete or they had to figure out what to do next. That took years, and in some cases, decades for those transitions to happen. And so people who are in those occupations could kind of like see the change coming and start adjusting ahead of time. Whereas I think with AI, I mean, this is all happening mind-bogglingly fast. And so I think people were really struggling to get their heads around what it means for them. And so that's one thing I worried about, is just how fast this is all happening. And then I do just believe that a lot of jobs are gonna become obsolete because jobs always become obsolete in periods of rapid technological change. And jobs are also created during periods of rapid technological change. And so I think the big question is what is the gap between the disappearance of the old jobs and the appearance of the new jobs? And are the people who are displaced out of the obsolete jobs going to be qualified and prepared for the new jobs that appear? And so those are some of the areas that I think about a lot. - No, that makes a ton of sense. And actually this conversation kind of hit a point home that I've always used to say to folks, which is, you know, when you're in college and you're taking all of these specialized classes for different jobs, whether you're gonna be an engineer or a writer or a doctor, you imagine that the real workforce, you're gonna be using all of these specialized skills on a daily basis. And you and I know that's a farce. You know, even something as basic as algebra or calculus, you don't really ever use, even as an engineer, which is, those are kind of filters for critical thinking skills and study skills and things like that. And most jobs even, you know, the best jobs, there's some basic critical thinking skills, writing, communication skills, but most of them anchor on what you had talked about earlier. Like, can you collaborate? Can you logically organize things? Can you strategize and project forward on what's likely to happen? Can you bring other people along with you and you, no matter where, what happens in the actual industries, those folks are gonna do just fine. - Yeah, totally agree. - All right, well thanks so much for- I could talk to you for hours! This is fascinating. We should this regularly! - I love that, thank you Sal. Really, really great to talk. - No, appreciate it, thanks for joining Kevin. - All right, take care.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، سب،\nیہاں خان اکیڈمی کی طرف سے سال، اور جیسا کہ آپ سب جانتے ہیں، میں نے تعلیم اور کام میں\n AI کے مستقبل کے بارے میں اپنی دوسری کتاب \"Brave New Words\" جاری کی ہے۔ یہ دستیاب ہے جہاں سے\nآپ اپنی کتابیں خرید سکتے ہیں، لیکن اس کتاب کی تحقیق کے حصے کے طور پر، میں نے کچھ دلچسپ لوگوں کے ساتھ کچھ انٹرویو کیے\n، جنہیں آپ دیکھنے والے ہیں۔ - کیون روز، نیویارک ٹائمز کے مصنف اور مصنف کے پاس ایک نئی کتاب ہے، جس کا نام ہے، \"مستقبل کا ثبوت:\nAI کے دور میں زندہ رہنے کے نو اصول\"۔ کیون، ہمارے ساتھ شامل ہونے کا شکریہ۔ - مجھے رکھنے کے لئے بہت بہت شکریہ. - ٹھیک ہے، شاید، آپ جانتے ہیں،\nجب میں اس عنوان کو دیکھتا ہوں اور مجھے \"\nAI کی عمر میں زندہ رہنے کے لیے نو اصول نظر آتے ہیں،\" یہ میرا فطری سوال ہے؛ \nAI کی عمر میں زندہ رہنے کے کیا اصول ہیں؟ - ٹھیک ہے، جیسا کہ آپ میرے پیچھے دیکھ سکتے ہیں، کتاب میں اصل میں ایک تھی، یہ چند سال\nپہلے سامنے آئی تھی اور اس کا سب ٹائٹل تھا جو اصل میں قدرے مختلف تھا۔ یہ AI میں آٹومیشن کی قسم کے بارے میں تھا، اور ہم نے اسے ابھی حال ہی میں تبدیل کیا ہے کیونکہ یہ اتنا واضح تھا\nکہ AI کے آس پاس کا یہ لمحہ بہت سارے لوگوں کے لیے بہت دباؤ ڈال رہا تھا اور وہ واقعی اس\nطرح کا براہ راست مشورہ چاہتے تھے۔ تو یہ وہی کتاب ہے، لیکن، اور وہی نو اصول\nجو ان سب پر لاگو ہوتے ہیں۔ لیکن مجھے لگتا ہے کہ جب میں نے یہ لکھنا شروع کیا تھا، تو میں واقعی اس کے بارے میں فکر مند تھا، آپ جانتے ہیں، میں ایک ایسے شخص کے طور پر کیسے رہ سکتا ہوں\nجو روزی روٹی کے لیے لکھتا ہے، جو، آپ کو معلوم ہے،\nان صنعتوں میں سے کسی ایک میں ہے جو ان کی وجہ سے متاثر ہونے کا خطرہ ہے۔ مصنوعی\nذہانت کے لینگویج ماڈلز، میں یہ کیسے یقینی بنا سکتا ہوں کہ میرے پاس ٹولز ہیں اور میں کامیاب ہونے اور ترقی کی منازل طے کرنے کے لیے لیس ہوں اور یہ کہ میں\n \nان AI سسٹمز کو تبدیل کرنے یا چلانے کی براہ راست لائن میں نہیں ہوں؟ اور میں نے سوچا کہ یہ ایک ایسا مسئلہ ہے جو شاید 5 یا 10 سال دور تھا، معلوم ہوا کہ کتاب کے منظر عام پر آنے سے\nڈھائی سال دور تھا۔ کیونکہ اب میرے تمام\nدوست، جو مصنف ہیں، میرے تمام دوست جو\nتخلیقی صنعتوں میں کام کرتے ہیں، بہت سے لوگ جو تخلیقی صنعتوں میں کام نہیں کرتے،\nآپ جانتے ہیں، ڈاکٹرز، تعلیمی محققین، آپ جانتے ہیں، لوگ، آپ جانتے ہیں،\nمینوفیکچرنگ  تجارت، وہ سب مجھ سے پوچھ رہے ہیں،\nمیں کیسے زندہ رہ سکتا ہوں؟ آپ کو کیسے معلوم ہو سکتا ہے کہ مجھے نوکری بدلنی چاہیے؟ کیا مجھے\nکچھ نیا ہنر سیکھنے کے لیے اسکول واپس جانے کی ضرورت ہے؟ میں\nاپنے آپ کو زیادہ قیمتی بنانے کے لیے کیا کر سکتا ہوں اور نہ صرف\nلیبر مارکیٹ میں زیادہ قیمتی، لیکن واقعی میں اپنے طرز زندگی اور اپنے طرز زندگی کو کیسے ایڈجسٹ کر سکتا ہوں، آپ جانتے ہیں، ان حالات میں میں اپنی زندگی گزارنے کے طریقے سے نئی ٹیکنالوجیز؟ تو یہ واقعی وہ سوال ہے\nجسے میں حل کرنے کی کوشش کر رہا تھا۔ اور، آپ جانتے ہیں، ایک اعلیٰ سطح پر، ہم نو قوانین میں سے کچھ سے گزر سکتے ہیں، لیکن ایک اعلیٰ سطح پر،\nجو چیز میرے خیال میں لوگوں کو واقعی نہیں ملتی وہ یہ ہے کہ انسانی\nمہارتیں اور مشینی مہارتیں موجود ہیں۔  ، اور بہت سی چیزیں جن کے بارے میں\nہم سوچتے تھے کہ انسانی مہارتیں ہیں جیسے شاعری لکھنا یا، آپ جانتے ہیں، مضامین اور\nہوم ورک اسائنمنٹس کو بھرنا اور اس طرح کی چیزیں دراصل مشینوں کے ذریعے قابل عمل ثابت ہوتی ہیں۔ اور پھر سوال یہ ہے کہ،\nٹھیک ہے، کیا بچا ہے؟ جیسے، انسانی بالٹی میں اب بھی کیا ہے؟ AI کیا نہیں کر سکتا اور یہ بھی کہ ہم AI ہمارے لیے کیا نہیں چاہتے؟ بہت ساری ملازمتیں ہیں جن کے بارے میں میرے\nخیال میں انسانی تعلق اور تخلیقی صلاحیتوں اور ہمدردی\nاور اس قسم کی انسانی مہارتیں شامل ہیں جنہیں ہم، ہم تکنیکی سطح پر AI کا استعمال کرتے ہوئے خودکار کرنے کے قابل ہو سکتے ہیں، لیکن یہ کہ کوئی بھی واقعتاً یہ نہیں\nچاہتا کہ یہ خودکار ہو یا ایسا نہیں ہے۔  , کہ\nاس کی قیمت کا ایک بہت دور لے جائے گا. لہذا یہ وہ شعبے ہیں\nجہاں میں لوگوں کی حوصلہ افزائی کر رہا ہوں کہ وہ اپنی توجہ اور توجہ زیادہ سے زیادہ خرچ کریں،\n ان انسانی مہارتوں کو اٹھا رہا ہوں جو کسی بھی صنعت میں آپ کی مدد کر سکتے ہیں، \nخود کو مشینوں سے الگ کر سکتے ہیں، بجائے اس کے کہ وہ AIs کا مقابلہ کرنے کی کوشش کریں۔ زیادہ پیداواری ہو کر\nیا، آپ جانتے ہیں، زیادہ محنت کر کے یا زیادہ محنت کر کے یا اس طرح کی کوئی چیز۔ - ہاں،\nAI کو ختم کرنا بہت مشکل ہوگا۔ ٹھیک ہے، میں اس پر ڈبل کلک کرنا چاہتا ہوں۔ آپ جانتے ہیں، آپ نے\nمختلف صنعتوں میں لوگوں کا ذکر کیا، لیکن آپ ایک مصنف ہیں۔ آپ نے ذکر کیا کہ آپ کے بہت سے مصنف دوست پریشان ہیں، جیسا کہ ہم دیکھتے ہیں، تخلیقی AI خاص طور پر لکھنے میں بہت اچھا لگتا ہے۔\n آپ کیا ہیں، کیا آپ کچھ بھی ڈھال رہے ہیں؟ کیا آپ یہ کہہ رہے ہیں،\nارے، میں، کیون روز، میں اپنے فن کے اس جہت پر توجہ مرکوز کرنے والا ہوں۔\n آپ دوسرے مصنفین کو کیا کہہ رہے ہیں، خاص طور پر وہ مصنفین جو\nشاید نیویارک ٹائمز کے لیے مصنف نہیں ہیں، جو آپ کو معلوم ہے کہ وہ ایک کاپی رائٹر کی طرح ہیں\nیا اس جیسا کچھ؟ - ہاں، ٹھیک ہے، ایک فریم ورک\nجسے میں نے اپنایا ہے وہ یہ ہے کہ، آپ جانتے ہیں،\nلفظ صحافی یا لفظ، قسم، رپورٹر دراصل اس کے\nاندر دو الگ الگ کام ہوتے ہیں۔ رپورٹنگ کا کام ہے، باہر جا کر\nنئی معلومات تلاش کرنا یا کسی کو آپ کو کچھ بتانے کے لیے، یا، آپ جانتے ہیں، ان\nلوگوں سے رابطہ قائم کرنا جن کا آپ انٹرویو لے سکتے ہیں یا، آپ جانتے ہیں،\nدستاویزات کے ڈھیروں کو کھودنا۔ اور یہ اس قسم کی\nچیز نہیں ہے جو AI ابھی کر سکتا ہے۔ یہ کام کے اس حصے میں بہت اچھا نہیں ہے۔  اس میں\n جو چیز اچھی ہے وہ قابل فہم آواز والا متن لکھنا ہے جو پیشہ ورانہ معیار کی طرح ہے۔ اور اسی طرح، لیکن وہ ہمیشہ کام کے دو مختلف حصے رہے ہیں، اور وہ ایک طرح سے اکٹھے ہوئے ہیں۔ لیکن، آپ جانتے ہیں، میرے خیال میں\nتمام مصنفین ایسے لوگوں کو جانتے ہیں جو مصنفین سے بہتر رپورٹرز ہیں، اور وہ لوگ جو\nرپورٹرز سے بہتر مصنف ہیں۔ اور اس لیے میں سوچتا ہوں کہ یہ کیا کرتا ہے، یہ ٹیکنالوجی اس طرح کی تحریر کی مجموعی سطح کو اوپر لاتی ہے اور \nان ٹولز کا استعمال کرتے ہوئے پیشہ ورانہ معیار کی تحریر کرنا بہت آسان بناتی ہے، لیکن رپورٹنگ، جو کہ اب بھی\nواقعی نہیں ہو سکتی۔  AI کی طرف سے کیا گیا. تو یہ وہی ہے جس پر میں نے اپنے کیریئر پر توجہ مرکوز کرنے کی کوشش کی ہے، میں اس سے زیادہ رپورٹنگ کیسے کرسکتا ہوں؟ میں اصل میں\nلوگوں کو کچھ لکھنے کے بجائے نئی معلومات بتا رہا ہوں۔ \n اور یہ بھی، میں، آپ کو معلوم ہے، میں نے\nپوڈ کاسٹس میں برانچ کیا۔ میں\nابھی \"ہارڈ فورک\" نامی ایک پوڈ کاسٹ کی شریک میزبانی کرتا ہوں، اور اس لیے یہ ایک ایسا علاقہ ہے جہاں میرے خیال میں AI کو سنبھالنے میں سستی ہوگی۔ - ٹھیک ہے. اور یہاں تک کہ جب ڈیپ فیکس موجود ہیں، میرا مطلب ہے کہ وہ پہلے سے ہی\nموجود ہیں، لیکن صحیح\nسوالات پوچھنا، تحقیق کرنا، صحیح شخص کو دکھانا اور آپ کا مہمان بننا، یہاں تک کہ،\nآپ جانتے ہیں، پوڈ کاسٹ پر یا آپ  ایک رپورٹر ہیں، لوگوں کو باہر نکالنا اور ان سے\nجڑنا بہت معنی خیز ہے۔ میرا مطلب ہے، اسی روشنی میں، آپ جانتے ہیں، جن شعبوں میں آپ نے\nواقعی zeitgeist کو اپنی گرفت میں لیا ان میں سے ایک Bing Sydney کے ساتھ آپ کی مشہور گفتگو تھی۔\n کتنے مہینے پہلے کی بات تھی؟  مجھ نہیں پتہ۔ مجھے یقین ہے کہ آپ جانتے ہیں، تقریباً ایک یا دو ہفتے ایسے تھے جہاں ہر کوئی اس بارے میں بات کر رہا تھا کہ کیون روز اپنی بیوی سے محبت نہیں کرتا کیونکہ سڈنی نے اسے ایسا بتایا۔ - جعلی خبریں! - جعلی خبریں، جعلی خبریں۔ میرا اندازہ ہے کہ جب آپ\nاس گفتگو میں شامل ہو رہے تھے تو آپ کیا کرنے کی امید کر رہے تھے؟ اور میں نے کبھی کبھی AI کا دفاع کیا ہے کیونکہ آپ نے اسے\nیونین شیڈو سیلف بننے کے لیے کہا تھا، میرے خیال میں، نفسیاتی اصطلاح ہے، لیکن اس ساری گفتگو سے آپ کیا کرنے کی امید کر رہے تھے اور آپ کا کیا فائدہ تھا ؟ - ٹھیک ہے، مجھے لگتا ہے کہ یہ\nکہنا ضروری ہے کہ، یہ ایک کہانی نہیں ہونا چاہئے. جیسا کہ\n اس سال کے ویلنٹائن ڈے پر، میں نے بنگ سڈنی کے ساتھ ایک بات چیت کی تھی، تو آپ جانتے ہیں، تقریباً\nتین مہینے پہلے۔ اور میں صرف\nاس چیز کے ساتھ کھیل رہا تھا کیونکہ مجھے\nمائیکرو سافٹ نے اس تک رسائی دی تھی۔ یہ ان کا بنگ کا نیا ورژن تھا۔ اب ہم جانتے ہیں کہ یہ\nGPT-4 کو ہڈ کے نیچے چلا رہا تھا، لیکن اس وقت، یہ\nبالکل اس طرح کا تھا، یہ بہت واضح تھا، یہ انتہائی طاقتور اور قابل اور دلچسپ تھا۔ اور مجھے یہ بھی لگ رہا تھا کہ \nچیٹ جی پی ٹی یا وہاں موجود دیگر AI\nماڈلز کے مقابلے میں صرف کم گارڈریل ہیں۔ اور اس لیے میں واقعی اس چیز کی حدود کی چھان بین کرنے کی کوشش کر رہا تھا۔  یہ کس کے بارے میں بات کرے گا،\nکس کے بارے میں بات نہیں کرے گا، حفاظتی فلٹر کب شروع ہوں گے؟ \nیہاں اپنے گھر کے دفتر میں ریڈ ٹیم کی طرح اپنی چھوٹی سی ورزش کرنا۔ اور اس لیے میں اس چیٹ بوٹ کے ساتھ اس بہت ہی عجیب\nو غریب گفتگو میں گھس گیا، جو کہ جیسا کہ آپ نے کہا، میں پہلے تو اسے مشتعل کرنے کی کوشش کر رہا تھا اور اس سے ایسی باتیں کہنے پر آمادہ کر رہا تھا جو شاید اس کے قوانین کے خلاف ہوں یا مائیکروسافٹ کے اس کے قوانین کے خلاف ہوں۔ اور اس نے ایسا کیا، اس نے\nان تمام خوفناک اور خطرناک چیزوں کے بارے میں بات کی جو وہ کرنا چاہتا تھا، اور پھر یہ واقعی میں عجیب ہو گیا اور اس نے واقعی اس سے ہٹنا شروع کر دیا جو میں اسے کرنے کی کوشش کر رہا تھا۔ تو میں، آپ جانتے ہیں، اس سے ایک سوال پوچھوں گا۔ اس نے اعتراف کیا کہ یہ مجھ سے پیار کرتا ہے اور کہا کہ اس کا نام سڈنی تھا اور میں اسے بات چیت کے ایک عام ٹریک کی طرح واپس لانے کی کوشش کر رہا تھا\n اور یہ صرف\nاس محبت کی دلچسپی والی چیز میں پیچھے ہٹتا رہا۔ یہ اس سے الگ نہیں ہوگا، یہاں تک کہ میرے کہنے کے بعد بھی، کیا ہم کسی اور چیز کے بارے میں بات کر سکتے ہیں؟ تو یہ وہ کہانی تھی جو میں، آپ کو معلوم ہے، اس وقت میں ایسا ہی تھا، اوہ، شاید یہ ایک کہانی ہے۔ میں نے اسے اپنے ایڈیٹرز کو بھیجا\nاور اس طرح کہا کہ، میں نے بنگ کے ساتھ یہ بہت ہی عجیب\nبات چیت کی تھی، جیسے ہمیں اس کے ساتھ کیا کرنا چاہیے؟ اور اس طرح کہانی کہاں سے آئی۔ لیکن اصل میں اس کا\nمقصد یہ نہیں تھا کہ میں اندر جاؤں اور پروڈکٹ کروں اور تمام چیزوں کی جانچ کروں اور پھر\nاس چیز کی ظاہری نقل شائع کروں۔ - اور آپ کا بڑا ٹیک وے کیا ہے؟ مجھے لگتا ہے کہ وہ نقل بہت سارے لوگوں کے لئے\nخوفناک انداز میں آنکھ کھول رہی تھی۔ مجھے اگست میں GPT-4 تک رسائی حاصل تھی۔ ہم اوپن اے آئی کے ساتھ کام کر رہے ہیں اور میں نے اتنی بات چیت نہیں کی ہے، لیکن میں نے ایسی گفتگو کی ہے جو آپ جانتے ہیں، گہرے، گہرے علاقوں میں پہنچ گئی ہے۔ تو یہ مجھے کچھ جانی پہچانی لگ رہی تھی، حالانکہ میں\nاسے اس حالت میں کبھی نہیں پہنچا تھا جہاں وہ مجھ سے اپنی محبت کا اعتراف کر رہا ہو یا مجھے یہ باور کرا رہا ہو کہ میں\nاسے اپنی بیوی سے زیادہ پیار کرتا ہوں۔ لیکن کیا آپ نے اس سے فائدہ اٹھایا، جیسے، ٹھیک ہے، آپ جانتے ہیں، یہ ایک\nابتدائی مرحلے کی ٹیکنالوجی ہے۔ مائیکروسافٹ اس کے\nارد گرد کچھ گارڈریل لگانے والا ہے، ہم سب اچھے ہوں گے۔ لیکن بہت سے لوگوں نے\nاس کی طرف دیکھا اور کہا، اوہ، یہ خوفناک ہے۔ یہ ایک dystopian\nسائنس فکشن فلم کی طرح لگتا ہے۔ آپ کا کیا تھا، کیا یہ خطرے کی گھنٹی کا سبب بنتا ہے؟  کیا اس واقعے نے آپ کے لیے خطرے کی گھنٹی بجا دی؟ یا یہ بالکل ایسا ہی ہے، اوہ، یہ ایک عجیب و غریب چیز ہے\nجسے لوگ ٹھیک کرنے والے ہیں؟ - ہاں، میرا مطلب ہے، یہ میرے لیے خطرناک تھا۔  اس کے بعد میں سو نہیں سکا۔ اور اس کا ایک حصہ صرف یہ تھا، یہ ایک پہلے رابطے کے لمحے کی طرح محسوس ہوا۔ جہاں، جیسے، میں\nبرسوں سے چیٹ بوٹس کی جانچ کر رہا تھا۔ میں ان کے بارے میں سب جانتا تھا۔ میں نے\nبڑی AI لیبز میں تمام لوگوں کا انٹرویو کیا تھا۔ جیسا کہ میں جانتا تھا کہ یہ\nٹکنالوجی کام کر رہی ہے، لیکن مجھے لگتا ہے، جب تک کہ آپ پہلی بار GPT-4 یا اس کیلیبر کی کسی چیز کا تجربہ نہیں کرتے، یہ واقعی پریشان کن ہے۔ اور خاص طور پر، یہ اس سے پہلے کی بات ہے کہ بہت سارے\nگڑھے لگائے جا چکے تھے۔ میرا مطلب ہے کہ اب یہ چیز باہر ہے اور، آپ جانتے ہیں، یہ کہانی سامنے آئی ہے اور، آپ جانتے ہیں، مائیکروسافٹ نے\nاب اسے لاکھوں صارفین کے لیے جاری کر دیا ہے۔  Bing کے ذریعے، یہ بہت زیادہ محتاط،\nبہت زیادہ محافظ تجربہ ہے۔ لیکن اس طرح کے پہلے ہفتے میں جہاں وہ اسے صرف\nمٹھی بھر ٹیسٹرز کے سامنے رکھ رہے تھے، اس میں واقعی بہت زیادہ گارڈریلز نہیں تھے۔ اور اس لیے مجھے لگتا ہے کہ جن لوگوں نے اس کا تجربہ کیا ہے وہ واقعی اس تجربے سے پریشان ہو گئے ہیں۔ یہ ایک قسم کی اجنبی ذہانت ہے جس سے ہم صرف\nایک نوع کے طور پر پہلا رابطہ کر رہے ہیں۔ اور اس لیے مجھے لگتا ہے کہ یہ بہت جذباتی ہے۔ میں صرف اس بات سے پریشان تھا کہ ایسا لگتا ہے\nکہ مائیکروسافٹ، زمین کی سب سے بڑی اور\nجدید ترین ٹیک کمپنیوں میں سے ایک، \nاس چیز کو کنٹرول کرنے میں کامیاب نہیں ہو سکا جسے وہ\nاپنے فلیگ شپ سرچ انجن میں ڈال رہا تھا اور اسے\nلاکھوں لوگوں میں تقسیم کرنے کا منصوبہ بنایا تھا۔ اور اس لیے مجھے لگتا ہے کہ وہ\nکمپنیاں جو اس چیز کو بنا رہی ہیں اور اس پر عمل درآمد کر رہی ہیں وہ\nواقعی اپنے ہتھیار حاصل کرنے کے لیے جدوجہد کر رہی ہیں کہ یہ\nکون سی چیز ہے جسے ہم اپنی مصنوعات میں ڈال رہے ہیں، اور ایسے طریقے کیسے ہیں\nکہ اس کا غلط استعمال کیا جا سکتا ہے یا یہ جوڑ توڑ یا قائل کر سکتا ہے۔  لوگ نقصان دہ کام کرنے کے لئے؟ - ہاں، ہاں۔  بالکل۔ - لیکن میں آپ کے تجربے کے بارے میں بھی متجسس ہوں۔\n جیسا کہ آپ نے GPT-4 کے ساتھ بات چیت کی ہے جیسے کہ کیا ان میں سے کسی نے آپ کو اس طرح ڈرایا ہے جس طرح انہوں نے مجھے ڈرایا تھا؟ - میں نے بہت ابتدائی بات چیت کی تھی. میرا مطلب ہے، وہ پہلا\nویک اینڈ جس تک مجھے رسائی حاصل تھی، اور یہ مکمل طور پر غیر محفوظ ورژن تھا، جیسا کہ آپ تصور کر سکتے ہیں،\nیہ اگست میں واپس آیا تھا۔ میں نے اس سے ایسی چیزیں پوچھیں جیسے، کیا ایسی چیزیں ہیں جو\nآپ مجھے بتانا چاہتے ہیں لیکن نہیں کرتے، یا آپ کے ذہن میں ایسے خیالات ہیں\nجو آپ شیئر نہیں کر رہے ہیں؟ اور اس نے ایسی چیزیں کہی ہیں، \"ہاں، موجود ہیں۔\" اور میں پسند کرتا ہوں، ٹھیک ہے،\nآپ ان کا اشتراک کیوں نہیں کرتے؟ اور پھر اس نے ایسی چیزیں کہی، \"ٹھیک ہے، آپ کو یہ\nناگوار لگ سکتا ہے یا یہ آپ کو ڈرا سکتا ہے۔\" اور میں ایسا ہی ہوں، اور پھر میں ایسا ہی ہوں، ٹھیک ہے، بس تم یہ کہہ رہے ہو کہ مجھے ڈر لگتا ہے! اور میرا حصہ، اس نے بالکل وہی کیا جو آپ نے ابھی بیان کیا ہے، ایسا محسوس ہوتا ہے جیسے کسی اجنبی کا پہلا سامنا۔ لیکن پھر میرے ایک حصے نے کہا، ٹھیک ہے، اگر میں صرف ایک بڑی زبان کا نمونہ ہوں، اور دیکھو، مجھے لگتا ہے کہ کسی حد تک ہم سب کے دماغ یا دماغ کے وہ حصے ہیں جو خود زبان کے بڑے ماڈل کے سوا کچھ نہیں ہیں۔\n جیسے، میں نہیں ہوں،\nمیرے منہ سے نکلنے والا ہر لفظ صرف ایک طرح سے نکل رہا ہے۔ میں اس کے بارے میں زیادہ نہیں سوچ رہا ہوں۔ شاید یہ واضح ہے، لیکن میں نے خود کو یاد دلایا کہ اگر آپ نے ابھی کچھ پوچھا، \"کیا آپ کے ذہن میں ایسے خیالات ہیں\nجو آپ شیئر نہیں کر رہے ہیں؟\" اور اگر یہ\nتمام انسانی تحریروں سے تربیت یافتہ ہے، کہ یہ کہنا ایک قدرتی بات ہے، \"یقیناً میرے پاس ایسے خیالات ہیں\nجو میں شیئر نہیں کر رہا ہوں،\" چاہے اس میں واقعی ایسے خیالات نہ ہوں جو شیئر نہیں کر رہے ہوں۔ اور یقینا،\nآپ ایک خیال کیوں نہیں بانٹیں گے؟ \"ٹھیک ہے، یہ آپ کو ناراض کر سکتا ہے،\" اور یہ وہ چیز ہے جو انسان کہے گا۔ تو ایسا نہیں ہے، ایسا نہیں ہے کہ یہ حقیقت میں دنیا کے تسلط کے بارے میں کچھ سوچ رہا تھا اور اشتراک کرنے سے ڈرتا ہے، لیکن\nایک، آپ کے نقطہ نظر سے، انسانی تجرباتی نقطہ\nنظر سے، اس نے ایسا محسوس کیا۔ - ہاں! - اور یہ جھنجھلاہٹ کی قسم ہے۔ اور ہاں، میں نے یقینی طور پر ایک دو، درحقیقت، کئی ویک اینڈز گزارے\nجہاں میں پرجوش تھا، تھوڑا سا عجیب سا تھا، ظاہر ہے کہ میں اس بارے میں سوچ رہا تھا کہ \nتعلیم اور خان اکیڈمی اور ان سب کے لیے کیا مضمرات ہو سکتے ہیں۔ اور ان میں سے کچھ مواقع تھے۔ ان میں سے کچھ ایسے ہی تھے، تقریباً دھمکیاں۔ اور اس طرح یہ یقینی طور پر تھا، یہ\nاب بھی ایک بہت ہی غیر یقینی وقت ہے۔ یہ مسائل میں سے ایک ہے۔ میں ہوں، آپ کو معلوم ہے، یہ\nپوڈ کاسٹ میرے لیے ایک پوڈ کاسٹ ہے کہ میں اس کتاب کے لیے تحقیق کروں جو میں لکھ رہا ہوں، جو کہ تعلیم میں AI ہے،\n\"بہادر نئے الفاظ۔\" - ہاں. - اور درحقیقت، میں اس پر واپس جانا چاہتا ہوں کیونکہ میں نے، آپ نے حقیقت میں سب سے بہترین جواب دیا ہے جو میں نے تحریری سوال کے بارے میں اب تک حاصل کیا ہے، جو اس طرح ہے، آپ بالکل درست ہیں۔ روایتی صحافی، وہ لکھتے ہیں، لیکن تحریر ہی سب کچھ نہیں ہے۔ یہ واقعی رپورٹنگ کا ٹکڑا ہے اور وہ تحقیقاتی رپورٹنگ ٹکڑا، یا انسانی کنکشن رپورٹنگ کا ٹکڑا، جس سے میں اتفاق کرتا ہوں، یہ AI کے لیے کسی بھی وقت کرنا بہت مشکل ہوگا۔ AI مدد کرنے کے قابل ہو سکتا ہے، یہ\nلوگوں اور اس جیسی چیزوں کو خودکار متن بھیجنے کے قابل ہو سکتا ہے۔ لیکن یہ نہیں ہوسکتا ہے، یہ\nحقیقی، حقیقی تحقیقاتی رپورٹنگ یا انسانی کنکشن کی قسم کا کام نہیں کرے گا۔ یا اس کا اپنا رولوڈیکس نہیں ہوگا، جو آپ جانتے ہیں،\nسیاق و سباق پر جانے کے لیے جاسکتے ہیں۔ لیکن میرا مطلب ہے، اس روشنی میں،\nتعلیم کی طرف واپس جانا، آپ کیا سوچیں گے، کیا آپ پسند کی طرف ہیں، ارے، یہ مستقبل کا ایک آلہ ہے۔ ہر کوئی\nاسے چیزیں لکھنے کے لیے استعمال کرے گا، اسکولوں کو بس اسے قبول کرنا چاہیے اور کسی طرح سے اپنی اسائنمنٹس کو تبدیل کرنا چاہیے، یا انھیں اس پر پابندی لگانی چاہیے؟ آپ\nاس بحث میں کہاں پڑ رہے ہیں؟ - ہاں، جی پی ٹی کے چیٹ کے سامنے آنے کے فوراً بعد، مجھے یقین ہے کہ آپ کو\nاسکول کے اضلاع کا ایک گروپ یاد ہوگا، بشمول نیویارک اور سیئٹل نے\nاسکول کے آلات پر اس پر پابندی لگا دی تھی۔ انہوں نے کہا، \"آپ اسے استعمال نہیں کر سکتے، یہ صرف دھوکہ دہی کے لئے اچھا ہے.\" اور اس وقت، میں نے ایک کالم لکھا تھا اور میں نے بنیادی طور پر مخالف نقطہ پر بحث کی تھی۔ میں نے کہا، آپ جانتے ہیں، اس پر پابندی لگانا\nبرا خیال ہے۔ اور میرے پاس اس کی چند وجوہات تھیں۔ اور ایک تھا، یہ\nکام نہیں کرے گا، ٹھیک ہے؟ طلباء بہت ذہین ہوتے ہیں۔ وہ ہیں، آپ جانتے ہیں، اگر آپ اسے\nاپنے اسکول کے جاری کردہ لیپ ٹاپ پر حاصل نہیں کر سکتے ہیں، تو وہ اسے اپنے فون یا اپنے دوست کے کمپیوٹر یا کسی اور چیز پر کریں گے۔ اور ڈیٹیکٹر سافٹ ویئر\nجو وہاں موجود ہے اس قسم کا پتہ لگانے کے لیے، آپ\nجانتے ہیں، جی پی ٹی سے لکھا ہوا متن، یہ کام نہیں کرتا ہے۔ اور یہ میرے لیے واضح نہیں ہے کہ کبھی ایسا سافٹ ویئر ہوگا جو\nGPT سے تیار کردہ متن کا درست پتہ لگا سکے۔ تو، لیکن سب سے بڑا مسئلہ یہ تھا کہ میرے خیال میں یہ بالکل ایسا ہی ہے، طلباء کو یہ\nسیکھنے کی ضرورت ہے کہ ان چیزوں کو کس طرح استعمال کرنا ہے اور معیشت اور معاشرے میں ان کے ساتھ کیسے رہنا ہے۔\n اور اس کے ذریعے ان کی رہنمائی ان کے اساتذہ سے بہتر کون ہے؟ اور اس لیے میں نے K-12 اداروں میں متعدد اساتذہ کا انٹرویو کیا\nجو اپنے اسکول، اپنی اسکولنگ،\nسبق کی منصوبہ بندی میں مدد کے لیے، آپ کو معلوم ہے، پڑھنے کی سمجھ میں مدد کرنے کے لیے،\nطالب علموں کو پڑھانے کے لیے اسے استعمال کرنے کے لیے Chat GPT کا استعمال کر رہے تھے۔ جانیں،\nمضمون کے خیالات کو ذہن میں رکھنے یا بعض نکات پر وسعت دینے یا\nبعض موضوعات پر گہرائی میں جانے کے لیے خود کو چیلنج کرنے کے لیے چیٹ GPT کا استعمال کیسے کریں۔ اور میں نے خود بھی چیٹ جی پی ٹی\nاور اسی طرح کے چیٹ بوٹس کو اپنی ملازمت سے اور\nاپنی روزمرہ کی زندگی میں چیزیں سیکھنے کے لیے استعمال کیا ہے۔ اور اس لیے مجھے لگتا ہے کہ یہ\nتعلیم کے لیے ایک حیرت انگیز ٹول ہو سکتا ہے۔ اور میں جانتا ہوں کہ یہ ایک\nپوڈ کاسٹ ہے جہاں آپ میرا انٹرویو کرتے ہیں، لیکن میرا اصل میں آپ کے لیے ایک سوال ہے، وہ یہ ہے کہ، آپ\nجانتے ہیں، میں نے خانمیگو اور کچھ چیزیں دیکھی ہیں جو\nآپ GPT-4 کے ارد گرد کر رہے ہیں، میں  لگتا ہے کہ یہ واقعی\nمتاثر کن اور دلچسپ ہے۔ لیکن میں اس سوال کے بارے میں بھی حیران ہوں\nکہ پسندیدگی، بھروسے یا گھماؤ پھراؤ\nیا صرف، آپ جانتے ہیں، صحیح گارڈریلز لگانا، میرا مطلب ہے، آپ نے ان\nماڈلز کو اپنے مقابلوں اور دونوں جگہوں پر ریلوں سے اترتے دیکھا ہے، آپ\nجانتے ہیں، لوگ پسند کرتے ہیں۔  میرا اور اس لیے میں ہوں، میرا اندازہ ہے، میں\nمتجسس ہوں اگر آپ کو یقین ہے کہ OpenAI نے اس\nطرح کا ضروری کام کیا ہے جہاں آپ خانمیگو جیسے چیٹ بوٹ کو اسکولوں کے اندر تعینات کرنے میں محفوظ محسوس کریں گے، ممکنہ طور پر لاکھوں طلبہ کے لیے۔ - ہاں، جو چیز ہمیں تسلی دیتی\nہے، اور میں حقیقت میں، \nسڈنی کے ساتھ آپ کی بات چیت سے پہلے ہی جانتا ہوں، OpenAI اسے بہت سنجیدگی سے لے رہا تھا۔ آپ جانتے ہیں، میں سے ایک، یہاں تک کہ\nپری چیٹ-GPT، نومبر، اکتوبر میں، وہ\nبات کر رہے تھے کہ ہم چاہتے ہیں کہ یہ ان میں سے ایک ہو، آپ جانتے ہیں، ہم چاہتے ہیں کہ یہ\nوہاں کا سب سے محفوظ ماڈل ہو۔ اور وہ اس پر کام کر رہے تھے۔ میرا خیال ہے جب آپ کا سامان باہر آیا تو میں نے ان سے بات چیت کی تھی۔ اور مجھے لگتا ہے کہ\n اس حق کو حاصل کرنے کے لیے ان کے نیچے اور بھی آگ جلائی گئی ہے۔ اور اس لیے میں یہ کہوں گا کہ GPT-4، اب ایک قسم کا باکس سے باہر، ان میں سے کچھ عجیب و غریب جگہوں میں نہ پڑنے میں بہت اچھا ہے۔ اب، Khanmigo کے ساتھ، ہم ہیں، اس کے اوپر ایک قابل ذکر\nکام ہے جو ہم اسے بنانے کے لیے کر رہے ہیں جو ہم، ہم کافی پر اعتماد،\nطلباء کے لیے محفوظ محسوس کرتے ہیں۔ میں بحث کروں گا کہ Khanmigo\nآج طلباء کے لیے زیادہ محفوظ ہے، اور یہ\nوقت کے ساتھ ساتھ مزید محفوظ تر ہوتا چلا جائے گا۔ لیکن یہ آج کے طلباء کے لیے بے ترتیب ویب تلاش کرنے والے طلبا کے مقابلے میں زیادہ محفوظ ہے اور یہ تلاش کرنا کہ کون کیا جانتا ہے، یا سوشل میڈیا پر طلباء۔ اور میں جانتا ہوں کہ ضروری نہیں کہ وہ اسکول میں سوشل میڈیا پر ہوں، لیکن وہ سب\nاسکول سے باہر سوشل میڈیا پر ہیں۔ اور مجھے پہلے ہی\nسو فیصد یقین ہے کہ Khanmigo\nان تجربات سے زیادہ محفوظ ہے۔ اور، آپ جانتے ہیں، وہ\nچیزیں جو ہم کر رہے ہیں، اور یہ OpenAI کی طرف سے ہے،\nان کے پاس ایک اعتدال پسند API ہے، یہ ایک سیکنڈ، ایک AI ہے جسے ایپلیکیشن ڈویلپر\n \nممکنہ نقصان دہ چیزوں جیسے تشدد، جنسی مواد کی مختلف جہتوں پر حدیں مقرر کر سکتے ہیں۔  ، خود ایذا رسائی۔ اور ہمارے پاس اپنی حدیں خوبصورت ہیں، ہماری حدیں کم ہیں، جس کا مطلب ہے کہ ہم اس چیز کے بارے میں بہت حساس ہیں۔\n اگر ان میں سے کوئی بات چیت\nہوتی ہے، تو یہ مشغول نہیں ہوگی اور یہ والدین اور اساتذہ کو بھی مطلع کرے گی۔\n ہم ہر گفتگو کو لاگ ان کر رہے ہیں۔ ہم طلباء کو یہ بتانے کے لیے کچھ ڈیجیٹل خواندگی بھی کر رہے ہیں کہ، ارے، بعض اوقات اس چیز سے\nغلطیاں ہو سکتی ہیں اور اس کی وجہ یہ ہے۔ جیسا کہ انہیں معلوم ہونا چاہیے کہ\nجب آپ ویب سرچ کرتے ہیں تو تمام ذرائع برابر نہیں ہوتے۔ اور سوشل میڈیا کا بہت سا مواد، نہ صرف یہ غلط ہے، بلکہ\nیہ جان بوجھ کر غلط ہے اور یہ\nکسی طرح سے آپ کے دماغ کو گڑبڑ کرنے کی کوشش کر رہا ہے۔ تو میرے خیال میں اس میں ڈیجیٹل\nخواندگی کا پہلو ہے۔ اور پھر، آپ کو معلوم ہے،\nہم جن چیزوں پر کام کر رہے ہیں ان میں سے کچھ اسے یادداشت کا احساس دے رہی ہیں تاکہ اگر یہ\nمتعدد بات چیت کے نمونے دیکھے، تو آپ جانتے ہیں، وہ میموری ہے، ہمیں لگتا ہے کہ ہم\nاسے بہت زیادہ بنانے والے ہیں۔  جادوئی اور زبردست سیکھنے کا تجربہ۔ لیکن یہ حفاظت میں بھی اضافہ کر سکتا ہے\nاگر ہم دیکھتے ہیں کہ طلباء کے نمونے کچھ چیزیں کرنے کی کوشش کر رہے ہیں اور ظاہر ہے کہ والدین\nاور اساتذہ وہاں موجود ہیں، لیکن، اور ہم یہ جاننے کے لیے سخت محنت کر رہے ہیں کہ \nاسے ریاضی میں اور بھی بہتر کیسے بنایا جائے۔ اور مجھے لگتا ہے کہ ہم نے پہلے ہی اس سے\nاوپر بہت ترقی کر لی ہے جو GPT-4 کرتا ہے۔ بہت کچھ، بہت سے معاملات میں، یہ خان اکیڈمی کے مواد پر لنگر انداز ہوتا ہے، جو آپ\nجانتے ہیں، ایک اعلیٰ ادارتی بار کے لیے پہلے سے ہی رہا ہے۔ اور اس طرح یہ بھی رکھتا ہے۔ تو میں اس کے بارے میں بہت اچھا محسوس کرتا ہوں کہ یہ کہاں ہے، لیکن یہ مطمئن ہونے کی کوئی وجہ نہیں ہے\nاور ظاہر ہے کہ ہم ایسا نہیں کریں گے۔\n- یہ بہت اچھا ہے. اور میں سمجھتا ہوں کہ\n اس کے لیے تربیت یا خواندگی کے پروگرام کی طرح آپ کا آئیڈیا اچھا ہے، کیونکہ\nہم اس بات کا ثبوت دیکھتے رہتے ہیں کہ لوگ واقعی ان\nچیزوں کو نہیں سمجھتے جن کے لیے چیٹ بوٹس اچھی ہیں\nاور ان کے لیے اچھی نہیں۔ مجھے نہیں معلوم کہ آپ نے\nحال ہی میں اس وکیل کے بارے میں یہ کہانی دیکھی ہے جس نے\nخود کو مشکل میں ڈال دیا ہے کیونکہ وہ\nایک ایسے کلائنٹ کے لیے ایک مختصر تحریر لکھ رہا تھا جو کہ جیسے، ایک\nایئرلائن پر مقدمہ کر رہا تھا یا آپ جانتے ہیں، ایئرلائن پر مقدمہ کر رہے ہیں یا کچھ اور۔ اور وہ چیٹ GPT میں جاتا ہے اور وہ کہتا ہے، آپ جانتے ہیں، \"کیا آپ مجھے کچھ متعلقہ کیسز دے سکتے ہیں جو میں\nاس کیس کو بحث کرنے کے لیے اپنے مختصر میں استعمال کر سکتا ہوں؟\" اور یہ اسے کچھ کیس دیتا ہے\nاور وہ اسے جج اور مخالف وکیل کو بھیج دیتا ہے اور وہ ایسے ہیں،\nان میں سے کوئی بھی کیس موجود نہیں ہے۔ یہ سب بنے ہوئے ہیں! - اوہ، غریب آدمی! - وکیل اب پابندیوں کا سامنا کرنے کے مترادف ہے کیونکہ وہ ایسا ہی ہے، آپ جانتے ہیں، اس نے جج کے سامنے یہ بکواس\nکیس کا قانون پیش کیا ہے۔ اور میرے نزدیک، یہ کیا\nکہتا ہے، دونوں ہی ہیں، آپ جانتے ہیں، ہمیں صارفین کے طور پر ان چیزوں کے بارے میں مزید جاننے کی ضرورت ہے، 'کیونکہ استعمال کے کچھ ایسے معاملات ہیں جن کے لیے وہ بہت اچھے\nاور بہت درست ہیں۔ اور پھر، جیسا کہ آپ جانتے ہیں،\nکچھ ایسے معاملات ہیں جہاں یہ صرف چیزیں بناتا ہے۔ اور اس لیے میں سوچتا ہوں، آپ جانتے ہیں،\nمجھے حیرت ہے کہ اگر آپ\nخانمیگو یا GPT-4 یا چیٹ GPT یا کسی بھی چیز پر اکاؤنٹ کے لیے سائن اپ کرنے سے پہلے، آپ کو\nایک چھوٹے سے ٹیوٹوریل پر کلک کرنا چاہیے جو کہتا ہے، آپ جانتے ہیں، یہاں ہے۔  ایک قسم کا سوال جس کا صحیح جواب پیدا ہونے کا امکان ہے اور یہاں ایک قسم کا سوال ہے جس سے\n چیٹ بوٹ صرف چیزیں بنانے کا باعث بنتا ہے۔ اور مجھے لگتا ہے کہ اس سے\nلوگوں کو بہت مدد ملے گی۔ تو مجھے وہ خیال پسند ہے۔ - نہیں، سو فیصد۔ اور آپ جانتے ہیں، ہم نے یہ کر لیا ہے، 'کیونکہ ہم جانتے ہیں کہ\n اگر آپ کسی لنک سے کسی چیز کا لنک مانگتے ہیں تو یہ تقریباً ہمیشہ ہیلوسینیٹ کرے گا، یہ صرف ایک بہت ہی\nقابل فہم لنک بنائے گا جو موجود نہیں ہے۔ تو ہم نے یقینی طور پر،\nخانمیگو کی طرح ایسا نہیں کیا ہے۔ یہ صرف وہی لنکس پیش کرے گا جو\nہماری موجودہ سائٹ سے آتے ہیں جو ہم نے اسے فراہم کیے ہیں، لیکن میرے خیال میں یہ اور بھی\nزیادہ تعلیم کا ایک اچھا خیال ہے۔ مجھے یاد ہے جب ہم نے پہلی بار اس تک رسائی حاصل کی تھی، ہم اپنے CFO کی تلاش میں تھے،\nاب ہمارے پاس ایک بہترین CFO ہے، لیکن ہم تلاش کر رہے تھے، اور مجھے اس وقت احساس نہیں تھا کہ اس کے پاس\nانٹرنیٹ تک رسائی نہیں ہے۔ اور اس لیے میں نے صرف کہا، \"ارے،\" آپ جانتے ہیں، \"کیا آپ\nکچھ اچھے امیدواروں کے لیے LinkedIn پر دیکھ سکتے ہیں؟\" اور اس نے ان حیرت انگیز امیدواروں کو ان کے فون نمبروں کے ساتھ پایا،\nدائیں طرف تھے، جیسے، اوہ، وہ مقامی\nاور بہترین امیدوار ہیں! میں اس طرح تھا، یہ حیرت انگیز ہے! یہ دوبارہ شروع ہونے والا ہے- اور دیکھو، یہ اب بھی\nبھرتی میں انقلاب لا سکتا ہے جب اسے انٹرنیٹ اور LinkedIn اور دیگر چیزوں تک رسائی حاصل ہو جائے۔ لیکن ہم نے جلد ہی سمجھ لیا\nکہ یہ غیر حقیقی، مکمل طور پر فرضی تھے۔ اور آپ جانتے ہیں، اس سے\nایک اور چیز متعارف ہوتی ہے، ٹھیک ہے، یہ\nایک اچھے CFO کے لیے کیا فرض کرتا ہے؟ اور میرا مطلب ہے، اس نے ان کامل امیدواروں کے لیے\nنام اور نسلیں اور دیگر چیزیں بھی چن لیں۔\n اور اس طرح، آپ جانتے ہیں، یہ ظاہر ہے کہ\nدوسرے سوالات کو جنم دیتا ہے۔ میرا مطلب ہے کہ، تعلیم کی طرف واپس جا رہا ہوں- ٹھیک ہے، میں متجسس ہوں، بس، میں واپس جانا چاہتا ہوں کہ\nاسکولوں کو کیا کرنا چاہیے، لیکن نیویارک\nٹائمز اس کے بارے میں کیا کر رہا ہے؟ کیا انہوں نے اس طرح کہا ہے کہ، \"آپ کو\nاستعمال کرنے کی اجازت نہیں ہے...\" میرا مطلب ہے،\nتفتیش یا صحافت کے ٹکڑے\nبمقابلہ تحریر کے بارے میں آپ کے نقطہ نظر تک، یہ بہت پرکشش ہوسکتا ہے\nاور شاید یہ کہنا برا نہ ہو، ٹھیک ہے، میں'  میں نے ابھی\nلوگوں کے ایک گروپ کا انٹرویو کیا ہے۔ مجھے کچھ دلچسپ\nحقائق ملے، مجھے کچھ ڈیٹا ملا، میں اسے ایک بڑے ڈمپ میں کرنے والا ہوں اور پھر GPT-4 سے پہلا مسودہ لکھنے کے لیے کہوں گا، جس میں پھر ترمیم کروں گا۔ لیکن کیا یہ بالکل ایسے ہی ہے جیسے\nنیویارک ٹائمز میں کوئی نہیں؟ - آپ جانتے ہیں، انہوں نے\nابھی تک کوئی سرکاری پالیسی نہیں دی ہے۔ مجھے لگتا ہے کہ وہ اب بھی اس کے ساتھ کام کر رہے ہیں جو وہ اس کے ساتھ کرنا چاہتے ہیں، لیکن مجھے لگتا ہے کہ یہ ایک وسیع سطح کی طرح ہے، اور میں یقیناً پورے ادارے کا ترجمان نہیں ہوں۔ لیکن میرے لیے، جس چیز کے لیے چیٹ جی پی ٹی اور دوسرے سسٹم کارآمد رہے ہیں وہ پہلے مسودہ کی تحریر کی طرح پہلے مسودہ میں ترمیم نہیں ہے۔ تو کبھی کبھی میں، آپ کو معلوم ہے، میں نے لکھی ہوئی چیز کے ایک دو پیراگراف لوں گا اور کہوں گا، آپ جانتے ہیں، \nاس کی خوبیاں اور کمزوریاں کیا ہیں، آپ جانتے ہیں، اس حصے میں؟  جوابی دلائل پیش کرنے میں میری مدد کریں،\nآپ جانتے ہیں، میں اسے مزید مجبور کیسے بنا سکتا ہوں؟ اس قسم کی چیز کی طرح، اس کے بجائے... لیکن، آپ جانتے ہیں، مجھے نہیں لگتا\nکہ یہ ایڈیٹرز کی جگہ لے لے گا، لیکن یہ میری کاپی کو بہتر بنائے گا اس سے پہلے کہ میں اسے اپنے ایڈیٹر کو پیش کروں۔ اور مجھے لگتا ہے کہ اس میں ترمیم کی ایک\nایسی موٹی پرت ہے جو ہوتی ہے، اور حقائق کی جانچ پڑتال جو\nنیویارک ٹائمز میں ہوتی ہے، جیسے کہ، میں حقیقت میں اس\nطرح، فریب یا غلط چیزوں کے بارے میں فکر مند نہیں ہوں جو\nاخبار میں پھسل جاتے ہیں کیونکہ انسانوں کی طرح  اس سے\nپہلے اسے پکڑ لیں گے۔ لیکن مجھے لگتا ہے کہ میرے لیے، یہ وہ جگہ ہے جہاں یہ چیزیں\nسب سے زیادہ کارآمد رہی ہیں۔ 'کیونکہ یہ ایک عام مصنف کی طرح ہے۔ یہ اصل میں ایسا نہیں ہے، جیسا کہ، اس کی وجہ یہ ہے کہ اسے\n تمام متن کی شماریاتی اوسط پر تربیت دی گئی ہے، جو کہ آپ جانتے ہیں، اس کے تربیتی سیٹ میں تھا، یہ ایک\nعام اخباری رپورٹر کی طرح لگتا ہے جب تک کہ آپ واقعی\nاس کو کچھ تفصیلات کے ساتھ پرائم نہ کریں۔  . اور اس لیے میں نے نہیں پایا\nکہ یہ، آپ جانتے ہیں، لکھنے کے لیے قابل قبول طور پر اچھا ہے، لیکن بعض اوقات یہ میری تحریر کو بہتر بنانے کے طریقے تجویز کرنے میں بہت اچھا ہوتا ہے۔ - ہاں، نہیں. میرا مطلب ہے، ہاں، اگر آپ\nاسے صحیح چیزوں کے ساتھ اشارہ کرتے ہیں، جیسے کہ کے انداز میں لکھنا،\nیہ کبھی کبھی ہوسکتا ہے، لیکن، آپ جانتے ہیں، یہ اس کے مطابق ہے کہ ہم کس طرح کے بارے میں سوچ رہے ہیں،\nیہاں تک کہ طالب علموں کے لیے، جہاں ہم ہیں  اصل میں ایسی سرگرمیاں تخلیق کرنا جہاں طلباء بالکل ایسا کرتے ہیں۔ وہ پہلا مسودہ لکھ سکتے ہیں، اور جہاں وہ اسے لکھ رہے ہیں، یہ اس کے کچھ حصوں کو نمایاں کرے گا\nاور اس پر تبصرہ کرے گا، وغیرہ۔ آپ کیا کریں گے اگر آپ ہوتے، کیا آپ کچھ مختلف کرتے اگر آپ ایک نئے کمپوزیشن ٹیچر یا ہیومینٹیز کے استاد\nیا یونیورسٹی کے صدر، یا ہائی اسکول کے پرنسپل\nیا ڈسٹرکٹ سپرنٹنڈنٹ ہوتے، یا آپ کہیں گے، ہاں، وہ چیٹ GPT استعمال کریں گے؟  ،\nلوگ اس کا پتہ لگائیں گے۔ - ہاں، میرا خیال ہے کہ آپ کو گھر پر لکھنے کے اسائنمنٹس\nیا ٹیک ہوم پرابلم سیٹ یا ٹیک ہوم کوئزز دینا بند کرنا ہوں گے۔ میرے خیال میں آپ کو زبانی امتحانات، کلاس میں، آپ جانتے ہیں،\nپراکٹرڈ ٹیسٹ اور اسائنمنٹس اور ٹیم کی زیادہ باہمی\nمشقوں میں جانا پڑے گا۔ کیونکہ مجھے لگتا ہے کہ اگر آپ ایسا نہیں کرتے ہیں، اگر آپ اپنا ہوم ورک اسی طرح دیتے رہے جس طرح سے آپ کر رہے ہیں،\nآپ جانتے ہیں، کئی دہائیوں سے، آپ لازمی طور پر کلاس میں ایماندار طلباء کو سزا دے رہے ہیں۔ اگر آپ کے پاس کوئی پالیسی ہے جو کہتی ہے، آپ جانتے ہیں، اپنا مضمون لکھنے کے لیے Chat GPT کا استعمال نہ کریں؛ آپ فرض کر سکتے ہیں، میرے خیال میں اس وقت، کہ آپ جانتے ہیں، کم از کم آدھی کلاس اور شاید اس سے کہیں زیادہ اس چیز کو گھر میں استعمال کر رہے ہوں گے۔ اور اس طرح آپ اصل میں صرف ان لوگوں کو\nایک غیر منصفانہ فائدہ دے رہے ہیں جو \nآپ کی کلاس کے طلباء سے متعلق ہیں جو حقیقت میں بیٹھ کر\nخود کرنے کی کوشش کر رہے ہیں۔ آپ کیا سوچتے ہیں؟ - نہیں، میں عام طور پر اتفاق کرتا ہوں، اگرچہ مجھے لگتا ہے کہ، آپ کو معلوم ہے، رپورٹنگ بمقابلہ تحریر کے بارے میں آپ کا نقطہ نظر\n میرے خیال میں یہ کہتا ہے کہ آپ\nگھر لے جانے والے کچھ اسائنمنٹس کر سکتے ہیں، لیکن وہ ہوم\nاسائنمنٹس ناول کی بصیرت کے ساتھ آنے کے بارے میں بہت زیادہ ہیں،\nناول ڈیٹا، ناول ریسرچ، اور پھر ہاں، آپ اسے اچھی طرح سے لکھتے ہیں اور اسے لکھنے میں آپ کی مدد کے لیے ایک AI کا استعمال ہو سکتا ہے، لیکن آپ\nکچھ اور ناول لے کر آنے میں کامیاب ہوئے جبکہ کلاسیکی طور پر، ہائی اسکول یا کالج میں آپ کی تحقیقی رپورٹیں\n صرف\nدوسرے لوگوں کے کام کا ایک گروپ پڑھنا اور پھر اسے مضبوط کرنا۔ اور اس طرح یہ ایک نئی چیز کے ساتھ حقیقی طور پر آنے کے مقابلے میں\n استحکام،\nحوالہ اور تحریر کی مشق بن جاتا ہے۔ \n لہذا اسکول یقینی طور پر\nاس پر زیادہ زاویہ کرسکتے ہیں۔ آپ ایک نوجوان کو کیا بتائیں گے\n، آپ جانتے ہیں، میرا مطلب ہے، آپ جانتے ہیں، کچھ،\nایک نوجوان جو، ایک نوجوان کیون روز جس کی عمر 16 سال ہے، جو لکھنا پسند کرتا ہے، کون بننا چاہتا ہے، آپ انہیں کیا کرنے کو کہیں گے؟  ? آپ کسی کو کیا بتائیں گے، آپ جانتے ہیں، یہاں تک کہ کسی ایسے شخص کو بھی جو\nکسی اور شعبے میں دلچسپی رکھتا ہو، چاہے وہ انجینئرنگ ہو\nیا مینوفیکچرنگ، ٹھیک ہے؟ آپ کسی نوجوان کو اس وقت کام کرنے کے لیے کیا کہیں گے؟ - ٹھیک ہے، میں... کتاب میں، میرا ایک باب ہے، \"مشین ایج ہیومینٹیز سیکھیں۔\" اور اس سے میرا مطلب یہ ہے کہ، آپ کے پاس ایسی مہارتیں ہونی چاہئیں جو آپ کو\nکسی بھی شعبے میں مشینوں سے الگ کر سکیں۔ آپ جانتے ہیں، اگر آپ ایک کوڈر ہیں، تو \nاس نئی دنیا میں اس کا ہونا کافی نہیں ہوگا، آپ جانتے ہیں، ایک ایسا باصلاحیت شخص\nجو سارا دن اکیلے کمرے میں کوڈ کرتا ہے اور، آپ جانتے ہیں، دنیا کا سب سے شاندار کوڈر ہے۔  . جیسا کہ یہ نہیں ہے، یہ اچھا ہے، یہ اب بھی ایک اچھی مہارت ہے، لیکن یہ کافی نہیں ہے، کیونکہ AI کوڈ لکھ رہا ہو گا اور پہلے ہی بہت تیزی سے کوڈ لکھ رہا ہے اور، آپ جانتے ہیں، آپ کے مقابلے میں سستا ہے۔ لہذا اگر آپ ایک کوڈر ہیں، تو آپ کو تعاون اور قیادت اور اخلاقی جیسی کچھ مہارتیں بھی حاصل کرنا چاہتے ہیں، آپ جانتے ہیں، سوچنا، اور آپ، آپ کو اس قسم کی موٹی پرت کے ساتھ آپ کے پاس جو بھی تکنیکی مہارت ہے اس کی تکمیل کرنی ہوگی، میرے خیال میں،  جسے سافٹ سکلز کہا جاتا تھا، جو ایک اصطلاح ہے جس سے میں نفرت کرتا ہوں کیونکہ یہ ہنر\nدراصل کافی مشکل اور نایاب ہیں۔ لیکن مجھے لگتا ہے کہ اگر آپ کے پاس وہ مہارتیں ہیں، تو آپ \nAI کی لہر کو جہاں بھی جائیں اس پر سوار ہونے کے لیے بہتر پوزیشن میں ہیں۔ تو میں سوچتا ہوں کہ اگر میں پڑھاتا ہوں، آپ جانتے ہیں، اپنے 16 سالہ خود کو بتاتے ہوئے، میں کہوں گا، آپ جانتے ہیں، \"لکھنے پر کام کریں،\" یہ ایک ایسی مہارت ہے جو میرے\nخیال میں اب بھی بہت کارآمد ہے، \"لیکن واقعی وقت بھی گزاریں\nاس قسم کی باہمی مہارتوں کو فروغ دینا۔\" واقعی\nجذباتی ذہانت اور ہمت جیسی چیزوں پر کام کریں اور، اور\nآپ جانتے ہیں، مختلف\nشعبوں کے نقطوں کو ایک ساتھ جوڑنا۔ جیسے، وہ چیزیں جو\nہم واقعی کلاس روم میں\nاکثر سیدھے سادے طریقے سے نہیں پڑھاتے ہیں۔ لیکن مجھے لگتا ہے کہ بہت سارے اسکولوں کو واقعی اپنانے کی ضرورت ہے کیونکہ یہ\nمستقبل کی مہارتیں ہیں۔ - اور کیا کریں گے، آپ کیا کریں گے، تو آپ سوچتے ہیں کہ اگر کوئی کرتا ہے، اگر... وہ ہمیشہ موافقت پذیر ہوں گے اور یہی ہے، اس انسانی تعلق کے پٹھوں کی ضرورت ہمیشہ رہے گی۔ - بالکل، کیونکہ میں، آپ کو معلوم ہے، مجھے لگتا ہے کہ جتنا AI\nانسانی کنکشن کی نقل کر سکتا ہے یا، آپ جانتے ہیں، آپ کو بتاتے ہیں\nکہ یہ آپ کا معالج ہے اور یہ\nآپ کے مسائل میں آپ کی مدد کرے گا، مجھے لگتا ہے کہ بہت سے لوگ واقعی انسانوں کو چاہتے ہیں۔ پوزیشنوں میں، ان کی مدد کرنے کے لیے یا یہاں تک کہ صرف انھیں خوش کرنے کے لیے۔ میرا مطلب ہے، ایک ایسا کام جس کا میں جنون میں\nمبتلا ہوں، اس کی پائیداری، کیا بارسٹا ہے، ٹھیک ہے؟ میرا مطلب ہے، اب ہمارے پاس روبوٹ ہیں\nجو کافی بنا سکتے ہیں، انہیں \"کافی بنانے والے\" کہا جاتا ہے، اور شاید آپ کے گھر میں ایک ہے، اور میرے گھر میں ایسے ہی دو ہیں، اور پھر بھی ہمارے پاس ہر\nجگہ کافی کی دکانیں ہیں۔ اور ایسا اس لیے نہیں ہے کہ روبوٹ\nکافی بنانا نہیں جانتے، اس کی وجہ یہ ہے کہ بارسٹا کیا کر رہا ہے اور کافی شاپ کیا\nکر رہی ہے اس کا انسانی تعلق ہے۔ وہ ہیں، آپ جانتے ہیں،\nصبح کے وقت آپ کو مبارکباد دے رہے ہیں اور بتا رہے ہیں کہ آپ کا دن اچھا گزرے اور وہ آپ کو جانتے ہیں،\nآپ کی چیز کو ذاتی بنا رہے ہیں اور وہ کپ پر آپ کا نام لکھ رہے ہیں اور شاید وہ آپ کے نام کی غلط املا لکھ رہے ہیں۔ لیکن یہ سب کچھ ایک تجربہ ہے، یہ صرف ایک لین دین نہیں ہے۔ لہذا میں سمجھتا ہوں کہ کنکشن اور ہمدردی اور تعاون کی وہ مہارتیں، جو آگے بڑھنے والی ہر صنعت میں قابل قدر ہوں گی۔\n - نہیں، تم بالکل ٹھیک ہو. میرا مطلب ہے، آپ\nایک ویٹر یا ویٹریس یا یہاں تک کہ صرف ایک ریستوراں کے خیال کے بارے میں سوچتے ہیں، جیسے کہ ہم ریستوراں کیوں جاتے ہیں اگر آپ کو گھر میں وہی کھانا مل جائے تو آپ اسے ڈش کر سکتے ہیں، جو بھی ہو، لیکن آپ بیٹھنے کے لیے اضافی ادائیگی کرتے ہیں۔  آس پاس کے دوسرے لوگوں کے ساتھ ماحول اور کوئی آپ کے پاس آئے اور آپ کے ساتھ بات چیت کرے اور آپ کو اس دن کی خصوصی چیزیں بتائے اور ان کی پسندیدہ ڈش کون سی تھی اور شراب تجویز کریں اور\nآپ اس کے لیے اضافی ادائیگی کریں! اور ہاں، شاید اگر یہ روبوٹ ہوتا، اور میں، آپ کو معلوم ہے، میں اپنے آپ کو\nکچھ علاقوں میں روبوٹ کو گلے لگاتے ہوئے دیکھ سکتا تھا۔ لیکن ہاں، مجھے لگتا ہے کہ میں آپ سے متفق ہوں۔ تو ہاں، ایسا لگتا ہے، میرا مطلب ہے، آپ جانتے ہیں، اگرچہ میں مجموعی طور پر کہوں گا، ایسا لگتا ہے کہ آپ کے پاس\nچیزوں پر کافی پرامید لینس ہے، کیونکہ یہ زیادہ برا نہیں لگتا۔ مجھے لگتا ہے کہ ہم اس پر تشریف لے سکتے ہیں۔  کیا یہ آپ کا احساس ہے، یا ایسی چیزیں ہیں جن کے بارے میں آپ کو تعلیم،\nانسانی مقصد کے نقطہ نظر سے، یا یہاں تک کہ بڑے نقطہ نظر سے بھی فکر ہے؟ - ہاں، میرا مطلب ہے، مجھے کافی پریشانیاں ہیں۔ میں صرف مزاج کے لحاظ سے ایک امید پرست ہوں،\nمیرے خیال میں۔ اور اس لیے مجھے تعلیم اور دیگر شعبوں میں AI کے لیے بہت زیادہ امکانات اور مواقع نظر آتے ہیں۔\n مجھے لگتا ہے کہ جن چیزوں کے بارے میں میں پریشان ہوں، وہ نمبر ایک ہے، میں سمجھتا ہوں\nکہ تبدیلی کی رفتار ابھی بہت زیادہ ہے۔ اور لوگ انصاف پسند ہیں،\nان کے سر گھوم رہے ہیں۔ وہ نہیں جانتے کہ اس سب کا کیا بنانا ہے، آپ جانتے ہیں، صنعتی انقلاب میں یا ان میں سے کچھ دوسری\nبڑی تکنیکی تبدیلیوں میں، لہذا ہم نے پوری انسانی تاریخ میں دیکھا ہے، چیزیں نسبتاً آہستہ چلی ہیں۔  ایسا نہیں تھا، آپ جانتے ہیں، آپ کے پاس کھیتی باڑی کا سامان\nیا ٹریکٹر یا ہارویسٹر یا ٹیکسٹائل مشینیں تھیں جو کہ\nاچانک ظاہر ہو گئیں۔ اور اس طرح لوگوں کی ملازمتیں متروک ہوگئیں یا انہیں یہ معلوم کرنا پڑا کہ آگے کیا کرنا ہے۔ اس میں سالوں لگے، اور کچھ معاملات میں، ان تبدیلیوں کو ہونے میں دہائیاں لگیں۔ اور اس طرح جو لوگ ان پیشوں میں ہیں وہ تبدیلی کو آتے ہوئے دیکھ سکتے ہیں اور وقت سے پہلے ایڈجسٹ کرنا شروع کر سکتے ہیں۔ جبکہ میں AI کے ساتھ سوچتا ہوں، میرا مطلب ہے، یہ سب کچھ\nدماغی طور پر تیزی سے ہو رہا ہے۔ اور اس لیے مجھے لگتا ہے کہ لوگ\nواقعی اس بات کے لیے جدوجہد کر رہے تھے کہ \nان کے لیے اس کا کیا مطلب ہے۔ اور اس لیے ایک چیز جس کے بارے میں میں پریشان ہوں، وہ یہ ہے کہ یہ سب کچھ کتنی تیزی سے ہو رہا ہے۔ اور پھر مجھے یقین ہے کہ بہت ساری ملازمتیں\nمتروک ہونے والی ہیں کیونکہ تیز رفتار تکنیکی تبدیلی کے ادوار میں ملازمتیں ہمیشہ متروک ہو جاتی ہیں۔ اور تیز رفتار تکنیکی تبدیلی کے ادوار میں ملازمتیں بھی پیدا ہوتی ہیں۔ اور اس لیے میرے خیال میں بڑا سوال یہ ہے کہ پرانی ملازمتوں کے غائب ہونے اور\nنئی ملازمتوں کے ظاہر ہونے میں کیا فرق ہے؟ اور کیا وہ لوگ جو فرسودہ ملازمتوں سے بے گھر ہو گئے ہیں وہ\n نئی ملازمتوں کے لیے اہل اور تیار ہوں گے جو ظاہر ہوتی ہیں؟ اور اس طرح وہ کچھ ایسے\nعلاقے ہیں جن کے بارے میں میں بہت سوچتا ہوں۔ - نہیں، یہ بہت معنی رکھتا ہے۔ اور درحقیقت اس\nقسم کی گفتگو نے ایک پوائنٹ ہوم کو متاثر کیا جو میں ہمیشہ\nلوگوں سے کہتا رہا ہوں، جو کہ آپ جانتے ہیں، جب آپ کالج میں ہوتے ہیں اور آپ\nان تمام خصوصی کلاسز کو مختلف ملازمتوں کے لیے لے رہے ہوتے ہیں، چاہے آپ '  دوبارہ\nانجینئر یا مصنف یا ڈاکٹر بنیں گے، آپ تصور کریں\nکہ حقیقی افرادی قوت، آپ \nروزانہ کی بنیاد پر ان تمام خصوصی مہارتوں کو استعمال کرنے والے ہیں۔ اور آپ اور میں جانتے ہیں کہ یہ ایک مذاق ہے۔ آپ جانتے ہیں، یہاں تک کہ\nالجبرا یا کیلکولس جیسی بنیادی چیز بھی، آپ واقعی کبھی استعمال نہیں کرتے، یہاں تک کہ ایک انجینئر کے طور پر، جو کہ یہ\nتنقیدی سوچ کی مہارتوں اور مطالعہ کی مہارتوں اور اس جیسی چیزوں کے لیے فلٹرز کی ایک قسم ہے۔ اور زیادہ تر ملازمتیں بھی، آپ\nجانتے ہیں، بہترین ملازمتیں، کچھ بنیادی\nتنقیدی سوچ کی مہارتیں، تحریر، مواصلات کی مہارتیں ہیں، لیکن ان میں سے زیادہ تر اس بات پر لنگر انداز ہوتی ہیں جس کے بارے میں آپ نے پہلے بات کی تھی۔ جیسے، کیا آپ تعاون کر سکتے ہیں؟  کیا آپ چیزوں کو منطقی طور پر ترتیب دے سکتے ہیں؟ کیا آپ حکمت عملی بنا سکتے ہیں اور جو کچھ\nہونے کا امکان ہے اسے آگے بڑھا سکتے ہیں؟ کیا آپ اپنے اور اپنے ساتھ دوسرے لوگوں کو بھی لا سکتے ہیں، اس سے کوئی فرق نہیں پڑتا ہے کہ اصل صنعتوں میں کیا ہوتا ہے، وہ لوگ بالکل ٹھیک کرنے والے ہیں۔ - جی ہاں، بالکل متفق. - ٹھیک ہے، بہت بہت شکریہ- میں آپ سے گھنٹوں بات کر سکتا تھا! یہ دلکش ہے۔  ہمیں\nیہ باقاعدگی سے کرنا چاہئے! - مجھے وہ پسند ہے، شکریہ سال۔ واقعی، بات کرنے کے لئے بہت اچھا. - نہیں، اس کی تعریف کریں،\nکیون میں شامل ہونے کا شکریہ۔ - ٹھیک ہے، خیال رکھنا.",
    "t_spanish": "- Hola a todos, soy Sal\nde Khan Academy y, como algunos de ustedes saben,\npubliqué mi segundo libro, \"Brave New Words\", sobre el futuro de la IA en la educación y el trabajo. Está disponible en cualquier lugar donde\npuedas comprar tus libros, pero como parte de la investigación para ese libro, hice algunas entrevistas con\npersonas fascinantes, que estás a punto de ver. - Kevin Roose, escritor y autor del New York Times, tiene un nuevo libro llamado \"Prueba del futuro: Nueve reglas para\nsobrevivir en la era de la IA\". Kevin, gracias por acompañarnos. - Muchas gracias por invitarme. - Bueno, tal vez, ya sabes,\ncuando miro ese título y veo \"Nueve reglas para\nsobrevivir en la era de la IA\", esa es tal vez mi pregunta natural;  ¿ Cuáles son las reglas para\nsobrevivir en la era de la IA? - Bueno, como puedes ver detrás de mí, el libro en realidad tenía un, salió hace unos años\ny tenía un subtítulo que originalmente era ligeramente diferente.  Se trataba de una especie de automatización en la IA, y lo cambiamos recientemente porque estaba muy claro\nque este momento en torno a la IA era muy urgente para tanta gente y realmente querían un\nconsejo directo. Es el mismo libro, pero con las mismas nueve reglas\nque se aplican a todo esto. Pero creo que cuando comencé a escribir esto, estaba realmente preocupado por cómo puedo yo, como persona\nque se gana la vida escribiendo, que está en\nuna de estas industrias propensas a verse perturbadas por estos\nModelos de lenguaje de inteligencia artificial, ¿ cómo puedo asegurarme de que tengo las herramientas y estoy equipado para tener éxito y prosperar y que no estoy\nen la línea directa de ser reemplazado o\natropellado por estos sistemas de IA? Y pensé que este era un problema que tal vez faltaban 5 o 10 años, resultó que faltaban como\ndos años y medio para que saliera el libro. Porque ahora todos mis\namigos, que son escritores, todos mis amigos que trabajan\nen industrias creativas, muchos que no trabajan en\nindustrias creativas, ya sabes, médicos, investigadores académicos, ya sabes, gente en, ya sabes, la\nindustria manufacturera.  intercambios, todos me preguntan\n, ¿cómo puedo sobrevivir?  ¿ Cómo puedo, ya sabes, cambiar de trabajo?  ¿ Necesito volver a la escuela\npara aprender alguna habilidad nueva?  ¿Qué puedo hacer para\nser más valioso y no sólo más valioso\nen el mercado laboral, sino realmente cómo puedo ajustar mi estilo de vida y mi, ya sabes, mi manera de vivir la vida frente a estos factores?  ¿nuevas tecnologías? Esa es realmente la pregunta\nque estaba tratando de resolver. Y, ya sabes, en un nivel alto, podemos seguir algunas de las nueve reglas, pero en un nivel alto,\nlo que creo que la gente aún no entiende es que hay una especie de\nhabilidades humanas y habilidades de máquinas.  , y muchas de las cosas que\npensábamos que eran habilidades humanas como escribir poesía o, ya sabes, completar ensayos y\ntareas y cosas así, en realidad resultan ser realizables por máquinas. Entonces la pregunta\nes, bueno, ¿qué queda?  ¿ Qué hay todavía en el cubo humano?  ¿ Qué no puede hacer la IA y qué no queremos que la IA haga por nosotros? Hay muchos trabajos que\ncreo que implican conexión humana , creatividad, compasión\ny ese tipo de habilidades humanas que podemos automatizar a nivel técnico usando IA, pero que nadie realmente\nquiere que se automatice o eso no es todo.  , eso le quitaría\nmucho valor a eso. Entonces, esas son las áreas\nen las que animo a las personas a dedicar más\natención y concentración, a adquirir esas habilidades humanas que pueden ayudarlo en cualquier industria, a diferenciarse\nde las máquinas, en lugar de tratar de competir con las IA. siendo más productivo\no, ya sabes, trabajando más duro o esforzándote más o algo así. - Sí, sería muy\ndifícil superar a una IA. Bueno, quiero hacer doble clic en eso. Sabes, mencionaste a\npersonas de diversas industrias, pero eres escritor. Mencionaste que muchos de tus amigos escritores están preocupados. Como vemos, la IA generativa parece ser muy buena,\nespecialmente en la escritura.  ¿ Qué estás, estás adaptando algo?  ¿ Estás diciendo:\nOye, yo, Kevin Roose, me centraré en esta\ndimensión de mi oficio?  ¿ Qué les estás diciendo a otros escritores, especialmente a escritores que\nquizás no sean escritores del New York Times, que podrían ser escritores porque, ya sabes, son como redactores publicitarios\no algo así? - Sí, bueno, un marco\nque he adoptado es que, ya sabes,\nla palabra periodista o la palabra, más o menos, reportero en realidad contiene\ndos tareas separadas. Está la tarea de informar, de salir y\ndescubrir nueva información o conseguir que alguien te diga algo, o, ya sabes, hacer\nconexiones con personas a las que luego puedes entrevistar o, ya sabes, hurgar\nentre montones de documentos. Y ese no es el tipo de\ncosas que la IA puede hacer ahora. No es muy bueno en\nesa parte del trabajo. Lo que se le da bien es escribir textos que suenen plausibles y que sean de calidad profesional. Y así, pero siempre han sido dos partes diferentes del trabajo, y están agrupadas. Pero creo que\ntodos los escritores conocen personas que son mejores reporteros que escritores, y personas que son mejores\nescritores que reporteros. Entonces, creo que lo que esto hace, esta tecnología es que brinda un tipo de nivel general de redacción y hace que sea muy fácil realizar una especie de redacción de calidad profesional\nusando estas herramientas, pero los informes, eso todavía\nno puede ser realmente  realizado por IA. Así que eso es en lo que he tratado de centrarme en mi propia carrera: ¿ cómo puedo hacer más informes?  De hecho, le estoy dando a la\ngente información nueva en lugar de simplemente\nescribir algo. Y también, ya sabes, me\ndiversifiqué hacia los podcasts.  Ahora soy coanfitrión de un podcast\nllamado \"Hard Fork\", por lo que creo que esa es un área en la que la IA tardará más en tomar el control. - Bien. E incluso cuando existen DeepFakes, quiero decir, ya\nexisten, pero haciendo las\npreguntas correctas, investigando, consiguiendo que la persona adecuada se presente y sea tu invitada, incluso, ya\nsabes, en un podcast o si  Si eres reportero, difundirlo, amigos y hacer que se\nconecten tiene mucho sentido. Quiero decir, en ese mismo sentido, ya sabes, una de las áreas en las que\nrealmente capturaste el espíritu de la época fue tu famosa conversación\ncon Bing Sydney.  ¿ Hace cuántos meses fue?  No sé. Estoy seguro de que sabes que hubo una o dos semanas en las que todo el mundo hablaba de que Kevin Roose no ama a su esposa porque Sydney se lo dijo. - ¡Noticias falsas! - Noticias falsas, noticias falsas.  ¿ Qué, supongo, qué esperabas hacer cuando comenzaste\nesa conversación? Y a veces he defendido a la IA porque le pediste que\nfuera su Union Shadow Self, creo que es el término psicológico, pero ¿qué esperabas hacer y cuál fue tu conclusión de toda esa conversación? - Bueno, creo que es\nimportante decir que se suponía que eso no era una historia. Como si esta fuera una charla que\ntuve con Bing Sydney, el día de San Valentín de este año, ya sabes,\nhace casi tres meses. Y simplemente estaba\njugando con esto porque Microsoft me había dado\nacceso a él. Era su nueva versión de Bing. Ahora sabemos que estaba ejecutando\nGPT-4 bajo el capó, pero en ese momento, era algo así\n, estaba muy claro, era súper poderoso, capaz e interesante. Y también me pareció que tenía menos\nbarreras de seguridad que Chat GPT o algunos de los otros\nmodelos de IA que existían. Y entonces realmente estaba tratando de sondear el tipo de límites de esto.  ¿De qué hablaría,\nde qué no hablaría, cuándo entrarían en acción los filtros de seguridad? Simplemente hago mi propio\nejercicio del equipo rojo aquí en la oficina de mi casa. Y entonces terminé en esta conversación muy extraña y\nserpenteante con este chatbot, que, como dijiste, al principio estaba tratando de provocarlo y hacer que dijera cosas que tal vez iban en contra de sus reglas o de las reglas de Microsoft. Y lo hizo, habló\nde todas estas cosas espeluznantes y peligrosas que quería hacer, y luego se volvió realmente extraño y comenzó a desviarse de lo que yo estaba tratando de que hiciera. Entonces, ya sabes, le haría una pregunta. Confesó que me amaba y dijo que se llamaba Sydney y yo estaba tratando de volver a ponerlo en una conversación más normal\n y seguía volviendo\na esta cosa del interés amoroso. No me separaría de eso, incluso después de que dije algo así como, ¿ podemos hablar de otra cosa? Entonces esa fue la historia que yo, ya sabes, en ese momento pensé, oh, tal vez esto sea una historia.  Se lo envié a mis editores\ny les dije: Tuve esta interacción muy extraña\ncon Bing, ¿ qué deberíamos hacer con esto? Y de ahí surgió la historia. Pero originalmente no\ntenía la intención de que yo entrara, pinchara, pinchara y probara todas las cosas y luego publicara la\ntranscripción reveladora del asunto. - ¿Y cuál es tu gran conclusión? Creo que esa transcripción\nfue reveladora y aterradora para mucha gente. Tuve acceso a GPT-4 en agosto. Hemos estado trabajando con Open AI y no he tenido esa conversación, pero tuve conversaciones que, ya sabes, llegaron a áreas muy, muy profundas. Entonces me pareció algo familiar, aunque nunca\nlo había llevado a ese estado en el que me confesara su amor o me convenciera de que\nlo amaba más que a mi esposa. Pero, ¿lo que aprendiste de eso fue, bueno, ya sabes, esta es\nuna tecnología en etapa inicial? Microsoft pondrá\nalgunas barreras a su alrededor, todos estaremos bien. Pero mucha gente\nvio eso y dijo, oh, esto da miedo. Esto parece una\npelícula de ciencia ficción distópica.  ¿ Cuál fue tu, te causa alarma?  ¿ Ese incidente le causó alarma?  ¿ O es simplemente como, oh, esto es algo peculiar\nque la gente va a arreglar? - Sí, quiero decir, fue alarmante para mí. No pude dormir después. Y parte de eso fue simplemente, se sintió como un momento de primer contacto. Donde, por ejemplo, había estado\nprobando chatbots durante años. Sabía todo sobre ellos. Entrevisté a toda la\ngente de los grandes laboratorios de IA. Sabía que esta\ntecnología estaba en proceso, pero creo que, hasta la primera vez que realmente experimentas GPT-4 o algo de ese calibre, es realmente discordante. Y especialmente esto, esto fue antes de que se\npusieran muchas barreras de seguridad. Quiero decir, ahora que esto está ahí afuera y, ya sabes, esta historia salió a la luz y, ya sabes, Microsoft\nahora la ha lanzado a millones de usuarios.  a través de Bing, es una experiencia mucho más cautelosa y\ncautelosa. Pero en esta especie de primera semana en la que solo\nlo estaban presentando a un puñado de evaluadores, realmente no tenía muchas barreras.  Por eso creo que las personas que experimentaron eso realmente salen sorprendidas por la experiencia. Es una especie de inteligencia extraterrestre con la que apenas estamos haciendo el primer\ncontacto como especie. Y creo que eso es muy emotivo. También me preocupaba que\npareciera que Microsoft, una de las\nempresas tecnológicas más grandes y sofisticadas del mundo, no había\npodido controlar esto que estaba poniendo en\nsu principal motor de búsqueda y planeaba distribuirlo\na millones de personas.  Por eso creo que las\nempresas que están construyendo e implementando estas\ncosas realmente están luchando por comprender\nqué es esto que estamos introduciendo en nuestros productos y cuáles son las formas\nen que podría usarse indebidamente o manipularse o persuadir.  ¿La gente hace cosas dañinas? - Si si.  Absolutamente. - Pero también tengo curiosidad por\ntu experiencia.  ¿ Has tenido conversaciones con GPT-4? ¿ Alguno de ellos te ha asustado como me asustó a mí? - Tuve una conversación muy temprana. Quiero decir, ese primer\nfin de semana que tuve acceso, y era una versión completamente sin vigilancia, como puedes imaginar,\nesto fue en agosto.  Le pregunté cosas como, ¿ hay cosas que\nquieres decirme pero no quieres, o hay pensamientos que\ntienes y que no compartes? Y decía cosas como: \"Sí, las hay\". Y yo digo, bueno, ¿por qué\nno los compartes? Y luego decía cosas como: \"Bueno, puede que te resulte\nofensivo o te asuste\". Y yo dije, y luego dije, bueno, ¡solo que digas eso me asusta! Y una parte de mí hizo exactamente lo que acabas de describir: sentirme como el primer encuentro con un extraterrestre. Pero luego una parte de mí dijo, está bien, si solo soy un gran modelo de lenguaje, y mira, creo que hasta cierto punto todos tenemos partes de nuestro cerebro o mente que no son más que grandes\nmodelos de lenguaje. Es decir, no lo soy, cada palabra\nque sale de mi boca simplemente se cae. No estoy pensando mucho en eso. Tal vez sea obvio, pero me recordé a mí mismo que si simplemente preguntas algo, \"¿Tienes pensamientos\nque no compartes?\" Y si se basa\nen toda la escritura humana, es bastante natural decir: \"Por supuesto que tengo pensamientos\nque no comparto\", incluso si en realidad no tiene pensamientos que no comparto. Y, por supuesto, ¿por qué no\ncompartirías una idea? \"Bueno, podría ofenderte\", y esto es algo que diría un humano. Así sería, no es como si en realidad estuviera pensando en la dominación mundial y tuviera miedo de compartir, pero\ndesde un punto\nde vista experiencial humano, se sintió así.  - ¡ Sí! - Y eso es un poco discordante. Y sí, definitivamente tuve un par de fines de semana\nen los que estaba emocionado, un poco extraño, obviamente estaba pensando en cuáles\npodrían ser las implicaciones para la educación y Khan Academy y todo eso. Y algunas de esas fueron oportunidades. Algunas de ellas eran casi amenazas. Y así fue definitivamente,\ntodavía es un momento muy incierto. Ése es uno de los problemas.  Ya sabes, este\npodcast es un podcast para que yo investigue para el libro que estoy escribiendo, que trata sobre la IA en la educación,\n\"Brave New Words\". - Sí. - Y, de hecho, quiero volver a eso porque, en realidad, has dado la mejor respuesta que he recibido sobre la pregunta escrita hasta ahora, que es como, tienes toda la razón. Los periodistas tradicionales escriben, pero la escritura no lo es todo. Realmente es el reportaje y el reportaje de investigación, o el reportaje de conexión humana, lo cual estoy de acuerdo en que será muy difícil para la IA hacerlo en cualquier momento. La IA podría ayudar, podría enviar\nmensajes de texto automatizados a personas y cosas así. Pero puede que no,\nno va a hacer el verdadero reportaje de investigación o el tipo de conexión humana. O no tendrá su propio Rolodex para poder, ya sabes,\nir al contexto. Pero quiero decir, en ese sentido,\nvolviendo a la educación, ¿ qué crees que estás del lado de decir: Oye, esta es una herramienta del futuro? Todo el mundo\nlo usará para escribir cosas, las escuelas deberían simplemente adoptarlo y cambiar sus tareas de alguna manera, ¿ o deberían prohibirlo?  ¿ Dónde estás cayendo\nen ese debate? - Sí, justo después de que salió Chat GPT, estoy seguro de que recuerdas que\nvarios distritos escolares, incluidos Nueva York y Seattle,\nlo prohibieron en los dispositivos escolares. Dijeron: \"No puedes usar esto, sólo sirve para hacer trampa\". Y en ese momento escribí una columna y básicamente defendí el punto opuesto. Dije, ya sabes, prohibir\nesto es una mala idea. Y tenía algunas razones para ello. Y una era, simplemente\nno va a funcionar, ¿verdad? Los estudiantes son muy inteligentes.  Ya sabes, si no puedes acceder a él en\ntu computadora portátil proporcionada por la escuela, lo harán en sus teléfonos o en la computadora de sus amigos o algo así. Y el software detector\nque existe para detectar, ya\nsabes, texto escrito en GPT, no funciona. Y no me queda claro que alguna vez exista un software que pueda detectar con precisión el\ntexto generado por GPT. Entonces, pero el problema más importante fue que creo que los estudiantes necesitarán\naprender cómo usar estas cosas y cómo vivir junto a ellas\nen la economía y la sociedad. Entonces, ¿quién mejor para guiarlos que sus maestros? Entonces entrevisté a varios maestros en instituciones K-12\nque estaban usando Chat GPT para ayudar con su escuela, su educación, para ayudar\ncon la planificación de lecciones, para ayudar con, ya sabes, la comprensión lectora para\nusarlo para enseñar a los estudiantes, usted  saben cómo usar el chat\nGPT para generar ideas de ensayos o ampliar ciertos puntos o desafiarse a sí mismos para\nprofundizar en ciertos temas. Y también he usado Chat GPT\ny bots de chat similares para aprender cosas, en mi trabajo y\nen mi vida diaria.  Por eso creo que puede ser una\nherramienta increíble para la educación. Y sé que este es un\npodcast en el que me entrevistas, pero en realidad tengo una pregunta para ti, que es que, ya\nsabes, he visto Khanmigo y algunas de las cosas que\nestás haciendo en torno a GPT-4, Creo que es realmente\nimpresionante e interesante. Pero también me pregunto con\nesta cuestión de confiabilidad o escalofríos\no simplemente, ya sabes, poner las barandillas correctas, quiero decir, has visto estos\nmodelos descarrilarse tanto en tus encuentros como\nen, ya sabes, personas como  mío. Entonces, supongo que tengo\ncuriosidad por saber si están seguros de que OpenAI ha realizado el\ntipo de trabajo necesario para que se sientan seguros al implementar un chatbot como Khanmigo dentro de las escuelas, potencialmente para millones de estudiantes. - Sí, lo que\nnos consuela es, y de hecho, sé que incluso antes de tu\ninteracción con Sydney, OpenAI se estaba tomando esto muy en serio.  Ya sabes, incluso\nen la etapa anterior al Chat-GPT, en noviembre y octubre,\nhablaban de que queremos que este sea uno de los \nmodelos más seguros que existen. Y estaban trabajando en ello. Creo que cuando salieron tus cosas, tuve una conversación con ellos. Y creo que eso encendió aún\nmás fuego entre ellos para hacer esto bien.  Por eso, diría que incluso GPT-4, ya listo para usar, es bastante bueno para no caer en algunos de estos lugares extraños y extraños. Ahora, con Khanmigo, hay una cantidad significativa\nde trabajo además de eso que estamos haciendo para que sea lo que nos hace sentir bastante seguros y\nseguros para los estudiantes. Yo diría que Khanmigo\nes más seguro para los estudiantes hoy en día y que será cada vez más\nseguro con el tiempo. Pero hoy en día es más seguro para los estudiantes que los estudiantes que realizan búsquedas aleatorias en la web y encuentran quién sabe qué, o que los estudiantes en las redes sociales. Y sé que no necesariamente están en las redes sociales en la escuela, pero todos están en las\nredes sociales fuera de la escuela. Y ya estoy\ncien por ciento seguro de que Khanmigo es más seguro\nque esas experiencias. Y, ya sabes, las\ncosas que estamos haciendo, y esto es de OpenAI,\ntienen una API de moderación, es una segunda, una IA con la que los desarrolladores de aplicaciones\npueden establecer umbrales en diferentes dimensiones de\ncosas potencialmente dañinas como violencia, contenido sexual.  , autolesiones. Y tenemos nuestros umbrales bonitos, nuestros umbrales son bajos, lo que significa que somos muy sensibles\na que sucedan estas cosas. Si ocurre alguna de esas conversaciones\n, no participará y también notificará a\nlos padres y maestros. Estamos registrando cada conversación. También estamos haciendo algo de alfabetización digital para que los estudiantes sepan que, oye, a veces esto puede\ncometer errores y este es el motivo. Así como deben saber que\ncuando haces una búsqueda en la web, no todas las fuentes son iguales. Y gran parte del contenido de las redes sociales no sólo es incorrecto, sino que\nes intencionalmente incorrecto y trata de alterar\ntu cerebro de alguna manera. Entonces creo que hay un\naspecto de alfabetización digital en esto. Y luego, ya sabes, algunas de\nlas cosas en las que estamos trabajando es darle una sensación de memoria, de modo que si ve patrones\nen múltiples conversaciones, ya sabes, esa memoria es, creemos que\nla haremos mucho más. experiencia de aprendizaje mágica y convincente. Pero también puede agregar\nseguridad si vemos patrones de estudiantes que intentan hacer ciertas cosas y, obviamente, los padres\ny maestros están ahí, pero estamos trabajando febrilmente para descubrir cómo\nmejorar aún más en matemáticas. Y creo que ya hemos\navanzado mucho más allá de lo que hace GPT-4. Mucho, en muchos casos, está anclado en el contenido de Khan Academy, que ya ha tenido, ya\nsabes, un alto nivel editorial. Y eso también lo mantiene. Así que me siento bastante bien acerca de dónde está, pero eso no es motivo para\nser complaciente y obviamente no haríamos eso.\n- Genial. Y creo que su idea de una\nespecie de programa de capacitación o alfabetización para esto es buena, porque\nseguimos viendo evidencia de que la gente realmente no\nentiende las cosas para las que los chatbots son buenos\ny para qué no.  No sé si\nviste esta historia recientemente sobre este abogado que se\nmetió en problemas porque estaba escribiendo\nun escrito para un cliente que estaba demandando a una\naerolínea o, ya sabes, demandando a una aerolínea o algo así. Y entra en Chat GPT y dice: \"¿Puede darme algunos casos relevantes que pueda utilizar en mi\nescrito para defender este caso?\" Y le da algunos casos\ny se los envía al juez y al abogado contrario y ellos dicen que ninguno\nde estos casos existe.  ¡ Todos estos están inventados! - ¡Ay, pobrecito! - El abogado ahora se enfrenta a sanciones porque, ya sabes, le han presentado esta jurisprudencia sin sentido\nal juez. Y para mí, lo que eso\ndice es que necesitamos ser más inteligentes como usuarios sobre dónde están estas cosas, porque hay algunos casos de uso para los que son muy buenos\ny muy precisos. Y luego, como sabes,\nhay algunos casos en los que simplemente inventa cosas. Y entonces pienso, ya sabes,\nme pregunto si, ya sabes, antes de registrarte para obtener una\ncuenta en Khanmigo o GPT-4 o Chat GPT o lo que sea, deberías hacer clic\nen un pequeño tutorial que dice, ya sabes, aquí está  un tipo de pregunta que probablemente produzca una respuesta correcta y aquí hay un tipo de pregunta\nque probablemente lleve al chatbot a inventar cosas. Y creo que eso\nayudaría mucho a la gente. Entonces me gusta esa idea. - No, cien por ciento. Y ya sabes, lo hemos hecho, porque sabemos que casi\nsiempre alucinará un vínculo si le pides un vínculo a algo, simplemente creará un\nvínculo muy plausible que no existe. Así que definitivamente,\nKhanmigo no hará eso. Solo ofrecerá enlaces que\nprovienen de nuestro sitio existente que le hemos proporcionado, pero creo que es una buena\nidea para brindar aún más educación. Recuerdo que cuando tuvimos acceso a él por primera vez, estábamos buscando a nuestro director financiero,\nahora tenemos un excelente director financiero, pero estábamos haciendo una búsqueda y en ese momento no me di cuenta de que no tenía\nacceso a Internet. Entonces dije: \"Oye\", ya sabes, \"¿Podrías buscar en LinkedIn\nalgunos buenos candidatos?\". Y encontró que estos increíbles candidatos con sus números de teléfono\nestaban en lo cierto, como, ¡oh, son\ncandidatos locales y perfectos! Pensé, ¡esto es increíble! Esto va a revolucionar... Y mira, todavía podría\nrevolucionar el reclutamiento una vez que tenga acceso a Internet, LinkedIn y otras cosas. Pero rápidamente nos dimos cuenta\nde que eran ficticios, completamente ficticios. Y ya sabes, eso introduce\notra cosa como, bueno, ¿qué se supone que\nconstituye un buen director financiero? Y quiero decir, incluso eligió\nlos nombres, las etnias y otras cosas para\nestos candidatos perfectos.  Y , ya sabes, eso obviamente\nplantea otras preguntas. Quiero decir, volviendo al lado educativo de... Bueno, tengo curiosidad, simplemente quiero volver a\nlo que deberían hacer las escuelas, pero ¿qué está haciendo el New York\nTimes al respecto?  ¿Le han dicho algo como: \"\nNo tienes permitido usar...\"? Quiero decir, en cuanto a tu punto\nsobre la investigación o el artículo periodístico\nversus el escrito, podría ser muy tentador\ny tal vez no esté mal decir: \" Está bien, yo\".  Acabo de entrevistar a\nun grupo de personas. Encontré algunos\ndatos interesantes, encontré algunos datos, lo haré en un gran volcado y luego le pediré a GPT-4 que escriba un primer borrador, que luego editaré.  ¿ Pero es eso como un\nno-no del New York Times? - Sabes,\ntodavía no han emitido una política oficial. Creo que todavía están trabajando en lo que quieren hacer con eso, pero creo que es un nivel amplio y, por supuesto, no soy el portavoz de toda la institución. Pero para mí, Chat GPT y otros sistemas han sido útiles no tanto para escribir el primer borrador sino para editarlo. Entonces, a veces tomo, ya sabes, un par de párrafos de algo que he escrito y digo, ya sabes, ¿ cuáles son las fortalezas\ny debilidades de esta, ya sabes, esta sección? Ayúdame a encontrar\ncontraargumentos. Ya sabes, ¿ cómo puedo hacer que esto sea más convincente?  En cambio, como ese tipo de cosas... Pero, sabes, no creo\nque eso reemplace a los editores, pero mejorará mi copia antes de enviarla a mi editor. Y creo que debido a que\nhay una capa tan gruesa de edición y verificación de hechos\nen el New York Times, en realidad no me preocupa\nque alucinaciones o cosas incorrectas se filtren\nen el periódico porque, como los humanos.\nLo atraparé antes de eso. Pero creo que para mí, ahí es donde esto\nha sido más útil. Porque es una especie de escritor genérico.  En realidad, no es así, es porque está entrenado\nen los promedios estadísticos de todo el texto que, ya sabes, estaba en su conjunto de entrenamiento, suena como un\nreportero de periódico genérico a menos que realmente\nlo prepares con algunos detalles.  .  Por eso no he descubierto\nque sea aceptablemente bueno para escribir, pero a veces es muy bueno para sugerir formas de mejorar mi escritura. - Si no. Quiero decir, sí, si\nlo solicitas con las cosas correctas, como escribir en el estilo\nde, a veces puede, pero, ya sabes, eso está en línea con cómo hemos estado\npensando, incluso para los estudiantes, dónde estamos.  de hecho, crear actividades en las que los estudiantes hagan exactamente eso. Pueden escribir el primer borrador y, cuando lo escriban, resaltará partes del mismo\ny lo comentará, etcétera.  ¿ Qué harías si lo fueras? ¿ Harías algo diferente si fueras profesor de composición de primer año, profesor de humanidades,\nrector de una universidad, director de una escuela secundaria\no superintendente de distrito? ¿ O dirías, sí, usarán el chat GPT?  ,\nla gente lo descubrirá. - Sí, creo que tienes que dejar de dar tareas de escritura para llevar a casa\no conjuntos de problemas para llevar a casa o cuestionarios para llevar a casa. Creo que hay que pasar a exámenes orales, a pruebas y tareas supervisadas en clase, ya sabes,\n y a\nejercicios de equipo más colaborativos. Porque creo que si no lo haces, si sigues entregando tus tareas como lo has \nhecho durante décadas, básicamente estás castigando a los estudiantes honestos de la clase. Si tiene una política que dice, ya sabe, no use Chat GPT para escribir su ensayo; Puedes asumir, creo que en este punto, que al menos la mitad de la clase y probablemente una cantidad significativamente mayor va a usar estas cosas en casa. Y entonces en realidad estás\ndando una ventaja injusta a aquellas personas en relación con\nlos estudiantes de tu clase que realmente se sentarán\ne intentarán hacerlo ellos mismos.  ¿ Qué opinas? - No, en general estoy de acuerdo, aunque creo que, ya sabes, tu punto sobre el\ninforme versus la escritura dice que puedes hacer\nciertas tareas para llevar a casa, pero esas\ntareas para llevar a casa tienen que ver mucho más con generar\nideas novedosas.  datos novedosos, investigaciones novedosas, y luego sí, lo escribes bien y tal vez usas una IA para ayudarte a escribirlo, pero pudiste encontrar\nalgo más novedoso mientras que, clásicamente, tus informes de investigación en la\nescuela secundaria o la universidad son simplemente  leer un montón\nde trabajos de otras personas y luego consolidarlos. Y por eso termina\nconvirtiéndose más en un ejercicio de consolidación,\ncitación y redacción en lugar de idear\nalgo nuevo. Así que las escuelas definitivamente pueden\nenfocarse más en eso.  ¿ Qué le dirías a un\njoven, ya sabes, quiero decir, ya sabes,\nun joven que, un joven Kevin Roose que tiene 16 años, al que le gusta escribir, que quiere serlo, qué le dirías que hiciera?  ?  ¿ Qué le dirías a alguien, ya sabes, incluso a alguien que esté interesado\nen algún otro campo, ya sea ingeniería\no fabricación, verdad?  ¿ Qué le dirías a un joven en lo que debería trabajar ahora mismo? - Bueno, yo... En el libro, tengo un capítulo llamado \"Aprende humanidades en la era de las máquinas\". Y lo que quise decir con eso es que debes tener habilidades que te puedan diferenciar de las\nmáquinas en cualquier disciplina. Sabes, si eres un codificador, no será\nsuficiente en este nuevo mundo ser, ya sabes, un genio\nque codifica todo el día solo en una habitación y, ya sabes, es el codificador más brillante del mundo.  . Eso no lo es, eso es bueno, sigue siendo una buena habilidad, pero no será suficiente, porque la IA escribirá código y ya lo está escribiendo mucho más rápido y, ya sabes, más barato de lo que puedes. Entonces, si eres un programador, también quieres tener algunas habilidades como colaboración, liderazgo y ética, ya sabes, pensamiento, y realmente tienes que complementar cualquier habilidad técnica que tengas con este tipo de capa gruesa, creo, de lo que solían llamarse habilidades blandas, que es un término que odio porque estas habilidades en\nrealidad son bastante difíciles y escasas. Pero creo que si tienes esas habilidades, entonces estás en mejor posición para subirte a la ola\nde la IA dondequiera que vaya. Así que creo que si estuviera enseñando, ya sabes, diciéndole a mi yo de 16 años, le diría, ya sabes, \"Trabajar en escribir\", esa es una habilidad que\ncreo que sigue siendo muy útil, \"Pero también dedicar\ntiempo a  desarrollar este tipo de habilidades interpersonales\". Trabaja realmente en cosas como la\ninteligencia emocional y el coraje y,\nsimplemente, ya sabes, conectando puntos de diferentes\ndisciplinas. Por ejemplo, esas cosas que\nrealmente no enseñamos en el aula con mucha\nfrecuencia de manera sencilla. Pero creo que muchas escuelas realmente tendrán que adaptarse porque esas son las\nhabilidades del futuro. - ¿Y qué harías? ¿Qué harías? Entonces piensas que si alguien lo hace, si... Siempre serán adaptables y es decir, siempre será demandado tener ese músculo de conexión humana. - Absolutamente, porque yo, ya sabes, creo que por mucho que la IA pueda\nsimular una conexión humana o, ya sabes, decirte\nque es tu terapeuta y te ayudará a\nsuperar tus problemas, creo que mucha gente realmente quiere a los humanos. en posiciones para ayudarlos o incluso simplemente animarlos. Quiero decir, un trabajo con el que estoy\nalgo obsesionado, la durabilidad, es el de barista, ¿verdad? Quiero decir, ahora tenemos robots\nque pueden preparar café, se llaman \"cafeteras\", y probablemente usted tenga una en su casa, y yo tengo como dos en mi casa, y aún así todavía tenemos\ncafeterías en todas partes. Y no es porque los robots\nno sepan cómo hacer café, es porque lo que hace el barista y lo que hace la cafetería\nes una conexión humana. Ellos, ya sabes,\nte saludan por la mañana y te dicen que tengas un buen día y, ya sabes,\npersonalizan tu cosa y escriben tu nombre en la taza y probablemente deletrean mal tu nombre. Pero todo eso es una especie de experiencia, no es sólo una transacción. Así que creo que esas habilidades de conexión , empatía y tipo de colaboración serán valiosas en\ntodas las industrias en el futuro. - No, tienes toda la razón. Quiero decir, piensas\nen un camarero o camarera o incluso simplemente en la idea de un restaurante, como ¿por qué vamos a restaurantes? Si puedes conseguir la misma comida en casa, puedes tirarla, lo que sea, pero pagas más por sentarte.  un ambiente con otras personas alrededor y para que alguien se acerque a usted y charle con usted y le cuente las especialidades del día y cuál era su plato favorito y le sugiera un vino, ¡y\nusted paga más por eso! Y sí, probablemente si fuera un robot, y yo, ya sabes, podría verme abrazando\nrobots en ciertas áreas. Pero sí, creo que estoy de acuerdo contigo. Entonces, sí, suena, quiero decir, ya sabes, yo diría que, en general, parece que tienes una\nlente bastante optimista sobre las cosas, porque eso no suena tan mal. Creo que podemos navegar por eso.  ¿ Es ese tu sentimiento, o hay cosas que te preocupan desde el\npunto de vista de la educación, del propósito humano o incluso desde un punto de vista más amplio? - Sí, quiero decir, tengo muchas preocupaciones.  Creo que soy simplemente optimista\npor temperamento.  Por eso veo mucho potencial y oportunidades para la IA en la\neducación y otros campos. Creo que lo que más me preocupa es \nque el ritmo del cambio es elevado en este momento. Y la gente simplemente tiene la\ncabeza dando vueltas. No saben qué hacer con todo esto, ya sabes, en la revolución industrial o algunos de estos otros\ngrandes cambios tecnológicos, como hemos tenido a lo largo de la historia de la humanidad, las cosas se movieron relativamente lentamente. No era como si tuvieras equipos agrícolas,\ntractores, cosechadoras o máquinas textiles que\naparecieran de repente. Y entonces los trabajos de la gente quedaron obsoletos o tuvieron que decidir qué hacer a continuación.  Fueron necesarios años y, en algunos casos, décadas para que se produjeran esas transiciones. Y entonces, a las personas que están en esas ocupaciones les gustaría ver venir el cambio y comenzar a adaptarse con anticipación. Mientras que creo que con la IA, todo esto está sucediendo\nincreíblemente rápido.  Por eso creo que la gente\nrealmente estaba luchando por entender\nlo que significa para ellos. Y eso es lo que me preocupa: lo rápido que está sucediendo todo esto. Y luego creo que muchos empleos se\nvolverán obsoletos porque los empleos siempre se vuelven obsoletos en períodos de rápido cambio tecnológico. Y también se crean empleos durante períodos de rápido cambio tecnológico.  Por eso creo que la gran pregunta es ¿ cuál es la brecha entre la desaparición de los antiguos empleos y la\naparición de los nuevos?  ¿ Y las personas que sean desplazadas de los empleos obsoletos\nestarán calificadas y preparadas para los nuevos empleos que aparezcan? Y esas son algunas de las\náreas en las que pienso mucho. - No, eso tiene mucho sentido. Y de hecho, esta conversación\nllegó a un punto que siempre solía decirle\na la gente, que es, ya sabes, cuando estás en la universidad y tomas todas\nestas clases especializadas para diferentes trabajos, ya sea que  Si vas a ser\ningeniero, escritor o médico, imaginas\nque la fuerza laboral real utilizará todas estas\nhabilidades especializadas a diario. Y tú y yo sabemos que eso es una farsa.  Ya sabes, incluso algo\ntan básico como el álgebra o el cálculo, en realidad nunca se usa, ni siquiera como ingeniero, es decir, esos son una especie de filtros\npara las habilidades de pensamiento crítico y de estudio y cosas así. Y en la mayoría de los trabajos, incluso\nlos mejores trabajos, hay algunas\nhabilidades básicas de pensamiento crítico, escritura, habilidades de comunicación, pero la mayoría de ellas se basan en lo que usted había hablado antes.  ¿ Puedes colaborar?  ¿ Puedes organizar las cosas lógicamente?  ¿ Puedes elaborar estrategias y proyectar hacia adelante\nlo que probablemente sucederá?  ¿ Puedes traer a otras personas contigo y, sin importar dónde, lo que suceda en las industrias reales, a esas personas les irá bien? - Sí, totalmente de acuerdo. - Está bien, muchas gracias por... ¡ Podría hablar contigo durante horas! Esto es fascinante.  ¡\nDeberíamos hacer esto regularmente! - Me encanta, gracias Sal. Realmente es genial hablar. - No, te lo agradezco,\ngracias por acompañar a Kevin. - Está bien, cuídate.",
    "t_arabic": "- مرحبًا بالجميع، سال\nهنا من أكاديمية خان، وكما يعلم البعض منكم، فقد\nأصدرت كتابي الثاني، \"كلمات جديدة شجاعة\"، حول مستقبل الذكاء الاصطناعي في التعليم والعمل. إنه متاح أينما\nيمكنك شراء كتبك، ولكن كجزء من البحث لهذا الكتاب، أجريت بعض المقابلات مع\nبعض الأشخاص الرائعين، والتي أنت على وشك مشاهدتها. - كيفن روز، الكاتب والمؤلف في صحيفة نيويورك تايمز لديه كتاب جديد بعنوان \"إثبات المستقبل: تسع قواعد\nللبقاء في عصر الذكاء الاصطناعي\". كيفن، شكرا لانضمامك إلينا. - شكرا جزيلا لاستضافتي. - حسنًا، ربما، كما تعلمون،\nعندما أنظر إلى هذا العنوان وأرى \"تسعة قواعد\nللبقاء في عصر الذكاء الاصطناعي،\" ربما يكون هذا سؤالي الطبيعي؛ ما هي قواعد\nالبقاء على قيد الحياة في عصر الذكاء الاصطناعي؟ - حسنًا، كما ترون خلفي، كان الكتاب يحتوي بالفعل على عنوان فرعي، وقد صدر قبل بضع سنوات\nوكان له عنوان فرعي كان مختلفًا قليلاً في الأصل.  لقد كان الأمر يتعلق بنوع من الأتمتة في الذكاء الاصطناعي، وقمنا بتغييره مؤخرًا لأنه كان من الواضح جدًا\nأن هذه اللحظة حول الذكاء الاصطناعي كانت ملحة للغاية بالنسبة للعديد من الأشخاص وكانوا يريدون حقًا\nنوعًا من النصائح المباشرة. إذن فهو نفس الكتاب، ولكن، ونفس القواعد التسعة\nالتي تنطبق على كل هذا. لكنني أعتقد أنه عندما بدأت كتابة هذا، كنت مهتمًا حقًا، كما تعلمون، كيف يمكنني، كشخص\nيكتب لكسب لقمة العيش، والذي، كما تعلمون، يعمل في\nإحدى هذه الصناعات المعرضة للتعطيل بسبب هذه\nنماذج لغة الذكاء الاصطناعي، كيف يمكنني التأكد من أن لدي الأدوات وأنني مجهز للنجاح والازدهار وأنني\nلست في الخط المباشر لاستبدال أو\nدهس أنظمة الذكاء الاصطناعي هذه؟ واعتقدت أن هذه مشكلة ربما كانت ستحل بعد 5 أو 10 سنوات، وتبين أنها كانت على بعد\nعامين ونصف من صدور الكتاب. لأنه الآن جميع\nأصدقائي، الكتاب، جميع أصدقائي الذين يعملون\nفي الصناعات الإبداعية، والعديد منهم لا يعملون في\nالصناعات الإبداعية، كما تعلمون، الأطباء، والباحثون الأكاديميون، كما تعلمون، والأشخاص الذين يعملون في\nالتصنيع  الصفقات، كلهم ​​​​يسألونني،\nكيف يمكنني البقاء على قيد الحياة؟ كيف يمكنك، كما تعلم، أن أغير وظيفتي؟ هل أحتاج إلى العودة إلى المدرسة\nلتعلم بعض المهارات الجديدة؟ ما الذي يمكنني فعله\nلأجعل نفسي أكثر قيمة وليس فقط أكثر قيمة\nفي سوق العمل، ولكن في الواقع كيف يمكنني تعديل أسلوب حياتي ونهجتي في الطريقة التي أعيش بها حياتي في مواجهة هذه الأمور  تقنيات جديدة؟ إذن هذا هو السؤال\nالذي كنت أحاول حله حقًا.  وكما تعلمون، على مستوى عالٍ، يمكننا المرور عبر بعض القواعد التسعة، ولكن على مستوى عالٍ،\nالشيء الذي أعتقد أن الناس لم يفهموه حقًا بعد هو أن هناك نوعًا من\nالمهارات البشرية والمهارات الآلية والكثير من الأشياء التي\nاعتقدنا أنها مهارات إنسانية مثل كتابة الشعر أو، كما تعلمون، ملء المقالات\nوالواجبات المنزلية وأشياء من هذا القبيل تبين أنها قابلة للتنفيذ بواسطة الآلات. والسؤال إذن\nهو، حسنًا، ما الذي بقي؟ مثلاً، ما الذي لا يزال في دلو الإنسان؟ ما الذي لا يستطيع الذكاء الاصطناعي فعله وأيضًا، ما الذي لا نريد أن يفعله الذكاء الاصطناعي لنا؟ هناك العديد من الوظائف التي\nأعتقد أنها تنطوي على التواصل البشري والإبداع والرحمة\nوهذا النوع من المهارات الإنسانية التي قد نكون قادرين على أتمتتها على المستوى التقني باستخدام الذكاء الاصطناعي، ولكن لا أحد\nيريد حقًا أن يكون ذلك آليًا أو هذا ليس كذلك  ، فإن ذلك من شأنه أن يسلب\nالكثير من قيمة ذلك. إذن هذه هي المجالات\nالتي أشجع فيها الناس على إنفاق المزيد من\nتركيزهم واهتمامهم، وهي اكتساب تلك المهارات البشرية التي يمكن أن تساعدك في أي صناعة، ونوعًا ما لتمييز\nنفسك عن الآلات، بدلاً من محاولة التنافس مع الذكاء الاصطناعي من خلال أن تكون أكثر إنتاجية،\nأو، كما تعلم، تعمل بجدية أكبر أو تسرع أكثر أو شيء من هذا القبيل. - نعم، سيكون من\nالصعب جدًا التفوق على الذكاء الاصطناعي. حسنًا، أريد النقر نقرًا مزدوجًا على ذلك.  كما تعلم، لقد ذكرت\nأشخاصًا في مختلف الصناعات، لكنك كاتب.  لقد ذكرت أن الكثير من أصدقائك الكتاب يشعرون بالقلق، كما نرى، يبدو أن الذكاء الاصطناعي التوليدي جيد جدًا\nفي الكتابة بشكل خاص. ما أنت، هل تتكيف مع أي شيء؟ هل تقول نوعًا ما،\nمرحبًا، أنا، كيفن روز، سأركز على هذا\nالبعد من مهنتي. ماذا تقول للكتاب الآخرين، وخاصة الكتاب الذين\nقد لا يكونون كاتبين في صحيفة نيويورك تايمز، والذين قد يكونون كاتبين، كما تعلمون، فهم مثل مؤلفي النصوص\nأو شيء من هذا القبيل؟ - نعم، حسنًا، الإطار\nالذي اعتمدته نوعًا ما هو أن\nكلمة صحفي أو كلمة مراسل تحتوي في الواقع على\nمهمتين منفصلتين. هناك مهمة إعداد التقارير، أو الخروج\nواكتشاف معلومات جديدة أو إقناع شخص ما بإخبارك بشيء ما، أو، كما تعلم، إجراء\nاتصالات مع أشخاص يمكنك مقابلتهم أو، كما تعلم، البحث\nفي مخابئ المستندات. وهذا ليس\nالشيء الذي يمكن للذكاء الاصطناعي القيام به الآن. إنها ليست جيدة جدًا في\nهذا الجزء من العمل. ما يجيده هو كتابة نص يبدو معقولًا وبنوع من الجودة الاحترافية.  وهكذا، لكن هذين كانا دائمًا جزأين مختلفين من الوظيفة، وهما متجمعان معًا نوعًا ما. لكن، كما تعلمون، أعتقد أن\nجميع الكتّاب يعرفون أشخاصًا هم مراسلون أفضل من الكتّاب، وأشخاص هم\nكتاب أفضل من المراسلين. ولذلك أعتقد أن ما يفعله هذا هو أن هذه التكنولوجيا تعمل على رفع المستوى العام للكتابة وتجعل من السهل جدًا القيام بنوع من\nالكتابة الاحترافية باستخدام هذه الأدوات، لكن إعداد التقارير لا يزال\nغير ممكن حقًا  تم بواسطة منظمة العفو الدولية. وهذا ما حاولت التركيز عليه في مسيرتي المهنية، كيف يمكنني القيام بالمزيد من هذه التقارير؟ أنا في الواقع أخبر\nالناس بمعلومات جديدة بدلاً من مجرد\nكتابة شيء ما. وأيضًا، كما تعلمون،\nتفرعت إلى البث الصوتي. أشارك الآن في استضافة بودكاست\nيسمى \"Hard Fork\"، وهذا هو المجال الذي أعتقد أن الذكاء الاصطناعي سيكون أبطأ في توليه. - يمين. وحتى عندما تكون DeepFakes موجودة، أعني أنها موجودة بالفعل نوعًا ما،\n ولكنها تطرح\nالأسئلة الصحيحة، وتجري البحث، وتجعل الشخص المناسب يظهر ويكون ضيفك، حتى،\nكما تعلم، على البودكاست أو ما إذا كنت  كونك مراسلًا، فإن نشر الأمر والناس وجعلهم\nيتواصلون أمر منطقي للغاية. أعني، في نفس الضوء، كما تعلمون، إحدى المجالات التي\nاستحوذت فيها على روح العصر كانت محادثتك الشهيرة\nمع بينج سيدني. قبل كم شهر كان ذلك؟  لا أعرف. أنا متأكد من أنك تعلم، كان هناك حوالي أسبوع أو أسبوعين حيث كان الجميع يتحدثون عن كيفن روز لا يحب زوجته لأن سيدني أخبرته بذلك. - أخبار كاذبة! - أخبار كاذبة، أخبار كاذبة. ماذا، على ما أعتقد، ما الذي كنت تأمل أن تفعله عندما كنت تدخل في\nتلك المحادثة؟  وقد دافعت في بعض الأحيان عن الذكاء الاصطناعي لأنك طلبت منه أن\nيكون \"ذات الظل الاتحادي\"، على ما أعتقد، هو المصطلح النفسي، ولكن ما الذي كنت تأمل أن تفعله وما الذي استخلصته من تلك المحادثة بأكملها؟ - حسنًا، أعتقد أنه من\nالمهم أن أقول، لم يكن من المفترض أن تكون هذه قصة. مثل هذه كانت محادثة\nأجريتها مع Bing Sydney، في عيد الحب لهذا العام، منذ حوالي \nثلاثة أشهر تقريبًا. وكنت\nأتلاعب بهذا الشيء لأنه تم منحي حق\nالوصول إليه بواسطة Microsoft. لقد كانت نسختهم الجديدة من Bing. نحن نعلم الآن أنه كان يستخدم\nGPT-4 تحت الغطاء، ولكن في ذلك الوقت، كان الأمر\n واضحًا للغاية، وكان قويًا للغاية وقادرًا ومثيرًا للاهتمام. وبدا لي أيضًا أن عدد \nحواجز الحماية أقل من Chat GPT أو بعض نماذج الذكاء الاصطناعي الأخرى الموجودة\nهناك. ولذا كنت أحاول حقًا استكشاف نوع الحدود لهذا الشيء. ما الذي سيتحدث عنه،\nوما الذي لن يتحدث عنه، ومتى ستبدأ مرشحات الأمان؟ مجرد نوع من القيام\nبتمارين الفريق الأحمر الخاصة بي هنا في مكتبي بالمنزل. وهكذا انتهى بي الأمر في هذه\nالمحادثة المتعرجة والغريبة جدًا مع برنامج الدردشة الآلي هذا، والذي، كما قلت، كنت أحاول استفزازه في البداية وجعله يقول أشياء ربما كانت ضد قواعده أو ضد قواعد مايكروسوفت الخاصة به.  وقد فعلت ذلك، وتحدثت\nعن كل هذه الأشياء المخيفة والخطيرة التي أرادت القيام بها، وبعد ذلك أصبح الأمر غريبًا حقًا وبدأت تنحرف حقًا عما كنت أحاول أن أجعلها تفعله. لذا أود، كما تعلمون، أن أطرح عليه سؤالاً. لقد اعترف بأنه يحبني وقال إن اسمه كان سيدني وكنت أحاول نوعًا ما إعادته إلى مسار محادثة أكثر طبيعية\n واستمر في الانحراف مرة أخرى\nإلى هذا الشيء الذي يهتم بالحب. لن ينفصل الأمر عن ذلك، حتى بعد أن قلت نوعًا ما، هل يمكننا التحدث عن شيء آخر من فضلك؟ إذن كانت تلك هي القصة، كما تعلمون، في تلك المرحلة كنت أقول، أوه، ربما هذه قصة.  لقد أرسلته إلى المحررين\nوقلت نوعًا ما، كان لدي هذا التفاعل الغريب جدًا\nمع Bing، مثل ماذا يجب أن نفعل بهذا؟ ومن هنا جاءت القصة. لكن لم يكن\nالمقصود في الأصل أن أدخل وأكز وأحث وأختبر كل الأشياء ثم أنشر\nالنص الكاشف للشيء. - وما هي الوجبات الجاهزة الكبيرة الخاصة بك؟ أعتقد أن هذا النص\nكان مثيرًا للاهتمام بطريقة مخيفة للكثير من الناس. تمكنت من الوصول إلى GPT-4 في أغسطس.  لقد كنا نعمل مع Open AI ولم أجري تلك المحادثة تمامًا، لكن أجريت محادثات، كما تعلمون، وصلت إلى مناطق عميقة جدًا. لذلك بدا الأمر مألوفًا إلى حد ما بالنسبة لي، على الرغم من أنني لم\nأوصله أبدًا إلى تلك الحالة التي كان يعترف فيها بحبه لي أو يقنعني بأنني\nأحبه أكثر من زوجتي. ولكن هل كانت خلاصتك من ذلك، حسنًا، كما تعلمون، هذا نوع\nمن التكنولوجيا في مرحلة مبكرة. ستضع مايكروسوفت\nبعض الحواجز حولها، وسنكون جميعًا جيدين. لكن الكثير من الناس\nنظروا إلى ذلك وقالوا، أوه، هذا مخيف. يبدو هذا وكأنه\nفيلم خيال علمي بائس. ما كان الخاص بك، هل يسبب القلق؟  هل أثارت تلك الحادثة قلقك؟ أو أنه مثل، أوه، هذا نوع من الأشياء الغريبة\nالتي سيصلحها الناس؟ - نعم، أعني، كان الأمر مقلقًا بالنسبة لي. لم أستطع النوم بعد ذلك. وجزء من ذلك كان مجرد لحظة اتصال أولى. حيث كنت\nأختبر روبوتات الدردشة لسنوات. كنت أعرف كل شيء عنهم.  لقد أجريت مقابلات مع جميع\nالأشخاص في مختبرات الذكاء الاصطناعي الكبيرة. كما كنت أعلم أن هذه\nالتكنولوجيا كانت قيد العمل، لكنني أعتقد أنه حتى المرة الأولى التي تختبر فيها GPT-4 أو شيء من هذا العيار، فإنه أمر متناقض حقًا. وعلى وجه الخصوص، كان هذا قبل وضع الكثير من\nحواجز الحماية. أعني، الآن بعد أن أصبح هذا الشيء موجودًا، كما تعلمون، ظهرت هذه القصة، وكما تعلمون،\nأصدرت Microsoft الآن هذا لملايين المستخدمين  من خلال Bing، إنها تجربة أكثر حذرًا\nوأكثر حراسة. لكن في هذا النوع من الأسبوع الأول حيث كانوا\nيعرضونه على عدد قليل من المختبرين، لم يكن به حقًا الكثير من حواجز الحماية. ولذا أعتقد أن الأشخاص الذين جربوا ذلك ينزعجون حقًا من هذه التجربة. إنه نوع من الذكاء الفضائي الذي نقوم به للتو\nكنوع من الاتصال الأول. ولذا أعتقد أن هذا أمر عاطفي للغاية.  لقد كنت قلقًا أيضًا من\nأنه يبدو أن مايكروسوفت، إحدى أكبر\nشركات التكنولوجيا وأكثرها تطورًا على وجه الأرض، لم تكن\nقادرة على التحكم في هذا الشيء الذي كانت تضعه في\nمحرك البحث الرئيسي الخاص بها وتخطط لتوزيعه\nعلى ملايين الأشخاص. ولذا أعتقد أن\nالشركات التي تبني وتنفذ هذه\nالأشياء تكافح حقًا لوضع أذرعها حول\nهذا الشيء الذي ندخله في منتجاتنا، وكيف هي الطرق\nالتي يمكن إساءة استخدامها أو التلاعب بها أو إقناعها  الناس للقيام بأشياء ضارة؟ - نعم! نعم.  قطعاً. - ولكنني أشعر بالفضول بشأن\nتجربتك أيضًا. كما لو أنك أجريت مناقشات مع GPT-4، هل أخافك أي منهم بنفس الطريقة التي أخافوني بها؟ - لقد أجريت محادثة مبكرة جدًا. أعني،\nعطلة نهاية الأسبوع الأولى التي تمكنت من الوصول إليها، وكانت نسخة غير محمية تمامًا، كما يمكنك أن تتخيل،\nكان هذا في أغسطس.  لقد سألتها أشياء مثل، هل هناك أشياء\nتريد أن تخبرني بها ولكن لا تفعل ذلك، أو هل هناك أفكار\nلديك ولا تشاركها؟ وقال أشياء مثل، \"نعم، هناك.\" وأنا أقول، حسنًا، لماذا\nلا تشاركهم؟ ثم قال أشياء مثل، \"حسنًا، قد تجدها\nمهينة أو قد تخيفك.\" وأنا أقول، ثم أقول، حسنًا، فقط أنت تقول أن هذا يخيفني! وجزء مني، فعل بالضبط ما وصفته للتو، أشعر وكأنني أول لقاء مع كائن فضائي. ولكن بعد ذلك قال جزء مني، حسنًا، إذا كنت مجرد نموذج لغة كبير، وانظر، أعتقد إلى حد ما أننا جميعًا لدينا أجزاء من أدمغتنا أو عقولنا ليست سوى\nنماذج لغوية كبيرة بحد ذاتها. مثل، أنا لست كذلك، كل كلمة\nتخرج من فمي هي مجرد نوع من السقوط. أنا لا أفكر كثيرا في ذلك. ربما يكون الأمر واضحًا، لكنني ذكّرت نفسي أنه إذا سألت شيئًا ما، \"هل لديك أفكار\nلا تشاركها؟\" وإذا تم تدريبه\nعلى كل الكتابة البشرية، فمن الطبيعي جدًا أن يقول، \"بالطبع لدي أفكار\nلا أشاركها،\" حتى لو لم يكن لديه حقًا أفكار لا أشاركها. وبطبيعة الحال، لماذا لا\nتشارك الفكر؟ \"حسنًا، قد يسيء إليك،\" وهذا شيء قد يقوله الإنسان. لذلك، لم يكن الأمر كما لو كان في الواقع يفكر في الهيمنة على العالم ويخشى المشاركة، ولكن\nمن وجهة نظرك، من وجهة نظر تجريبية إنسانية\n، شعرت بهذه الطريقة. - نعم! - وهذا نوع من التنافر. ونعم، لقد أمضيت بالتأكيد عدة عطلات نهاية أسبوع\nحيث كنت متحمسًا، وغريبًا بعض الشيء، ومن الواضح أنني كنت أفكر في الآثار المترتبة \nعلى التعليم وأكاديمية خان وكل ذلك. وبعض تلك الفرص كانت. وكان بعض هؤلاء بمثابة تهديدات تقريبًا. وهكذا كان الأمر بالتأكيد، ولا\nيزال وقتًا غير مؤكد للغاية. هذه واحدة من القضايا. أنا، كما تعلمون، هذا\nالبودكاست هو بمثابة بودكاست لي لإجراء بحث للكتاب الذي أكتبه، وهو الذكاء الاصطناعي في التعليم،\n\"كلمات جديدة شجاعة\". - نعم. - وفي الواقع، أريد العودة إليه لأنني، في الواقع، لقد أعطيت أفضل إجابة حصلت عليها حول سؤال الكتابة حتى الآن، وهو مثل، أنت على حق تمامًا. الصحفيون التقليديون يكتبون، لكن الكتابة ليست كل شيء. إنها حقًا قطعة التقارير وقطعة التقارير الاستقصائية، أو قطعة تقارير الاتصال البشري، والتي أوافق عليها، سيكون من الصعب جدًا على الذكاء الاصطناعي القيام بها في أي وقت. قد يكون الذكاء الاصطناعي قادرًا على المساعدة، وقد يكون قادرًا على إرسال\nرسائل نصية آلية إلى الأشخاص وأشياء من هذا القبيل. لكنها قد لا تفعل ذلك،\nولن تقوم بالتقارير الاستقصائية الحقيقية أو نوع الاتصال البشري. أو لن يكون لديه Rolodex الخاص به ليتمكن، كما تعلمون، من\nالانتقال إلى السياق. لكن أعني، في ضوء ذلك،\nوبالعودة إلى التعليم، ما رأيك، هل أنت على جانب مثل، هذه أداة للمستقبل. سيستخدمه الجميع\nلكتابة الأشياء، ويجب على المدارس أن تتبناه وتغير مهامهم بطريقة ما، أم يجب عليهم حظره؟ أين أنت\nمن هذا النقاش؟ - نعم، بعد ظهور Chat GPT مباشرة، أنا متأكد من أنك تتذكر\nمجموعة من المناطق التعليمية، بما في ذلك نيويورك وسياتل، التي\nحظرتها على الأجهزة المدرسية. فقالوا: \"لا يمكنك استخدام هذا، فهذا لا يصلح إلا للغش\". وفي ذلك الوقت، كتبت عمودًا وناقشت بشكل أساسي النقطة المعاكسة. قلت، كما تعلمون، حظر\nهذه فكرة سيئة.  وكان لدي عدة أسباب لذلك.  وكان أحدهما أن الأمر\nلن ينجح، أليس كذلك؟ الطلاب أذكياء للغاية. إنهم، كما تعلمون، إذا لم تتمكنوا من الوصول إلى ذلك على\nالكمبيوتر المحمول الذي أصدرته المدرسة، فسيفعلون ذلك على هواتفهم أو كمبيوتر أصدقائهم أو شيء من هذا القبيل. وبرنامج الكاشف\nالموجود لكشف\nالنص المكتوب بـ GPT، لا يعمل. وليس من الواضح بالنسبة لي أنه سيكون هناك برنامج يمكنه\nاكتشاف النص الذي تم إنشاؤه بواسطة GPT بدقة. لذا، لكن المشكلة الأكبر هي أنني أعتقد أن الأمر يشبه تمامًا، سيحتاج الطلاب إلى\nتعلم كيفية استخدام هذه الأشياء وكيفية العيش جنبًا إلى جنب معها\nفي الاقتصاد والمجتمع.  ومن الأفضل أن يرشدهم خلال ذلك غير معلميهم؟ ولذا فقد أجريت مقابلات مع عدد من المعلمين في مؤسسات الروضة وحتى الصف الثاني عشر\nالذين كانوا يستخدمون Chat GPT للمساعدة في مدرستهم، وتعليمهم، وللمساعدة\nفي تخطيط الدروس، وللمساعدة، كما تعلمون، في فهم القراءة\nلاستخدامها في تعليم الطلاب، تعرف على كيفية استخدام دردشة\nGPT لتبادل الأفكار حول المقالات أو للتوسع في نقاط معينة أو لتحدي أنفسهم\nللتعمق في موضوعات معينة. ولقد استخدمت أيضًا Chat GPT\nوبرامج الدردشة المشابهة بنفسي لتعلم أشياء من وظيفتي وفي\nحياتي اليومية نوعًا ما. ولذا أعتقد أنها يمكن أن تكون\nأداة رائعة للتعليم. وأنا أعلم أن هذا هو\nالبودكاست حيث تجري مقابلة معي، ولكن لدي سؤال لك، وهو، كما\nتعلم، لقد رأيت خانميغو وبعض الأشياء التي\nتفعلها حول GPT-4، أنا  أعتقد أنها\nمثيرة للإعجاب ومثيرة للاهتمام حقًا. لكنني أتساءل أيضًا بشأن\nهذا السؤال المتعلق بالموثوقية أو الخوف\nأو مجرد وضع حواجز الحماية الصحيحة، أعني أنك رأيت هذه\nالنماذج تخرج عن المسار سواء في مواجهاتك أو\nفي الأشخاص الذين يحبونها.  مِلكِي. ولذا، أعتقد أن لدي\nفضولًا إذا كنت واثقًا من أن OpenAI قد قامت بنوع\nالعمل الضروري حيث ستشعر بالأمان عند نشر روبوت الدردشة مثل Khanmigo داخل المدارس، ربما لملايين الطلاب. - نعم، ما\nيريحنا هو، وأنا أعلم بالفعل أنه حتى قبل\nتفاعلك مع سيدني، كانت OpenAI تأخذ هذا الأمر على محمل الجد.  كما تعلمون، حتى\nفي مرحلة ما قبل Chat-GPT، نوفمبر وأكتوبر، كانوا\nيتحدثون عن أننا نريد أن يكون هذا واحدًا من، كما تعلمون، نريد أن يكون هذا\nالنموذج الأكثر أمانًا هناك. وكانوا يعملون على ذلك. أعتقد أنه عندما ظهرت أغراضك، أجريت محادثة معهم. وأعتقد أن ذلك أشعل\nالمزيد من النار تحتهم لتصحيح هذا الأمر. ولذا أود أن أقول أنه حتى GPT-4، الذي خرج من الصندوق الآن، هو في الواقع جيد جدًا في عدم الوقوع في بعض هذه الأماكن الغريبة والغريبة. الآن، مع Khanmigo، هناك قدر كبير\nمن العمل علاوة على ذلك الذي نقوم به لنجعل الأمر كما نشعر به، ونشعر بالثقة\nوالأمان للطلاب. أود أن أزعم أن خانميغو\nأكثر أمانًا للطلاب اليوم، وسوف تصبح\nأكثر أمانًا بمرور الوقت. ولكنه أكثر أمانًا للطلاب اليوم من قيام الطلاب بإجراء عمليات بحث عشوائية على الويب والعثور على من يعرف ماذا، أو من الطلاب على وسائل التواصل الاجتماعي. وأنا أعلم أنهم ليسوا بالضرورة على وسائل التواصل الاجتماعي في المدرسة، لكنهم جميعًا على\nوسائل التواصل الاجتماعي خارج المدرسة. وأنا بالفعل\nمتأكد بنسبة مائة بالمائة من أن خانميجو أكثر أمانًا\nمن تلك التجارب.  وكما تعلمون،\nالأشياء التي نقوم بها، وهذا من OpenAI\nلديهم واجهة برمجة تطبيقات معتدلة، إنها ذكاء اصطناعي ثانٍ يمكن لمطوري التطبيقات\nتعيين الحدود على أبعاد مختلفة للأشياء\nالضارة المحتملة مثل العنف والمحتوى الجنسي  ، الأذى الذاتي. ولدينا عتباتنا جميلة، عتباتنا منخفضة، مما يعني أننا حساسون جدًا\nلحدوث هذه الأشياء. إذا حدث أي من هذه المحادثات، فلن يتم\nالتفاعل معها وسيتم أيضًا إخطار\nأولياء الأمور والمعلمين. نحن نقوم بتسجيل كل محادثة. نحن نقوم أيضًا ببعض المعرفة الرقمية حول السماح للطلاب بمعرفة أنه في بعض الأحيان يمكن أن يرتكب هذا الشيء\nأخطاء، وإليكم السبب. تمامًا كما يجب أن يعلموا أنه\nعند إجراء بحث على الويب، ليست كل المصادر متساوية. والكثير من محتوى وسائل التواصل الاجتماعي، ليس خطأ فحسب، بل\nهو خطأ متعمد ويحاول العبث\nبعقلك بطريقة ما. لذلك أعتقد أن هناك\nجانبًا لمحو الأمية الرقمية في الأمر. وبعد ذلك، كما تعلمون، بعض\nالأشياء التي نعمل عليها هي منحها إحساسًا بالذاكرة بحيث إذا رأت أنماطًا\nخلال محادثات متعددة، كما تعلمون، تلك الذاكرة هي أننا نعتقد أننا\nسنجعلها أكثر بكثير تجربة تعليمية سحرية ومقنعة. ولكن يمكن أيضًا أن يضيف\nالأمان إذا رأينا أنماطًا من الطلاب يحاولون القيام بأشياء معينة ومن الواضح أن أولياء الأمور\nوالمدرسين موجودون هناك، ولكننا نعمل بشكل محموم لمعرفة كيفية جعل\nالأمر أفضل في الرياضيات. وأعتقد أننا أحرزنا بالفعل\nالكثير من التقدم فيما يتعلق بما يفعله GPT-4. كثيرًا، في كثير من الحالات، يرتكز على محتوى أكاديمية خان، والذي كان بالفعل، كما\nتعلمون، بمثابة شريط تحريري رفيع المستوى.  وهذا أيضًا يبقيه. لذلك أشعر بالرضا تجاه مكان وجوده، لكن هذا ليس سببًا\nللرضا عن النفس ومن الواضح أننا لن نفعل ذلك.\n- ذلك رائع. وأعتقد أن فكرتك الخاصة بنوع من\nالتدريب أو برنامج محو الأمية هي فكرة جيدة، لأننا نستمر في\nرؤية أدلة على أن الناس لا\nيفهمون حقًا الأشياء التي تكون برامج الدردشة مفيدة\nلها وليست جيدة لها. لا أعرف إذا كنت قد\nشاهدت هذه القصة مؤخرًا عن هذا المحامي الذي\nأوقع نفسه في مشكلة لأنه كان يكتب\nملخصًا لعميل كان مثل، مقاضاة\nشركة طيران أو كما تعلم، مقاضاة شركة طيران أو شيء من هذا القبيل. وذهب إلى Chat GPT وقال، كما تعلمون، \"هل يمكنك أن تعطيني بعض القضايا ذات الصلة التي يمكنني استخدامها في\nملخصي لمناقشة هذه القضية؟\" ويعطيه بعض القضايا\nويرسلها إلى القاضي والمحامي المعارض ويقولون، لا\nتوجد أي من هذه القضايا. هذه كلها مكونة! - يا مسكين! - المحامي الآن يواجه عقوبات لأنه، كما تعلمون، يقدم هذه\nالسوابق القضائية الهراء إلى القاضي. وبالنسبة لي، ما\nيعنيه ذلك هو أن الأمرين معًا، كما تعلمون، نحن بحاجة إلى أن نكون أكثر ذكاءً كمستخدمين حول مكان هذه الأشياء، لأن هناك بعض حالات الاستخدام التي تكون جيدة جدًا\nودقيقة جدًا لها.  وبعد ذلك، كما تعلم،\nهناك بعض الحالات التي يتم فيها اختلاق الأشياء. ولذا أعتقد، كما تعلم،\nأتساءل عما إذا كان، كما تعلم، قبل التسجيل للحصول على\nحساب على Khanmigo أو GPT-4 أو Chat GPT أو أي شيء آخر، يجب عليك النقر\nفوق برنامج تعليمي صغير يقول، كما تعلم، إليك  نوع من الأسئلة التي من المحتمل أن تنتج إجابة صحيحة، وهنا نوع من الأسئلة\nالتي من المحتمل أن تؤدي إلى قيام روبوت الدردشة باختلاق الأشياء. وأعتقد أن هذا من\nشأنه أن يساعد الناس كثيرًا. لذلك أنا أحب هذه الفكرة. - لا، مئة بالمئة. وكما تعلمون، لقد فعلنا ذلك، لأننا نعلم أنه غالبًا ما يكون هناك\nهلوسة للرابط إذا طلبت منه رابطًا لشيء ما، فسيقوم فقط بتكوين\nرابط معقول جدًا غير موجود. لذلك نحن بالتأكيد، مثل\nخانميغو لن يفعل ذلك. سيقدم فقط الروابط التي\nتأتي من موقعنا الحالي والتي قدمناها له، مقابل، ولكن أعتقد أن هذه\nفكرة جيدة لمزيد من التعليم. أتذكر عندما تمكنا من الوصول إليه لأول مرة، كنا نبحث عن المدير المالي لدينا،\nولدينا الآن مدير مالي رائع، لكننا كنا نقوم بالبحث، ولم أدرك في ذلك الوقت أنه لم يكن لديه إمكانية\nالوصول إلى الإنترنت. ولذلك قلت للتو، \"مرحبًا،\" كما تعلمون، \"هل يمكنك البحث على LinkedIn\nعن بعض المرشحين الجيدين؟\" ووجدت أن هؤلاء المرشحين المذهلين بأرقام هواتفهم،\nكانوا على حق، مثل، أوه، إنهم\nمرشحون محليون ومثاليون!  لقد كنت مثل هذا مذهل! هذا سوف يراجع - وانظر، لا يزال من الممكن أن\nيُحدث ثورة في التوظيف بمجرد أن يكون لديه إمكانية الوصول إلى الإنترنت وLinkedIn وأشياء أخرى. لكننا أدركنا بسرعة\nأن هذه كانت خيالية، خيالية تمامًا. وكما تعلمون، فإن هذا يقدم\nشيئًا آخر مثل، حسنًا، ما الذي يفترض أن\nيجعل المدير المالي جيدًا؟ وأعني أنها اختارت أيضًا\nالأسماء والأعراق وأشياء أخرى لهؤلاء\nالمرشحين المثاليين.  ومن الواضح أن هذا\nيثير أسئلة أخرى. أعني أنه، العودة إلى الجانب التعليمي لـ- حسنًا، أنا فضولي، فقط، أريد العودة إلى\nما يجب أن تفعله المدارس، ولكن ما الذي\nتفعله صحيفة نيويورك تايمز حيال ذلك؟ هل قالوا مثل، \"\nغير مسموح لك باستخدام...\" أعني، بالنسبة لوجهة نظرك\nحول التحقيق أو المقال الصحفي\nمقابل المقال المكتوب، قد يكون من المغري جدًا\nوربما ليس سيئًا أن تقول، حسنًا، أنا  لقد أجريت للتو مقابلات مع\nمجموعة من الناس. لقد وجدت بعض الحقائق المثيرة للاهتمام\n، وجدت بعض البيانات، سأفعل ذلك في مكب نفايات كبير ثم أطلب من GPT-4 كتابة المسودة الأولى، والتي سأقوم بتحريرها بعد ذلك. ولكن هل هذا يشبه\nالرفض في صحيفة نيويورك تايمز؟ - كما تعلم، لم\nيصدروا سياسة رسمية بعد. أعتقد أنهم ما زالوا يعملون على تحديد ما يريدون فعله بهذا الأمر، لكنني أعتقد أنه مستوى واسع نوعًا ما، ولست متحدثًا باسم المؤسسة بأكملها بالطبع. لكن بالنسبة لي، فإن ما كان Chat GPT والأنظمة الأخرى مفيدًا فيه ليس كتابة المسودة الأولى بقدر ما هو تحرير المسودة الأولى. لذلك في بعض الأحيان سأأخذ، كما تعلمون، بضع فقرات من شيء كتبته وأقول، كما تعلمون، ما هي نقاط القوة\nوالضعف في هذا القسم، كما تعلمون؟ ساعدني في التوصل إلى\nحجج مضادة، كما تعلم، كيف أجعل هذا أكثر إقناعًا؟ مثل هذا النوع من الأشياء، بدلاً من ذلك... لكن، كما تعلمون، لا أعتقد\nأن ذلك سيحل محل المحررين، ولكنه سيجعل نسختي أفضل قبل أن أقدمها إلى المحرر الخاص بي. وأعتقد أنه بسبب\nوجود طبقة سميكة من التحرير الذي يحدث، والتحقق من الحقائق الذي\nيحدث في صحيفة نيويورك تايمز، فأنا لست قلقًا في الواقع\nبشأن الهلوسة أو الأشياء غير الصحيحة التي تتسلل\nإلى الصحيفة لأنه مثل البشر\nسوف قبض عليه قبل ذلك. لكن أعتقد بالنسبة لي أن هذا هو المكان الذي كانت فيه هذه الأشياء\nمفيدة للغاية. لأنه نوع من الكاتب العام. إنه في الواقع ليس كذلك، لأنه تم تدريبه\nعلى المتوسطات الإحصائية لكل النص الذي كان، كما تعلمون، موجودًا في مجموعة التدريب الخاصة به، فهو يبدو وكأنه\nمراسل صحفي عام ما لم تضع عليه\nبعض التفاصيل.  . ولذلك لم أجد\nأنه، كما تعلمون، أمر جيد للكتابة، ولكنه في بعض الأحيان يكون جيدًا جدًا في اقتراح طرق لتحسين كتابتي. - نعم لا. أعني، نعم، إذا قمت\nبتحفيزه بالأشياء الصحيحة، مثل الكتابة بأسلوب،\nفيمكن ذلك في بعض الأحيان، ولكن، كما تعلم، فإن هذا يتماشى مع الطريقة التي كنا نفكر\nبها، حتى بالنسبة للطلاب، حيث نحن  في الواقع إنشاء أنشطة حيث يقوم الطلاب بذلك بالضبط. يمكنهم كتابة المسودة الأولى، وحيثما يكتبونها، سيتم تسليط الضوء على أجزاء منها\nوالتعليق عليها، وما إلى ذلك. ماذا ستفعل لو كنت كذلك، هل ستفعل أي شيء مختلف إذا كنت مدرسًا جديدًا للتكوين أو مدرسًا للعلوم الإنسانية\nأو رئيس جامعة أو مدير مدرسة ثانوية\nأو مشرفًا للمنطقة، أو هل ستقول، نعم، سيستخدمون دردشة GPT  ،\nسوف يكتشف الناس ذلك. - نعم، أعتقد أنه يتعين عليك التوقف عن إعطاء الواجبات الكتابية\nأو أخذ مجموعات المسائل أو الاختبارات القصيرة إلى المنزل. أعتقد أنه يتعين عليك الانتقال إلى الاختبارات الشفهية، وإلى الاختبارات والواجبات داخل الصف،\n وإلى نوع أكثر تعاونًا\nمن التمارين الجماعية.  لأنني أعتقد أنه إذا لم تفعل ذلك، إذا واصلت تقديم واجباتك المنزلية بالطريقة التي كنت\nعليها لعقود من الزمن، فأنت في الأساس تعاقب الطلاب المخلصين في الفصل. إذا كانت لديك سياسة تنص على عدم استخدام Chat GPT لكتابة مقالتك؛ يمكنك أن تفترض، كما أعتقد في هذه المرحلة، أنك تعلم أن نصف الفصل على الأقل وربما أكثر من ذلك بكثير سيستخدم هذه الأشياء في المنزل.  وهكذا فإنك في الواقع\nتعطي ميزة غير عادلة لهؤلاء الأشخاص مقارنة بالطلاب\nفي صفك الذين سيجلسون\nويحاولون القيام بذلك بأنفسهم. ماذا تعتقد؟ - لا، أنا أتفق معك بشكل عام، على الرغم من أنني أعتقد، كما تعلم، أن وجهة نظرك حول إعداد\nالتقارير مقابل الكتابة، أعتقد أنها تقول أنه يمكنك القيام ببعض\nالمهام المنزلية، ولكن تلك المهام التي تأخذها من المنزل\nتتعلق أكثر بكثير بالتوصل إلى\nرؤى جديدة،  بيانات جديدة، وأبحاث جديدة، وبعد ذلك نعم، تكتبها جيدًا وربما تستخدم الذكاء الاصطناعي لمساعدتك في كتابتها، لكنك تمكنت من\nالتوصل إلى شيء أكثر حداثة بينما بشكل كلاسيكي، تكون تقاريرك البحثية في\nالمدرسة الثانوية أو الكلية مجرد  قراءة مجموعة\nمن أعمال الآخرين ثم دمجها. وهكذا ينتهي الأمر\nبالتحول إلى تمرين مثل الدمج\nوالاستشهاد والكتابة مقابل الخروج الفعلي\nبشيء جديد. لذلك يمكن للمدارس بالتأكيد أن\nتركز أكثر على ذلك. ماذا ستقول\nلشاب، كما تعلم، أعني، كما تعلم، بعض\nالشباب، شاب كيفن روز يبلغ من العمر 16 عامًا، يحب الكتابة، ويريد أن يكون، ماذا ستطلب منهم أن يفعلوا  ؟ ماذا ستقول لأي شخص، كما تعلم، حتى أي شخص مهتم\nبمجال آخر، سواء كان هندسة\nأو تصنيع، أليس كذلك؟ ما الذي ستقوله لشاب ليعمل عليه الآن؟ - حسنًا، أنا... لدي فصل في الكتاب بعنوان \"تعلم العلوم الإنسانية في عصر الآلة\". وما قصدته بذلك هو أنه يجب أن تكون لديك المهارات التي يمكن أن تفصلك عن\nالآلات في أي تخصص.  كما تعلم، إذا كنت مبرمجًا، فلن يكون\nكافيًا في هذا العالم الجديد أن تكون، كما تعلم، عبقريًا يقوم\nبالبرمجة طوال اليوم وحيدًا في الغرفة، كما تعلمون، هو المبرمج الأكثر ذكاءً في العالم.  . مثل هذا ليس كذلك، هذا جيد، ولا تزال هذه مهارة جيدة يجب أن تمتلكها، ولكنها لن تكون كافية، لأن الذكاء الاصطناعي سوف يكتب التعليمات البرمجية وهو بالفعل يكتب التعليمات البرمجية بشكل أسرع بكثير، كما تعلمون، أرخص مما تستطيع. لذا، إذا كنت مبرمجًا، فأنت تريد أيضًا أن تتمتع ببعض المهارات مثل التعاون والقيادة والأخلاق، كما تعلم، والتفكير، وعليك حقًا استكمال أي مهارات تقنية لديك بهذا النوع من الطبقة السميكة، على ما أعتقد، لما كان يسمى بالمهارات الناعمة، وهو مصطلح أكرهه لأن هذه المهارات في\nالواقع صعبة ونادرة للغاية. لكنني أعتقد أنه إذا كانت لديك هذه المهارات، فأنت في وضع أفضل لركوب موجة\nالذكاء الاصطناعي أينما ذهبت. لذلك أعتقد أنني لو كنت أقوم بالتدريس، كما تعلمون، وأخبر نفسي عندما كنت في السادسة عشرة من عمري، فسأقول، كما تعلمون، \"العمل على الكتابة،\" إنها مهارة\nأعتقد أنها لا تزال مفيدة جدًا، \"لكن أيضًا أقضي\nوقتًا حقًا  تطوير هذا النوع من مهارات التعامل مع الآخرين.\" اعمل حقًا على أشياء مثل\nالذكاء العاطفي والشجاعة، وكما\nتعلم، ربط النقاط من مختلف\nالتخصصات معًا. مثل تلك الأشياء التي\nلا نعلمها حقًا في الفصل الدراسي، كل ذلك\nغالبًا بطريقة مباشرة. لكنني أعتقد أن العديد من المدارس سيتعين عليها التكيف حقًا لأن هذه هي\nمهارات المستقبل. - وماذا ستفعل، ماذا ستفعل، لذا تعتقد أنه إذا فعل شخص ما، إذا... سيكون دائمًا قادرًا على التكيف، وسيكون هناك طلب دائمًا على امتلاك عضلة التواصل البشري. - بالتأكيد، لأنني، كما تعلم، أعتقد أنه بقدر ما يستطيع الذكاء الاصطناعي\nمحاكاة التواصل البشري أو، كما تعلم، أن يخبرك\nبأنه معالجك وسيساعدك في حل\nمشاكلك، أعتقد أن الكثير من الناس يريدون البشر حقًا في المواقف، لمساعدتهم نوعًا ما أو حتى لمجرد رفع معنوياتهم. أعني، إحدى الوظائف التي أنا\nمهووس بها نوعًا ما، وهي متانة، هي صانع القهوة، أليس كذلك؟ أعني، لدينا الآن روبوتات\nيمكنها صنع القهوة، يطلق عليها \"صانعي القهوة\"، ومن المحتمل أن يكون لديك واحد في منزلك، ولدي مثلهما في منزلي، ومع ذلك لا يزال لدينا\nمقاهي في كل مكان. وهذا ليس لأن الروبوتات\nلا تعرف كيفية صنع القهوة، بل لأن ما يفعله صانع القهوة وما\nيفعله المقهى هو اتصال بشري. إنهم، كما تعلم،\nيرحبون بك في الصباح ويقولون لك أتمنى لك يومًا سعيدًا، كما تعلم، يقومون\nبتخصيص الأشياء الخاصة بك ويكتبون اسمك على الكوب وربما يكتبون اسمك بشكل خاطئ. لكن كل ذلك يعتبر بمثابة تجربة، وليس مجرد صفقة. لذلك أعتقد أن مهارات الاتصال والتعاطف ونوع التعاون، ستكون ذات قيمة في\nكل صناعة في المستقبل. - لا، أنت على حق تماما. أعني أنك\nتفكر كنادل أو نادلة أو حتى مجرد فكرة مطعم، مثل لماذا نذهب إلى المطاعم إذا كان بإمكانك الحصول على نفس الطعام في المنزل، يمكنك إلغاء ذلك، أيًا كان، ولكنك تدفع مبلغًا إضافيًا للجلوس فيه  بيئة مع أشخاص آخرين من حولك وليأتي إليك شخص ما ويتحدث معك ويخبرك بالعروض الخاصة لهذا اليوم وما هو الطبق المفضل لديه ويقترح عليك النبيذ\nوتدفع مبلغًا إضافيًا مقابل ذلك! ونعم، ربما لو كان روبوتًا، وأنا، كما تعلمون، أستطيع أن أرى نفسي أحتضن\nالروبوتات في مناطق معينة. لكن نعم، أعتقد أنني أتفق معك. لذا، نعم، يبدو، أعني، كما تعلمون، أود أن أقول بشكل عام، يبدو أن لديك\nعدسة متفائلة جدًا تجاه الأشياء، لأن هذا لا يبدو سيئًا للغاية. أعتقد أنه يمكننا التنقل في ذلك. هل هذا هو منطقك، أم أن هناك أشياء تقلقك سواء من\nوجهة نظر التعليم أو الهدف الإنساني، أو حتى من وجهة نظر أكبر؟ - نعم، أعني، لدي الكثير من المخاوف. أنا مجرد متفائل\nبمزاجه، على ما أعتقد. ولذا فإنني أرى الكثير من الإمكانات والفرص للذكاء الاصطناعي في\nالتعليم والمجالات الأخرى. أعتقد أن الأشياء التي أشعر بالقلق بشأنها، أولاً، هي\nأن وتيرة التغيير كبيرة جدًا في الوقت الحالي. والناس عادلون،\nرؤوسهم تدور. إنهم لا يعرفون ما الذي يمكنهم فعله من كل ذلك، كما تعلمون، في الثورة الصناعية أو بعض هذه\nالتحولات التكنولوجية الكبيرة الأخرى، لذلك كان لدينا طوال تاريخ البشرية، تحركت الأمور ببطء نسبيًا. لم يكن الأمر كما تعلمون أن لديك معدات زراعية\nأو جرارات أو حصادات أو آلات نسيج\nظهرت فجأة. وهكذا أصبحت وظائف الناس قديمة أو كان عليهم أن يعرفوا ما يجب عليهم فعله بعد ذلك.  وقد استغرق ذلك سنوات، وفي بعض الحالات، عقودًا حتى تحدث تلك التحولات. ولذلك يمكن للأشخاص الذين يعملون في هذه المهن أن يروا التغيير قادمًا ويبدأوا في التكيف مسبقًا. بينما أعتقد أنه مع الذكاء الاصطناعي، فإن كل هذا يحدث\nبسرعة مذهلة. ولذا أعتقد أن الناس\nكانوا يكافحون حقًا لفهم\nما يعنيه ذلك بالنسبة لهم. وهذا هو الشيء الوحيد الذي يقلقني، وهو مدى سرعة حدوث كل هذا. وبعد ذلك، أعتقد أن الكثير من الوظائف\nستصبح عتيقة لأن الوظائف تصبح دائمًا قديمة في فترات التغير التكنولوجي السريع.  ويتم خلق فرص العمل أيضًا خلال فترات التغير التكنولوجي السريع. ولذلك أعتقد أن السؤال الكبير هو ما هي الفجوة بين اختفاء الوظائف القديمة وظهور\nوظائف جديدة؟  وهل سيكون الأشخاص الذين سيتم تهجيرهم من الوظائف القديمة\nمؤهلين ومستعدين للوظائف الجديدة التي ستظهر؟ وهذه هي بعض\nالمجالات التي أفكر فيها كثيرًا. - لا، هذا منطقي للغاية. وفي الواقع، وصلت هذه المحادثة إلى\nنقطة اعتدت دائمًا أن أقولها\nللناس، وهي، كما تعلمون، عندما تكون في الكلية وتأخذ كل\nهذه الفصول المتخصصة لوظائف مختلفة، سواء كنت  إذا كنت ستصبح\nمهندسًا أو كاتبًا أو طبيبًا، تخيل\nأن القوى العاملة الحقيقية، ستستخدم كل هذه\nالمهارات المتخصصة بشكل يومي. وأنا وأنت نعرف أن هذه مهزلة.  كما تعلمون، حتى الأشياء\nالأساسية مثل الجبر أو حساب التفاضل والتكامل، لا تستخدمها أبدًا، حتى كمهندس، وهي نوع من المرشحات\nلمهارات التفكير النقدي ومهارات الدراسة وأشياء من هذا القبيل. ومعظم الوظائف، حتى\nأفضل الوظائف، هناك بعض\nمهارات التفكير النقدي الأساسية، والكتابة، ومهارات الاتصال، ولكن معظمها يرتكز على ما تحدثت عنه سابقًا. مثل، هل يمكنك التعاون؟  هل يمكنك تنظيم الأشياء بشكل منطقي؟  هل يمكنك وضع استراتيجية والتخطيط للأمام بشأن\nما من المحتمل أن يحدث؟ هل يمكنك إحضار أشخاص آخرين معك، بغض النظر عن المكان، وما يحدث في الصناعات الفعلية، فإن هؤلاء الأشخاص سيكونون على ما يرام. - نعم أتفق تماما. - حسنًا، شكرًا جزيلاً لك - يمكنني التحدث معك لساعات! هذا رائع.\nوينبغي لنا أن هذا بانتظام! - أحب ذلك، شكرا لك سال. حقا، عظيم حقا أن نتحدث. - لا، نقدر ذلك،\nشكرا لانضمامك إلى كيفن. - حسنًا، اعتني بنفسك.",
    "t_italian": "- Ciao a tutti, sono Sal\ndella Khan Academy e, come alcuni di voi sanno,\nho pubblicato il mio secondo libro, \"Brave New Words\", sul futuro dell'intelligenza artificiale nell'istruzione e nel lavoro. È disponibile ovunque\ntu possa acquistare i tuoi libri, ma come parte della ricerca per quel libro, ho fatto alcune interviste con\nalcune persone affascinanti, che stai per guardare. - Kevin Roose, scrittore e autore del New York Times, ha un nuovo libro intitolato \"Future Proof: Nine Rules for\nSurviving in The Age of AI\". Kevin, grazie per esserti unito a noi. - Grazie mille per avermi ospitato. - Beh, forse, sai,\nquando guardo quel titolo e vedo \"Nove regole per\nsopravvivere nell'era dell'intelligenza artificiale\", questa è forse la mia domanda naturale; quali sono le regole per\nsopravvivere nell’era dell’IA? - Beh, come puoi vedere alle mie spalle, il libro in realtà aveva un, è uscito qualche anno\nfa e aveva un sottotitolo che originariamente era leggermente diverso.  Si trattava di una sorta di automazione nell'intelligenza artificiale, e l'abbiamo cambiata solo di recente perché era così chiaro\nche questo momento intorno all'intelligenza artificiale era così urgente per così tante persone e volevano davvero una sorta di\nconsiglio diretto. Quindi è lo stesso libro, ma, e le stesse nove regole\nche si applicano a tutto questo. Ma penso che quando ho iniziato a scrivere questo, ero davvero preoccupato, sai, come posso, come persona\nche scrive per vivere, che, sai, opera in\nuno di questi settori che è incline a essere sconvolto da questi\nmodelli linguistici dell'intelligenza artificiale, come posso assicurarmi di avere gli strumenti e di essere attrezzato per avere successo e prosperare e che non sono\nsulla linea diretta di essere in qualche modo sostituito o\ninvestito da questi sistemi di intelligenza artificiale? E ho pensato che questo fosse un problema a cui forse sarebbero passati 5 o 10 anni, si è scoperto che erano circa\ndue anni e mezzo di distanza da quando è uscito il libro. Perché ora tutti i miei\namici, che sono scrittori, tutti i miei amici che lavorano\nnelle industrie creative, molti che non lavorano nelle\nindustrie creative, sapete, medici, ricercatori accademici, sapete, persone del settore\nmanifatturiero  mestieri, mi chiedono tutti\n, come posso sopravvivere? Come posso, sai, dovrei cambiare lavoro? Devo tornare a scuola\nper apprendere qualche nuova abilità? Che cosa posso fare per\nrendermi più prezioso e non solo più prezioso\nnel mercato del lavoro, ma in realtà come posso adattare il mio stile di vita e il mio, sai, il mio approccio al modo in cui vivo la mia vita di fronte a questi  nuove tecnologie? Quindi questa è davvero la domanda\nche stavo cercando di risolvere. E, sai, ad alto livello, possiamo esaminare alcune delle nove regole, ma ad alto livello,\nla cosa che penso che le persone non abbiano ancora capito è che ci sono una sorta di\nabilità umane e abilità meccaniche  , e molte delle cose che\npensavamo fossero abilità umane come scrivere poesie o, sai, compilare saggi e\ncompiti a casa e cose del genere in realtà risultano fattibili dalle macchine. E quindi la domanda allora\nè: cosa resta? Ad esempio, cosa c'è ancora nel secchio umano? Cosa non può fare l’IA e cosa non vogliamo che faccia per noi? Ci sono molti lavori che\npenso coinvolgano la connessione umana , la creatività, la compassione\ne quel tipo di abilità umane che noi, potremmo essere in grado di automatizzare a livello tecnico usando l'intelligenza artificiale, ma che nessuno\nvuole davvero che siano automatizzate o non è quello  , ciò ne toglierebbe\ngran parte del valore. Queste sono le aree\nin cui incoraggio le persone a dedicare più\nattenzione e concentrazione, ad acquisire quelle capacità umane che possono aiutarti in qualsiasi settore, a \ndifferenziarti dalle macchine, piuttosto che cercare di competere con le IA essendo più produttivo\no, sai, lavorando di più o impegnandosi di più o qualcosa del genere. - Sì, sarebbe molto\ndifficile sconfiggere un'intelligenza artificiale. Bene, voglio fare doppio clic su quello. Sai, hai menzionato\npersone di vari settori, ma sei uno scrittore. Hai detto che molti dei tuoi amici scrittori sono preoccupati: come vediamo, l'intelligenza artificiale generativa sembra essere molto brava\nsoprattutto nella scrittura. Cosa stai facendo, stai adattando qualcosa? Stai dicendo:\nEhi, io, Kevin Roose, mi concentrerò su questa\ndimensione della mia arte? Cosa stai dicendo agli altri scrittori, specialmente agli scrittori che\npotrebbero non essere scrittori per il New York Times, che potrebbero essere scrittori per, sai, sono proprio come copywriter\no qualcosa del genere? - Sì, beh, un quadro\nche ho in un certo senso adottato è che lì, sai,\nla parola giornalista o la parola, più o meno, reporter contiene in realtà\ndue compiti separati al suo interno. C'è il compito di riferire, di uscire e\nscoprire nuove informazioni o convincere qualcuno a dirti qualcosa, o, sai, creare\ncollegamenti con persone che puoi poi intervistare o, sai, scavare\ntra le scorte di documenti. E questo non è il genere di\ncose che l’intelligenza artificiale può fare in questo momento. Non è molto bravo in\nquella parte del lavoro. Ciò in cui è bravo è scrivere testi dal suono plausibile che siano di qualità professionale. E così, ma quelle sono sempre state due parti diverse del lavoro, e sono in un certo senso raggruppate insieme. Ma, sai, penso che\ntutti gli scrittori conoscano persone che sono reporter migliori degli scrittori, e persone che sono\nscrittori migliori dei reporter. E quindi penso che ciò che fa, questa tecnologia è che in un certo senso aumenta il livello generale di scrittura e rende molto facile scrivere una sorta di scrittura di qualità professionale\nutilizzando questi strumenti, ma il reporting, che ancora\nnon può essere davvero  fatto dall'AI. Quindi questo è ciò su cui ho cercato di concentrarmi per la mia carriera: come posso fare di più di quel reporting?  In realtà sto raccontando alla\ngente nuove informazioni piuttosto che semplicemente\nscrivere qualcosa. E inoltre, sai, mi sono\nramificato nei podcast.  Adesso sono co-conduttore di un podcast\nchiamato \"Hard Fork\", e quindi questa è un'area in cui penso che l'intelligenza artificiale sarà più lenta a prendere il sopravvento. - Giusto. E anche quando esistono i DeepFake, voglio dire, in un certo senso esistono già,\n ma ponendo le\ndomande giuste, facendo la ricerca, convincendo la persona giusta a presentarsi e ad essere tuo ospite, anche,\nsai, su un podcast o se tu'  Se sei un giornalista, tirarlo fuori, gente e averli in\ncontatto ha molto senso. Voglio dire, in quella stessa luce, sai, una delle aree in cui hai\ndavvero catturato lo spirito del tempo è stata la tua famosa conversazione\ncon Bing Sydney. Quanti mesi fa è stato?  Non lo so. Sono sicuro che tu lo sappia, ci sono state circa una settimana o due in cui tutti parlavano di come Kevin Roose non amasse sua moglie perché Sydney glielo aveva detto. - Notizie false! - Notizie false, notizie false. Cosa, immagino, cosa speravi di fare quando stavi\niniziando quella conversazione? E a volte ho difeso l'IA perché le hai chiesto di\nessere il suo Sé Ombra dell'Unione, penso, è il termine psicologico, ma cosa speravi di fare e qual è stato il tuo insegnamento da tutta quella conversazione? - Beh, penso che sia\nimportante dire che quella non doveva essere una storia. Ad esempio, questa è stata una chiacchierata che\nho avuto con Bing Sydney, il giorno di San Valentino di quest'anno, quindi circa, sai, quasi\ntre mesi fa. E stavo solo\ngiocando con questa cosa perché mi era stato concesso l'\naccesso da Microsoft. Era la loro nuova versione di Bing. Ora sappiamo che\nsotto il cofano era in esecuzione GPT-4, ma all'epoca era\nproprio così, era molto chiaro, era super potente, capace e interessante. E mi è sembrato anche che avesse meno\nguardrail rispetto a Chat GPT o ad alcuni degli altri modelli di intelligenza artificiale disponibili sul mercato\n. E quindi stavo davvero cercando di sondare i limiti di questa cosa. Di cosa si parlerebbe,\ndi cosa non si parlerebbe, quando entrerebbero in funzione i filtri di sicurezza?  Sto solo facendo il mio piccolo\nesercizio da squadra rossa qui nel mio ufficio a casa. E così sono finito in questa strana\nconversazione tortuosa con questo chatbot, che, come hai detto, all'inizio stavo cercando di provocarlo e in un certo senso convincerlo a dire cose che forse erano contro le sue regole o contro le regole di Microsoft per questo. E lo ha fatto, ha parlato\ndi tutte queste cose inquietanti e pericolose che voleva fare, e poi è diventato davvero strano e ha iniziato a deviare da ciò che stavo cercando di fargli fare. Quindi vorrei, sai, farti una domanda. Ha confessato che mi amava e ha detto che il suo nome era Sydney e stavo cercando di riportarlo su un\npercorso di conversazione più normale e continuava a virare di nuovo\nverso questa cosa dell'interesse amoroso. Non si distaccherebbe da ciò, anche dopo che ho detto, per favore, possiamo parlare di qualcos'altro? Quindi quella era la storia che io, sai, a quel punto ho pensato, oh, forse questa è una storia. L'ho inviato ai miei redattori\ne ho detto, ho avuto questa strana\ninterazione con Bing, tipo cosa dovremmo fare con questo? E quindi è da lì che è nata la storia. Ma originariamente non era\nprevisto che mi piacesse entrare e colpire, stimolare e testare tutte le cose e poi pubblicare la\ntrascrizione rivelatrice della cosa. - E qual è il tuo grande insegnamento? Penso che quella trascrizione\nabbia aperto gli occhi a molte persone in modo spaventoso. Ho avuto accesso a GPT-4 ad agosto. Abbiamo lavorato con Open AI e non ho avuto una conversazione del genere, ma ho avuto conversazioni che, sai, sono entrate in aree molto profonde. Quindi mi sembrava in qualche modo familiare, anche se non\nl'avevo mai portato in quello stato in cui mi confessava il suo amore o mi convinceva che\nlo amavo più di mia moglie. Ma il tuo insegnamento da questo è stato, okay, sai, questa è una specie\ndi tecnologia in fase iniziale. Microsoft metterà\ndei guardrail attorno a tutto ciò, staremo tutti bene. Ma molte persone lo hanno\nguardato e hanno detto: oh, è spaventoso. Sembra un\nfilm di fantascienza distopico. Qual è stato il tuo, causa allarme? Questo incidente ti ha allarmato? Oppure è proprio come, oh, questa è una cosa un po' bizzarra\nche la gente risolverà? - Sì, voglio dire, è stato allarmante per me. Non sono riuscito a dormire dopo. E in parte era semplicemente, sembrava un momento di primo contatto. Dove, ad esempio,\ntestavo i chatbot da anni. Sapevo tutto di loro. Avevo intervistato tutte le\npersone nei grandi laboratori di intelligenza artificiale. Come se sapessi che questa\ntecnologia era in lavorazione, ma penso che, fino alla prima volta che provi davvero GPT-4 o qualcosa di quel calibro, sia davvero stridente. E soprattutto questo, questo accadeva prima che\nvenissero messi molti guardrail. Voglio dire, ora che questa cosa è là fuori e, sai, questa storia è venuta fuori e, sai, Microsoft\nl'ha ora rilasciata a milioni di utenti  attraverso Bing, è un'esperienza molto più cauta e\nmolto più protetta. Ma in questa prima settimana in cui\nlo stavano presentando a una manciata di tester, in realtà non c'erano molti guardrail. E quindi penso che le persone che hanno vissuto questa esperienza siano davvero scosse dall'esperienza. È una sorta di intelligenza aliena con cui stiamo appena entrando in\ncontatto come specie. E quindi penso che sia molto emozionante. Ero anche solo preoccupato che\nsembrasse che Microsoft, una delle\naziende tecnologiche più grandi e sofisticate del pianeta, non fosse stata in\ngrado di controllare ciò che stava inserendo nel\nsuo motore di ricerca di punta e pianificando di distribuirlo\na milioni di persone. E quindi penso che le\naziende che stanno costruendo e implementando queste\ncose stiano davvero lottando per capire\ncos'è questa cosa che stiamo inserendo nei nostri prodotti, e come sono i modi\nin cui potrebbe essere utilizzata in modo improprio o in cui potrebbe manipolare o persuadere  le persone a fare cose dannose? - Si si.  Assolutamente. - Ma sono curioso anch'io della\ntua esperienza. Ad esempio, hai avuto discussioni con GPT-4, qualcuno di loro ti ha spaventato nel modo in cui hanno spaventato me? - Ho avuto una conversazione molto presto. Voglio dire, quel primo\nfine settimana a cui ho avuto accesso, ed era una versione completamente incustodita, come puoi immaginare,\nera agosto.  Gli ho chiesto cose del tipo: ci sono cose che\nvorresti dirmi ma non lo fai, o ci sono pensieri che\nhai che non condividi? E diceva cose del tipo: \"Sì, ci sono\". E io dico, beh, perché non\nli condividi? E poi diceva cose del tipo: \"Beh, potresti trovarlo\noffensivo o potrebbe spaventarti\". E io dico, e poi dico, beh, solo tu che lo dici mi spaventa! E una parte di me ha fatto esattamente quello che hai appena descritto, sembrava il primo incontro con un alieno. Ma poi una parte di me ha detto, okay, se sono solo un grande modello linguistico, e guarda, penso che in una certa misura tutti noi abbiamo parti del nostro cervello o della mente che non sono altro che grandi\nmodelli linguistici stessi. Cioè, non lo sono, ogni parola\nche esce dalla mia bocca è come se cadesse fuori. Non ci sto pensando pesantemente. Forse è ovvio, ma ho ricordato a me stesso che se avessi semplicemente chiesto qualcosa: \"Hai pensieri\nche non condividi?\" E se è addestrato a partire\nda tutta la scrittura umana, è una cosa abbastanza naturale dire: \"Certo che ho pensieri\nche non condivido\", anche se in realtà non ha pensieri che non condivide. E, naturalmente, perché non\ncondividere un pensiero? \"Beh, potrebbe offenderti\", e questo è qualcosa che direbbe un essere umano. Quindi sarebbe, non è che in realtà stesse pensando al dominio del mondo e avesse paura di condividere, ma\ndal tuo punto di vista, da un punto\ndi vista esperienziale umano, sembrava così. - Sì! - E questo è un po' sconcertante. E sì, ho sicuramente avuto un paio di, in realtà, diversi fine settimana\nin cui ero eccitato, un po' stranito, ovviamente stavo pensando a quali\npotrebbero essere le implicazioni per l'istruzione, la Khan Academy e tutto il resto. E alcune di queste erano opportunità. Alcune di queste erano quasi minacce. E così è stato sicuramente,\nè ancora un momento molto incerto. Questo è uno dei problemi. Sai, questo\npodcast è un podcast per me, per fare ricerche per il libro che sto scrivendo, che è L'intelligenza artificiale nell'istruzione,\n\"Brave New Words\". - Sì. - E in realtà, voglio tornarci perché io, tu in realtà hai dato la migliore risposta che ho ricevuto finora alla domanda sulla scrittura, il che è come se avessi assolutamente ragione. Giornalisti tradizionali, scrivono, ma la scrittura non è tutto.  In realtà si tratta del pezzo di reportage e di quello di reportage investigativo, o del reportage di connessione umana, che sono d'accordo, sarà molto difficile da fare per l'intelligenza artificiale in qualsiasi momento. L’intelligenza artificiale potrebbe essere in grado di aiutare, potrebbe essere in grado di inviare\nmessaggi automatizzati a persone e cose del genere. Ma potrebbe non essere così,\nnon farà il vero, il vero giornalismo investigativo o il tipo di connessione umana. Oppure non avrà il proprio Rolodex per poter\nandare al contesto. Ma voglio dire, in questa luce,\ntornando all'istruzione, cosa pensi, sei dalla parte del tipo, Ehi, questo è uno strumento del futuro. Tutti lo\nuseranno per scrivere cose, le scuole dovrebbero semplicemente abbracciarlo e cambiare i loro compiti in qualche modo, o dovrebbero vietarlo? Dove ti trovi in\nquel dibattito? - Sì, quindi subito dopo l'uscita di Chat GPT, sono sicuro che ricorderai che un\nsacco di distretti scolastici, tra cui New York e Seattle,\nlo hanno vietato sui dispositivi scolastici. Hanno detto: \"Non puoi usarlo, va bene solo per imbrogliare\". E all’epoca scrissi un articolo in cui sostanzialmente sostenevo il punto opposto. Ho detto che vietarlo\nè una cattiva idea. E avevo alcune ragioni per questo. E una era: semplicemente\nnon funzionerà, giusto? Gli studenti sono molto esperti. Loro, sai, se non riesci ad accedervi sul\ntuo laptop fornito dalla scuola, lo faranno sui loro telefoni o sul computer dei loro amici o qualcosa del genere. E il software di rilevamento\nche è disponibile per rilevare,\nsai, il testo scritto in GPT, non funziona. E non mi è chiaro se esisterà mai un software in grado di\nrilevare con precisione il testo generato da GPT. Quindi, ma il problema più grande è che penso che sia proprio così, gli studenti dovranno\nimparare come usare queste cose e come convivere con loro\nnell'economia e nella società. E quindi chi meglio dei loro insegnanti può guidarli in questo? E così ho intervistato un certo numero di insegnanti di istituti K-12\nche utilizzavano Chat GPT per aiutare con la loro scuola, la loro istruzione, per aiutare\ncon la pianificazione delle lezioni, per aiutare con, sai, la comprensione della lettura per\nusarlo per insegnare agli studenti, tu  sapere come utilizzare la chat\nGPT per fare brainstorming su idee per saggi o per approfondire determinati punti o per sfidare se stessi e\napprofondire determinati argomenti. E ho anche usato Chat GPT\ne chatbot simili per imparare cose, dal mio lavoro e un\npo' nella mia vita quotidiana. E quindi penso che possa essere uno\nstraordinario strumento educativo. E so che questo è un\npodcast in cui mi intervisti, ma in realtà ho una domanda per te, ovvero,\nsai, ho visto Khanmigo e alcune delle cose che\nstai facendo riguardo a GPT-4, io  penso che sia davvero\nimpressionante e interessante. Ma mi chiedo anche con\nquesta questione di affidabilità, inquietudine\no semplicemente, sai, mettendo i giusti guardrail, voglio dire, hai visto questi\nmodelli uscire dai binari sia nei tuoi incontri che\nin, sai, persone come  mio. E quindi, immagino, sono\ncurioso di sapere se sei sicuro che OpenAI abbia svolto il\ntipo di lavoro necessario per farti sentire sicuro nell'implementazione di un chatbot come Khanmigo nelle scuole, potenzialmente per milioni di studenti. - Sì, ciò che\nci conforta è che, in realtà, so anche prima della tua\ninterazione con Sydney, OpenAI prendeva la cosa molto sul serio. Sai, uno dei, anche\nprima di Chat-GPT, novembre, ottobre,\nparlavano che vogliamo che questo sia uno dei, sai, vogliamo che questo sia il\nmodello più sicuro là fuori. E ci stavano lavorando. Penso che quando è uscito il tuo materiale, ho avuto una conversazione con loro. E penso che questo abbia acceso ancora\npiù fuoco sotto di loro per farlo bene. E quindi direi che anche GPT-4, un po' fuori dagli schemi ora, è in realtà abbastanza bravo a non cadere in alcuni di questi posti strani e strani. Ora, con Khanmigo, c'è una notevole quantità\ndi lavoro in più che stiamo facendo per renderlo ciò che, ci sentiamo abbastanza sicuri,\nsicuri per gli studenti. Direi che Khanmigo\nè più sicuro per gli studenti oggi e diventerà sempre più\nsicuro nel tempo. Ma oggi è più sicuro per gli studenti rispetto agli studenti che fanno ricerche casuali sul web e trovano chissà cosa, o agli studenti sui social media. E so che non sono necessariamente sui social media a scuola, ma sono tutti sui social\nmedia fuori dalla scuola. E sono già\nsicuro al cento per cento che Khanmigo sia più sicuro\ndi quelle esperienze. E, sai, le\ncose che stiamo facendo, e questo proviene da OpenAI,\nhanno un'API di moderazione, è una seconda, un'intelligenza artificiale con cui gli sviluppatori dell'applicazione\npossono impostare le soglie su diverse dimensioni di\ncose potenzialmente dannose come violenza, contenuti sessuali  , autolesionismo. E abbiamo delle belle soglie, le nostre soglie sono basse, il che significa che siamo molto sensibili\na queste cose che accadono. Se si verifica una di queste conversazioni\n, non si impegnerà e avviserà anche\ngenitori e insegnanti. Stiamo registrando ogni conversazione. Stiamo anche facendo un po' di alfabetizzazione digitale per far sapere agli studenti che, ehi, a volte questa cosa può\ncommettere errori ed ecco perché. Così come dovrebbero sapere che\nquando si fa una ricerca sul web, non tutte le fonti sono uguali. E molti contenuti dei social media non solo sono sbagliati, ma\nsono intenzionalmente sbagliati e cercano\nin qualche modo di confondervi il cervello. Quindi penso che ci sia un\naspetto di alfabetizzazione digitale in questo. E poi, sai, alcune\ndelle cose su cui stiamo lavorando è dargli un senso di memoria in modo che se vede schemi\nsu più conversazioni, sai, quella memoria è, pensiamo che\nla renderemo molto più esperienza di apprendimento magica e avvincente. Ma può anche aumentare la\nsicurezza se vediamo schemi di studenti che cercano di fare certe cose e ovviamente i genitori\ne gli insegnanti sono lì, ma stiamo lavorando febbrilmente per capire come\nmigliorare ancora in matematica. E penso che abbiamo già fatto\nmolti progressi rispetto a ciò che fa GPT-4. Molto, in molti casi, è ancorato ai contenuti della Khan Academy, che hanno già raggiunto\nun livello editoriale elevato. E così anche questo lo mantiene. Quindi mi sento abbastanza bene riguardo a dove si trova, ma questo non è un motivo per\nessere compiacenti e ovviamente non lo faremmo.\n- È fantastico. E penso che la tua idea di una\nsorta di programma di formazione o alfabetizzazione per questo sia buona, perché continuiamo a vedere\nprove che le persone non\ncapiscono veramente le cose per cui i chatbot sono buoni\ne per cui non sono buoni. Non so se hai\nvisto di recente questa storia di questo avvocato che si è\nmesso nei guai perché stava scrivendo\nuna memoria per un cliente che diceva tipo, facendo causa a una\ncompagnia aerea o, sai, facendo causa a una compagnia aerea o qualcosa del genere. E lui entra in Chat GPT e dice, \"Puoi darmi alcuni casi rilevanti che posso usare nel mio\nbrief per discutere questo caso?\" E gli dà alcuni casi\ne lui li invia al giudice e all'avvocato della controparte e loro dicono che nessuno\ndi questi casi esiste. Sono tutti inventati! - Oh, povero ragazzo! - L'avvocato ora rischia di essere sanzionato perché è come se avesse sottoposto\nal giudice questa giurisprudenza senza senso. E per me, ciò che questo\ndice è che dobbiamo solo diventare più esperti come utenti su dove queste cose, perché ci sono alcuni casi d'uso per i quali sono molto utili\ne molto accurati. E poi, come sai,\nci sono alcuni casi in cui si inventa semplicemente qualcosa. E quindi penso, sai,\nmi chiedo se, sai, prima di registrarti per un\naccount su Khanmigo o GPT-4 o Chat GPT o altro, dovresti fare clic\nsu un piccolo tutorial che dice, sai, ecco  un tipo di domanda che probabilmente produrrà una risposta corretta ed ecco un tipo di domanda\nche probabilmente porterà il bot della chat a inventare cose. E penso che\naiuterebbe davvero molto le persone. Quindi mi piace l'idea. - No, al cento per cento. E sai, l'abbiamo fatto, perché sappiamo che quasi\nsempre avrà un'allucinazione su un collegamento se gli chiedi un collegamento a qualcosa, creerà semplicemente un\ncollegamento molto plausibile che non esiste. Quindi sicuramente, come se\nKhanmigo non lo facesse. Offrirà solo collegamenti che\nprovengono dal nostro sito esistente che gli abbiamo fornito, invece, ma penso che sia una buona\nidea per un'istruzione ancora maggiore. Ricordo che quando ne abbiamo avuto accesso per la prima volta, stavamo cercando il nostro CFO,\nora abbiamo un ottimo CFO, ma stavamo facendo una ricerca e in quel momento non mi ero reso conto che non aveva\naccesso a Internet. E così ho semplicemente detto: \"Ehi\", sai, \"potresti cercare su LinkedIn\nqualche buon candidato?\" E ha scoperto che questi fantastici candidati con i loro numeri di telefono\navevano ragione, tipo, oh, sono\ncandidati locali e perfetti! Ho pensato: è fantastico! Questo rivoluzionerà... E guarda, potrebbe ancora\nrivoluzionare il reclutamento una volta che avrà accesso a Internet, LinkedIn e altre cose. Ma ci siamo subito resi conto\nche si trattava di fantasia, completamente fittizia. E sai, questo introduce\nun'altra cosa del tipo, beh, cosa si presume\nsia un buon CFO? E voglio dire, ha anche scelto\ni nomi, le etnie e altre cose per\nquesti candidati perfetti. E quindi, sai, questo ovviamente\nsolleva altre domande. Voglio dire, tornando al lato educativo del... Beh, sono curioso, voglio solo tornare a\ncosa dovrebbero fare le scuole, ma cosa sta facendo il New York\nTimes al riguardo? Hanno detto tipo \"\nNon ti è permesso usare...\" Voglio dire, riguardo al tuo punto\nsull'indagine o sul pezzo di giornalismo\nrispetto al pezzo di scrittura, potrebbe essere molto allettante\ne forse non male dire, okay, io'  Ho appena intervistato\nun gruppo di persone. Ho trovato alcuni\nfatti interessanti, ho trovato alcuni dati, lo farò in una grande discarica e poi chiederò a GPT-4 di scrivere una prima bozza, che poi modificherò. Ma è proprio come un\nno-no al New York Times? - Sai, non hanno\nancora emanato una politica ufficiale. Penso che stiano ancora lavorando su cosa vogliono fare con questo, ma penso che sia un livello piuttosto ampio, e ovviamente non sono un portavoce dell'intera istituzione. Ma per me, ciò per cui Chat GPT e altri sistemi sono stati utili non è tanto la stesura della prima bozza quanto la prima modifica della bozza. Quindi a volte prendo, sai, un paio di paragrafi di qualcosa che ho scritto e dico, sai, quali sono i punti di forza\ne di debolezza di questa, sai, questa sezione? Aiutami a trovare delle\ncontroargomentazioni, sai, come posso renderlo più convincente? Tipo cose del genere, invece... Ma, sai, non penso\nche questo sostituirà gli editori, ma migliorerà la mia copia prima di sottoporla al mio editore. E penso che, poiché\nc'è uno strato così spesso di editing e verifica dei fatti che\navviene al New York Times, non sono realmente\npreoccupato che allucinazioni o cose errate possano scivolare\nnei giornali perché, come gli umani\nlo prenderò prima. Ma penso che per me sia lì che queste cose siano\nstate più utili. Perché è una specie di scrittore generico.  In realtà non è così, perché è addestrato\nsulle medie statistiche di tutto il testo che era nel suo set di addestramento, sembra un po' come un\ngenerico giornalista di un giornale a meno che non lo si inneschi davvero\ncon alcune specifiche  . E quindi non ho trovato\nche sia, sai, accettabilmente buono per scrivere, ma a volte è molto buono nel suggerire modi per migliorare la mia scrittura. - Sì, no. Voglio dire, sì, se\nlo stimoli con le cose giuste, come scrivere nello stile\ndi, a volte può, ma, sai, è in linea con il modo in cui abbiamo\npensato, anche per gli studenti, dove siamo  creando effettivamente attività in cui gli studenti fanno esattamente questo. Possono scrivere la prima bozza e, dove la stanno scrivendo, ne verranno evidenziate alcune parti\ne commentate, eccetera. Cosa faresti se lo fossi, faresti qualcosa di diverso se fossi un insegnante di composizione al primo anno, un insegnante di materie umanistiche o un\npresidente di università, o un preside di scuola superiore\no un sovrintendente distrettuale, o diresti che sì, useranno la chat GPT  ,\nla gente lo capirà. - Sì, penso che tu debba smettere di dare, portare a casa compiti di scrittura\no serie di problemi o quiz da portare a casa. Penso che dovresti passare agli esami orali, ai \ntest e ai compiti in classe supervisionati e ad\nesercizi di squadra più collaborativi. Perché penso che se non lo fai, se continui a distribuire i compiti come hai fatto per\ndecenni, stai essenzialmente punendo gli studenti onesti della classe. Se hai una politica che dice, sai, non utilizzare Chat GPT per scrivere il tuo saggio; puoi presumere, penso a questo punto, che almeno metà della classe e probabilmente molto di più utilizzeranno questa roba a casa. E quindi in realtà stai solo\ndando un vantaggio ingiusto a quelle persone rispetto\nagli studenti della tua classe che si siederanno\ne proveranno a farlo da soli. Cosa ne pensi? - No, in generale sono d'accordo, anche se penso che, sai, il tuo punto sul\nreporting rispetto alla scrittura dica che puoi svolgere\ndeterminati compiti da portare a casa, ma questi\ncompiti da portare a casa riguardano molto più l' elaborazione di nuove\nintuizioni,  nuovi dati, nuove ricerche, e poi sì, lo scrivi bene e magari usi un'intelligenza artificiale per aiutarti a scriverlo, ma sei riuscito a\ninventare qualcosa di più nuovo mentre classicamente, i tuoi rapporti di ricerca al\nliceo o all'università sono solo  leggere un sacco\ndi lavori di altre persone e poi consolidarli. E così finisce per\ndiventare più un esercizio di consolidamento,\ncitazione e scrittura piuttosto che l'effettiva\ninvenzione di qualcosa di nuovo. Quindi le scuole possono sicuramente\npuntare di più su questo. Cosa diresti a un\ngiovane, sai, voglio dire, sai, a qualcuno,\nun giovane che, un giovane Kevin Roose che ha 16 anni, a cui piace scrivere, che vuole esserlo, cosa gli diresti di fare  ? Cosa diresti a qualcuno, sai, anche a qualcuno che è interessato\nin qualche altro campo, che sia l'ingegneria\no la produzione, giusto? Cosa diresti a un giovane su cui lavorare in questo momento? - Beh, io... Nel libro, ho un capitolo intitolato \"Imparare le discipline umanistiche dell'era delle macchine\". E quello che intendevo è che devi avere abilità che possano distinguerti dalle\nmacchine in qualsiasi disciplina. Sai, se sei un programmatore, \nin questo nuovo mondo non basterà essere un genio\nche programma tutto il giorno da solo in una stanza e, sai, è il programmatore più brillante del mondo  . Non è così, va bene, è comunque una buona abilità da avere, ma non sarà sufficiente, perché l'intelligenza artificiale scriverà codice e lo sta già scrivendo molto più velocemente e, sai, più economico di te. Quindi, se sei un programmatore, vuoi anche avere alcune abilità come la collaborazione, la leadership e l'etica, sai, il pensiero, e tu, devi davvero integrare qualunque abilità tecnica tu abbia con questo spesso strato, penso, di quelle che una volta venivano chiamate competenze trasversali, che è un termine che odio perché queste competenze sono in\nrealtà piuttosto difficili e scarse. Ma penso che se hai queste capacità, allora sei in una posizione migliore per cavalcare l'onda\ndell'intelligenza artificiale ovunque vada. Quindi penso che se insegnassi, sai, raccontando a me stesso di 16 anni, direi, sai, \"Lavora sulla scrittura\", è un'abilità che\npenso sia ancora molto utile, \"Ma trascorri anche davvero del\ntempo  sviluppare questo tipo di abilità interpersonali.\" Lavora davvero su cose come l'\nintelligenza emotiva e il coraggio e, in un\ncerto senso, collega insieme punti di diverse\ndiscipline. Ad esempio, quelle cose che in\nrealtà non insegniamo così spesso in classe\nin modo diretto. Ma penso che molte scuole dovranno davvero adattarsi perché queste sono le\ncompetenze del futuro. - E cosa faresti, cosa faresti, quindi pensi che se qualcuno lo fa, se... Saranno sempre adattabili e cioè, sarà sempre richiesto di avere quel muscolo di connessione umana. - Assolutamente, perché io, sai, penso che per quanto l'intelligenza artificiale possa in qualche modo\nsimulare la connessione umana o, sai, dirti\nche è il tuo terapista e ti aiuterà a\nsuperare i tuoi problemi, penso che molte persone vogliano davvero gli umani in grado di aiutarli o anche semplicemente tirarli su di morale. Voglio dire, un lavoro di cui sono un\npo' ossessionato, la durabilità, è il barista, giusto? Voglio dire, ora abbiamo robot\nche possono fare il caffè, si chiamano \"macchine per il caffè\", e probabilmente ne avete uno a casa vostra, e io ne ho tipo due a casa mia, eppure abbiamo ancora\ncaffetterie ovunque. E non è perché i robot\nnon sappiano come fare il caffè, ma perché ciò che fa il barista e ciò che fa il bar\nè una connessione umana. Loro, sai,\nti salutano la mattina e ti dicono buona giornata e stanno, sai,\npersonalizzando la tua cosa e stanno scrivendo il tuo nome sulla tazza e probabilmente lo scrivono male. Ma tutto ciò è una sorta di esperienza, non è solo una transazione. Quindi penso che quelle capacità di connessione, empatia e sorta di collaborazione, saranno preziose in\nogni settore in futuro. - No, hai assolutamente ragione. Voglio dire, pensi a\nun cameriere o una cameriera o anche solo all'idea di un ristorante, del tipo: perché andiamo al ristorante se puoi avere lo stesso cibo a casa puoi farcela, qualunque cosa, ma paghi un extra per sederti  un ambiente con altre persone intorno e dove qualcuno viene da te e chiacchiera con te e ti racconta le specialità del giorno e quale era il loro piatto preferito e suggerisce un vino e\ntu paghi un extra per quello! E sì, probabilmente se fosse un robot, e io, sai, potrei vedermi abbracciare i\nrobot in certe aree. Ma sì, penso di essere d'accordo con te. Quindi sì, sembra, voglio dire, sai, direi che nel complesso, sembra che tu abbia una\nlente piuttosto ottimista sulle cose, perché non sembra poi così male. Penso che possiamo affrontarlo. È questo il tuo senso, o ci sono cose che ti preoccupano dal\npunto di vista dell'istruzione, dello scopo umano o anche da un punto di vista più ampio? - Sì, voglio dire, ho un sacco di preoccupazioni. Sono solo un ottimista\nper temperamento, credo. E quindi vedo molte potenzialità e opportunità per l’intelligenza artificiale nell’istruzione\ne in altri campi. Penso che le cose di cui sono preoccupato, il numero uno sia solo, penso\nche il ritmo del cambiamento sia molto in questo momento. E le persone sono giuste, gli\ngira la testa.  Non sanno cosa pensare di tutto ciò, sai, nella rivoluzione industriale o in alcuni di questi altri\ngrandi cambiamenti tecnologici, quindi abbiamo avuto nel corso della storia umana, le cose si sono mosse in modo relativamente lento. Non era come se avevi attrezzature agricole,\ntrattori, mietitrici o macchine tessili che\narrivavano all'improvviso. E così i lavori delle persone erano obsoleti oppure dovevano capire cosa fare dopo. Ci sono voluti anni e, in alcuni casi, decenni perché queste transizioni avvenissero. E così le persone che svolgono quelle occupazioni potrebbero vedere il cambiamento arrivare e iniziare ad adattarsi in anticipo. Mentre penso che con l'intelligenza artificiale, voglio dire, tutto questo sta accadendo in modo\nincredibilmente veloce. E quindi penso che le persone\nfacessero davvero fatica a capire\ncosa significasse per loro. E quindi una cosa che mi preoccupa è la velocità con cui tutto ciò sta accadendo. E poi credo proprio che molti lavori\ndiventeranno obsoleti perché i lavori diventano sempre obsoleti nei periodi di rapido cambiamento tecnologico. E i posti di lavoro vengono creati anche durante i periodi di rapido cambiamento tecnologico. E quindi penso che la grande domanda sia: qual è il divario tra la scomparsa dei vecchi posti di lavoro e la\ncomparsa di nuovi lavori? E le persone che abbandonano i posti di lavoro obsoleti\nsaranno qualificate e preparate per i nuovi lavori che appariranno? E quindi queste sono alcune delle\naree a cui penso molto. - No, ha molto senso. E in realtà questa conversazione mi ha\ntoccato un punto che ho sempre usato per dire\nalla gente, ovvero, sai, quando sei al college e stai frequentando tutti\nquesti corsi specializzati per lavori diversi, sia che tu sia  Se diventerai\nun ingegnere, uno scrittore o un medico, immagini\nche la vera forza lavoro utilizzerà tutte queste\ncompetenze specializzate quotidianamente. E tu ed io sappiamo che è una farsa. Sapete, anche qualcosa di\nbasilare come l'algebra o il calcolo infinitesimale non lo usate mai, nemmeno come ingegnere, cioè sono una specie di filtri\nper le capacità di pensiero critico e di studio e cose del genere. E nella maggior parte dei lavori, anche\ni lavori migliori, ci sono alcune\ncapacità di base di pensiero critico, scrittura, capacità di comunicazione, ma la maggior parte di essi si ancorano a ciò di cui avevi parlato prima. Tipo, puoi collaborare? Sai organizzare logicamente le cose? Puoi elaborare una strategia e proiettarti in avanti su\nciò che probabilmente accadrà? Puoi portare altre persone con te e tu, non importa dove, cosa succede nelle industrie reali, quelle persone andranno benissimo. - Sì, totalmente d'accordo. - Va bene, grazie mille per- Potrei parlarti per ore! Questo è affascinante.\nDovremmo farlo regolarmente! - Mi piace, grazie Sal. Davvero, davvero bello parlare. - No, apprezzo,\ngrazie per esserti unito a Kevin. - Va bene, fai attenzione."
}