{
    "source": "HCCm0lFwqNw",
    "youtubelink": "https://www.youtube.com/watch?v=HCCm0lFwqNw",
    "t_english": "- [Instructor] If you shine particular kinds of light on certain metals, electrons will be ejected. We call this the photoelectric effect because light is photo and electrons being ejected is electric, and this was one of the key experiments that actually helped us discover a completely new model of light. But how exactly you ask? Well, let's find out. What's interesting here is that this effect depends on the color of light. For example, if this metal was, say, potassium, okay, then if you shine blue light then we will get electrons being ejected, photoelectric effect happens. But if you were to shine red light on potassium, we will not get photoelectric effect at all, regardless of how bright you make it, even if you were to make it blindingly bright, we will not get photoelectric effect. This is what puzzled physicists. I mean, think about the model over here. We have atoms with electron clouds over here and the nucleus at the center, okay. When you shine light, the energy of the light gets transferred to the electrons and they're able to escape the clutches of the nucleus and go out. But why can't that happen over here with red light? Think about it. I'm shining bright light, very high intensity, incredible amount of energy over here, and yet electrons are not able to absorb it and get out. Why does the photoelectric effect depend on the color? That was a big question that didn't make any sense. So what do we do over here? Well, we do more careful experiments. First, let's only look at the color and then think about the brightness later, okay. So what is color representing? Electromagnetic waves. Remember that color basically depends on the wavelength of light. For example, red color is, the wavelength of light could be somewhere around 650 nanometers. What we find is that at 650 nanometers, we don't get any photoelectric effect for potassium. We don't know why, but now what we can do is let's reduce the wavelength and see what happens. If I keep reducing the wavelength and let's say I come to orange light of 600 nanometers, see I've reduced it, I still get no photoelectric effect. I don't know why, but I'm just doing an experiment. This is an observation, okay. I keep reducing, I keep reducing the wavelength until I hit 541 nanometers. At this point, I now start seeing photoelectric effect, and in this particular case, electrons are barely ejected from the metal, that's why I've drawn very tiny arrow marks over here. They have hardly have any kinetic energy. I just get some photoelectric effect. And then if I reduce it even further, that's where I get my blue light at about say 500 nanometers. These are rough numbers, okay? At 500 nanometers, I now get photoelectric effect, but the electrons coming out with even more energy. What happens if I reduce it even further? I find that electrons are coming out with even more energy. So what's our observation over here? We see that if we lower the wavelength, we get more energy for the electrons coming out over here. We can also talk in terms of frequency. Remember, bigger the wavelength, smaller the frequency, because if you have big wavelength, there are less waves passing per second. So this is low frequency and this is high over here. So we can say when it comes to frequency, more the frequency, more the energy of the electrons. And you also have some kind of a cutoff over here, right. So for example, if the wavelength is above 541 nanometers for potassium, for potassium, if it's above 541 nanometers, no photoelectric effect, only below it, we will get photoelectric effect. And so every metal will have its own cutoff, we call that the threshold wavelength or you can also say threshold frequency. But the whole idea is, if the wavelength is below that threshold wavelength, only then you get photoelectric effect, if it's above, you won't get it. Different metals have different threshold wavelengths, and similarly different threshold frequencies. So that's the effect of wavelength of frequency. We see that the wavelength of the frequency controls the energy with which the electrons come out and that cannot be explained as to why. Why does the wavelength of the frequency control it? Why am I not getting photoelectric effect if it's above the threshold wavelength? It doesn't make any sense. But anyways, the next question could be for us, how does the brightness affect this whole thing? Does it have any effect? The answer is yes. Remember, brightness, or the intensity of light, is basically how big the valleys and the peaks are. So if you were to make the light brighter, then it will look somewhat like this. You can imagine it this way. This is brighter light, okay. Now, what we find is that we get more electrons, okay. It doesn't change the energy with which the electrons come out, see they're coming out with pretty much the same energy as before, but we now get more electrons. Of course, if you're above the threshold wavelength, you'll not get photoelectric effect at all, regardless of the brightness, it doesn't matter, okay. So if you decrease the brightness or intensity, you get less electrons. If you increase the intensity, you get more electrons. So intensity only controls the number of electrons, but it's the wavelength of the frequency that controls the energy with which the electrons come out, it also controls whether we get photoelectric effect or not. The big question was why? The wave model just cannot explain this, because according to wave model, you should get photoelectric effect for all colors of light. If you make light bright enough, electrons should be able to absorb it and just get emitted, but that doesn't happen, and this is why physicists back then were puzzled and we were desperately in need of an answer for this. So what did we do? Well, to explain these observations, we came up with a completely brand new model of light. Instead of thinking of light as waves that carry energy continuously and that can transfer energy continuously, we thought maybe light is made of discrete packets of energy, not waves, but packets of energy, which we call photons. And then light is being absorbed by say electrons, you also absorb it as packets. You'll either absorb no light or you'll absorb one packet of light or two packets of light and so on and so forth, nothing in between. We call this discrete, which is exactly opposite of what happens in wave model, there you can absorb continuously, okay. So how does this explain the photoelectric effect, the observations over here? Well, let's see. The key thing over here is that the energy of the photons or the packets, notice, depends on the color. If you're dealing with long wavelength or low frequency light, then we have less energy of the packet, the photons have less energy, and if you're dealing with short wavelength or high frequency light, you can see that the packets have more energy. So shorter the wavelength or more the frequency, there is more energy in the packet. There is a relationship between energy and the wavelength, which we'll not get into, but let me just give you some rough numbers over here because the numbers is gonna help us over here. So here are some numbers. So it turns out that if you consider red light of 650 nanometers, the energy of the packet, the energy of the photon is about 1.9 electronvolt. You maybe wondering, shouldn't we be measuring energy in joules? Well, joules turns out to be a big unit of energy, so we use a smaller unit of energy, which we call electronvolts. Don't worry too much about the units over here, it's just the numbers. You can see these packets have tiny energy, but this packet has much bigger energy, 2.8 electronvolts, you can see that, right. Now for potassium, it turns out, if you want to pluck an electron, if electron needs to be ejected, the minimum energy that you need is about 2.3 electronvolts, this is for potassium. Now is a great time for you to pause the video, and see if you can try and come up with an explanation over here. Alright, let's see. The big idea over here is that if you want to knock off an electron, I mean like, you know, make that electron escape, then a single photon should have at least this much energy. If the photons do not have at least this much energy, then the electron will absorb it but it's not enough to escape and so it'll just reradiate it back. And therefore, if you consider red light, a single photon does not carry enough energy, and that's the reason why electrons are not getting ejected over here, and that's why these lights are unable to give you photoelectric effect. Over here, we have just enough energy for photoelectric effect, and therefore, electrons barely make it out over here, because all of the energy is used up in just releasing the electrons, there's hardly any energy left over here so they'll be hardly moving. But over here, notice, you have more than the necessary energy over here and therefore some residual energy is left, and so electrons after coming out have some extra energy remaining, that goes out as kinetic energy. And since this has even more energy, each photon has even more energy, well, electrons now eject with even more kinetic energy 'cause there's more residual energy after getting ejected. But what about the intensity? Well, if you increase the intensity in this model, we are increasing the number of photons, that's it. Over here, notice, if a single photon does not have enough energy, then I don't care how many photons you shine, it's just not going to work, that's why here I will still not get any photoelectric effect. But over here, now I'm shining more number of photons, so more electrons can absorb that energy and therefore more electrons can escape per second and that's why I get more electrons over here. Putting it all together, since the wavelength of the frequency decides the energy of an individual photon, that decides the kinetic energy. Shorter the wavelength, more is the energy of the photon and more is the kinetic energy. If the wavelength is bigger and it's too big, the energy of the photon is very tiny, it'll not be able to knock off anything and you'll not get any photoelectric effect. And since intensity is basically the number of photons, if you have more number of photons, you'll get more number of electrons coming out. But over here, it doesn't matter how many photons you shine, and therefore it doesn't matter what the brightness is, you will not get photoelectric effect. Beautiful, isn't it? So wait, does this mean that light is not a wave? It's actually particles? Well, not quiet. You see certain phenomena of light like diffraction or interference means that light must have wave properties. And certain other phenomenons like photoelectric effect, black body radiation, scattering of light, and any other such effects makes us believe that light must also have the particle nature, the photon nature, which means a light must have a dual nature, both particle and waves. It's not that light sometimes behaves as waves and sometimes behaves as particle. No, no, no. Light has both wave and particle nature. And if you're wondering, well, how does that make any sense? How can something be both waves and particles at the same time? Well, unfortunately, there's no way to really visualize it because in our macroscopic world, we don't have any experience of things having both wave and particle nature. But this is one of the reasons why sometimes when we are showing photons, we show it this way with a tiny wave packet, but this doesn't mean that the photons are wiggling up and down, okay, that's a misconception that I used to have. It's not like that. A better way to sort of think about this is that light is not a wave in the traditional sense, it's not a particle in the traditional sense, it's a brand new object, which we don't have experience within our daily life. This object has both wave properties and particle properties, and we call such an object, a quantum object. Now this sounds very theoretical, right? But there are so many applications of the fact that light is a quantum object. Let me tell you one of them, okay. Now, in photoelectric effect, from light, we get electrons ejected. Now there's a very similar, slightly different, effect in which when you shine light, you can generate voltage. We call such an effect a photovoltaic effect. Now, the way that works is we need to first create a crystal in which there's an already inbuilt electric field. It's possible to do that. We'll not get too much details of how we build such crystals, but using semiconductors, we can build crystals like that. We don't have to hook it up to any battery or anything, it'll have an inbuilt electric field. The crystal is built in such a way that one side of the crystal has slightly different properties compared to another side of the crystal, and because of the difference in properties, an electric field gets built up. Now the important point is there are electrons everywhere, but if you focus on this region, there are a lot of electrons, but they're all bonded and they're not free to move. So even if there's an electric field pushing on them, they cannot move because they're stuck in bonds. You can imagine that this is like the sea of electrons, they're all kind of fixed inside the crystal, they cannot move. But if we shine light in this region, and if the light has the suitable frequency or the suitable wavelength, then the electrons can absorb that energy, but it won't get emitted, okay, that's the difference over here. In photoelectric effect, it gets emitted, but here, instead of getting emitted, it just gets enough energy to escape the bond. And as a result, now it's free to move, and therefore it'll get accelerated to the left in this diagram, because electric field is to the right, electrons are negatively charged, they experience of force in the opposite direction. And as a result, it will now come to the left side, and it will leave behind a gap. Now, other electrons under electrons which are bonded can swoop into this gap, which makes the gap go to the right, and then the other electrons can swoop into this gap and so on and so forth. So it kind of feels that this gap, this vacancy, will move in to the other side. This way a lot of electrons and a lot of vacancies can be created. And so, look, if you can complete this circuit, electrons would love to go from here to here through that external circuit. In other words, there is a voltage created. And so what we have done is we have used the energy from light to create voltage, photovoltaic effect. If you put a lot of these together, we create a solar panel, that's how solar cells and solar panels work. They work on the photovoltaic effect. Whether you consider them on the roofs of the houses or you consider the ones which are in the spacecraft, they all use the same idea. At the end of the day, we are using the fact that light is a quantum object to harness the power of light, which we get from the sun.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] اگر آپ مخصوص دھاتوں پر\nخاص قسم کی روشنی چمکاتے ہیں، تو الیکٹران نکالے جائیں گے۔ ہم اسے فوٹو الیکٹرک اثر کہتے ہیں کیونکہ روشنی تصویر ہے اور الیکٹران نکالے جانے والے برقی ہیں، اور یہ ان کلیدی تجربات میں سے ایک تھا جس نے روشنی کا بالکل نیا ماڈل دریافت کرنے میں ہماری مدد کی۔ لیکن آپ بالکل کیسے پوچھتے ہیں؟\nاچھا، آئیے معلوم کرتے ہیں۔ یہاں دلچسپ بات یہ ہے\nکہ یہ اثر روشنی کے رنگ پر منحصر ہے۔ مثال کے طور پر، اگر یہ دھات\nتھی، کہو، پوٹاشیم، ٹھیک ہے، پھر اگر آپ نیلی روشنی چمکائیں گے تو ہمیں الیکٹران نکالے جائیں گے، فوٹو الیکٹرک اثر ہوتا ہے۔ لیکن اگر آپ\nپوٹاشیم پر سرخ روشنی چمکاتے ہیں، تو ہمیں\nفوٹو الیکٹرک اثر بالکل نہیں ملے گا، چاہے آپ اسے کتنا ہی روشن کیوں نہ کریں، چاہے آپ\nاسے آنکھیں بند کرکے روشن کریں، ہمیں فوٹو الیکٹرک اثر نہیں ملے گا۔ یہ وہی چیز ہے جس نے طبیعیات دانوں کو حیران کردیا۔ میرا مطلب ہے، یہاں ماڈل کے بارے میں سوچو۔ ہمارے\nیہاں الیکٹران کے بادلوں کے ساتھ ایٹم ہیں اور مرکز میں نیوکلئس، ٹھیک ہے۔ جب آپ روشنی چمکاتے ہیں تو روشنی کی توانائی\nالیکٹرانوں میں منتقل ہو جاتی ہے اور وہ\nنیوکلئس کے چنگل سے بچ کر باہر نکل جاتے ہیں۔ لیکن یہ\nسرخ بتی کے ساتھ یہاں کیوں نہیں ہو سکتا؟ اس کے بارے میں سوچیں۔ میں یہاں روشن روشنی،\nبہت زیادہ شدت، توانائی کی ناقابل یقین مقدار میں چمک رہا ہوں، اور پھر بھی الیکٹران\nاسے جذب کرنے اور باہر نکلنے کے قابل نہیں ہیں۔ فوٹو الیکٹرک\nاثر رنگ پر کیوں منحصر ہے؟ یہ ایک بڑا سوال تھا\nجس کا کوئی مطلب نہیں تھا۔ تو ہم یہاں کیا کریں؟ ٹھیک ہے، ہم زیادہ محتاط تجربات کرتے ہیں۔ سب سے پہلے، آئیے صرف رنگ کو دیکھتے ہیں اور پھر چمک کے بارے میں سوچتے ہیں،\nٹھیک ہے. تو رنگ کیا نمائندگی کر رہا ہے؟\nبرقی مقناطیسی لہریں۔ یاد رکھیں کہ رنگ بنیادی طور پر روشنی کی طول موج پر منحصر ہے۔ مثال کے طور پر، سرخ رنگ ہے، روشنی کی طول موج تقریباً 650 نینو میٹر ہو سکتی ہے۔ ہمیں جو معلوم ہوتا ہے وہ یہ ہے کہ 650 نینو میٹر پر، ہمیں پوٹاشیم کے لیے کوئی فوٹو الیکٹرک اثر نہیں ملتا۔\n ہم نہیں جانتے کیوں، لیکن اب ہم کیا کر سکتے ہیں آئیے طول موج کو کم کریں\nاور دیکھیں کہ کیا ہوتا ہے۔ اگر میں طول موج کو کم کرتا رہوں اور یہ کہوں کہ میں\n600 نینو میٹر کی نارنجی روشنی پر آتا ہوں، تو دیکھو میں نے اسے کم کر دیا ہے، مجھے پھر بھی کوئی\nفوٹو الیکٹرک اثر نہیں ملتا۔ مجھے نہیں معلوم کیوں، لیکن میں\nصرف ایک تجربہ کر رہا ہوں۔ یہ ایک مشاہدہ ہے، ٹھیک ہے۔ میں کم کرتا رہتا ہوں، میں طول موج کو کم کرتا رہتا ہوں\nیہاں تک کہ میں 541 نینو میٹر تک پہنچ جاتا ہوں۔ اس مقام پر، میں اب\nفوٹو الیکٹرک اثر دیکھنا شروع کرتا ہوں، اور اس خاص معاملے میں، الیکٹران بمشکل\nدھات سے نکلتے ہیں، اسی لیے میں نے\nیہاں تیر کے بہت چھوٹے نشان بنائے ہیں۔ ان کے پاس شاید ہی کوئی حرکی توانائی ہے۔ مجھے ابھی کچھ فوٹو الیکٹرک اثر ملتا ہے۔ اور پھر اگر میں اسے مزید کم کرتا ہوں، تو وہیں سے مجھے اپنی نیلی روشنی تقریباً 500 نینو میٹر پر ملتی ہے۔ یہ کھردرے نمبر ہیں، ٹھیک ہے؟ 500 نینو میٹر پر، مجھے اب\nفوٹو الیکٹرک اثر ملتا ہے، لیکن الیکٹران اس سے\nبھی زیادہ توانائی کے ساتھ باہر آتے ہیں۔ اگر میں اسے مزید کم کردوں تو کیا ہوگا؟ مجھے معلوم ہوا کہ الیکٹران\nاور بھی زیادہ توانائی کے ساتھ باہر آ رہے ہیں۔ تو یہاں ہمارا مشاہدہ کیا ہے؟ ہم دیکھتے ہیں کہ اگر ہم طول موج کو کم کرتے ہیں، تو ہمیں یہاں سے باہر آنے والے الیکٹرانوں کے لیے زیادہ توانائی ملتی ہے۔\n ہم تعدد کے لحاظ سے بھی بات کر سکتے ہیں۔ یاد رکھیں، طول موج بڑی،\nتعدد چھوٹی، کیونکہ اگر آپ کی طول موج بڑی ہے، تو فی سیکنڈ کم لہریں گزرتی ہیں۔ تو یہ کم تعدد ہے\nاور یہ یہاں زیادہ ہے۔ لہذا ہم کہہ سکتے ہیں جب تعدد کی بات آتی ہے، زیادہ فریکوئنسی، زیادہ\nالیکٹران کی توانائی۔ اور آپ کے پاس\nیہاں ایک قسم کا کٹ آف بھی ہے، ٹھیک ہے۔ تو مثال کے طور پر، اگر طول موج\nپوٹاشیم کے لیے 541 نینو میٹر سے اوپر ہے، پوٹاشیم کے لیے، اگر یہ\n541 نینو میٹر سے اوپر ہے، کوئی فوٹو الیکٹرک اثر نہیں، صرف اس کے نیچے، ہمیں\nفوٹو الیکٹرک اثر ملے گا۔ اور اس طرح ہر دھات کا\nاپنا کٹ آف ہوگا، ہم اسے تھریشولڈ طول موج کہتے ہیں یا آپ تھریشولڈ فریکوئنسی بھی کہہ سکتے ہیں۔ لیکن پورا خیال یہ ہے کہ اگر طول موج\nاس حد سے نیچے ہے، تب ہی آپ کو فوٹو الیکٹرک اثر ملے گا، اگر یہ اوپر ہے تو آپ کو نہیں ملے گا۔ مختلف دھاتوں میں مختلف\nتھریشولڈ طول موج ہوتی ہے، اور اسی طرح مختلف\nحد کی تعدد ہوتی ہے۔ تو یہ\nتعدد کی طول موج کا اثر ہے۔ ہم دیکھتے ہیں کہ فریکوئنسی کی طول موج اس\n توانائی کو کنٹرول کرتی ہے\nجس کے ساتھ الیکٹران نکلتے ہیں اور اس کی وجہ نہیں بتائی جا سکتی۔  تعدد کی طول موج\nاسے کیوں کنٹرول کرتی ہے؟  اگر یہ تھریشولڈ طول موج سے اوپر ہے تو مجھے فوٹو الیکٹرک اثر کیوں نہیں مل رہا ہے ؟ اس کا کوئی مطلب نہیں ہے۔ لیکن بہرحال، اگلا\nسوال ہمارے لیے ہو سکتا ہے، چمک\nاس ساری چیز کو کیسے متاثر کرتی ہے؟  کیا اس کا کوئی اثر ہے؟\nجواب ہاں میں ہے۔ یاد رکھیں، چمک، یا\nروشنی کی شدت، بنیادی طور پر یہ ہے کہ\nوادیاں اور چوٹیاں کتنی بڑی ہیں۔ لہذا اگر آپ روشنی کو روشن کرنا چاہتے ہیں، تو یہ کچھ اس طرح نظر آئے گا. آپ اس کا تصور اس طرح کر سکتے ہیں۔ یہ روشن روشنی ہے، ٹھیک ہے۔ اب، جو ہمیں ملتا ہے وہ یہ ہے کہ\nہمیں زیادہ الیکٹران ملتے ہیں، ٹھیک ہے۔ یہ اس توانائی کو تبدیل نہیں کرتا جس کے ساتھ الیکٹران نکلتے ہیں، دیکھیں کہ وہ \nپہلے جیسی توانائی کے ساتھ باہر آ رہے ہیں، لیکن اب ہمیں مزید الیکٹران ملتے ہیں۔ بلاشبہ، اگر آپ\nتھریشولڈ طول موج سے اوپر ہیں، تو آپ کو\nفوٹو الیکٹرک اثر بالکل نہیں ملے گا، چمک سے قطع نظر،\nاس سے کوئی فرق نہیں پڑتا، ٹھیک ہے۔ لہذا اگر آپ\nچمک یا شدت کو کم کرتے ہیں، تو آپ کو کم الیکٹران ملتے ہیں۔ اگر آپ شدت میں اضافہ کرتے ہیں، تو\nآپ کو زیادہ الیکٹران ملتے ہیں۔ لہٰذا شدت صرف\nالیکٹرانوں کی تعداد کو کنٹرول کرتی ہے، لیکن یہ فریکوئنسی کی طول موج ہے جو اس توانائی کو کنٹرول کرتی ہے\nجس کے ساتھ الیکٹران نکلتے ہیں، یہ اس بات کو بھی کنٹرول کرتا ہے کہ ہمیں\nفوٹو الیکٹرک اثر ملتا ہے یا نہیں۔ بڑا سوال یہ تھا کہ کیوں؟ ویو ماڈل صرف اس کی وضاحت نہیں کر سکتا، کیونکہ لہر ماڈل کے مطابق، آپ کو\nروشنی کے تمام رنگوں کے لیے فوٹو الیکٹرک اثر ملنا چاہیے۔ اگر آپ روشنی کو کافی روشن بناتے ہیں، تو الیکٹران اسے جذب کرنے کے قابل ہو جائیں اور صرف خارج ہو جائیں،\nلیکن ایسا نہیں ہوتا، اور یہی وجہ ہے کہ اس وقت کے طبیعیات دان\nحیران تھے اور ہمیں\nاس کے جواب کی اشد ضرورت تھی۔ تو ہم نے کیا کیا؟ ٹھیک ہے، ان مشاہدات کی وضاحت کے لیے، ہم\nروشنی کے بالکل نئے ماڈل کے ساتھ آئے ہیں۔ روشنی کو ایسی لہروں کے طور پر سوچنے کی بجائے جو توانائی کو مسلسل لے جاتی ہیں اور جو توانائی کو مسلسل منتقل کر سکتی ہیں، ہم نے سوچا کہ شاید روشنی توانائی کے مجرد پیکٹوں سے بنی ہے،\nلہروں سے نہیں، بلکہ توانائی کے پیکٹوں سے بنی ہے،\nجسے ہم فوٹان کہتے ہیں۔ اور پھر روشنی کو\nالیکٹران کے ذریعے جذب کیا جا رہا ہے، آپ اسے پیکٹ کے طور پر بھی جذب کرتے ہیں۔ آپ یا تو کوئی روشنی جذب نہیں کریں گے یا آپ روشنی کا ایک پیکٹ یا روشنی کے دو پیکٹ جذب کریں گے\nاور اسی طرح آگے، درمیان میں کچھ نہیں۔ ہم اسے مجرد کہتے ہیں، جو\nویو ماڈل میں ہونے والی چیزوں کے بالکل برعکس ہے، وہاں آپ مسلسل جذب کر سکتے ہیں، ٹھیک ہے۔ تو یہ\nفوٹو الیکٹرک اثر، یہاں کے مشاہدات کی وضاحت کیسے کرتا ہے؟ ٹھیک ہے، چلو دیکھتے ہیں. یہاں اہم بات یہ ہے کہ\nفوٹون یا پیکٹ کی توانائی، نوٹس، رنگ پر منحصر ہے۔ اگر آپ لمبی طول موج یا کم فریکوئنسی لائٹ سے نمٹ رہے ہیں، تو ہمارے پاس پیکٹ کی توانائی کم ہے، فوٹون کی توانائی کم ہے، اور اگر آپ\nمختصر طول موج یا ہائی فریکوئنسی لائٹ کے ساتھ کام کر رہے ہیں، تو آپ دیکھ سکتے ہیں کہ\nپیکٹ میں زیادہ توانائی ہے۔  توانائی اتنی کم طول موج\nیا زیادہ فریکوئنسی، پیکٹ میں زیادہ توانائی ہوتی ہے۔  توانائی اور طول موج کے درمیان ایک رشتہ ہے،\n جس میں ہم نہیں جائیں گے، لیکن میں آپ کو\nیہاں کچھ کھردرے اعداد بتاتا ہوں کیونکہ اعداد\nیہاں ہماری مدد کرنے والے ہیں۔ تو یہاں کچھ نمبر ہیں۔ تو پتہ چلتا ہے کہ اگر آپ\n650 نینو میٹر کی سرخ روشنی پر غور کریں تو پیکٹ کی توانائی، فوٹوون کی توانائی\nتقریباً 1.9 الیکٹران وولٹ ہے۔ آپ سوچ رہے ہوں گے، کیا ہمیں\nتوانائی کی پیمائش جولز میں نہیں کرنی چاہیے؟ ٹھیک ہے، جولز\nتوانائی کی ایک بڑی اکائی بنتے ہیں، اس لیے ہم توانائی کی ایک چھوٹی اکائی استعمال کرتے ہیں، جسے ہم الیکٹران وولٹس کہتے ہیں۔ \nیہاں کی اکائیوں کے بارے میں زیادہ فکر نہ کریں، یہ صرف تعداد ہے۔ آپ دیکھ سکتے ہیں کہ ان\nپیکٹوں میں چھوٹی توانائی ہے، لیکن اس پیکٹ میں بہت بڑی\nتوانائی ہے، 2.8 الیکٹران وولٹس، آپ دیکھ سکتے ہیں، ٹھیک ہے۔ اب پوٹاشیم کے لیے، یہ پتہ چلتا ہے، اگر آپ الیکٹران کو نکالنا چاہتے ہیں، اگر الیکٹران کو نکالنے کی ضرورت ہے، تو کم از کم توانائی جس کی آپ کو\nضرورت ہے تقریباً 2.3 الیکٹران وولٹ، یہ پوٹاشیم کے لیے ہے۔ اب آپ کے لیے ویڈیو کو موقوف کرنے کا بہترین وقت ہے،\n اور دیکھیں کہ کیا آپ کوشش کر سکتے ہیں اور یہاں کوئی وضاحت پیش کر سکتے ہیں۔ ٹھیک ہے، آئیے دیکھتے ہیں۔ یہاں پر بڑا خیال یہ ہے کہ اگر آپ\nایک الیکٹران کو بند کرنا چاہتے ہیں، میرا مطلب ہے کہ، آپ جانتے ہیں،\nاس الیکٹران کو فرار بنائیں، تو ایک فوٹون میں کم\nاز کم اتنی توانائی ہونی چاہیے۔ اگر فوٹون کے پاس کم\nاز کم اتنی توانائی نہیں ہے، تو الیکٹران اسے جذب کر لے گا لیکن یہ فرار ہونے کے لیے کافی نہیں ہے اور اس لیے یہ اسے دوبارہ ریڈیڈیٹ کر دے گا۔ اور اس لیے، اگر آپ سرخ روشنی پر غور کریں، تو ایک فوٹون\nکافی توانائی نہیں لیتا، اور یہی وجہ ہے کہ الیکٹران\nیہاں سے خارج نہیں ہو رہے ہیں، اور یہی وجہ ہے کہ یہ روشنیاں آپ کو\nفوٹو الیکٹرک اثر دینے سے قاصر ہیں۔ یہاں، ہمارے پاس فوٹو الیکٹرک اثر کے لیے کافی توانائی ہے، اور اس وجہ سے، الیکٹران اسے\nبمشکل یہاں سے نکالتے ہیں، کیونکہ تمام توانائی صرف الیکٹرانوں کو چھوڑنے میں استعمال ہوتی ہے، یہاں شاید ہی کوئی توانائی باقی رہ جائے، اس لیے وہ مشکل سے ہی ہوں گے۔  منتقل لیکن یہاں، نوٹس کریں، آپ کے پاس\nیہاں ضروری توانائی سے زیادہ ہے اور اس وجہ سے کچھ\nبقایا توانائی رہ گئی ہے، اور اس لیے باہر آنے کے بعد الیکٹران کے پاس کچھ اضافی توانائی باقی رہ جاتی ہے، جو کہ حرکی توانائی کے طور پر نکل جاتی ہے۔ اور چونکہ اس میں اور بھی زیادہ توانائی ہوتی ہے، اس لیے ہر فوٹون میں اور بھی زیادہ توانائی ہوتی ہے، ٹھیک ہے، الیکٹران اب اس سے بھی\nزیادہ حرکی توانائی کے ساتھ نکلتے ہیں کیونکہ\nخارج ہونے کے بعد زیادہ بقایا توانائی ہوتی ہے۔ لیکن شدت کا کیا ہوگا؟ ٹھیک ہے، اگر آپ\nاس ماڈل میں شدت کو بڑھاتے ہیں، تو ہم\nفوٹون کی تعداد بڑھا رہے ہیں، بس۔ یہاں، نوٹس کریں، اگر ایک فوٹون میں\nاتنی توانائی نہیں ہے، تو مجھے اس سے کوئی فرق نہیں پڑتا کہ\nآپ کتنے فوٹون چمکاتے ہیں، یہ کام نہیں کرے گا، اسی لیے یہاں مجھے اب بھی کوئی فوٹو الیکٹرک اثر نہیں ملے گا۔ لیکن یہاں، اب میں\nزیادہ تعداد میں فوٹون چمکا رہا ہوں، اس لیے زیادہ الیکٹران اس توانائی کو جذب کر سکتے ہیں اور اس لیے زیادہ الیکٹران\nفی سیکنڈ سے باہر نکل سکتے ہیں اور اسی لیے مجھے\nیہاں زیادہ الیکٹران ملتے ہیں۔ ان سب کو ایک ساتھ رکھنا، چونکہ فریکوئنسی کی طول موج انفرادی فوٹوون کی توانائی کا فیصلہ کرتی ہے\n، جو حرکی توانائی کا فیصلہ کرتی ہے۔ طول موج کم، فوٹان کی توانائی زیادہ ہے اور حرکی توانائی زیادہ ہے۔ اگر طول موج\nبڑی ہے اور یہ بہت بڑی ہے تو، فوٹوون کی توانائی بہت چھوٹی ہے، یہ کسی چیز کو دستک نہیں دے سکے گا اور آپ کو کوئی\nفوٹو الیکٹرک اثر نہیں ملے گا۔ اور چونکہ شدت\nبنیادی طور پر فوٹون کی تعداد ہے، اگر آپ کے پاس زیادہ تعداد میں فوٹون ہیں، تو آپ کو زیادہ تعداد\nمیں الیکٹران نکلیں گے۔ لیکن یہاں، اس سے کوئی فرق نہیں پڑتا ہے کہ\nآپ کتنے فوٹونز چمکتے ہیں، اور اس لیے اس سے کوئی\nفرق نہیں پڑتا کہ چمک کتنی ہے، آپ کو فوٹو الیکٹرک اثر نہیں ملے گا۔ خوبصورت، ہے نا؟ تو انتظار کرو، کیا اس کا مطلب یہ ہے\nکہ روشنی لہر نہیں ہے؟ یہ اصل میں ذرات ہے؟  ٹھیک ہے، خاموش نہیں. آپ روشنی کے کچھ مظاہر دیکھتے ہیں جیسے کہ پھیلاؤ یا مداخلت کا مطلب ہے کہ روشنی میں\nلہر کی خصوصیات ہونی چاہئیں۔ اور کچھ دوسرے مظاہر\nجیسے فوٹو الیکٹرک اثر، بلیک باڈی ریڈی ایشن، روشنی کا بکھرنا، اور اس طرح کے دیگر\nاثرات ہمیں اس بات پر یقین دلاتے ہیں کہ روشنی میں بھی\nذرہ فطرت، فوٹون فطرت، جس کا مطلب ہے کہ روشنی کی\nدوہری نوعیت ہونی چاہیے، ذرہ اور دونوں۔  لہریں ایسا نہیں ہے کہ روشنی\nکبھی لہروں کی طرح برتاؤ کرتی ہے اور کبھی ذرات کی طرح برتاؤ کرتی ہے۔ نہیں نہیں نہیں۔ روشنی کی لہر اور ذرہ دونوں نوعیت ہوتی ہے۔ اور اگر آپ سوچ رہے ہیں، ٹھیک ہے،\nاس کا کوئی مطلب کیسے ہے؟ کوئی چیز بیک وقت لہریں اور ذرات دونوں کیسے ہو سکتی ہے؟ ٹھیک ہے، بدقسمتی سے،\nواقعی اس کا تصور کرنے کا کوئی طریقہ نہیں ہے کیونکہ ہماری میکروسکوپک دنیا میں، ہمیں ایسی چیزوں کا کوئی تجربہ نہیں ہے جو لہر اور ذرہ دونوں نوعیت کی ہوں۔ لیکن یہ ایک وجہ ہے کہ بعض اوقات جب ہم فوٹون دکھا رہے ہوتے ہیں تو ہم اسے\nایک چھوٹے موج کے پیکٹ سے اس طرح دکھاتے ہیں، لیکن اس کا مطلب یہ نہیں ہے کہ فوٹون اوپر\nنیچے گھوم رہے ہیں، ٹھیک ہے، یہ ایک غلط فہمی ہے\nجو میں استعمال کرتا تھا۔  ہے یہ اس طرح نہیں ہے۔ اس کے بارے میں سوچنے کا ایک بہتر طریقہ یہ ہے کہ روشنی\nروایتی معنوں میں لہر نہیں ہے، یہ روایتی معنوں میں کوئی ذرہ نہیں ہے،\n یہ بالکل نئی چیز ہے، جس کا ہمیں\nاپنی روزمرہ کی زندگی میں تجربہ نہیں ہے۔ اس شے میں لہر کی خصوصیات اور پارٹیکل کی خصوصیات دونوں ہیں اور ہم ایسی\nچیز کو کوانٹم آبجیکٹ کہتے ہیں۔ اب یہ بہت نظریاتی لگتا ہے، ٹھیک ہے؟ لیکن اس حقیقت کے بہت سارے اطلاقات ہیں کہ روشنی\nایک کوانٹم آبجیکٹ ہے۔ میں آپ کو ان میں سے ایک بتاتا ہوں، ٹھیک ہے. اب، فوٹو الیکٹرک اثر میں، روشنی سے، ہم الیکٹران نکالتے ہیں۔ اب ایک بہت ہی ملتا جلتا،\nقدرے مختلف، اثر ہے جس میں جب آپ روشنی چمکاتے ہیں، تو آپ وولٹیج پیدا کر سکتے ہیں۔ ہم ایسے اثر کو\nفوٹوولٹک اثر کہتے ہیں۔ اب، کام کرنے کا طریقہ یہ ہے کہ ہمیں\nسب سے پہلے ایک کرسٹل بنانے کی ضرورت ہے جس میں پہلے سے\nموجود الیکٹرک فیلڈ موجود ہو۔ ایسا کرنا ممکن ہے۔ ہم اس بارے میں زیادہ تفصیلات حاصل نہیں کریں گے کہ ہم اس طرح کے کرسٹل کیسے بناتے ہیں، لیکن سیمی کنڈکٹرز کا استعمال کرتے ہوئے، ہم اس\nطرح کے کرسٹل بنا سکتے ہیں۔ ہمیں اسے\nکسی بھی بیٹری یا کسی چیز سے جوڑنے کی ضرورت نہیں ہے، اس میں ان بلٹ الیکٹرک فیلڈ ہوگی۔ کرسٹل کو اس طرح بنایا گیا ہے کہ کرسٹل کے ایک سائیڈ میں کرسٹل کے دوسرے سائیڈ کے مقابلے میں قدرے مختلف خصوصیات ہیں اور\nخصوصیات میں فرق کی وجہ سے برقی میدان بن جاتا ہے۔ اب اہم نکتہ یہ ہے کہ\nہر جگہ الیکٹران موجود ہیں، لیکن اگر آپ اس خطے پر توجہ مرکوز کریں تو وہاں بہت سارے الیکٹران موجود ہیں، لیکن وہ سب بندھے ہوئے ہیں اور\nوہ حرکت کرنے کے لیے آزاد نہیں ہیں۔ اس لیے یہاں تک کہ اگر کوئی برقی\nمیدان ان پر دھکیل رہا ہے، وہ حرکت نہیں کر سکتے کیونکہ\nوہ بندھن میں پھنس گئے ہیں۔ آپ تصور کر سکتے ہیں کہ یہ\nالیکٹرانوں کے سمندر کی طرح ہے، وہ تمام قسم کے\nکرسٹل کے اندر جمے ہوئے ہیں، وہ حرکت نہیں کر سکتے۔ لیکن اگر ہم اس خطے میں روشنی چمکاتے ہیں، اور اگر روشنی\nمناسب فریکوئنسی یا مناسب طول موج رکھتی ہے، تو الیکٹران اس توانائی کو جذب کر سکتے ہیں، لیکن یہ خارج نہیں ہوگی، ٹھیک ہے، یہاں فرق ہے۔ فوٹو الیکٹرک اثر میں، یہ خارج ہوتا ہے، لیکن یہاں، خارج ہونے کے بجائے، اس کو\nبانڈ سے بچنے کے لیے کافی توانائی ملتی ہے۔ اور نتیجے کے طور پر، اب یہ حرکت کرنے کے لیے آزاد ہے، اور اس لیے یہ اس خاکہ میں بائیں جانب تیز ہو جائے گا، کیونکہ برقی میدان دائیں طرف ہے، الیکٹران منفی طور پر چارج ہوتے ہیں، وہ مخالف سمت میں قوت کا تجربہ کرتے ہیں۔\n اور نتیجے کے طور پر، یہ\nاب بائیں طرف آئے گا، اور یہ ایک خلا چھوڑ جائے گا. اب، الیکٹران کے نیچے دوسرے الیکٹران\nجو بندھے ہوئے ہیں اس خلا میں جھپٹ سکتے ہیں، جس سے یہ خلا دائیں طرف جاتا ہے، اور پھر دوسرے الیکٹران\nاس خلا میں جھپٹ سکتے ہیں اور اسی طرح آگے۔ تو ایسا محسوس ہوتا ہے کہ\nیہ خلا، یہ خالی جگہ، دوسری طرف چلی جائے گی۔ اس طرح بہت سارے الیکٹران اور بہت ساری خالی جگہیں بن سکتی ہیں۔ اور اس طرح، دیکھو، اگر آپ\nاس سرکٹ کو مکمل کر سکتے ہیں، تو الیکٹران اس بیرونی سرکٹ کے ذریعے\nیہاں سے یہاں جانا پسند کریں گے۔ دوسرے الفاظ میں،\nایک وولٹیج پیدا ہوتا ہے. اور اس لیے ہم نے یہ کیا ہے کہ ہم نے\nروشنی سے حاصل ہونے والی توانائی کو وولٹیج، فوٹوولٹک اثر بنانے کے لیے استعمال کیا ہے۔ اگر آپ ان میں سے بہت ساری چیزیں\nاکٹھا کرتے ہیں تو ہم ایک سولر پینل بناتے ہیں، اس طرح سولر سیل\nاور سولر پینل کام کرتے ہیں۔ وہ فوٹوولٹک اثر پر کام کرتے ہیں۔ چاہے آپ انہیں\nگھروں کی چھتوں پر غور کریں یا آپ\nخلائی جہاز میں موجود چیزوں پر غور کریں، وہ سب ایک ہی خیال کا استعمال کرتے ہیں۔ دن کے اختتام پر، ہم اس حقیقت کو استعمال کر رہے ہیں کہ روشنی کی طاقت کو استعمال کرنے کے لیے\nروشنی ایک کوانٹم آبجیکٹ ہے، \nجو ہمیں سورج سے حاصل ہوتی ہے۔",
    "t_spanish": "- [Instructor] Si proyectas\ndeterminados tipos de luz sobre ciertos metales, se expulsarán electrones.  A esto lo llamamos efecto fotoeléctrico porque la luz es una fotografía y los electrones expulsados ​​son eléctricos, y este fue uno de los experimentos clave que realmente nos ayudó a descubrir un modelo de luz completamente nuevo.  ¿ Pero cómo preguntas exactamente?\nBueno, averigüémoslo. Lo interesante aquí\nes que este efecto depende del color de la luz. Por ejemplo, si este metal\nfuera, digamos, potasio, está bien, entonces si brillamos con luz azul, se expulsarán electrones y se producirá el efecto fotoeléctrico. Pero si iluminamos con\nluz roja el potasio, no obtendremos ningún\nefecto fotoeléctrico, independientemente de lo brillante que lo hagamos, incluso si\nlo hicieramos deslumbrantemente brillante, no obtendremos el efecto fotoeléctrico. Esto es lo que desconcertó a los físicos. Quiero decir, piensa en el modelo de aquí. Tenemos átomos con\nnubes de electrones aquí y el núcleo en el centro, está bien. Cuando irradias luz, la energía de la luz se\ntransfiere a los electrones y estos pueden escapar de\nlas garras del núcleo y apagarse.  ¿ Pero por qué no puede suceder eso\naquí con luz roja?  Piénsalo. Estoy brillando con una luz brillante, de\nmuy alta intensidad, con una cantidad increíble de energía aquí y, sin embargo, los electrones no\npueden absorberla y salir.  ¿ Por qué el\nefecto fotoeléctrico depende del color? Ésa era una gran pregunta\nque no tenía ningún sentido. Entonces, ¿qué hacemos aquí? Bueno, hacemos experimentos más cuidadosos. Primero, miremos solo el color y luego pensemos en el\nbrillo, está bien. Entonces, ¿qué representa el color?\nOndas electromagnéticas. Recuerda que el color depende básicamente de la longitud de onda de la luz. Por ejemplo, si es de color rojo, la longitud de onda de la luz podría rondar los 650 nanómetros. Lo que encontramos es que a 650 nanómetros no obtenemos ningún\nefecto fotoeléctrico para el potasio. No sabemos por qué, pero ahora lo que podemos hacer es reducir la longitud de onda\ny ver qué pasa. Si sigo reduciendo la longitud de onda y digamos que llego a una\nluz naranja de 600 nanómetros, la he reducido, todavía\nno obtengo ningún efecto fotoeléctrico. No sé por qué, pero\nsólo estoy haciendo un experimento. Esta es una observación, está bien. Sigo reduciendo, sigo reduciendo la longitud de onda\nhasta llegar a 541 nanómetros. En este punto, empiezo a\nver el efecto fotoeléctrico y, en este caso particular, los electrones apenas son\nexpulsados ​​del metal, por eso he dibujado\nmarcas de flechas muy pequeñas aquí. Apenas tienen energía cinética. Solo obtengo un efecto fotoeléctrico. Y luego, si lo reduzco aún más, ahí es donde obtengo mi luz azul de aproximadamente 500 nanómetros. Estos son números aproximados, ¿vale? A 500 nanómetros ahora\nobtengo un efecto fotoeléctrico, pero los electrones\nsalen con aún más energía.  ¿ Qué pasa si lo reduzco aún más? Encuentro que los electrones\nsalen con aún más energía. Entonces, ¿cuál es nuestra observación aquí? Vemos que si reducimos la longitud de onda, obtenemos más energía para los\nelectrones que salen por aquí. También podemos hablar en términos de frecuencia. Recuerde, cuanto mayor es la longitud de onda,\nmenor es la frecuencia, porque si tiene una longitud de onda grande, pasan menos ondas por segundo. Entonces esto es de baja frecuencia\ny esto es de alta aquí. Entonces podemos decir que cuando se trata de frecuencia, más frecuencia, más\nenergía de los electrones. Y también tienes una especie\nde límite aquí, ¿verdad? Entonces, por ejemplo, si la longitud de onda está por encima de\n541 nanómetros para el potasio, para el potasio, si está por\nencima de 541 nanómetros, no habrá efecto fotoeléctrico, solo por debajo de él,\nobtendremos efecto fotoeléctrico. Y entonces, cada metal\ntendrá su propio límite, lo llamamos longitud de onda umbral o también se puede decir frecuencia umbral. Pero la idea es que si la longitud de onda está por debajo de\nese umbral de longitud de onda, sólo entonces se obtiene el efecto fotoeléctrico; si está por encima, no lo obtendrá. Diferentes metales tienen diferentes\nlongitudes de onda umbral y, de manera similar, diferentes\nfrecuencias umbral. Ese es el efecto de la\nlongitud de onda de la frecuencia. Vemos que la longitud de onda\nde la frecuencia controla la energía con\nla que salen los electrones y eso no se puede explicar por qué.  ¿ Por qué la longitud de onda de\nla frecuencia lo controla?  ¿ Por qué no obtengo el efecto fotoeléctrico si está por encima del umbral de longitud de onda? No tiene ningún sentido. Pero de todos modos, la siguiente\npregunta podría ser: ¿ cómo afecta el brillo a\ntodo esto?  ¿ Tiene algún efecto?\nLa respuesta es sí. Recuerde, el brillo, o\nla intensidad de la luz, es básicamente el tamaño de los\nvalles y los picos. Entonces, si hicieras que la luz fuera más brillante, se vería más o menos así. Puedes imaginarlo de esta manera. Esta es una luz más brillante, ¿vale? Ahora, lo que encontramos es que\nobtenemos más electrones, ¿vale? No cambia la energía con la que salen los electrones, miran, salen con prácticamente la\nmisma energía que antes, pero ahora obtenemos más electrones. Por supuesto, si estás por encima\ndel umbral de longitud de onda, no obtendrás\nningún efecto fotoeléctrico, independientemente del brillo,\nno importa, está bien. Entonces, si disminuyes el\nbrillo o la intensidad, obtienes menos electrones. Si aumentas la intensidad,\nobtienes más electrones. Entonces la intensidad solo controla\nel número de electrones, pero es la longitud de onda de la frecuencia la que controla la energía con\nla que salen los electrones, también controla si obtenemos\nefecto fotoeléctrico o no. La gran pregunta era ¿por qué? El modelo de onda simplemente no puede explicar esto, porque según el modelo de onda, debería obtenerse un\nefecto fotoeléctrico para todos los colores de luz. Si se hace que la luz sea lo suficientemente brillante, los electrones deberían poder absorberla y simplemente emitirse,\npero eso no sucede, y es por eso que los físicos\nde entonces estaban desconcertados y necesitábamos desesperadamente\nuna respuesta para esto. entonces, ¿qué hicimos? Bueno, para explicar estas observaciones, se nos ocurrió un\nmodelo de luz completamente nuevo. En lugar de pensar en la luz como ondas que transportan energía continuamente y que pueden transferir energía continuamente, pensamos que tal vez la luz esté formada por paquetes discretos\nde energía, no ondas, sino paquetes de energía,\nque llamamos fotones. Y luego la luz es\nabsorbida por, digamos, electrones, también la absorbes en forma de paquetes. O no absorberás ninguna luz o absorberás un paquete de luz o dos paquetes de luz\ny así sucesivamente, nada intermedio.  A esto lo llamamos discreto, que es exactamente lo opuesto a\nlo que sucede en el modelo ondulatorio, donde puedes absorber continuamente, ¿vale? Entonces, ¿cómo explica esto\nel efecto fotoeléctrico, las observaciones aquí? Bien, veamos. La clave aquí es que la energía de los\nfotones o de los paquetes, fíjate, depende del color. Si se trata de luz de longitud de onda larga o de baja frecuencia, entonces tenemos menos energía del paquete, los fotones tienen menos energía, y si se trata\nde luz de longitud de onda corta o de alta frecuencia, se puede ver que los\npaquetes tienen más  energía. Cuanto menor sea la longitud de onda\no mayor sea la frecuencia, más energía habrá en el paquete. Existe una relación entre la\nenergía y la longitud de onda, en la cual no entraremos, pero permítanme darles\nalgunos números aproximados porque los números\nnos ayudarán. Así que aquí hay algunos números. Entonces resulta que si consideramos la\nluz roja de 650 nanómetros, la energía del paquete, la energía del fotón\nes de aproximadamente 1,9 electronvoltios. Quizás te preguntes: ¿ no deberíamos medir la\nenergía en julios? Bueno, los julios resultan\nser una unidad grande de energía, por lo que usamos una unidad de energía más pequeña, a la que llamamos electronvoltios. No te preocupes demasiado\npor las unidades aquí, son sólo los números. Pueden ver que estos\npaquetes tienen una energía pequeña, pero este paquete tiene una energía mucho mayor\n, 2,8 electronvoltios, pueden verlo, ¿verdad? Ahora, para el potasio, resulta que si quieres arrancar un electrón, si es necesario expulsarlo, la energía mínima que\nnecesitas es aproximadamente 2,3 electronvoltios, esto es para el potasio. Ahora es un buen momento para\npausar el video y ver si puedes intentar encontrar una explicación aquí. Muy bien, veamos. La gran idea aquí es que si quieres\neliminar un electrón, quiero decir, ya sabes,\nhacer que ese electrón escape, entonces un solo fotón debería\ntener al menos esta cantidad de energía. Si los fotones no tienen\nal menos tanta energía, entonces el electrón la absorberá pero no es suficiente para escapar y simplemente la reirradiará. Y por lo tanto, si consideramos la luz roja, un solo fotón\nno transporta suficiente energía, y esa es la razón por la cual los electrones no son\nexpulsados ​​aquí, y es por eso que estas luces no pueden darle\nefecto fotoeléctrico. Aquí, tenemos suficiente energía para el efecto fotoeléctrico y, por lo tanto, los electrones\napenas logran salir por aquí, debido a que toda la energía se consume simplemente liberando los electrones, casi no queda energía aquí, por lo que difícilmente serán  Moviente. Pero aquí, observen, tienen más\nenergía de la necesaria y por lo tanto\nqueda algo de energía residual, por lo que a los electrones después de salir les queda algo de energía extra, que sale como energía cinética. Y como esto tiene aún más energía, cada fotón tiene aún más energía, bueno, los electrones ahora se eyectan\ncon aún más energía cinética porque hay más\nenergía residual después de ser expulsados. Pero ¿qué pasa con la intensidad? Bueno, si aumentas la\nintensidad en este modelo, estamos aumentando la cantidad\nde fotones, eso es todo. Aquí, fíjense, si un solo fotón\nno tiene suficiente energía, entonces no me importa\ncuántos fotones brillen, simplemente no va a funcionar, es por eso que aquí todavía no obtendré ningún efecto fotoeléctrico. Pero aquí, ahora estoy brillando con\nmás fotones, por lo que más electrones pueden absorber esa energía y, por lo tanto, más electrones\npueden escapar por segundo y es por eso que obtengo\nmás electrones aquí.  En conjunto, dado que la longitud de onda de la frecuencia decide la energía de\nun fotón individual, eso decide la energía cinética.  Cuanto más corta es la longitud de onda, mayor es la energía del fotón y mayor es la energía cinética. Si la longitud de onda es\nmayor y demasiado grande, la energía del fotón es muy pequeña, no podrá derribar nada y no obtendrá ningún\nefecto fotoeléctrico. Y dado que la intensidad es\nbásicamente la cantidad de fotones, si tiene más fotones, saldrá más cantidad\nde electrones. Pero aquí, no importa\ncuántos fotones brille y, por lo tanto, no\nimporta cuál sea el brillo, no obtendrá efecto fotoeléctrico. Hermoso, ¿no? Espera, ¿significa esto\nque la luz no es una onda?  ¿En realidad son partículas?  Bueno, no tranquilo. Ver ciertos fenómenos de la luz como la difracción o la interferencia significa que la luz debe\ntener propiedades ondulatorias. Y ciertos otros fenómenos\ncomo el efecto fotoeléctrico, la radiación del cuerpo negro, la dispersión de la luz y otros\nefectos similares nos hacen creer que la luz también debe\ntener la naturaleza de partícula, la naturaleza de fotón, lo que significa que una luz\ndebe tener una naturaleza dual, tanto de partícula como de fotón.  ondas. No es que la luz\na veces se comporte como ondas y otras como partículas. No no no.  La luz tiene naturaleza tanto ondulatoria como partícula. Y si te estás preguntando, bueno, ¿\nqué sentido tiene eso?  ¿ Cómo puede algo ser a la vez ondas y partículas? Bueno, desafortunadamente,\nno hay manera de visualizarlo realmente porque en nuestro mundo macroscópico, no tenemos ninguna experiencia de que las cosas tengan naturaleza tanto ondulatoria como partícula. Pero esta es una de las razones por las que a veces cuando mostramos fotones, lo mostramos de esta manera\ncon un pequeño paquete de ondas, pero esto no significa que los fotones se\nmueven hacia arriba y hacia abajo, está bien, esa es una idea errónea\nque solía tener.  tener. No es así. Una mejor manera de pensar en esto es que la luz no es una onda\nen el sentido tradicional, no es una partícula en\nel sentido tradicional, es un objeto completamente nuevo, que no tenemos experiencia\nen nuestra vida diaria. Este objeto tiene propiedades tanto de onda como de partícula, y lo llamamos\nobjeto cuántico. Ahora bien, esto suena muy teórico, ¿verdad? Pero hay muchísimas aplicaciones del hecho de que la luz\nsea un objeto cuántico. Déjame contarte uno de ellos, está bien. Ahora, en el efecto fotoeléctrico, a partir de la luz, conseguimos que se expulsen electrones. Ahora hay un efecto muy similar,\nligeramente diferente, en el que cuando iluminas, puedes generar voltaje.  A este efecto lo llamamos\nefecto fotovoltaico. Ahora, la forma en que funciona es que\nprimero debemos crear un cristal en el que ya haya un\ncampo eléctrico incorporado. Es posible hacer eso. No daremos muchos detalles sobre cómo construimos dichos cristales, pero usando semiconductores,\npodemos construir cristales como esos. No tenemos que conectarlo\na ninguna batería ni nada, tendrá un campo eléctrico incorporado. El cristal está construido de tal manera que un lado del cristal tiene propiedades ligeramente diferentes en comparación con el otro lado del cristal y, debido a la\ndiferencia de propiedades, se genera un campo eléctrico. Ahora bien, el punto importante es que\nhay electrones en todas partes, pero si te concentras en esta región, hay muchos electrones, pero todos están unidos y\nno pueden moverse libremente. Entonces, incluso si hay un\ncampo eléctrico empujándolos, no pueden moverse porque\nestán atrapados en ataduras. Puedes imaginar que esto es\ncomo el mar de electrones, todos están\nfijos dentro del cristal, no pueden moverse. Pero si iluminamos esta región, y si la luz tiene\nla frecuencia adecuada o la longitud de onda adecuada, entonces los electrones pueden absorber esa energía, pero no se emitirá, bueno, esa es la diferencia aquí. En el efecto fotoeléctrico, se emite, pero aquí, en lugar de emitirse, simplemente obtiene suficiente\nenergía para escapar del enlace. Y como resultado, ahora puede moverse libremente y, por lo tanto, se acelerará hacia la izquierda en este diagrama, porque el campo eléctrico está hacia la derecha, los electrones están cargados negativamente y experimentan fuerza\nen la dirección opuesta. Y como resultado,\nahora vendrá hacia el lado izquierdo y dejará un espacio. Ahora, otros electrones debajo de\nelectrones que están unidos pueden lanzarse en este espacio, lo que hace que el espacio vaya hacia la derecha, y luego los otros electrones\npueden lanzarse en este espacio y así sucesivamente. Entonces parece que\nesta brecha, esta vacante, se trasladará al otro lado.  De esta manera se pueden crear muchos electrones y muchas vacantes. Y entonces, mira, si puedes\ncompletar este circuito, a los electrones les encantaría\nir de aquí a aquí a través de ese circuito externo. En otras palabras, se\ncrea un voltaje. Y lo que hemos hecho es utilizar la energía\nde la luz para crear voltaje, efecto fotovoltaico. Si juntas muchos de estos\n, creamos un panel solar, así es como funcionan las células solares\ny los paneles solares. Trabajan sobre el efecto fotovoltaico. Ya sea que los consideres\nen los techos de las casas o los\nque están en las naves espaciales, todos usan la misma idea. Al fin y al cabo, utilizamos el hecho de que la\nluz es un objeto cuántico para aprovechar el poder de la luz,\nque obtenemos del sol.",
    "t_arabic": "- [المدرس] إذا قمت بتسليط\nأنواع معينة من الضوء على معادن معينة، فسيتم إطلاق الإلكترونات. نحن نسمي هذا التأثير الكهروضوئي لأن الضوء هو صورة والإلكترونات المنبعثة هي كهربية، وكانت هذه إحدى التجارب الرئيسية التي ساعدتنا بالفعل على اكتشاف نموذج جديد تمامًا للضوء. ولكن كيف بالضبط تسأل؟\nحسنا، دعونا معرفة ذلك. المثير هنا\nهو أن هذا التأثير يعتمد على لون الضوء. على سبيل المثال، إذا كان هذا المعدن\n، على سبيل المثال، البوتاسيوم، حسنًا، إذا قمت بتسليط ضوء أزرق، فسوف يتم إطلاق الإلكترونات، ويحدث التأثير الكهروضوئي. لكن إذا سلطت\nضوءًا أحمر على البوتاسيوم، فلن نحصل على\nتأثير كهروضوئي على الإطلاق، بغض النظر عن مدى سطوعه، حتى لو جعلته\nساطعًا بشكل يعمي البصر، فلن نحصل على تأثير كهروضوئي. وهذا ما حير علماء الفيزياء. أعني، فكر في النموذج هنا. لدينا ذرات مع\nسحب إلكترونية هنا والنواة في المركز، حسنًا. عندما تسلط الضوء، تنتقل طاقة الضوء\nإلى الإلكترونات وتكون قادرة على الهروب من\nبراثن النواة والخروج. لكن لماذا لا يحدث هذا\nهنا بالضوء الأحمر؟ فكر في الأمر. أنا أسلط ضوءًا ساطعًا،\nوكثافة عالية جدًا، وكمية لا تصدق من الطاقة هنا، ومع ذلك فإن الإلكترونات غير\nقادرة على امتصاصها والخروج. لماذا\nيعتمد التأثير الكهروضوئي على اللون؟  لقد كان هذا سؤالًا كبيرًا ولم يكن\nله أي معنى. إذن ماذا نفعل هنا؟ حسنًا، نحن نقوم بتجارب أكثر دقة. أولاً، دعونا ننظر فقط إلى اللون ثم نفكر في\nالسطوع لاحقًا، حسنًا. إذن ما هو اللون الذي يمثله؟\nموجات كهرومغناطيسية. تذكر أن اللون يعتمد بشكل أساسي على الطول الموجي للضوء. على سبيل المثال، اللون الأحمر هو أن الطول الموجي للضوء يمكن أن يكون حوالي 650 نانومتر. ما وجدناه هو أنه عند 650 نانومتر، لا نحصل على أي\nتأثير كهروضوئي للبوتاسيوم. لا نعرف السبب، لكن ما يمكننا فعله الآن هو تقليل الطول الموجي\nونرى ما سيحدث. إذا واصلت تقليل الطول الموجي ولنفترض أنني وصلت إلى\nضوء برتقالي يبلغ طوله 600 نانومتر، فقد قمت بتقليله، وما زلت\nلا أحصل على أي تأثير كهروضوئي. لا أعرف لماذا، ولكني أقوم\nفقط بالتجربة. هذه ملاحظة، حسنًا. أستمر في التقليل، وأستمر في تقليل الطول الموجي\nحتى أصل إلى 541 نانومتر. عند هذه النقطة، بدأت الآن\nأرى التأثير الكهروضوئي، وفي هذه الحالة بالذات، بالكاد يتم\nإخراج الإلكترونات من المعدن، ولهذا السبب رسمت\nعلامات أسهم صغيرة جدًا هنا.  ليس لديهم أي طاقة حركية تقريبًا. أنا فقط أحصل على بعض التأثير الكهروضوئي. وبعد ذلك إذا قمت بتقليله إلى أبعد من ذلك، فهذا هو المكان الذي أحصل فيه على الضوء الأزرق عند حوالي 500 نانومتر. هذه أرقام تقريبية، حسنًا؟ عند 500 نانومتر، أحصل الآن على\nالتأثير الكهروضوئي، لكن الإلكترونات\nتخرج بطاقة أكبر. ماذا يحدث إذا قمت بتقليله إلى أبعد من ذلك؟ أجد أن الإلكترونات\nتخرج بمزيد من الطاقة. إذن ما هي ملاحظتنا هنا؟ نلاحظ أنه إذا خفضنا الطول الموجي، فسنحصل على المزيد من الطاقة\nللإلكترونات الخارجة هنا. يمكننا أيضًا التحدث من حيث التردد. تذكر أنه كلما زاد الطول الموجي،\nقل التردد، لأنه إذا كان لديك طول موجي كبير، فسيكون هناك عدد أقل من الموجات التي تمر في الثانية. إذن هذا تردد منخفض\nوهذا تردد مرتفع هنا. لذا يمكننا القول أنه عندما يتعلق الأمر بالتردد، كلما زاد التردد، زادت\nطاقة الإلكترونات. ولديك أيضًا نوع\nمن القطع هنا، أليس كذلك. لذلك على سبيل المثال، إذا كان الطول الموجي أعلى من\n541 نانومتر بالنسبة للبوتاسيوم، وبالنسبة للبوتاسيوم، إذا كان\nأعلى من 541 نانومتر، فلا يوجد تأثير كهروضوئي، فقط تحته، سنحصل\nعلى تأثير كهروضوئي. ومن ثم فإن كل معدن سيكون\nله حد قطع خاص به، ونحن نسمي ذلك طول موجة العتبة أو يمكنك أيضًا قول تردد العتبة. لكن الفكرة بأكملها هي، إذا كان الطول الموجي أقل من\nهذا الطول الموجي، عندها فقط تحصل على التأثير الكهروضوئي، وإذا كان أعلى من ذلك، فلن تحصل عليه. المعادن المختلفة لها\nأطوال موجية مختلفة، وترددات عتبة مختلفة بشكل مماثل\n. وهذا هو تأثير\nالطول الموجي للتردد. نرى أن الطول الموجي\nللتردد يتحكم في الطاقة\nالتي تخرج بها الإلكترونات ولا يمكن تفسير السبب. لماذا\nيتحكم فيه الطول الموجي للتردد؟ لماذا لا أحصل على التأثير الكهروضوئي إذا كان أعلى من الطول الموجي العتبي؟ هذا ليس له أي معنى. لكن على أية حال،\nالسؤال التالي يمكن أن يكون لنا، كيف يؤثر السطوع على\nهذا الأمر برمته؟  هل له أي تأثير؟\nالجواب نعم. تذكر أن السطوع أو\nشدة الضوء هي في الأساس حجم\nالوديان والقمم. لذا، إذا أردت جعل الضوء أكثر سطوعًا، فسيبدو إلى حدٍ ما بهذا الشكل. يمكنك أن تتخيل الأمر بهذه الطريقة. هذا ضوء أكثر سطوعًا، حسنًا. الآن، ما نجده هو أننا\nحصلنا على المزيد من الإلكترونات، حسنًا. إنه لا يغير الطاقة التي تخرج بها الإلكترونات، لاحظ أنها تخرج تقريبًا\nبنفس الطاقة التي كانت عليها من قبل، لكننا الآن نحصل على المزيد من الإلكترونات. بالطبع، إذا كنت فوق\nالحد الأقصى للطول الموجي، فلن تحصل على\nتأثير كهروضوئي على الإطلاق، بغض النظر عن السطوع،\nلا يهم، حسنًا. لذا، إذا قمت بتقليل\nالسطوع أو الشدة، فستحصل على إلكترونات أقل. إذا قمت بزيادة الكثافة،\nتحصل على المزيد من الإلكترونات. لذا فإن الكثافة تتحكم فقط في\nعدد الإلكترونات، لكن الطول الموجي للتردد هو الذي يتحكم في الطاقة التي\nتخرج بها الإلكترونات، كما أنه يتحكم في حصولنا على\nالتأثير الكهروضوئي أم لا. السؤال الكبير كان لماذا؟ النموذج الموجي لا يمكنه تفسير ذلك، لأنه وفقًا للنموذج الموجي، يجب أن تحصل على\nتأثير كهروضوئي لجميع ألوان الضوء. إذا جعلت الضوء ساطعًا بدرجة كافية، فيجب أن تكون الإلكترونات قادرة على امتصاصه ثم تنبعث،\nلكن هذا لا يحدث، ولهذا السبب\nكان الفيزيائيون في حيرة من أمرهم وكنا في\nحاجة ماسة إلى إجابة لهذا السؤال. إذا، مالذي فعلناه؟ حسنًا، لشرح هذه الملاحظات، توصلنا إلى\nنموذج جديد تمامًا للضوء. بدلًا من التفكير في الضوء باعتباره موجات تحمل الطاقة بشكل مستمر ويمكنها نقل الطاقة بشكل مستمر، اعتقدنا أن الضوء ربما يتكون من حزم منفصلة\nمن الطاقة، وليس موجات، ولكن حزم من الطاقة،\nوالتي نسميها الفوتونات. ومن ثم يتم\nامتصاص الضوء بواسطة الإلكترونات على سبيل المثال، وتمتصه أيضًا كحزم. إما أنك لن تمتص أي ضوء أو أنك سوف تمتص حزمة واحدة من الضوء أو حزمتين من الضوء\nوهكذا دواليك، لا شيء بينهما. نحن نسمي هذا منفصلًا، وهو عكس\nما يحدث تمامًا في النموذج الموجي، حيث يمكنك الامتصاص بشكل مستمر، حسنًا. فكيف يفسر هذا\nالتأثير الكهروضوئي، الملاحظات هنا؟ حسنا دعنا نري. الشيء الرئيسي هنا هو أن طاقة\nالفوتونات أو الحزم، لاحظ، تعتمد على اللون. إذا كنت تتعامل مع ضوء ذو طول موجي طويل أو ضوء منخفض التردد، فلدينا طاقة أقل للحزمة، والفوتونات لديها طاقة أقل، وإذا كنت تتعامل\nمع ضوء ذو طول موجي قصير أو ضوء عالي التردد، يمكنك أن ترى أن\nالحزم لديها المزيد من الطاقة  طاقة. لذا، كلما كان الطول الموجي أقصر\nأو زاد التردد، زادت الطاقة في الحزمة. هناك علاقة بين\nالطاقة والطول الموجي، والتي لن نتناولها، لكن اسمحوا لي أن أقدم لكم\nبعض الأرقام التقريبية هنا لأن الأرقام\nستساعدنا هنا. إذن هذه بعض الأرقام. لذلك اتضح أنه إذا نظرت إلى\nالضوء الأحمر الذي يبلغ طوله 650 نانومتر، أي طاقة الحزمة، فإن طاقة الفوتون\nتبلغ حوالي 1.9 إلكترون فولت. ربما تتساءل، ألا ينبغي لنا أن نقيس\nالطاقة بالجول؟ حسنًا، تبين أن الجول هو\nوحدة كبيرة للطاقة، لذا نستخدم وحدة أصغر من الطاقة، والتي نسميها الإلكترون فولت. لا تقلق كثيرًا\nبشأن الوحدات هنا، إنها مجرد أرقام. يمكنك أن ترى أن هذه\nالحزم لديها طاقة صغيرة، ولكن هذه الحزمة لديها\nطاقة أكبر بكثير، 2.8 إلكترون فولت، يمكنك أن ترى ذلك، أليس كذلك. الآن بالنسبة للبوتاسيوم، اتضح أنه إذا كنت تريد انتزاع إلكترون، وإذا كان الإلكترون بحاجة إلى إخراجه، فإن الحد الأدنى من الطاقة التي\nتحتاجها هو حوالي 2.3 إلكترون فولت، وهذا بالنسبة للبوتاسيوم. الآن هو الوقت المناسب\nلإيقاف الفيديو مؤقتًا ومعرفة ما إذا كان بإمكانك محاولة تقديم شرح هنا. حسنا، دعونا نرى. الفكرة الكبيرة هنا هي أنه إذا كنت تريد\nالتخلص من إلكترون، أعني، كما تعلمون،\nجعل هذا الإلكترون يهرب، فيجب أن يمتلك الفوتون الواحد\nعلى الأقل هذا القدر من الطاقة. إذا لم يكن لدى الفوتونات\nهذا القدر من الطاقة على الأقل، فسوف يمتصها الإلكترون لكنها ليست كافية للهروب، وبالتالي سيعيد إشعاعها مرة أخرى. وبالتالي، إذا كنت تفكر في الضوء الأحمر، فإن الفوتون الواحد\nلا يحمل ما يكفي من الطاقة، وهذا هو السبب وراء عدم\nطرد الإلكترونات هنا، ولهذا السبب فإن هذه الأضواء غير قادرة على إعطائك\nالتأثير الكهروضوئي. هنا، لدينا ما يكفي من الطاقة لإحداث التأثير الكهروضوئي، وبالتالي،\nبالكاد تخرج الإلكترونات من هنا، لأن كل الطاقة تُستهلك في إطلاق الإلكترونات فقط، ولا يكاد يكون هناك أي طاقة متبقية هنا لذا لن تكون موجودة تقريبًا  متحرك. لكن هنا، لاحظ أن لديك أكثر من\nالطاقة اللازمة هنا، وبالتالي\nتبقى بعض الطاقة المتبقية، وبالتالي فإن الإلكترونات بعد خروجها يكون لديها بعض الطاقة الإضافية المتبقية، والتي تخرج كطاقة حركية. وبما أن هذا يحتوي على طاقة أكبر، فإن كل فوتون لديه طاقة أكثر، حسنًا، الإلكترونات تنطلق الآن\nبطاقة حركية أكبر لأنه يوجد المزيد من\nالطاقة المتبقية بعد طردها. ولكن ماذا عن الشدة؟ حسنًا، إذا قمت بزيادة\nالكثافة في هذا النموذج، فإننا نزيد عدد\nالفوتونات، هذا كل شيء. هنا، لاحظ، إذا كان الفوتون الواحد\nلا يحتوي على طاقة كافية، فلا يهمني\nعدد الفوتونات التي تسلطها، فهو لن يعمل، ولهذا السبب لن أحصل على أي تأثير كهروضوئي هنا. لكن هنا، أنا الآن أقوم بتسليط\nعدد أكبر من الفوتونات، لذلك يمكن لعدد أكبر من الإلكترونات أن يمتص تلك الطاقة وبالتالي يمكن لمزيد من الإلكترونات\nالهروب في الثانية ولهذا السبب أحصل على\nالمزيد من الإلكترونات هنا. وبجمع كل ذلك معًا، نظرًا لأن الطول الموجي للتردد هو الذي يحدد طاقة\nالفوتون الفردي، فهو الذي يحدد الطاقة الحركية. كلما قل الطول الموجي، زادت طاقة الفوتون وزادت الطاقة الحركية. إذا كان الطول الموجي\nأكبر وكبير جدًا، فإن طاقة الفوتون صغيرة جدًا، ولن يتمكن من التخلص من أي شيء ولن تحصل على أي\nتأثير كهروضوئي. وبما أن الكثافة هي\nفي الأساس عدد الفوتونات، فإذا كان لديك عدد أكبر من الفوتونات، فسوف تحصل على عدد أكبر\nمن الإلكترونات الخارجة. لكن هنا، لا يهم\nعدد الفوتونات التي تشعها، وبالتالي لا\nيهم ما هو السطوع، فلن تحصل على التأثير الكهروضوئي. جميلة، أليس كذلك؟ لذا انتظر، هل هذا يعني\nأن الضوء ليس موجة؟ انها في الواقع الجسيمات؟  حسنا، ليس هادئا. ترى ظواهر معينة للضوء مثل الحيود أو التداخل مما يعني أن الضوء يجب أن\nيكون له خصائص موجية. وبعض الظواهر الأخرى\nمثل التأثير الكهروضوئي، وإشعاع الجسم الأسود، وتشتت الضوء، وأي تأثيرات أخرى من هذا القبيل\nتجعلنا نعتقد أن الضوء يجب أن\nيكون له أيضًا طبيعة جسيمية، طبيعة الفوتون، مما يعني أن الضوء\nيجب أن يكون له طبيعة مزدوجة، جسيمية وفوتونية.  أمواج. لا يعني ذلك أن الضوء\nيتصرف أحيانًا كموجات، وأحيانًا يتصرف كجسيمات. لا لا لا. للضوء طبيعة موجية وجسيمية. وإذا كنت تتساءل، حسنًا،\nكيف يكون لذلك أي معنى؟ كيف يمكن لشيء أن يكون موجات وجسيمات في نفس الوقت؟ حسنًا، لسوء الحظ،\nلا توجد طريقة لتصور ذلك لأنه في عالمنا المجهري، ليس لدينا أي خبرة للأشياء التي لها طبيعة موجية وجسيمية. ولكن هذا هو أحد الأسباب التي تجعلنا أحيانًا عندما نعرض الفوتونات، نعرضها بهذه الطريقة\nمع حزمة موجية صغيرة، لكن هذا لا يعني أن الفوتونات\nتهتز لأعلى ولأسفل، حسنًا، هذا مفهوم خاطئ\nاعتدت عليه  يملك. إنه ليس كذلك. الطريقة الأفضل للتفكير في هذا الأمر هي أن الضوء ليس موجة\nبالمعنى التقليدي، وليس جسيمًا\nبالمعنى التقليدي، إنه كائن جديد تمامًا، ليس لدينا خبرة\nفي حياتنا اليومية. يمتلك هذا الجسم خصائص موجية وخصائص جسيمية، ونطلق على هذا\nالكائن اسم الكائن الكمي. الآن يبدو هذا نظريًا جدًا، أليس كذلك؟ ولكن هناك العديد من التطبيقات لحقيقة أن الضوء\nكائن كمي. دعني أخبرك بواحد منهم، حسنًا. الآن، في التأثير الكهروضوئي، من الضوء، نحصل على إلكترونات تنطلق. الآن هناك تأثير مشابه جدًا ومختلف\nقليلًا، حيث عندما تسلط الضوء، يمكنك توليد جهد كهربائي. نحن نسمي هذا التأثير\nبالتأثير الكهروضوئي. الآن، طريقة العمل هي أننا\nنحتاج أولاً إلى إنشاء بلورة تحتوي على \nمجال كهربائي مدمج بالفعل. من الممكن أن تفعل ذلك. لن نحصل على الكثير من التفاصيل حول كيفية بناء مثل هذه البلورات، ولكن باستخدام أشباه الموصلات،\nيمكننا بناء بلورات من هذا القبيل. لا يتعين علينا توصيله\nبأي بطارية أو أي شيء، سيكون به مجال كهربائي مدمج.  تم بناء البلورة بطريقة تجعل أحد جوانب البلورة له خصائص مختلفة قليلاً مقارنة بالجانب الآخر من البلورة، وبسبب\nالاختلاف في الخصائص، يتم بناء مجال كهربائي. الآن النقطة المهمة هي أن\nهناك إلكترونات في كل مكان، لكن إذا ركزت على هذه المنطقة، هناك الكثير من الإلكترونات، لكنها جميعها مرتبطة\nوليست حرة في الحركة. لذلك، حتى لو كان هناك\nمجال كهربائي يضغط عليها، فإنها لا تستطيع التحرك لأنها\nعالقة في الروابط. يمكنك أن تتخيل أن هذا\nيشبه بحرًا من الإلكترونات، جميعها\nثابتة داخل البلورة، ولا يمكنها التحرك. لكن إذا سلطنا الضوء في هذه المنطقة، وإذا كان للضوء\nالتردد المناسب أو الطول الموجي المناسب، فيمكن للإلكترونات امتصاص تلك الطاقة، لكنها لن تنبعث، حسنًا، هذا هو الفرق هنا. في التأثير الكهروضوئي، ينبعث، ولكن هنا، بدلاً من أن ينبعث، يحصل على\nطاقة كافية للهروب من الرابطة. ونتيجة لذلك، أصبح الآن حر الحركة، وبالتالي سيتم تسريعه إلى اليسار في هذا الرسم البياني، لأن المجال الكهربائي يقع على اليمين، والإلكترونات مشحونة سالبًا، وتتعرض للقوة\nفي الاتجاه المعاكس. ونتيجة لذلك، سيأتي\nالآن إلى الجانب الأيسر، وسيترك وراءه فجوة. الآن، يمكن للإلكترونات الأخرى الموجودة تحت\nالإلكترونات المرتبطة أن تنقض على هذه الفجوة، مما يجعل الفجوة تتجه إلى اليمين، ومن ثم يمكن للإلكترونات الأخرى أن\nتنقض داخل هذه الفجوة، وهكذا دواليك. لذلك، يبدو الأمر وكأن\nهذه الفجوة، وهذا المنصب الشاغر، سوف ينتقل إلى الجانب الآخر. بهذه الطريقة يمكن إنشاء الكثير من الإلكترونات والكثير من الوظائف الشاغرة. لذا، انظر، إذا تمكنت من\nإكمال هذه الدائرة، فستحب الإلكترونات\nالانتقال من هنا إلى هنا عبر تلك الدائرة الخارجية. وبعبارة أخرى، هناك\nجهد تم إنشاؤه. ولذا فإن ما فعلناه هو أننا استخدمنا الطاقة\nمن الضوء لإنشاء جهد كهربائي، وتأثير كهروضوئي. إذا قمت بتجميع الكثير من هذه\nمعًا، فإننا نصنع لوحة شمسية، هذه هي الطريقة التي تعمل بها الخلايا الشمسية\nوالألواح الشمسية. أنها تعمل على التأثير الكهروضوئي. سواء نظرتم إليها\nعلى أسطح المنازل أو نظرتم إلى تلك\nالموجودة في المركبة الفضائية، فجميعها تستخدم نفس الفكرة. في نهاية المطاف، نحن نستخدم حقيقة أن\nالضوء هو جسم كمي لتسخير قوة الضوء،\nالتي نحصل عليها من الشمس.",
    "t_italian": "- [Istruttore] Se si illuminano\nparticolari tipi di luce su determinati metalli, gli elettroni verranno espulsi. Lo chiamiamo effetto fotoelettrico perché la luce è foto e gli elettroni espulsi sono elettrici, e questo è stato uno degli esperimenti chiave che ci ha aiutato a scoprire un modello di luce completamente nuovo. Ma come chiedi esattamente?\nBene, scopriamolo. Ciò che è interessante qui\nè che questo effetto dipende dal colore della luce. Ad esempio, se questo metallo\nfosse, diciamo, potassio, ok, allora se si illumina con luce blu si otterranno l'espulsione di elettroni, si verifica l'effetto fotoelettrico. Ma se dovessimo puntare la\nluce rossa sul potassio, non otterremo\naffatto l'effetto fotoelettrico, indipendentemente da quanto lo rendiamo luminoso, anche se\nlo rendessimo accecantemente luminoso, non otterremmo l'effetto fotoelettrico. Questo è ciò che ha lasciato perplessi i fisici. Voglio dire, pensa al modello qui. Abbiamo atomi con\nnuvole di elettroni qui e il nucleo al centro, ok. Quando si illumina la luce, l'energia della luce viene\ntrasferita agli elettroni e questi sono in grado di sfuggire\nalle grinfie del nucleo e di spegnersi. Ma perché\nqui con il semaforo rosso non può succedere? Pensaci. Sto brillando una luce intensa, ad\naltissima intensità, con un'incredibile quantità di energia, eppure gli elettroni non sono in\ngrado di assorbirla e di uscire. Perché l'\neffetto fotoelettrico dipende dal colore? Quella era una grande domanda\nche non aveva alcun senso. Allora cosa facciamo qui? Bene, facciamo esperimenti più accurati. Per prima cosa, guardiamo solo il colore e poi pensiamo alla\nluminosità in seguito, ok. Quindi cosa rappresenta il colore?\nOnde elettromagnetiche. Ricorda che il colore dipende fondamentalmente dalla lunghezza d'onda della luce. Ad esempio, se il colore è rosso, la lunghezza d'onda della luce potrebbe essere intorno ai 650 nanometri. Ciò che scopriamo è che a 650 nanometri non otteniamo alcun\neffetto fotoelettrico per il potassio. Non sappiamo perché, ma ora quello che possiamo fare è ridurre la lunghezza d'onda\ne vedere cosa succede. Se continuo a ridurre la lunghezza d'onda e diciamo che arrivo alla\nluce arancione di 600 nanometri, vedi che l'ho ridotta,\nnon ottengo comunque alcun effetto fotoelettrico. Non so perché, ma sto\nsolo facendo un esperimento. Questa è un'osservazione, ok. Continuo a ridurre, continuo a ridurre la lunghezza d'onda\nfinché non raggiungo 541 nanometri. A questo punto, inizio a\nvedere l'effetto fotoelettrico e, in questo caso particolare, gli elettroni vengono a malapena\nespulsi dal metallo, ecco perché ho disegnato\nqui delle frecce molto piccole.  Non hanno quasi alcuna energia cinetica. Ottengo solo un po' di effetto fotoelettrico. E poi se lo riduco ulteriormente, è lì che ottengo la mia luce blu a circa 500 nanometri. Questi sono numeri approssimativi, ok? A 500 nanometri ora\nottengo l'effetto fotoelettrico, ma gli elettroni\nescono con ancora più energia. Cosa succede se lo riduco ulteriormente? Trovo che gli elettroni\nescano con ancora più energia. Allora qual è la nostra osservazione qui? Vediamo che se abbassiamo la lunghezza d'onda, otteniamo più energia per gli\nelettroni che escono qui. Possiamo parlare anche in termini di frequenza. Ricorda, maggiore è la lunghezza d'onda,\nminore è la frequenza, perché se la lunghezza d'onda è grande, ci saranno meno onde che passano al secondo. Quindi questa è la bassa frequenza\ne questa è alta qui. Quindi possiamo dire che quando si parla di frequenza, più è la frequenza, più è\nl'energia degli elettroni. E c'è anche una specie\ndi interruzione qui, giusto. Quindi, per esempio, se la lunghezza d'onda è superiore a\n541 nanometri per il potassio, per il potassio, se è\nsuperiore a 541 nanometri, nessun effetto fotoelettrico, solo al di sotto di essa\notterremo l'effetto fotoelettrico. E quindi ogni metallo\navrà il proprio taglio, lo chiamiamo lunghezza d'onda di soglia o puoi anche dire frequenza di soglia. Ma l'idea è che se la lunghezza d'onda è al di sotto di\nquella soglia di lunghezza d'onda, solo allora si ottiene l'effetto fotoelettrico, se è al di sopra, non lo si otterrà. Metalli diversi hanno\nlunghezze d'onda di soglia diverse e\nfrequenze di soglia similmente diverse. Questo è l'effetto della\nlunghezza d'onda della frequenza. Vediamo che la lunghezza d'onda\ndella frequenza controlla l'energia con\ncui escono gli elettroni e non se ne spiega il motivo. Perché la lunghezza d'onda della\nfrequenza lo controlla? Perché non ottengo l'effetto fotoelettrico se è al di sopra della lunghezza d'onda di soglia? Non ha alcun senso. Ma in ogni caso, la prossima\ndomanda potrebbe essere per noi: in che modo la luminosità\ninfluisce sull'intera faccenda? Ha qualche effetto?\nLa risposta è si. Ricorda, la luminosità, o\nl'intensità della luce, dipende fondamentalmente dalla grandezza delle\nvalli e dei picchi. Quindi se dovessi rendere la luce più brillante, assomiglierebbe a questo. Puoi immaginarlo in questo modo. Questa è una luce più brillante, ok. Ora, quello che scopriamo è che\notteniamo più elettroni, ok. Non cambia l'energia con cui escono gli elettroni, vedi che escono più o meno con la\nstessa energia di prima, ma ora otteniamo più elettroni. Naturalmente, se sei al di sopra\ndella lunghezza d'onda soglia, non otterrai\naffatto l'effetto fotoelettrico, indipendentemente dalla luminosità,\nnon importa, ok. Quindi se diminuisci la\nluminosità o l'intensità, ottieni meno elettroni. Se aumenti l'intensità,\nottieni più elettroni. Quindi l'intensità controlla solo\nil numero di elettroni, ma è la lunghezza d'onda della frequenza che controlla l'energia con\ncui escono gli elettroni, controlla anche se otteniamo\no meno l'effetto fotoelettrico. La grande domanda era: perché? Il modello ondulatorio semplicemente non può spiegarlo, perché secondo il modello ondulatorio, dovresti ottenere un\neffetto fotoelettrico per tutti i colori della luce. Se rendi la luce abbastanza luminosa, gli elettroni dovrebbero essere in grado di assorbirla e di essere emessi,\nma ciò non accade, ed è per questo che i fisici\ndi allora erano perplessi e noi avevamo un disperato\nbisogno di una risposta a questo. Allora cosa abbiamo fatto? Ebbene, per spiegare queste osservazioni, abbiamo ideato un\nmodello di luce completamente nuovo. Invece di pensare alla luce come a onde che trasportano energia continuamente e che possono trasferirla continuamente, abbiamo pensato che forse la luce è fatta di pacchetti discreti\ndi energia, non onde, ma pacchetti di energia,\nche chiamiamo fotoni. E poi la luce viene\nassorbita, diciamo, dagli elettroni, la assorbi anche come pacchetti. O non assorbirai luce oppure assorbirai un pacchetto di luce o due pacchetti di luce\ne così via e così via, niente in mezzo. Lo chiamiamo discreto, che è esattamente l'opposto di\nciò che accade nel modello ondulatorio, lì puoi assorbire continuamente, ok. Allora come si spiega\nl'effetto fotoelettrico, le osservazioni qui? Bene vediamo. La cosa fondamentale qui è che l'energia dei\nfotoni o dei pacchetti, notate, dipende dal colore. Se hai a che fare con luce a lunghezza d'onda lunga o a bassa frequenza, allora abbiamo meno energia del pacchetto, i fotoni hanno meno energia e se hai a che fare\ncon luce a lunghezza d'onda corta o ad alta frequenza, puoi vedere che i\npacchetti hanno più  energia. Quindi più corta è la lunghezza d'onda\no maggiore è la frequenza, c'è più energia nel pacchetto. C'è una relazione tra l'\nenergia e la lunghezza d'onda, di cui non parleremo, ma lasciatemi darvi solo\nalcuni numeri approssimativi qui perché i numeri\nci aiuteranno qui.  Ecco quindi alcuni numeri. Quindi risulta che se consideriamo la\nluce rossa di 650 nanometri, l'energia del pacchetto, l'energia del fotone\nè di circa 1,9 elettronvolt. Forse ti starai chiedendo: non dovremmo misurare l'\nenergia in joule? Bene, i joule risultano\nessere una grande unità di energia, quindi usiamo un'unità di energia più piccola, che chiamiamo elettronvolt. Non preoccuparti troppo\ndelle unità qui, sono solo i numeri. Potete vedere che questi\npacchetti hanno un'energia minuscola, ma questo pacchetto ha un'energia molto più grande\n, 2,8 elettronvolt, potete vederlo, giusto. Ora per il potassio, si scopre che se vuoi strappare un elettrone, se l'elettrone deve essere espulso, l'energia minima di cui hai\nbisogno è di circa 2,3 elettronvolt, questo è per il potassio. Ora è il momento giusto per mettere in\npausa il video e vedere se riesci a trovare una spiegazione qui. Va bene, vediamo. La grande idea qui è che se vuoi\nstaccare un elettrone, intendo dire, sai,\nfar fuggire quell'elettrone, allora un singolo fotone dovrebbe\navere almeno questa quantità di energia. Se i fotoni non hanno\nalmeno questa quantità di energia, allora l'elettrone la assorbirà ma non sarà sufficiente per sfuggire e quindi la reirradierà indietro. E quindi, se consideriamo la luce rossa, un singolo fotone\nnon trasporta abbastanza energia, e questo è il motivo per cui gli elettroni non\nvengono espulsi qui, ed è per questo che queste luci non sono in grado di darvi l'\neffetto fotoelettrico. Qui, abbiamo energia appena sufficiente per l'effetto fotoelettrico, e quindi gli elettroni riescono\na malapena a uscire da qui, perché tutta l'energia viene consumata semplicemente rilasciando gli elettroni, qui non c'è quasi più energia quindi difficilmente saranno  in movimento. Ma qui, notate, avete più\nenergia dell'energia necessaria e quindi\nrimane un po' di energia residua, e così gli elettroni dopo essere usciti hanno un po' di energia extra rimanente, che viene rilasciata come energia cinetica. E poiché questo ha ancora più energia, ogni fotone ha ancora più energia, beh, gli elettroni ora vengono espulsi\ncon ancora più energia cinetica perché c'è più\nenergia residua dopo essere stati espulsi. Ma per quanto riguarda l'intensità? Bene, se aumenti l'\nintensità in questo modello, aumentiamo il numero\ndi fotoni, tutto qui. Qui, nota, se un singolo fotone\nnon ha abbastanza energia, allora non mi interessa\nquanti fotoni fai brillare, semplicemente non funzionerà, ecco perché qui non otterrò comunque alcun effetto fotoelettrico. Ma qui, ora emetto un\nnumero maggiore di fotoni, quindi più elettroni possono assorbire quell'energia e quindi più elettroni\npossono sfuggire al secondo ed è per questo che ottengo\npiù elettroni qui. Mettendo tutto insieme, poiché la lunghezza d'onda della frequenza decide l'energia di\nun singolo fotone, che decide l'energia cinetica. Più corta è la lunghezza d'onda, maggiore è l'energia del fotone e maggiore è l'energia cinetica. Se la lunghezza d'onda è\npiù grande ed è troppo grande, l'energia del fotone è molto piccola, non sarà in grado di eliminare nulla e non otterrai alcun\neffetto fotoelettrico. E poiché l'intensità è\nfondamentalmente il numero di fotoni, se hai un numero maggiore di fotoni, otterrai un numero maggiore\ndi elettroni in uscita. Ma qui, non importa\nquanti fotoni risplendete, e quindi non\nimporta quale sia la luminosità, non otterrete l'effetto fotoelettrico. Bello, non è vero? Quindi aspetta, questo significa\nche la luce non è un'onda? Sono davvero particelle?  Beh, non tranquillo. Vedi certi fenomeni di luce come la diffrazione o l'interferenza significa che la luce deve\navere proprietà ondulatorie. E certi altri fenomeni\ncome l’effetto fotoelettrico, la radiazione del corpo nero, la diffusione della luce e altri\neffetti simili ci fanno credere che la luce debba\navere anche la natura particellare, la natura fotonica, il che significa che una luce\ndeve avere una duplice natura, sia particellare che corpuscolare.  onde. Non è che la luce\na volte si comporti come un'onda e a volte come una particella. No, no, no.  La luce ha sia natura ondulatoria che particellare. E se ti stai chiedendo, beh, che\nsenso ha tutto questo? Come può qualcosa essere allo stesso tempo onda e particella? Ebbene, sfortunatamente,\nnon c'è modo di visualizzarlo davvero perché nel nostro mondo macroscopico non abbiamo alcuna esperienza di cose che abbiano sia natura ondulatoria che particellare. Ma questo è uno dei motivi per cui a volte quando mostriamo i fotoni, lo mostriamo in questo modo\ncon un minuscolo pacchetto d'onda, ma questo non significa che i fotoni si\nmuovono su e giù, okay, è un malinteso\nche avevo  Avere. Non è così. Un modo migliore di pensare a questo è che la luce non è un'onda\nnel senso tradizionale, non è una particella nel\nsenso tradizionale, è un oggetto completamente nuovo, di cui non abbiamo esperienza\nnella nostra vita quotidiana. Questo oggetto ha sia proprietà ondulatorie che proprietà particellari e chiamiamo tale\noggetto oggetto quantistico. Ora, questo sembra molto teorico, giusto? Ma ci sono così tante applicazioni del fatto che la luce\nè un oggetto quantistico. Lascia che te ne racconti uno, okay. Ora, nell'effetto fotoelettrico, dalla luce vengono espulsi gli elettroni. Ora c'è un effetto molto simile,\nleggermente diverso, in cui quando si illumina la luce, è possibile generare tensione. Chiamiamo tale effetto\neffetto fotovoltaico. Ora, il modo in cui funziona è che\ndobbiamo prima creare un cristallo in cui sia già presente un\ncampo elettrico incorporato. È possibile farlo. Non forniremo molti dettagli su come costruiamo tali cristalli, ma utilizzando i semiconduttori\npossiamo costruire cristalli del genere. Non dobbiamo collegarlo\na nessuna batteria o altro, avrà un campo elettrico integrato. Il cristallo è costruito in modo tale che un lato del cristallo abbia proprietà leggermente diverse rispetto a un altro lato del cristallo e, a causa della\ndifferenza nelle proprietà, si crea un campo elettrico. Ora il punto importante è che\nci sono elettroni ovunque, ma se ti concentri su questa regione, ci sono molti elettroni, ma sono tutti legati e\nnon sono liberi di muoversi. Quindi, anche se sono\nspinti da un campo elettrico, non possono muoversi perché\nsono bloccati. Potete immaginare che questo sia\ncome un mare di elettroni, sono tutti\nfissi all'interno del cristallo, non possono muoversi. Ma se illuminiamo questa regione, e se la luce ha\nla frequenza o la lunghezza d'onda adatte, allora gli elettroni possono assorbire quell'energia, ma non verrà emessa, okay, questa è la differenza qui. Nell'effetto fotoelettrico viene emesso, ma qui, invece di essere emesso, riceve abbastanza\nenergia per sfuggire al legame. E di conseguenza, ora è libero di muoversi, e quindi verrà accelerato verso sinistra in questo diagramma, perché il campo elettrico è a destra, gli elettroni hanno carica negativa, sperimentano la forza\nnella direzione opposta. E di conseguenza,\nora arriverà sul lato sinistro e lascerà uno spazio vuoto. Ora, altri elettroni sotto\nelettroni che sono legati possono piombare in questo spazio vuoto, il che fa sì che lo spazio vuoto vada a destra, e poi gli altri elettroni\npossono piombare in questo spazio vuoto e così via. Quindi sembra che\nquesto divario, questo posto vacante, si sposterà dall'altra parte.  In questo modo si possono creare molti elettroni e molti posti vacanti. E quindi, guarda, se riesci a\ncompletare questo circuito, gli elettroni adorerebbero\nandare da qui a qui attraverso quel circuito esterno. In altre parole, viene\ncreata una tensione. E quindi quello che abbiamo fatto è stato usare l'energia\ndella luce per creare voltaggio, effetto fotovoltaico. Se mettiamo insieme molti di questi\n, creiamo un pannello solare, ecco come funzionano le celle solari\ne i pannelli solari. Funzionano sull'effetto fotovoltaico. Sia che li consideriate\nsui tetti delle case o che consideriate quelli\nche si trovano nelle navicelle spaziali, usano tutti la stessa idea. In fin dei conti, stiamo sfruttando il fatto che la\nluce è un oggetto quantistico per sfruttare la potenza della luce,\nche otteniamo dal sole."
}