{
    "source": "IvXZCocyU_M",
    "youtubelink": "https://www.youtube.com/watch?v=IvXZCocyU_M",
    "t_english": "- Hi, my name is Sal Khan, I'm the founder of Khan Academy. And I'm also the author of a new book about artificial intelligence and education, called, \"Brave New Words.\" And OpenAI invited myself and my son Imran here to try out some of their new technology. And so we're curious about how good it might be at tutoring someone in math on Khan Academy. So let's get it started. It's loading up. All right, make sure it can see our screen. - [AI] Actually, in this format I can't... - Hello there. I'm here with my son and I'd love you to tutor him on this math problem, but don't give him the answer. You can ask questions and nudge him in the right direction, but I really wanna make sure he understands it himself. and he's here in the room so you can talk to him directly. - [AI] Of course, I'd be happy to help. Let's look at the problem together. Can you first identify which sides of the triangle are the opposite, adjacent and hypotenuse relative to angle alpha? - All right, so I'm pretty sure this is the angle alpha right here, right? - [AI] Perfect, that's correct. Now looking at the triangle, which, side do you think is the hypotenuse? - I'm not totally sure. I think it might be this one, but I really am not sure. This side AC. - [AI] You're close. Actually, side AC is called the adjacent side to the angle alpha. The hypotenuse is the longest side of a right triangle and is directly opposite the right angle. Can you find which one is the hypotenuse? - Oh, okay. I see. So I think the hypotenuse is this really long side from A to B, would that be correct? - [AI] Exactly. Well done. Now that you've identified the hypotenuse, can you identify which side is the opposite side to angle alpha? - Okay, well, I mean, you told me earlier that this was the adjacent side and I know that's the hypotenuse. So I'm guessing that this side, BC, is the opposite side. - [AI] Great deduction, that's absolutely correct. Now that you've identified all the sides relative to angle alpha, do you remember the formula for finding the sine of an angle in a right triangle? - Yeah, I know that the sine is equal to the opposite over the hypotenuse. - [AI] Perfect. That's absolutely right. Now, can you apply that formula to find side alpha in the triangle using the lengths of the sides that we've identified? - Okay, so I mean, you told me that seven, the side BC is the opposite side, and then you said that the hypotenuse is the longest side. So that would be this side AB, which is 25. So would the answer be seven over 25? - [AI] Excellent work. That's correct. Sine alpha equals seven over 25. He did a great job identifying the sides at using the sine formula. If you have any more questions, feel free to ask. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میرا نام سال خان ہے، میں خان اکیڈمی کا بانی ہوں۔ اور میں مصنوعی ذہانت اور تعلیم کے بارے میں ایک نئی کتاب کا مصنف بھی ہوں، جسے \n \"بہادر نئے الفاظ\" کہا جاتا ہے۔ اور OpenAI نے مجھے\nاور اپنے بیٹے عمران کو اپنی نئی ٹیکنالوجی آزمانے کے لیے یہاں مدعو کیا۔ اور اس لیے ہم جاننا چاہتے ہیں کہ\n \nخان اکیڈمی میں کسی کو ریاضی میں ٹیوشن دینا کتنا اچھا ہو سکتا ہے۔ تو آئیے اسے شروع کرتے ہیں۔ یہ لوڈ ہو رہا ہے۔ ٹھیک ہے، یقینی بنائیں کہ\nیہ ہماری اسکرین دیکھ سکتا ہے۔ - [AI] دراصل، اس فارمیٹ میں میں نہیں کر سکتا... - ہیلو۔ میں یہاں اپنے بیٹے کے ساتھ ہوں اور میں پسند کروں گا کہ آپ\nاسے ریاضی کے اس مسئلے پر ٹیوٹر دیں، لیکن اسے جواب نہ دیں۔ آپ سوالات پوچھ سکتے ہیں اور\nاسے صحیح سمت میں لے جا سکتے ہیں، لیکن میں واقعی یہ یقینی بنانا چاہتا ہوں کہ\nوہ خود اسے سمجھتا ہے۔ اور وہ یہاں کمرے میں ہے تاکہ\nآپ اس سے براہ راست بات کر سکیں۔ - [AI] یقینا، مجھے مدد کرنے میں خوشی ہوگی۔ آئیے مل کر مسئلہ کو دیکھیں۔  کیا آپ سب سے پہلے یہ شناخت کر سکتے ہیں کہ مثلث کے کون سے اطراف \nزاویہ الفا کے مقابل، ملحقہ اور فرضی ہیں؟ - ٹھیک ہے، تو مجھے یقین ہے کہ یہ زاویہ الفا ہے، ٹھیک ہے؟ - [AI] کامل، یہ درست ہے۔ اب مثلث کو دیکھتے ہوئے، آپ کے خیال میں کون سی طرف\nفرضی ہے؟ - مجھے پوری طرح یقین نہیں ہے۔ مجھے لگتا ہے کہ یہ ہوسکتا ہے،\nلیکن مجھے واقعی یقین نہیں ہے۔ اس طرف اے سی۔ - [AI] آپ قریب ہیں۔ دراصل، سائیڈ اے سی کو\n زاویہ الفا سے ملحقہ کہا جاتا ہے۔ hypotenuse\nایک دائیں مثلث کا سب سے لمبا رخ ہے اور براہ راست دائیں زاویہ کے مخالف ہے۔ کیا آپ تلاش کر سکتے ہیں کہ ہائپوٹینس کون سا ہے؟ - اوہ ٹھیک ہے۔  میں سمجھ گیا، اچھا۔ تو میں سمجھتا ہوں کہ فرضی\nیہ واقعی A سے B تک لمبا رخ ہے، کیا یہ درست ہوگا؟ - [AI] بالکل۔  بہت اچھے۔ اب جب کہ آپ نے hypotenuse کی شناخت کر لی ہے، کیا آپ شناخت کر سکتے ہیں کہ زاویہ الفا کا\nمخالف رخ کون سا ہے ؟ - ٹھیک ہے، ٹھیک ہے، میرا مطلب ہے، آپ نے مجھے پہلے بتایا تھا کہ یہ ملحقہ طرف ہے اور میں جانتا ہوں کہ یہ فرضی ہے۔ تو میں اندازہ لگا رہا ہوں کہ یہ\nطرف، BC، مخالف سمت ہے۔ - [AI] زبردست کٹوتی،\nیہ بالکل درست ہے۔ اب جب کہ آپ نے زاویہ الفا کے\nنسبت تمام اطراف کی شناخت کر لی ہے، کیا آپ کو صحیح مثلث میں زاویہ\n کی سائن تلاش کرنے کا فارمولا یاد ہے\n؟ - ہاں، میں جانتا ہوں کہ سائن ہائپوٹینوز پر مخالف کے برابر ہے۔ - [AI] کامل۔  یہ بالکل درست ہے۔ اب، کیا آپ اس\nفارمولے کو مثلث میں سائیڈ الفا تلاش کرنے کے لیے استعمال کر سکتے ہیں جن \nاطراف کی لمبائی ہم نے شناخت کی ہے؟ - ٹھیک ہے، تو میرا مطلب ہے، آپ نے مجھے بتایا کہ سات، سائیڈ BC مخالف سمت ہے، اور پھر آپ نے کہا کہ\nhypotenuse سب سے لمبا رخ ہے۔ تو وہ یہ\nسائیڈ AB ہوگی، جو 25 ہے۔ تو کیا جواب 25 پر سات ہوگا؟ - [AI] بہترین کام۔  یہ درست ہے۔ سائن الفا سات سے زیادہ 25 کے برابر ہے۔ اس نے سائن فارمولے کو استعمال کرتے ہوئے اطراف کی نشاندہی کرنے میں بہت اچھا کام کیا۔ اگر آپ کے مزید\nسوالات ہیں تو بلا جھجھک پوچھیں۔",
    "t_spanish": "- Hola, mi nombre es Sal Khan, soy el fundador de Khan Academy. Y también soy autor de un nuevo libro sobre\ninteligencia artificial y educación, llamado \"Brave New Words\". Y OpenAI nos invitó a mí\ny a mi hijo Imran a probar algunas de sus nuevas tecnologías. Y por eso tenemos curiosidad\nsobre qué tan bueno podría ser dar tutoría a alguien en\nmatemáticas en Khan Academy. Así que empecemos.  Se está cargando. Muy bien, asegúrate de que\npueda ver nuestra pantalla. - [AI] En realidad, en este formato no puedo... - Hola. Estoy aquí con mi hijo y me encantaría que\nle enseñaras este problema de matemáticas, pero no le des la respuesta. Puedes hacerle preguntas y guiarlo\nen la dirección correcta, pero realmente quiero asegurarme de que\nél mismo lo entienda. y él está aquí en la sala para que\npuedas hablar con él directamente. - [AI] Por supuesto, estaré encantado de ayudar. Miremos el problema juntos.  ¿ Puedes primero identificar qué lados del triángulo son opuestos, adyacentes y hipotenusa\nen relación con el ángulo alfa? - Muy bien, estoy bastante seguro de que este es el ángulo alfa de aquí, ¿verdad? - [AI] Perfecto, eso es correcto. Ahora, mirando el triángulo, ¿ cuál lado\ncrees que es la hipotenusa? - No estoy totalmente seguro. Creo que podría ser este,\npero realmente no estoy seguro. Este lado AC. - [AI] Estás cerca. En realidad, el lado AC se\nllama lado adyacente al ángulo alfa. La hipotenusa es el lado más largo\nde un triángulo rectángulo y está directamente opuesto al ángulo recto.  ¿ Puedes encontrar cuál es la hipotenusa? - Ah, okey.  Veo. Entonces creo que la hipotenusa\nes este lado realmente largo de A a B, ¿sería correcto? - [IA] Exacto.  Bien hecho. Ahora que has identificado la hipotenusa, ¿ puedes identificar qué\nlado es el lado opuesto al ángulo alfa? - Está bien, bueno, quiero decir, me dijiste antes que este era el lado adyacente y sé que es la hipotenusa. Entonces supongo que este\nlado, BC, es el lado opuesto. - [AI] Gran deducción,\neso es absolutamente correcto. Ahora que has identificado\ntodos los lados relativos al ángulo alfa, ¿\nrecuerdas la fórmula para encontrar el seno de un\nángulo en un triángulo rectángulo? - Sí, sé que el seno es igual al opuesto sobre la hipotenusa. - [IA] Perfecto.  Eso es absolutamente correcto. Ahora, ¿puedes aplicar esa\nfórmula para encontrar el lado alfa en el triángulo usando\nlas longitudes de los lados que hemos identificado? - Bueno, quiero decir, me dijiste que siete, el lado BC es el lado opuesto, y luego dijiste que la\nhipotenusa es el lado más largo. Entonces ese sería este\nlado AB, que es 25. Entonces, ¿la respuesta sería siete partido por 25? - [AI] Excelente trabajo.  Eso es correcto. El seno alfa es igual a siete partido por 25. Hizo un gran trabajo identificando los lados usando la fórmula del seno. Si tienes más\npreguntas, no dudes en preguntar.",
    "t_arabic": "- مرحباً، اسمي سال خان، أنا مؤسس أكاديمية خان. وأنا أيضًا مؤلف كتاب جديد عن\nالذكاء الاصطناعي والتعليم، بعنوان \"كلمات جديدة شجاعة\". وقامت شركة OpenAI بدعوة نفسي\nوابني عمران إلى هنا لتجربة بعض تقنياتهم الجديدة. ولذلك نحن مهتمون\nبمعرفة مدى جودة تدريس\nالرياضيات لشخص ما في أكاديمية خان. لذلك دعونا نبدأ.  جارٍ التحميل. حسنًا، تأكد من\nأنه يمكنه رؤية شاشتنا. - [AI] في الواقع، لا أستطيع بهذه الصيغة... - مرحبًا. أنا هنا مع ابني وأود أن تعلميه\nهذه المسألة الرياضية، لكن لا تعطه الإجابة. يمكنك طرح الأسئلة ودفعه\nفي الاتجاه الصحيح، لكني أريد حقًا التأكد من\nأنه يفهم ذلك بنفسه. وهو هنا في الغرفة حتى\nتتمكن من التحدث معه مباشرة. - [AI] بالطبع، سأكون سعيدًا بالمساعدة. دعونا ننظر إلى المشكلة معا.  هل يمكنك أولًا تحديد أضلاع المثلث المقابلة والمجاورة والوتر\nبالنسبة للزاوية ألفا؟ - حسنًا، أنا متأكد من أن هذه هي زاوية ألفا هنا، أليس كذلك؟ - [AI] ممتاز، هذا صحيح. الآن، بالنظر إلى المثلث، أي ضلع\nتعتقد أنه الوتر؟ - لست متأكدا تماما. أعتقد أنه قد يكون هذا،\nلكنني لست متأكدًا حقًا. هذا الجانب AC. - [AI] أنت قريب. في الواقع، الضلع AC\nيسمى الضلع المجاور للزاوية ألفا. الوتر هو أطول\nضلع في المثلث القائم وهو مقابل الزاوية القائمة مباشرة.  هل يمكنك العثور على أي واحد هو الوتر؟ - حسنا.  أرى. لذا أعتقد أن الوتر\nهو هذا الضلع الطويل من A إلى B، هل هذا صحيح؟ - [منظمة العفو الدولية] بالضبط.  أحسنت. الآن بعد أن حددت الوتر، هل يمكنك تحديد\nالضلع المقابل للزاوية ألفا؟ - حسنًا، أعني أنك أخبرتني سابقًا أن هذا هو الضلع المجاور وأنا أعلم أن هذا هو الوتر. لذا أعتقد أن هذا\nالضلع، BC، هو الضلع المقابل. - [AI] خصم كبير،\nهذا صحيح تمامًا. الآن بعد أن حددت\nجميع الجوانب المتعلقة بالزاوية ألفا، هل\nتتذكر صيغة إيجاد جيب\nالزاوية في المثلث القائم؟ - نعم، أعلم أن جيب الجيب يساوي المقابل على الوتر. - [منظمة العفو الدولية] ممتاز.  هذا صحيح تماما. الآن، هل يمكنك تطبيق هذه\nالصيغة لإيجاد ضلع ألفا في المثلث باستخدام\nأطوال الأضلاع التي حددناها؟ - حسنًا، أعني أنك أخبرتني أن سبعة، الضلع BC هو الضلع المقابل، ثم قلت إن\nالوتر هو الضلع الأطول. إذن، هذا هو\nالضلع AB، وهو 25. إذن، هل ستكون الإجابة سبعة على 25؟ - [منظمة العفو الدولية] عمل ممتاز.  هذا صحيح. جيب ألفا يساوي سبعة على ٢٥. لقد قام بعمل رائع في تحديد الأضلاع باستخدام صيغة الجيب. إذا كان لديك أي\nأسئلة أخرى لا تتردد في طرحها.",
    "t_italian": "- Ciao, mi chiamo Sal Khan, sono il fondatore della Khan Academy. E sono anche l'autore di un nuovo libro sull'intelligenza artificiale\ne l'educazione, intitolato \"Brave New Words\". E OpenAI ha invitato\nqui me e mio figlio Imran per provare alcune delle loro nuove tecnologie. E quindi siamo curiosi\ndi sapere quanto sarebbe bello dare ripetizioni di\nmatematica a qualcuno alla Khan Academy. Quindi iniziamo.  Si sta caricando. Va bene, assicurati che\npossa vedere il nostro schermo. - [AI] In realtà, in questo formato non posso... - Salve. Sono qui con mio figlio e mi piacerebbe che tu\ngli insegnassi questo problema di matematica, ma non dargli la risposta. Puoi fare domande e spingerlo\nnella giusta direzione, ma voglio davvero assicurarmi che lo\ncapisca da solo. ed è qui nella stanza, quindi\npuoi parlargli direttamente. - [AI] Certo, sarei felice di aiutarti. Vediamo insieme il problema. Riesci innanzitutto a identificare quali lati del triangolo sono opposti, adiacenti e ipotenusa\nrispetto all'angolo alfa? - Va bene, quindi sono abbastanza sicuro che questo sia l'angolo alfa proprio qui, giusto? - [AI] Perfetto, esatto. Ora guardando il triangolo, quale lato\npensi sia l'ipotenusa? - Non ne sono del tutto sicuro. Penso che potrebbe essere questo,\nma non ne sono davvero sicuro. Questo lato AC. - [AI] Ci sei vicino. In realtà il lato AC si\nchiama lato adiacente all'angolo alfa. L'ipotenusa è il lato più lungo\ndi un triangolo rettangolo ed è direttamente opposto all'angolo retto. Riesci a trovare qual è l'ipotenusa? - Oh ok.  Vedo. Quindi penso che l'ipotenusa\nsia davvero il lato lungo da A a B, sarebbe corretto? - [AI] Esattamente.  Ben fatto. Ora che hai identificato l'ipotenusa, puoi identificare quale\nlato è opposto all'angolo alfa? - Ok, beh, voglio dire, prima mi hai detto che questo era il lato adiacente e so che è l'ipotenusa. Quindi immagino che questo\nlato, BC, sia il lato opposto. - [AI] Ottima deduzione,\nassolutamente corretta. Ora che hai identificato\ntutti i lati relativi all'angolo alfa,\nricordi la formula per trovare il seno di un\nangolo in un triangolo rettangolo? - Sì, lo so che il seno è uguale all'opposto sull'ipotenusa.  - [AI] Perfetto.  E' assolutamente vero. Ora, puoi applicare quella\nformula per trovare il lato alfa del triangolo usando\nla lunghezza dei lati che abbiamo identificato? - Ok, quindi voglio dire, mi hai detto che sette, il lato BC è il lato opposto, e poi hai detto che l'\nipotenusa è il lato più lungo. Quindi questo sarebbe questo\nlato AB, che è 25. Quindi la risposta sarebbe sette su 25? - [AI] Ottimo lavoro.  È corretto.  Il seno alfa è uguale a sette su 25. Ha fatto un ottimo lavoro identificando i lati usando la formula del seno. Se avete altre\ndomande, non esitate a chiedere."
}