{
    "source": "J36ZvlMxEuM",
    "youtubelink": "https://www.youtube.com/watch?v=J36ZvlMxEuM",
    "t_english": "- All right everybody. Well, we are gonna take time to now introduce myself as the host and then I'll let my amazing panelists go ahead and introduce themselves. So nice to meet you. My name is Danielle Sullivan. I am Senior Manager of District Partnerships in the Northeast for Khan Academy. And before all of this, way back when, I've been with ed tech for a little bit, but I was also a fifth and sixth grade special education teacher in upstate New York and in Washington DC. So I'm excited to be here today to talk all about SATs. Sarah, why don't you go ahead and kick us off with the panel introductions. - Sure. Hi everyone. My name is Sarah Thaler. I am a District Success Manager. I work primarily with districts in Michigan and Ohio. Prior to being at Khan Academy, I was a high school science teacher for about 10 years, and then was in administration, K-12 curriculum director. And then for about nine years I was at College Board. And so I was working with state Departments of Education, helping to administer the SAT suite of assessments for their state federal accountability assessments. And so I am very happy to be able to apply my knowledge of SAT to the districts that I work with at Khan Academy. - Great, Sarah. Thank you. All right, Elizabeth. - Hello, good afternoon. My name is Elizabeth Hadley and I am also a District Success Manager, working with districts all across the United States, focusing on their digital SAT implementation with Khan Academy. Prior to my arrival at Khan Academy, I was working in a county in Orlando called Osceola County. I was a teacher, former literacy coach and spent four years in a research and evaluation office implementing assessments, PLC short cycle formative assessments, and also implementing Khan Academy with our 20,000 high school students. So it's just a pleasure to be able to share all of that information I have with the districts that I work with now at Khan Academy. - No big deal, just implementing you know, 20,000 kids. - A little bit at Khan. - Just like working with several state departments. No big deal. And Raven. - Hey everybody. So happy to see you all today. My name is Raven Casseus. I'm a District Success Manager, mostly working with districts in the Northeast and I see somebody from Greensboro on, so welcome. And former to this, I was in K-12 for about 22 years. I was a science teacher, an instructional coach, and most recently a high school principal. So very familiar with the SAT and getting parents and students and teachers ready and involved in the process. So happy to share my expertise today about all the things that go along with the SAT. - Wonderful. So I'm gonna stop sharing my screen because the point of today is to really just have a interactive, collaborative conversation around how we're gonna support you and thinking through preparing students for the digital SAT. We understand that it is wherever you're watching this, those of you here today, you're in a different journey. And if you're watching this in the future, you might be in a different journey of the timeline. But our goal today is really to help you understand through different perspectives and point of views how students can help them under, catch up in ELA and math, especially after the pandemic, which was a lot. I mean, does anyone remember the year 2019? Does anybody? (Raven laughs) I, no. Right? I mean, who even knows? So how we can transition to the new digital assessment format, it can be challenging. So we're here to support you and understand pieces and our perspectives. You can have, ask questions in the chat. You can collaborate with each other in the chat or you can submit questions from the Q and A. So I have both up and ready. I'll be asking questions of our panelists, but please, we would love to hear from you as well. So to kick us off, Sarah, the SAT has been around for a long time. We have several months into the transition to a digital test. How has the transition been for schools and how have you observed the preparation for the tests and how that's, how's that been? - Sure. You know, change is hard. And there was a lot of it this year. If you administered the SAT school day or if you were a weekend test center, you're probably likely focused on a lot of the administrative changes that had to happen with the digital test. So how to install Blue Book, how do students log into Blue Book, testing toolkit, ordering, registration, rooms, training your staff, all of those logistical things was a lot for educators this year if you administered in your building. But now hopefully, maybe you have one or more administrations under your belt and you feel a little more confident about actually administering the test and you can focus now on, you know, helping students and really diving into the data that you might get for that. - Great. Elizabeth, what about, what have you seen from your perspective? - Well, you know, just like Sarah said, change is really hard. And I have to be honest, I've worked with intensive readers for a very long time trying to get them to the finish line with the SAT and I was really nervous about all of the changes. I was nervous for the teachers, especially in reading classrooms, having to transition from annotating text and working with texts with their fingers, chunking text to a digital format. And to be honest with you, as the course of the year went on, the transition was a lot smoother than I had anticipated. If you were talking to me last summer, I was pretty nervous. But once we got into the swing of things and students were practicing on Khan Academy and they were getting exposure to those digital items, I started to feel like it was, the districts were reporting back to me like they're doing really well with it and they're doing well with the online calculators and things like that. Now with the districts I've been talking to, the students are reporting back to the educators that, you know, they liked it a lot better. It wasn't as long. It was a little bit more easier to get through some of the questions. Obviously the data will tell us if it was easier or not, but you know, the fact that the students are responding a little bit better to that digital format was not only a nice surprise to me, but it was also exciting, you know, to hear that feedback and news from our district partners. - Oh, absolutely. I, do y'all remember taking the SAT? remember back when in 19- (Danielle clears her throat) Change is always hard, right? Raven, what are you seeing from your perspective? - So I just wanted to say that last year, we were partnered with College Board, which is such a great partnership that we had. And we started transitioning our districts last year. We started getting them ready, we started prepping them, we started giving them as much information as we can, as we could to kind of get them ready, get their students ready, kind of have a plan in place. So I feel like they were ready. They did reach out for assistance from us, which we were happy to collaborate with them. And then with the help of the new Khan Academy SAT course and the Blue Book app, we were able to get the students up and running. And like Sarah said, I think the biggest change was for teachers and administrators. Our kids are so resilient, right? They take to technology so quickly. So this wasn't that hard for the students. It was harder for the teachers to prepare I think for most of all. But like Elizabeth said, only the data will tell. And I think that with the preparation that students had on Khan Academy, I'm excited to hear from districts once they start getting those scores back. - Absolutely. And again, in the chat, if you wanna chime in, what was your experience with the change? Did it work? How are you feeling about it? And but Sarah, since we're gonna make the College Board connection, I'd love for you to think about though, Khan Academy's approach to SAT preparation. How do we think through this at Khan Academy to help students be prepared and ensure that they're understanding what to do? - Sure. I mean, I think when we think about SAT prep, we think about all those preppiness activities. You know, getting familiar with Blue Book, how many questions, the type of questions, time management. And while important and students need to have those skills, what we really want to try to focus on and to really improve SAT scores and of course that means college readiness 'cause that's what the SAT is designed to measure. We really need to focus on the skills. And these are not just skills on the SAT, these are enduring reading and writing and math skills that students need to know, not only for college readiness, but to be successful also in their other high school courses. So I think our focus on those enduring skills is really, really important. - Thank you. So Elizabeth, walk us through how we approach skills at Khan Academy. - Yeah, great question. Like Raven said, you know, we are partnered with the College Board, so they help us design those questions to make sure that they're 100% aligned. But you know, talking specifically about the skills, both of our digital SAT courses, the math and the reading and writing have a series of skills. The math one has like 111 and the ELA one has about 41 to 50 skills. And when we talk about mastery learning and we talk about our students authentically learning those skills, like Sarah was mentioning for college and career and just life in general. What I love about Khan Academy is that the students, the teachers and the administrators are able to track the student's proficiency level on those skills. And so all year long, starting in August, we're tracking the students working through those skills and whether or not they're reaching proficiency in those skills. Because if they're proficient, then I am, as a teacher, more confident that they're gonna be able to answer that question on their own when it comes to the PSAT or the SAT on test day. And so that's something that myself, Sarah, and Raven work really hard with our district partners is, you know, here are the skills your students are excelling in. These are the ones that we need to kind of lean into and really get some more support going. And so that's really what frames our conversations with our partners all the time is, what are the skills and how are the students doing on those skills? - And Raven, from your perspective, what else are you thinking about when it comes to skills? Because I know you're thinking about skills a lot. - Yes. So just to piggyback off what Elizabeth and Sarah said, the great thing about Khan Academy is it's a one-stop shop for SAT, right? Like students can go in, they can take the course challenge. That can give us, the teachers from right from the beginning of the school year where they need to lean in. So instead of wasting time, having kids just kind of drill and kill, we're gonna take the approach, let's lean into what they need. If they already know it, let it be, they will get those skills throughout the school year from their teacher. But the skills that they need a little, a bit of extra help on, we're gonna lean in there and then teachers are gonna look at their reports and then go back and maybe make small groups or give extra reinforcement assignments outside of their course mastery goal. So we were, we did a good job aligning with College Board and making those three different categories in our SAT prep course. We have the foundation, the medium and the advanced. So just like the SAT because it's adaptive now, we wanna make sure that our students are getting all that they need in all the areas of the test. - That's great. So I want us to start to now layer on how we're thinking about AI in use of the courses. So Sarah, thinking about AI, what are some of the challenges and opportunities that are presented when using an AI for the digital SAT prep? - Yeah, one of the immediate examples that came in my head is when I was teaching science, we did an SAT prep bootcamp that was like a two week kind of course that we had students take during the summer. They could sign up for it. But I really struggled with figuring out how to teach that, how to keep students engaged in some of this content that isn't, you know, terribly exciting probably to them. I know lots of you probably have SAT prep courses or electives in your school. And so I think where AI could have been an opportunity for me and saved me a lot of time is to use our Khanmigo teacher tools. And so this would've made my life a whole lot easier 'cause I spent so much time trying to figure out how to keep students engaged and do these things. But we have lesson plan generators that would've been super helpful. There's like a Khanmigo teacher tool where it creates informational text and as we know, kind of reading, and having those close reading skills are super important. So generating that informational text for my students to be able to practice with. We have a Khanmigo teacher tool about keeping it relevant, real world context generators, all of those things that I just spent so much mental energy trying to come up with on my own, Khanmigo could have done it for me. And so I wish I would've had those tools back in my teaching day, way back in the day. (Raven laughs) - Anyone else feel that way? Anyone else spending any time on planning. (Raven laughs) Just kidding. I know you are. So Elizabeth, I see you empathetic, really nodding your head. That's the word right there. So what do you add to the conversation? - Yeah, I mean, I remember lots of Sundays preparing for my multiple preps and you know, making sure I had everything planned out for the week. And it's amazing to me how quickly some of this is now automated with Khanmigo. You know, AI is new to all of us. Khanmigo, you know, several of the other AI tools out there is not only new to us like at Khan Academy and my colleagues on this call, but you know, it's new to our teachers, it's new to our parents, our district admin. And it's been really a great year just kind of discovering and learning. And I think, you know, one of the challenges that educators are facing today in the classroom is students' understanding how to interact with Khanmigo and with AI and I have really come to the conclusion that there's a lot of modeling that needs to be involved for our students. You know, this is not Google. It's not a quick way just to go get an answer. You really have to really work with the students on how you talk to Khanmigo and how you can authentically use Khanmigo to help you learn and, you know, grasp onto new skills and tasks. Where I see it being really beneficial for just like SAT prep is, you know, small group instruction in the classroom and you know, having a personalized tutor at every single desk. So there's only one teacher usually in the classroom. If they're lucky they get two or an aid or a helper. But being able to have students get that immediate feedback and work through something that they're trying to learn right at their fingertips without having that teacher right next to them, I really think is what's powerful in all of this. And when it comes to SAT prep, you know, all the students deserve all the help that they can get and that's definitely something I see being super powerful in the future in classrooms. - Oh, absolutely. I mean, technology's come a long way, but as we've shared, change can be hard. I mean, I remember SAT prep was a giant book like this. Again, you all remember, I mean, in the year, blah, blah blah. So thinking about the evolution, thinking about AI, Raven, what are you seeing in the districts that you work with about opportunities and challenges? - So, you know, the opportunities are just the equity, right? We know that everyone doesn't have a mom that stays home or access to a tutor. So the fact that we have a tool that all students can use no matter what grade level, what state that they're in, is amazing. You know, and honestly, I have two teenagers and I don't know all the stuff that they're learning now even though I'm an educator. So just imagine a non-educator parent trying to navigate all the different things that students are learning nowadays. So not only can it help the parents, because I use Khanmigo quite often to help my own children, but this is, like Elizabeth said, this is a personalized tutor for every single student in every single classroom all over the country. And you know, just like any new tool, the challenges always come with time, right? When am I gonna train my teachers to use this? How am I gonna to use this so that, you know, they're using it safely? Those are all the things that are always challenges. But I feel like at Khan Academy, we really, we did a really good job at figuring all those things out, you know, while having the moderation and having teachers being able to monitor the chat and having parents being able to link to accounts and monitor their chat. So there's always gonna be challenges because ChatGPT and all the AI technology is constantly changing, right? Large language models hallucinate, there's all the things, but you know, even with any new technology or any new curriculum, adaption or any of those things in a school is always challenging. And it just takes, you know, the right leader and us guiding you through implementation in order to make sure that the challenges are minimal. But I would not be a former high school principal if I sat here and said that there aren't gonna be any challenges 'cause they're definitely will be. But you know, hopefully those are things that our team and can figure out for you and help you navigate some of those things. - Right? And there was a question in the chat about a visual demo. We wanna focus on more of a conversation today, but we're gonna, before we leave you all today, we'll give you some, point you in a direction where you can access things and see the things and there's lots of resources, but we're trying to give you more of the educator perspective instead of showing you a bunch of stuff. (Raven laughs) It's awesome. It's very awesome. However, we wanna talk more about the why and the how behind it and like Raven said, I'll give you a little bit more information of how we'd love to support you in this work. But I wanna go back to learning and mastery learning. That is a term which is really interesting that I feel like we need to talk way more from the education rooftops about protecting learning. What does it mean to master skills? So Sarah, I'd love for you to think about how, what role does mastery learning play and helping students with even the new digital SAT format? - Yeah, I think the inherent nature of mastery learning is to make sure that students have a strong foundation and that prerequisite knowledge to build upon. So there aren't any gaps, there's no holes in their learning. And then the digital SAT prep course mirrors this, and Raven mentioned this before, by scaffolding those skills, we have those foundational levels, the medium difficulty, the advanced difficulty to ensure not only the breadth of the skills that we are offering to make sure those align to what's being assessed on the SAT and again, those enduring skills, but the depth of those skills as well. - Yeah, absolutely. I mean even thinking about the SAT, why are we taking that? Anybody, Bueller? just kidding. We're taking it so students can continue to learn, continue to master learning, hopefully at different institutions. So Sarah or Elizabeth, what have you seen from your perspective around mastery learning? - Well, you know, mastery learning to me has always been, you know, the students truly getting to the depth of that skill and being able to reproduce proficiency on it many different times. And really for our students to show proficiency in a skill on Khan Academy, they have to see it at least two times and get that skill correct on an assessment or a unit quiz or a course challenge. So I always feel like more confident knowing that when the student has mastered this skill, this is something they've been able to do multiple times through practice. Another thing that I see that I is really beneficial is the students, the parents and the teachers and admin can track how the students and like, or how many skills the students have mastered. So in our platform you can track mastery progress by unit or even by the entire course and you can keep students engaged. When we're talking about student engagement here on, you know, all year long, how much of this course have you mastered? And making sure that students are continuing to, you know, progress and continue to gain mastery. I think that's always like the big piece of this puzzle is motivating students. And so if students know that end goal in mind and they know that like, hey, if I can get to 80 or 90% mastering this course, hey, like I'm gonna be a lot more confident the day I have to sit for the SAT. So yeah, that's what I like. And I also love how it's transparent from the student all the way up to the district admin. That's to me really important so everyone can be involved in that conversation with the students. - Oh, absolutely. I mean, data needs to be owned and visible for all stakeholders in a district, period. Like that's the way it's gonna have a profound impact. But Raven, from your perspective, even as a former building-level leader, what do you, what are your thoughts on the engagement and mastery of, well, mastery of skills and student engagement when thinking about SAT in particular? - Yeah, I'm just thinking about in the secondary world, you know, right? You have kids on different tracks doing different things, different schedules across the district. So the fact that mastery learning is something that teachers can set day one and kind of just let it flow and the kids will go on their own path, that is great because it's less time, right? For teachers. Now teachers can focus on student face time and going over those skills that students are not proficient at, right? And giving the, doing small groups and managing that and then, you know, doing during their PLCs using the data to kind of track, okay, maybe this is something we need to change in our curriculum or instruction. I noticed that most kids are really doing poorly on literary equations, so maybe we need to loop back around and try that skill again. But the great thing about mastery learning is if I have six different levels in the class, it's okay because Khan Academy's gonna pull them through in the path that they need that fits their learning. And there's nothing that can beat that because that will take a teacher, like Danielle said, back when I was in the classroom some years ago, that will take a teacher a very long time to outline who needs to learn what in a short period of time before the SAT and it's just not a manageable task. So using Khan Academy in order to filter some of that out and have the teacher put the students on and kind of have that path and then they can focus on that student face time and that one-on-one interaction is just a game changer. And for those students who are high flyers who don't wanna sit there and listen to you, guess what? They don't have to. They keep going on Khan Academy where they need to be. And that to me is just, you know, something, as a educator and a teacher that is, you know what my kids, all my kids are getting what they need and that's the most important thing. - Yeah. And just make sure you go back and just re-listen to what Raven just said. She just dropped a lot (Raven laughs) of great data, best practice strategies just around making sure that you were thinking and using skill-based analysis to support student learning. So now we're gonna go back in a time machine. This is not \"Back to the Future,\" but maybe it is. (Raven laughs) It's not just. I want you to think back, think back to when you were back in teaching in your high school classrooms, thinking about getting started for the next school year. How would you think through preparing students for the digital SAT and how, now we're like right \"Back to the Future\" where he's like from the eighties but on the hoverboard. So you're back when you taught and then now you have Khanmigo and you have Khan Academy to help you. So how would you think about it and then how would it change with the introduction of the AI? Why don't you kick us off Sarah? In the DeLorean. (Sarah laughs) Way too much of this analogy. All right, go ahead Sarah. (Raven laughs) - So I think most everyone knows, science isn't directly measured on the SAT, right? But within the reading and writing section and the math section, there are questions that have a science context. So I was a science teacher and just because science isn't being measured doesn't mean I'm off the hook. I can still help my students with preparing for the SAT. So what I would do is have my students go into Khan Academy in the science courses. So go to the biology course or chemistry course, physics or science, whatever you want to do. And within those courses there are articles and those articles have a lot of rich, informational science-based text. And so the more I can get my students reading those science kind of context text and being comfortable with reading those, that's just gonna serve them so much better when they're going to take the SAT. So I would really focus on the reading, close reading skills of science informational text. And then if students have access to Khanmigo, they can, you know, use Khanmigo on those articles as well. Hey, explain, I don't know what this word means, help me with this. So again, it's that personal tutor helping them go through that informational text, which again will help them on the SAT. - That's amazing. And I love how you're sharing, even though you, you know, science isn't directly assessed, I think a lot of content teachers sometimes are like, what? What does my subject have to do with it? (Raven laughs) But just supporting students and being critical thinkers, engaged learners, like it takes a team effort. So thank you for pointing that out too. Elizabeth, what's your perspective in your DeLorean time machine? - Well, you know, I taught 11th grade ELA for five years and I always felt like I was very like systematic. I like things to like happen at a certain time. And so I'd really kind of like backwards plan from, okay, when is my SAT school day? When should I have my students practice on Blue Book? And really start in August with two things. The first thing I would really start is with the course challenge. So cool thing in our digital SAT courses is you can assign something kind of like a pre-assessment. It's called a course challenge. And it gives the students, you know, a random sampling of the skills from both of the courses. And you can do that really early on in the school year and immediately start getting skill data back. So you can start grouping students by skills, you can kind of start to get an idea of what skills students may be already a little bit proficient in and which ones they may need help with. So I would definitely start with the course challenge just to kind of get that initial data. And then I would, you know, with AI and with Khanmigo would probably spend a lot of time modeling at the beginning of the year with my students of, you know, hey, this is an example of a problem that I don't know how to answer. If it was me, it would be a math problem. That I would model with my students. And really kind of show the students how you can engage back and forth with Khanmigo to answer the question or summarize a video or summarize an article. I also think collaborative pairs, students working together with Khanmigo to see what they discover and see what they learn would also be part of my routine early on in the school year. And then moving into the fall, you know, starting to really look at the skills data and my mastery data. So, you know, have my students mastered at least 15% of the course by, I don't know, October 15th? And just making sure that my students were on track to keep moving through the skills would definitely be probably my approach if I was in an ELA classroom today. And you know, going into January, making sure that they've practiced on Blue Book is super important. And you know, going through the features and all the tools and the calculator and all that that's embedded there I think is also super important to be transparent with the students on. - And I really love that you're calling out modeling. I was a former middle school teacher and I, maybe you can relate, has anyone ever handed highlighters to middle school kids? - Yeah. - Without modeling? Just you can imagine, you know, what happens, that's the thing. But a AI is another tool, but it's still important to model. I think sometimes middle school and high school teachers forget. They think, they assume that students should know how to use things, but in this new world, no, no. Modeling is really, really important, especially when there's so much changing, there's so much innovation happening. So I really, plus your approach is very linear, so thank you for that. Raven, what about you? - So I'm gonna just take the perspective of a building administrator just 'cause Sarah and Elizabeth share so many great tips as a classroom teacher. But right now is the time that you are gonna be planning out scheduling, right? Because what is everything that teachers say? I don't have enough time, I can't do that. I don't have enough time for this. I don't have enough time for that. Well, we're in charge, building administrators, you're in charge of the schedule, you're in charge of giving teachers that quote unquote time. And that's really important, even if it's not changing your schedule. Like in my high school, we had 90 minute blocks, so I gave them, you know, several different options of how they could set up their class in order to prep for all the different things that you have to prep for in high school, all the different exams. And teachers just have to know that you're supporting them in this journey. And part of that is giving them ease of access. And that's what Khanmigo does, right? So they don't have to have that big book anymore. They can go on, they can align their content throughout the year with the SAT questions. Why can't they have SAT Fridays? You know, say, \"Hey guys, if you're,\" like Sarah said, it doesn't matter what content you're teaching. On Fridays for the first 30 minutes of our last block, we're gonna do SAT prep on Khan Academy. You know, it's also parents can link to their accounts. So maybe if I have a good success rate with homework, I'm gonna use it for homework. But Khanmigo can give the teachers data, like Elizabeth was saying, so that can be done right before class instead of them having to dig through. Khanmigo will make groups for you. It will tell you the skills that need to be worked on it has, it will give you lesson plans, it will even allow the students to practice. You just say \"Khanmigo, gimme some practice questions.\" So even just giving the kids enough time to do that is gonna be definitely an agent of change for them to be able to move forward. We know that time is of the essence for students, for teachers. So this is just another way for teachers, administrators to save time, have a plan, and make sure that students are prepared and not waiting 'til the last minute to cram, but be working on this all year long, like Elizabeth said, from the fall with that course challenge. And then keeping it going throughout the year until test day instead of, you know, having that anxiousness of cramming everything into one bit of time because you don't have the time. - I'm sure nobody who's watching has ever crammed for anything and felt that pressure. Right? (Raven laughs) Especially not in college when you're trying to manage your time as a young person. - Right. - That's the key is preparedness planning. And we try to support you in our partnerships at Khan Academy in doing this essential work. So now I wanna, we're running, speaking of time, we are running almost out of time. So I want us to think about one last perspective, future developments. So in thinking that, you know, the way the SAT has moved to the digital format, what are we doing at Khan Academy or what are, what do you think in the world of education's happening or what do we hope for for the use of AI and helping to continue this work for the digital SAT? Why don't you get us started, Sarah? - I think there's a lot of concern about using AI in education, and rightly so, right? We're in a brand new world. But I also think we are, we tend to think about it in the way that we were taught or the way that we were taught to teach. And so kind of moving into this new world of using AI in education, what I would hope to see is that AI is a tool to help us teach critical thinking a little bit better, a little bit easier. It's a hard thing to teach and it's a hard thing to do. I would hope that, you know, increased collaboration. We're taking AI, you know, for all of that rote knowledge that's, that that can do it for students, right? But then how are we gonna get them to collaborate effectively? And I think there's a big kind of place where AI can help teachers and students improve those critical thinking skills and collaboration skills. And I'm hoping that's where we're headed eventually. - And what I heard you say is human skills. - Right. - Right? Critical thinking, collaboration. A computer can't do that. That's what humans, and that's actually a great way for us to just learn in general. So, I just, again, I know I have a lot, there's a lot of talk in education. It's, \"The computers are taking over.\" This can be a tool to help with the humaning skills. That is a new word everybody, humaning. Maybe it's a real word? - Right. - Elizabeth, save me. What do you think? - You know, I hope for the future that, you know, everyone gets more comfortable with AI but also with that understanding that that teacher in the classroom can never be replaced and that the teacher is still just the most important human connection in the world. And I remember, you know, you, we go back to the modeling and I remember in the classroom, you know, my students looked up to me and you know, and I spent more time with my students than I did my own family on many, many occasions. And I know they did the same and they would take long bus rides, you know, to my school. And, you know, I hope that for the future, that students, you know, still have, you know, that human connection with their peers and with their students and the world and the community around them, but that they get more comfortable using AI to enhance what they have and what they know and what they can learn. I would also love to see AI have a role in assessments. I believe data is so important not only to our school district leaders, but our principals and our students and our parents. And I would love to see some sort of incorporation of AI in our short cycle formative assessments that we give our students. What that looks like, I'm not exactly sure, but it's definitely something I've been thinking about in my mind of how this could change the world of assessments for the future. - Yeah, absolutely. And Raven, I love that you keep giving us the admin perspective. (Raven laughs) So let's just keep on going. What are your thoughts? - I mean, I was just thinking that, you know, from when I was a student myself to when I was teaching in the school and you know, admin and then even this perspective that I have now, working with districts every single day. You know, there's always gonna be something new. And for education, I think we've got that down pat, right? We get a new curriculum every other minute, we get new tools, we get all the things. So this is one of those things. But this thing we have to treat a little bit more delicately, right? We have to make sure that we're modeling. We're exposing not only our teachers and our students and our admin, but also our community and our parents because it's gonna affect everybody. It already is, right? Like we use it on a day-to-day basis, sometimes without knowing. If you have an Alexa in your house, if you have, you know, Google, if you have any of a Google Nest or any of those things. - Siri. - You know. Yeah Siri. (Danielle laughs) You're using AI every single day and you know, you don't think twice about it. So that's what it needs. That's what I hope for the future. That is something that you won't even think twice. You know, before COVID, not everybody had even one-to-one devices. We never even thought like, okay, everybody's gonna have a computer and you're gonna be doing your work on the computer. Not even in the school building, but we did it. So this is just another one of those things that has come, you know, to the forefront and we have to take it and we have to learn it. Don't be afraid of it. And then teach, teach, teach, model, model, model and make sure that it's being used in the appropriate way and that students know the value of it, because it is valuable. It's not just a tool for students to cheat or to, you know, mess around 'cause I know that's what a lot of people think, but it is really valuable. And I'm gonna say one little short story 'cause I know we're running outta time, but just as everybody else, when you know Khanmigo came out, was born one year ago, you know, March or so. I was like, oh my goodness, like what are we doing? Like this is crazy, like an AI, like, you know, I was trying to read books and look up articles and all the things to try to, you know, help myself understand what was going on. And I'll never forget my manager saying, \"You know, this is here guys. Like we have to embrace it, we have to use it, we have to know it so that we can help our district partners.\" And I thought about that and I was like, you know, she's right. And, but I'm like, I just need to see it for myself. So I had the opportunity to go to a school in California and see it in action and this school using a special population. So they use it with avid students, special ed students and ELL students. And that changed my whole perspective because basically just as we wanted it, the one teacher, all the kids, they had Khanmigo to help them and they didn't skip a beat. So there was no kids sitting there waiting, leaning back, doing nothing. They immediately, when the teacher was working with other students, they immediately got on Khanmigo, asked Khanmigo what they needed and they kept going. And that was like, oh my God, like I don't have a line of kids waiting for me to ask for help. I, you know, there's no one, I don't have to worry that I'm gonna have to do this lesson for three more days than I have to because half my class didn't get it. They had someone there that could help them and could change the language so they could be supported in the language that they needed. So with all the teacher shortages, with all the shortages that are going on around that just really, you know, was a special thing that I saw and really made me feel that we're doing the right thing and that Khanmigo is gonna be really something that's gonna change the lives of a lot of people. - Well, Raven, Sarah, Elizabeth, this was a wonderful conversation. I appreciate all of your time and your thoughts and your perspectives. And to Raven's point, hopefully you can see this, here we go. Can y'all see this? We are here with you. Khanmigo, right? With you. We would love to work with you. We'd love to partner with you. We wanna step into the future with you. So if you wanna partner with us at Khan Academy, you have many different advantages. First off, all the courses are free. Y'all know, hopefully you know this, but you get the courses for free. But, when you partner with us, we help you. These amazing humans on this panel are partnering with districts every single day. You get white glove service, you have professional learning, you have auto rostering, customized data. We also wanna support you in empowering all students to have that equitable access to grade-level content, to have that engaged learning to make sure that they're doing all of the things and building those skills. So we help you track the progress. And most importantly, I mean all of that's really important. But most importantly, we have developed a safe and ethical AI in Khanmigo. We value, we know that student data and privacy is really important. We have particular guardrails in because y'all work with a wonderful, amazing humans and there are teacher shortages and sometimes students are needing help and sometimes they're gonna ask for help with Khanmigo and we wanna make sure that we are enrolling the adults and the humans that can help with that. So if you are interested in learning more, we did put a link in the chat. This is our district partner team. Please reach out to us. You can also scan this QR code. You can go onto our website, look at it today and just, we so much appreciate you. And until we meet again, it was wonderful learning with you. Have a wonderful rest of your day. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- سب ٹھیک ہے۔ ٹھیک ہے، اب ہم\n میزبان کے طور پر اپنا تعارف کرانے میں وقت لگائیں گے اور پھر میں\nاپنے حیرت انگیز پینلسٹس کو آگے بڑھ کر اپنا تعارف کروانے دوں گا۔ آپ سے مل کر بہت اچھا لگا۔  میرا\nنام ڈینیئل سلیوان ہے۔ میں\n خان اکیڈمی کے شمال مشرق میں ڈسٹرکٹ پارٹنرشپس کا سینئر مینیجر ہوں۔ اور ان سب سے پہلے، جب میں تھوڑی دیر کے لیے ایڈ ٹیک کے ساتھ رہا ہوں، لیکن میں نیو یارک اور واشنگٹن ڈی سی میں پانچویں اور چھٹی جماعت کی خصوصی تعلیم کا استاد بھی تھا۔ لہذا میں\nSATs کے بارے میں تمام بات کرنے کے لیے آج یہاں آ کر بہت پرجوش ہوں۔ سارہ، کیوں نہیں آپ\nآگے بڑھیں اور پینل کے تعارف کے ساتھ ہمیں لات ماریں۔ - ضرور.  سب کو سلام۔ میرا نام سارہ تھیلر ہے۔ میں ضلعی کامیابی کا مینیجر ہوں۔ میں بنیادی طور پر\nمشی گن اور اوہائیو کے اضلاع کے ساتھ کام کرتا ہوں۔ خان اکیڈمی میں ہونے سے پہلے، میں تقریباً 10 سال ہائی اسکول میں سائنس کا استاد تھا،\n اور پھر انتظامیہ میں،\nK-12 کے نصاب کے ڈائریکٹر تھا۔ اور پھر تقریباً نو\nسال تک میں کالج بورڈ میں رہا۔ اور اس لیے میں\nریاستی محکموں کے تعلیم کے ساتھ کام کر رہا تھا، \n ان کے ریاستی وفاقی\nاحتساب کے جائزوں کے لیے SAT سوٹ کا انتظام کرنے میں مدد کر رہا تھا۔ اور اس لیے میں\n SAT کے اپنے علم کو ان اضلاع میں لاگو کرنے کے قابل ہونے پر بہت خوش ہوں جن کے\nساتھ میں خان اکیڈمی میں کام کرتا ہوں۔ - بہت اچھا، سارہ.  شکریہ ٹھیک ہے، الزبتھ۔ - آداب سہ پہر بخیر۔ میرا نام الزبتھ ہیڈلی ہے اور میں ایک ڈسٹرکٹ سکس مینیجر بھی ہوں، پورے امریکہ کے اضلاع کے ساتھ کام کر رہا ہوں\n، خان اکیڈمی کے ساتھ ان کے ڈیجیٹل SAT کے نفاذ پر توجہ مرکوز کر رہا ہوں۔\n خان اکیڈمی میں آنے سے پہلے، میں اورلینڈو کی ایک کاؤنٹی میں کام کر رہا تھا جس کا\nنام اوسیولا کاؤنٹی ہے۔ میں ایک استاد، سابقہ ​​خواندگی کا کوچ تھا اور میں نے تحقیق اور تشخیص کے دفتر میں چار سال گزارے جس میں \nاسسمنٹ، PLC مختصر سائیکل فارمیٹو اسیسمنٹس، اور ہمارے 20,000 ہائی اسکول کے طلباء کے ساتھ خان اکیڈمی کو لاگو کیا گیا۔ لہذا یہ صرف خوشی کی بات ہے کہ\n میرے پاس\nموجود تمام معلومات کو ان اضلاع کے ساتھ بانٹنے کے قابل ہوں جن کے ساتھ میں اب خان اکیڈمی میں کام کرتا ہوں۔ - کوئی بڑی بات نہیں، بس\nآپ کو معلوم ہے، 20,000 بچوں کو نافذ کرنا۔ - خان پر تھوڑا سا.\n- جیسے کئی ریاستی محکموں کے ساتھ کام کرنا۔  کوئی بڑی بات نہیں۔ اور ریوین۔ - ارے سب۔\nآج آپ سب کو دیکھ کر بہت خوشی ہوئی۔ میرا نام ریوین کیسیئس ہے۔ میں ایک ضلعی کامیابی کا مینیجر ہوں، زیادہ تر\nشمال مشرق کے اضلاع کے ساتھ کام کرتا ہوں اور میں گرینزبورو سے کسی کو دیکھتا ہوں،\nتو خوش آمدید۔ اور اس سے پہلے، میں\nK-12 میں تقریباً 22 سال رہا۔ میں ایک سائنس ٹیچر،\nایک انسٹرکشنل کوچ، اور حال ہی میں ایک ہائی اسکول کا پرنسپل تھا۔  SAT سے بہت واقف ہوں\nاور والدین اور طلباء اور اساتذہ کو تیار\nاور اس عمل میں شامل کرنا۔  SAT کے ساتھ چلنے والی تمام چیزوں کے بارے میں آج اپنی مہارت کا اشتراک کرتے ہوئے بہت خوشی ہوئی۔ \n - کمال ہے.  اس لیے میں\nاپنی اسکرین کا اشتراک کرنا بند کر دوں گا کیونکہ آج کا مقصد صرف ایک انٹرایکٹو،\nباہمی تعاون پر مبنی گفتگو کرنا ہے کہ ہم آپ کی مدد کیسے کریں گے اور\nطلباء کو ڈیجیٹل SAT کے لیے تیار کرنے کے بارے میں سوچ رہے ہیں۔ ہم سمجھتے ہیں کہ یہ وہ جگہ ہے\nجہاں آپ اسے دیکھ رہے ہیں، آپ میں سے جو آج یہاں ہیں،\nآپ ایک مختلف سفر میں ہیں۔ اور اگر آپ مستقبل میں اسے دیکھ رہے ہیں، تو ہو سکتا ہے کہ آپ\nٹائم لائن کے مختلف سفر میں ہوں۔ لیکن آج ہمارا مقصد واقعی\nآپ کو مختلف نقطہ نظر اور نقطہ نظر کے ذریعے یہ سمجھنے میں مدد کرنا ہے کہ\nطالب علم کس طرح ELA اور ریاضی میں ان کی مدد کر سکتے ہیں، خاص طور پر\nوبائی مرض کے بعد، جو بہت زیادہ تھا۔ میرا مطلب ہے، کیا کسی کو\n2019 کا سال یاد ہے؟ کوئی ہے؟\n(ریوین ہنستا ہے) میں، نہیں.  ٹھیک ہے؟ میرا مطلب ہے، کون جانتا ہے؟ تو ہم نئے ڈیجیٹل اسسمنٹ\nفارمیٹ میں کیسے منتقل ہو سکتے ہیں، یہ چیلنجنگ ہو سکتا ہے۔ لہذا ہم یہاں\nآپ کی مدد کرنے اور ٹکڑوں اور ہمارے نقطہ نظر کو سمجھنے کے لیے موجود ہیں۔ آپ چیٹ میں سوالات پوچھ سکتے ہیں۔ آپ چیٹ میں ایک دوسرے کے ساتھ تعاون کر سکتے ہیں\n یا آپ\nQ اور A سے سوالات جمع کر سکتے ہیں۔ لہذا میرے پاس دونوں تیار ہیں۔ میں اپنے پینلسٹس سے سوالات پوچھوں گا، لیکن براہ کرم، ہم\nآپ سے بھی سننا پسند کریں گے۔ تو ہمیں لات مارنے کے لیے، سارہ،\nSAT کافی عرصے سے موجود ہے۔ ہمارے پاس ڈیجیٹل ٹیسٹ کی منتقلی میں کئی ماہ باقی ہیں۔ اسکولوں میں منتقلی کیسی رہی ہے اور آپ نے ٹیسٹ کی تیاری کا کیسے مشاہدہ کیا ہے\n اور یہ کیسا ہے، کیسا رہا؟ - ضرور.  آپ جانتے ہیں، تبدیلی مشکل ہے. اور اس سال اس میں بہت کچھ تھا۔ اگر آپ نے SAT اسکول کے دن کا انتظام کیا ہے یا اگر آپ ہفتے کے آخر میں امتحانی مرکز تھے، تو آپ غالباً ان بہت ساری انتظامی تبدیلیوں پر توجہ مرکوز کر رہے ہوں گے جو ڈیجیٹل ٹیسٹ کے ساتھ ہونی تھیں۔ لہذا بلیو بک کو کیسے انسٹال کیا جائے، طلباء بلیو بک میں کیسے لاگ ان ہوتے ہیں،\nٹول کٹ کی جانچ، آرڈرنگ، رجسٹریشن،\nکمرے، اپنے عملے کو تربیت دینا، وہ تمام لاجسٹک چیزیں اس سال اساتذہ کے لیے بہت کچھ تھیں اگر آپ نے اپنی عمارت میں انتظام کیا۔ لیکن اب امید ہے، ہو سکتا ہے کہ آپ کے پاس ایک یا ایک سے زیادہ ایڈمنسٹریشن ہوں اور آپ حقیقت میں ٹیسٹ کے انتظام کے بارے میں تھوڑا زیادہ پراعتماد محسوس کریں اور آپ اب توجہ مرکوز کر سکتے ہیں،\nآپ جانتے ہیں، طلباء کی مدد کرنے اور واقعی اس ڈیٹا میں غوطہ لگانے پر\nجو آپ کو حاصل ہو سکتا ہے۔  . - زبردست۔ الزبتھ، کس بارے میں، آپ نے اپنے نقطہ نظر سے کیا دیکھا ہے؟ - ٹھیک ہے، آپ جانتے ہیں، جیسا کہ سارہ نے کہا، تبدیلی واقعی مشکل ہے۔ اور مجھے ایماندار ہونا پڑے گا، میں نے بہت طویل عرصے تک\nگہرے قارئین کے ساتھ کام کیا ہے اور \nانہیں SAT کے ساتھ فنش لائن تک پہنچانے کی کوشش کی ہے اور میں ان تمام تبدیلیوں سے بے چین تھا۔ میں اساتذہ کے لیے گھبرا گیا تھا، خاص طور پر کلاس رومز کو پڑھنے میں، متن کی تشریح کرنے اور اپنی انگلیوں سے متن کے ساتھ کام کرنے، متن کو ڈیجیٹل فارمیٹ میں تبدیل کرنے میں۔ اور آپ کے ساتھ سچ پوچھیں تو، جیسا کہ سال گزرتا گیا، منتقلی\nمیری توقع سے کہیں زیادہ ہموار تھی۔ اگر آپ گزشتہ موسم گرما میں مجھ سے بات کر رہے تھے، تو\nمیں بہت گھبرایا ہوا تھا۔ لیکن ایک بار جب ہم چیزوں کے جھولے میں آگئے اور طلباء\nخان اکیڈمی میں مشق کر رہے تھے اور وہ\nان ڈیجیٹل آئٹمز سے روشناس ہو رہے تھے، تو مجھے ایسا محسوس ہونے لگا، اضلاع مجھے واپس رپورٹ کر رہے تھے جیسے وہ اس کے ساتھ بہت اچھا کر رہے ہیں۔ اور وہ\nآن لائن کیلکولیٹر اور اس جیسی چیزوں کے ساتھ اچھا کام کر رہے ہیں۔ اب میں جن اضلاع سے\nبات کر رہا ہوں، طلباء دوبارہ معلمین کو اطلاع دے رہے ہیں\n کہ، آپ جانتے ہیں، انہیں\nیہ بہت اچھا لگا۔ یہ اتنا لمبا نہیں تھا۔  کچھ سوالات کے ذریعے حاصل کرنا تھوڑا سا آسان تھا۔ ظاہر ہے کہ ڈیٹا ہمیں بتائے گا\nکہ یہ آسان تھا یا نہیں، لیکن آپ جانتے ہیں کہ طلباء اس ڈیجیٹل فارمیٹ پر\nتھوڑا بہتر جواب دے رہے ہیں، یہ \nمیرے لیے نہ صرف ایک اچھا تعجب تھا، بلکہ یہ پرجوش بھی تھا، آپ\nجانتے ہیں، ہمارے ضلعی شراکت داروں سے اس تاثرات اور خبروں کو سننے کے لیے۔ - اوہ، بالکل. میں، کیا آپ سب کو SAT لینا یاد ہے؟ یاد ہے جب 19 میں- (ڈینیل نے اپنا گلا صاف کیا) تبدیلی ہمیشہ مشکل ہوتی ہے، ٹھیک ہے؟ ریوین، آپ\nاپنے نقطہ نظر سے کیا دیکھ رہے ہیں؟ - تو میں صرف یہ کہنا چاہتا تھا کہ پچھلے سال، ہم کالج بورڈ کے ساتھ شراکت داری کر رہے تھے، جو کہ اتنی بڑی\nشراکت داری ہے جو ہمارے پاس تھی۔ اور ہم نے\nپچھلے سال اپنے اضلاع کی تبدیلی شروع کردی۔ ہم نے انہیں تیار کرنا شروع کر دیا،\nہم نے ان کی تیاری شروع کر دی، ہم نے انہیں زیادہ سے زیادہ معلومات دینا شروع کر دیں،\n جتنا ہم کر سکتے تھے، انہیں تیار کر سکتے ہیں، ان کے طلباء کو تیار کر سکتے ہیں، ایک\nطرح کا منصوبہ ہے۔ تو مجھے ایسا لگتا ہے جیسے وہ تیار تھے۔ انہوں نے ہم سے مدد کے لیے رابطہ کیا، جس پر ہمیں\nان کے ساتھ تعاون کرنے میں خوشی ہوئی۔ اور پھر\nخان اکیڈمی کے نئے SAT کورس اور بلیو بک ایپ کی مدد سے، ہم طلباء کو تیار کرنے میں کامیاب ہو گئے۔\n اور جیسا کہ سارہ نے کہا، میرے\nخیال میں سب سے بڑی تبدیلی اساتذہ اور منتظمین کے لیے تھی۔ ہمارے بچے بہت لچکدار ہیں، ٹھیک ہے؟ وہ اتنی جلدی ٹکنالوجی کی طرف لے جاتے ہیں۔ تو یہ طالب علموں کے لیے اتنا مشکل نہیں تھا۔ اساتذہ کے لیے تیار کرنا مشکل تھا میرے خیال میں سب سے زیادہ۔ لیکن جیسا کہ الزبتھ نے کہا،\nصرف ڈیٹا ہی بتائے گا۔ اور میں سمجھتا ہوں کہ خان اکیڈمی میں طالب علموں کی تیاری کے ساتھ، میں اضلاع سے یہ سن کر بہت پرجوش ہوں کہ ایک بار جب وہ وہ اسکور واپس حاصل کرنا شروع کر دیں گے۔ - بالکل اور ایک بار پھر، چیٹ میں،\nاگر آپ گھنٹی بجانا چاہتے ہیں، تو تبدیلی کے ساتھ آپ کا تجربہ کیا تھا؟  کیا اس نے کام کیا؟  آپ اس کے بارے میں کیسا محسوس کر رہے ہیں؟ اور سارہ، چونکہ ہم کالج بورڈ سے رابطہ قائم کرنے والے ہیں،\n میں آپ کے لیے SAT کی تیاری کے لیے خان اکیڈمی کے طریقہ کار کے بارے میں سوچنا پسند کروں گا۔\n ہم\nخان اکیڈمی میں اس کے ذریعے طالب علموں کو تیار رہنے اور اس بات کو یقینی بنانے میں کس طرح مدد کرتے ہیں کہ وہ\nسمجھ رہے ہیں کہ کیا کرنا ہے؟ - ضرور. میرا مطلب ہے، میرا خیال ہے کہ جب ہم\nSAT پریپ کے بارے میں سوچتے ہیں، تو ہم ان تمام تیاری کی سرگرمیوں کے بارے میں سوچتے ہیں۔\n آپ جانتے ہیں، بلیو بک سے واقفیت، کتنے سوالات،\nسوالات کی قسم، ٹائم مینجمنٹ۔ اور جب کہ اہم اور طالب علموں کے پاس\nان مہارتوں کی ضرورت ہوتی ہے، جس پر ہم واقعی توجہ مرکوز کرنے کی کوشش کرنا چاہتے ہیں اور واقعی SAT سکور کو بہتر بنانا چاہتے ہیں اور یقیناً اس کا مطلب ہے کالج کی تیاری 'کیونکہ SAT کو\nپیمائش کرنے کے لیے ڈیزائن کیا گیا ہے۔ ہمیں واقعی مہارتوں پر توجہ دینے کی ضرورت ہے۔ اور یہ صرف SAT پر مہارتیں نہیں ہیں، یہ پڑھنے\nاور لکھنے اور ریاضی کی پائیدار مہارتیں ہیں جو طلباء کو\nنہ صرف کالج کی تیاری کے لیے، بلکہ اپنے دوسرے ہائی اسکول کورسز میں کامیاب ہونے کے لیے بھی جاننے کی ضرورت ہے۔ لہذا میں سمجھتا ہوں کہ ان پائیدار مہارتوں پر ہماری توجہ\nواقعی، واقعی اہم ہے۔ - آپ کا شکریہ. تو الزبتھ، ہمیں بتائیں کہ ہم خان اکیڈمی میں کس طرح مہارت حاصل کرتے ہیں۔ - جی ہاں، بہت اچھا سوال. جیسا کہ ریوین نے کہا، آپ جانتے ہیں، ہم کالج بورڈ کے ساتھ شراکت دار ہیں، اس لیے وہ ان سوالات کو ڈیزائن کرنے میں ہماری مدد کرتے ہیں تاکہ یہ یقینی بنایا جا سکے کہ وہ 100% منسلک ہیں۔ لیکن آپ جانتے ہیں،\nمہارتوں کے بارے میں خاص طور پر بات کرتے ہوئے، ہمارے دونوں ڈیجیٹل SAT کورسز، ریاضی اور پڑھنے اور لکھنے میں\nمہارتوں کا ایک سلسلہ ہے۔ ریاضی والے کے پاس 111 اور ELA والے میں تقریباً 41 سے 50 مہارتیں ہیں۔ اور جب ہم مہارت سیکھنے کے بارے میں بات کرتے ہیں اور ہم اپنے طلباء کے بارے میں بات کرتے ہیں کہ وہ ان مہارتوں کو\nمستند طریقے سے سیکھ رہے ہیں، جیسا کہ سارہ\nکالج اور کیریئر اور عام طور پر صرف زندگی کا ذکر کر رہی تھیں۔ مجھے خان اکیڈمی کے بارے میں جو چیز پسند ہے وہ یہ ہے کہ\nطلباء، اساتذہ اور\nمنتظمین \nان مہارتوں پر طالب علم کی مہارت کی سطح کو ٹریک کرنے کے قابل ہیں۔ اور اس طرح سارا سال، اگست سے شروع ہو کر، ہم\nان مہارتوں کے ذریعے کام کرنے والے طلباء کا سراغ لگا رہے ہیں اور آیا وہ\n ان مہارتوں میں مہارت حاصل کر رہے ہیں یا نہیں۔ کیونکہ اگر وہ ماہر ہیں،\nتو میں، ایک استاد کے طور پر، زیادہ پر اعتماد ہوں کہ\n \nجب وہ ٹیسٹ کے دن PSAT یا SAT کی بات کرتے ہیں تو وہ خود اس سوال کا جواب دینے کے قابل ہوں گے۔ اور اس لیے یہ وہ چیز ہے\nجس میں میں، سارہ، اور ریوین\nہمارے ضلعی شراکت داروں کے ساتھ بہت محنت کرتے ہیں، آپ جانتے ہیں، یہاں وہ مہارتیں ہیں جن میں آپ کے طلباء بہترین کارکردگی کا مظاہرہ کر رہے ہیں۔ \n حمایت جاری ہے. اور اس طرح واقعی وہی ہے جو\n ہمارے شراکت داروں کے ساتھ ہر\nوقت ہماری بات چیت کو فریم کرتا ہے، کیا مہارتیں ہیں اور طلباء\nان مہارتوں پر کیسے کام کر رہے ہیں؟ - اور ریوین، آپ کے نقطہ نظر سے، \nجب مہارت کی بات آتی ہے تو آپ اور کیا سوچتے ہیں؟ کیونکہ میں جانتا ہوں کہ آپ\nہنر کے بارے میں بہت سوچ رہے ہیں۔ - جی ہاں۔ تو صرف الزبتھ اور سارہ نے جو کچھ کہا اس کو ختم کرنے کے لیے،\n خان اکیڈمی کے بارے میں سب سے بڑی بات یہ ہے کہ یہ\n SAT کے لیے ون اسٹاپ شاپ ہے، ٹھیک ہے؟ جیسے طلباء اندر جا سکتے ہیں، وہ\nکورس کا چیلنج لے سکتے ہیں۔ یہ ہمیں، تعلیمی سال کے آغاز سے ہی اساتذہ کو دے سکتا ہے\n جہاں\nانہیں جھکنے کی ضرورت ہوتی ہے۔ لہٰذا وقت ضائع کرنے کے بجائے، بچوں کو صرف ایک قسم کی ڈرل اینڈ مارنا، ہم یہ طریقہ اختیار کرنے والے ہیں، آئیے کس چیز کی طرف جھکاؤ  انہیں ضرورت ہے۔ اگر وہ اسے پہلے سے جانتے ہیں تو رہنے دیں، وہ یہ مہارتیں\nپورے تعلیمی سال میں اپنے استاد سے حاصل کریں گے۔ لیکن وہ مہارتیں جن پر انہیں تھوڑی بہت اضافی مدد کی ضرورت ہے،\nہم وہاں جھکنے والے ہیں اور پھر اساتذہ\nاپنی رپورٹس دیکھیں گے اور پھر واپس جائیں گے اور\nہو سکتا ہے چھوٹے گروپ بنائیں یا اپنے کورس سے باہر اضافی کمک اسائنمنٹ دیں۔ مہارت کا مقصد. تو ہم تھے، ہم نے\nکالج بورڈ کے ساتھ صف بندی کرتے ہوئے ایک اچھا کام کیا اور\n اپنے SAT پریپ کورس میں ان تینوں مختلف زمروں کو بنایا۔ ہمارے پاس فاؤنڈیشن،\nمیڈیم اور ایڈوانس ہے۔ تو بالکل SAT کی طرح\nکیونکہ یہ اب موافقت پذیر ہے، ہم اس بات کو یقینی بنانا چاہتے ہیں کہ ہمارے\nطلباء کو وہ سب کچھ مل رہا ہے جس کی انہیں امتحان کے تمام شعبوں میں ضرورت ہے۔\n - یہ بہت اچھا ہے. لہذا میں چاہتا ہوں کہ ہم\nکورسز کے استعمال میں AI کے بارے میں کس طرح سوچ رہے ہیں اس پر اب پرت شروع کریں۔ تو سارہ، AI کے بارے میں سوچتے ہوئے،\nکچھ چیلنجز اور مواقع کیا ہیں جو\n ڈیجیٹل SAT پریپ کے لیے AI کا استعمال کرتے وقت پیش کیے جاتے ہیں؟ - ہاں، میرے ذہن میں آنے والی فوری مثالوں میں سے ایک یہ ہے کہ \nجب میں سائنس پڑھا رہا تھا، ہم نے ایک SAT پریپ بوٹ کیمپ کیا\nجو کہ دو ہفتے کے کورس کی طرح تھا جسے ہم نے طلباء کو\nگرمیوں کے دوران لیا تھا۔ وہ اس کے لیے سائن اپ کر سکتے تھے۔ لیکن میں نے واقعی یہ\nجاننے کے لیے جدوجہد کی کہ اسے کیسے سکھایا جائے، طلبہ کو\nاس مواد میں سے کچھ میں کیسے مشغول رکھا جائے جو آپ جانتے ہیں،\nشاید ان کے لیے بہت پرجوش ہے۔ میں جانتا ہوں کہ آپ میں سے بہت سے لوگوں کے پاس شاید\n آپ کے اسکول میں SAT پریپ کورسز یا الیکٹیو ہیں۔ اور اس لیے میں سوچتا ہوں کہ جہاں AI\n میرے لیے ایک موقع ہو سکتا تھا اور میرا\nکافی وقت بچا سکتا تھا وہ ہے ہمارے خانمیگو ٹیچر ٹولز کو استعمال کرنا۔ اور اس طرح اس نے\nمیری زندگی کو بہت آسان بنا دیا تھا کیونکہ میں نے یہ جاننے کی کوشش میں بہت وقت صرف کیا کہ\n طالب علموں کو کس طرح مصروف رکھا جائے\nاور ان چیزوں کو کیا جائے۔ لیکن ہمارے پاس سبق کی منصوبہ بندی کے جنریٹر ہیں جو بہت مددگار ثابت ہوتے۔ خانمیگو ٹیچر ٹول کی طرح ہے جہاں یہ معلوماتی متن تخلیق کرتا ہے اور جیسا کہ ہم جانتے ہیں، پڑھنے کی قسم، اور قریب سے پڑھنے کی\nمہارت کا ہونا انتہائی اہم ہے۔ اس طرح\nمیرے طلباء کے لیے وہ معلوماتی متن تیار کرنا جس کے ساتھ مشق کر سکیں۔ ہمارے پاس خانمیگو ٹیچر\nٹول ہے اسے متعلقہ رکھنے کے لیے، حقیقی دنیا کے سیاق و سباق کے جنریٹرز، وہ\nتمام چیزیں جن کے بارے میں میں نے صرف اتنی\nذہنی توانائی صرف کی ہے کہ اپنے طور پر سامنے آئیں، Khanmigo یہ\nمیرے لیے کر سکتا تھا۔ اور اس لیے میری خواہش ہے کہ میرے پاس وہ ٹولز واپس اپنے تدریسی دن میں،\nدن میں واپس ہوتے۔ (ریوین ہنستا ہے) - کوئی اور ایسا محسوس کرتا ہے؟ کوئی اور منصوبہ بندی پر کوئی بھی وقت خرچ کرتا ہے۔ (ریوین ہنستا ہے)\nبس مذاق کر رہا ہوں۔  میں جانتا ہوں تم ہو۔ تو الزبتھ، میں آپ کو ہمدرد دیکھ رہی ہوں، واقعی میں اپنا سر ہلا رہی ہوں۔\nیہ وہیں لفظ ہے۔ تو آپ گفتگو میں کیا اضافہ کرتے ہیں؟ - ہاں، میرا مطلب ہے، مجھے یاد ہے کہ\nبہت سارے اتوار میری متعدد تیاریوں کی تیاری کرتے تھے اور آپ جانتے ہیں، اس بات کو یقینی بناتے ہوئے کہ میں نے\nہفتے کے لیے ہر چیز کی منصوبہ بندی کی تھی۔ اور یہ میرے لیے حیرت انگیز ہے کہ اس میں سے کچھ اب خانمیگو کے ساتھ کتنی جلدی خودکار ہو جاتے ہیں۔ آپ جانتے ہیں، AI ہم سب کے لیے نیا ہے۔ خانمیگو، آپ کو معلوم ہے کہ وہاں موجود دیگر AI ٹولز میں سے کئی\nنہ صرف ہمارے لیے نئے ہیں جیسے کہ خان اکیڈمی اور\nاس کال پر میرے ساتھیوں کے لیے، بلکہ آپ جانتے ہیں، یہ ہمارے اساتذہ کے لیے نیا ہے، یہ ہمارے والدین،\nہمارے ضلعی منتظم کے لیے نیا ہے۔ اور یہ واقعی ایک بہت اچھا سال رہا ہے صرف ایک قسم کی دریافت اور سیکھنے کا۔ اور میں سمجھتا ہوں، آپ جانتے ہیں،\n آج کلاس روم میں اساتذہ کو جن چیلنجوں کا سامنا ہے ان میں سے ایک یہ ہے کہ طالب علموں کو یہ\nسمجھنا ہے کہ خانمیگو اور اے آئی کے ساتھ کیسے بات چیت کی جائے اور میں واقعی اس نتیجے پر پہنچا ہوں کہ بہت ساری ماڈلنگ ہے\nجس میں شامل ہونے کی ضرورت ہے۔ ہمارے طلباء کے لیے۔ آپ جانتے ہیں، یہ گوگل نہیں ہے۔  صرف جواب حاصل کرنے کا یہ کوئی تیز طریقہ نہیں ہے۔\n آپ کو واقعی\nطالب علموں کے ساتھ کام کرنا ہوگا کہ آپ Khanmigo سے کیسے بات کرتے ہیں اور آپ خانمیگو کو مستند طریقے سے کس طرح استعمال کر سکتے ہیں تاکہ آپ کو سیکھنے میں مدد ملے اور، آپ جانتے ہیں،\nنئی مہارتوں اور کاموں کو سمجھنے میں۔ جہاں میں دیکھتا ہوں کہ یہ واقعی فائدہ مند ہے جیسا کہ SAT پریپ ہے، آپ جانتے ہیں، کلاس روم میں چھوٹے گروپ کی ہدایات اور آپ جانتے ہیں، \nہر ایک میز پر ایک ذاتی ٹیوٹر رکھنا۔ لہذا\nکلاس روم میں عام طور پر صرف ایک استاد ہوتا ہے۔ اگر وہ خوش قسمت ہیں تو انہیں\nدو یا ایک امداد یا ایک مددگار ملتا ہے۔ لیکن طلباء کو فوری طور پر فیڈ بیک حاصل کرنے اور کسی ایسی چیز کے ذریعے کام کرنے کے قابل ہونا\nجسے وہ اپنے ساتھ استاد کے بغیر سیکھنے کی کوشش کر رہے ہیں، \n میں واقعی میں سوچتا ہوں کہ اس\nسب میں کیا طاقتور ہے۔ اور جب بات SAT کی تیاری کی ہو، تو آپ جانتے ہیں، تمام طلباء ہر طرح کی\nمدد کے مستحق ہیں جو وہ حاصل کر سکتے ہیں اور یہ یقینی طور پر ایسی چیز ہے جسے\nمیں مستقبل میں کلاس رومز میں انتہائی طاقتور ہوتے ہوئے دیکھ رہا ہوں۔ - اوہ، بالکل. میرا مطلب ہے، ٹیکنالوجی بہت طویل سفر طے کر چکی ہے، لیکن جیسا کہ ہم نے اشتراک کیا ہے، تبدیلی مشکل ہو سکتی ہے۔ میرا مطلب ہے، مجھے یاد ہے کہ SAT پریپ\nاس طرح کی ایک بڑی کتاب تھی۔ ایک بار پھر، آپ سب کو یاد ہے، میرا مطلب ہے، سال میں، بلہ، بلہ بلہ۔ تو ارتقاء کے بارے میں سوچتے ہوئے،\nAI، Raven کے بارے میں سوچتے ہوئے، آپ ان اضلاع میں کیا دیکھ رہے ہیں جن کے ساتھ آپ مواقع اور چیلنجوں کے بارے میں کام کرتے ہیں؟ - تو، آپ جانتے ہیں، مواقع\nصرف ایکویٹی ہیں، ٹھیک ہے؟ ہم جانتے ہیں کہ ہر ایک کی\nماں نہیں ہوتی جو گھر میں رہتی ہو یا ٹیوٹر تک رسائی حاصل کرتی ہو۔ لہٰذا یہ حقیقت کہ ہمارے پاس ایک ٹول ہے جسے تمام طلبا استعمال کر سکتے ہیں اس سے\nقطع نظر کہ وہ کسی بھی گریڈ کی سطح، کس حالت میں ہیں، حیرت انگیز ہے۔ آپ جانتے ہیں، اور ایمانداری سے،\nمیرے دو نوجوان ہیں اور میں وہ تمام چیزیں نہیں جانتا جو وہ اب سیکھ رہے ہیں\nحالانکہ میں ایک معلم ہوں۔ تو ذرا تصور کریں کہ ایک\nغیر معلم والدین ان تمام مختلف چیزوں کو نیویگیٹ کرنے کی کوشش کر رہے ہیں جو طلباء آج کل سیکھ رہے ہیں۔ لہذا نہ صرف یہ والدین کی مدد کر سکتا ہے، کیونکہ میں\nاپنے بچوں کی مدد کے لیے خانمیگو کو اکثر استعمال کرتا ہوں، لیکن یہ، جیسا کہ الزبتھ نے کہا، یہ پورے ملک میں ہر ایک کلاس روم میں\nہر ایک طالب علم کے لیے ایک ذاتی ٹیوٹر ہے۔ \n اور آپ جانتے ہیں، بالکل کسی نئے ٹول کی طرح، چیلنجز ہمیشہ\nوقت کے ساتھ آتے ہیں، ٹھیک ہے؟ میں کب\nاپنے اساتذہ کو اس کو استعمال کرنے کی تربیت دوں گا؟ میں اسے کیسے استعمال کروں گا\nتاکہ، آپ جانتے ہیں، وہ اسے محفوظ طریقے سے استعمال کر رہے ہیں؟ یہ وہ تمام چیزیں ہیں\nجو ہمیشہ چیلنجز ہوتی ہیں۔ لیکن میں خان اکیڈمی میں ایسا محسوس کرتا ہوں\n، ہم نے واقعی، ہم نے ان تمام چیزوں کا پتہ لگانے میں بہت اچھا کام کیا،\n آپ جانتے ہیں، جب کہ اعتدال پسندی اور اساتذہ کو\nچیٹ کی نگرانی کرنے اور والدین کو\nاکاؤنٹس سے منسلک کرنے کے قابل ہونے کے ساتھ ساتھ ان کی چیٹ کی نگرانی کریں. تو ہمیشہ\nچیلنجز ہوں گے کیونکہ ChatGPT اور تمام AI ٹیکنالوجی\nمسلسل بدل رہی ہے، ٹھیک ہے؟ بڑے لینگویج ماڈل فریب دیتے ہیں،\nیہاں تمام چیزیں موجود ہیں، لیکن آپ جانتے ہیں، کسی بھی نئی ٹیکنالوجی یا کسی بھی نئے نصاب کے ساتھ، اسکول میں موافقت یا ان میں سے کوئی بھی چیز\nہمیشہ مشکل ہوتی ہے۔ اور یہ صرف، آپ کو\nمعلوم ہے، درست رہنما اور ہم آپ کو\nعمل درآمد کے ذریعے رہنمائی کرنے کی ضرورت ہے تاکہ یہ یقینی بنایا جا سکے کہ\nچیلنجز کم سے کم ہوں۔ لیکن میں ہائی اسکول کا سابق پرنسپل نہیں بنوں گا\n اگر میں یہاں بیٹھ کر کہوں کہ\nکوئی چیلنج نہیں ہوگا کیونکہ وہ یقینی طور پر ہوں گے۔ لیکن آپ جانتے ہیں، امید ہے کہ یہ وہ چیزیں ہیں جن کا ہماری ٹیم اور آپ کے لیے پتہ لگا سکتی ہے اور ان میں سے کچھ چیزوں کو نیویگیٹ کرنے میں آپ کی مدد کر سکتی ہے۔\n - ٹھیک ہے؟ اور\nچیٹ میں ایک بصری ڈیمو کے بارے میں ایک سوال تھا۔ ہم آج مزید گفتگو پر توجہ مرکوز کرنا چاہتے ہیں،\n لیکن ہم کرنے والے ہیں، اس سے پہلے کہ\nہم آج آپ سب کو چھوڑ دیں، ہم آپ کو کچھ دیں گے،\nآپ کو ایک ایسی سمت بتائیں گے جہاں آپ چیزوں تک رسائی حاصل کر سکیں\nاور چیزیں دیکھ سکیں اور بہت سارے وسائل موجود ہیں، لیکن ہم آپ کو بہت ساری چیزیں دکھانے کے بجائے آپ کو معلم کا مزید نقطہ نظر دینے کی کوشش کر رہے ہیں۔ (ریوین ہنستا ہے)\nیہ بہت اچھا ہے۔ یہ بہت ہی زبردست ہے۔ تاہم، ہم اس کے پیچھے کیوں اور کیسے ہیں اس کے بارے میں مزید بات کرنا چاہتے ہیں اور جیسا کہ ریوین نے کہا، میں آپ کو تھوڑی سی\nمزید معلومات دوں گا کہ ہم\nاس کام میں آپ کا ساتھ دینا پسند کریں گے۔ لیکن میں\nسیکھنے اور مہارت حاصل کرنے کی طرف واپس جانا چاہتا ہوں۔ یہ ایک ایسی اصطلاح ہے جو واقعی دلچسپ ہے کہ مجھے لگتا ہے کہ ہمیں تعلیم کے تحفظ کے بارے میں تعلیم کی چھتوں سے مزید بات کرنے کی ضرورت ہے۔ \n مہارت میں مہارت حاصل کرنے کا کیا مطلب ہے؟ تو سارہ، میں آپ کے لیے یہ سوچنا پسند کروں گا کہ\n مہارت سیکھنے کا کیا کردار ہے اور یہاں تک کہ\nنئے ڈیجیٹل SAT فارمیٹ کے ساتھ طلباء کی مدد کرنا؟ - ہاں، میں سمجھتا ہوں کہ\nمہارت سیکھنے کی موروثی نوعیت اس بات کو یقینی بنانا ہے کہ طلباء کی\nبنیاد مضبوط ہو اور وہ ضروری\nعلم جس پر استوار ہو۔ لہذا ان کے سیکھنے میں کوئی خلاء نہیں ہے، کوئی سوراخ نہیں ہے۔ اور پھر ڈیجیٹل SAT\nپریپ کورس اس کی عکاسی کرتا ہے، اور ریوین نے اس سے پہلے اس بات کا ذکر کیا، ان مہارتوں کا سہارا لے کر، ہمارے پاس وہ بنیادی\nسطحیں ہیں، درمیانی مشکل، \nنہ صرف اس مہارت کی وسعت کو یقینی بنانے کے لیے جو ہم\nپیش کر رہے ہیں۔  وہ اس کے مطابق ہیں جس کا SAT پر اندازہ کیا جا رہا ہے اور دوبارہ، وہ پائیدار مہارتیں، لیکن ان مہارتوں کی گہرائی بھی۔ - جی ہاں، بالکل. میرا مطلب ہے کہ SAT کے بارے میں سوچنا بھی،\nہم اسے کیوں لے رہے ہیں؟ کوئی، Bueller؟  صرف مذاق کر رہا ہے. ہم اسے لے رہے ہیں تاکہ طلباء سیکھنا\nجاری رکھ سکیں، سیکھنے میں مہارت حاصل کرتے رہیں، امید ہے کہ مختلف اداروں میں۔ تو سارہ یا الزبتھ، آپ نے مہارت سیکھنے کے بارے میں اپنے نقطہ نظر سے کیا دیکھا ہے ؟ - ٹھیک ہے، آپ جانتے ہیں،\nمیرے لیے مہارت سیکھنا ہمیشہ سے رہا ہے، آپ جانتے ہیں، طلباء\nواقعی اس مہارت کی گہرائی تک پہنچتے ہیں اور\n کئی بار اس پر مہارت کو دوبارہ پیدا کرنے کے قابل ہوتے ہیں۔ اور واقعی ہمارے طلباء کے لیے\n خان اکیڈمی میں کسی ہنر میں مہارت دکھانے کے لیے، انہیں اسے کم از کم دو بار دیکھنا ہوگا اور اس مہارت کو\nاسیسمنٹ یا یونٹ کوئز یا کورس کے چیلنج پر درست کرنا ہوگا۔ لہذا میں ہمیشہ یہ\nجان کر زیادہ پر اعتماد محسوس کرتا ہوں کہ جب طالب علم نے\nاس مہارت میں مہارت حاصل کی ہے، تو یہ وہ چیز ہے جسے وہ مشق کے ذریعے\nمتعدد بار کرنے میں کامیاب رہے ہیں۔ ایک اور چیز جو میں دیکھ رہا ہوں کہ میں واقعی\nفائدہ مند ہوں وہ ہے طلباء، والدین اور\nاساتذہ اور منتظم یہ جان سکتے ہیں کہ طلباء کس طرح اور پسند کرتے ہیں، یا طلباء نے کتنی مہارتوں میں\nمہارت حاصل کی ہے۔ لہذا ہمارے پلیٹ فارم میں آپ\n یونٹ کے لحاظ سے یا پورے کورس کے ذریعے مہارت کی پیشرفت کو ٹریک کرسکتے ہیں اور آپ طلباء کو مصروف رکھ سکتے ہیں۔ جب ہم\nیہاں طالب علم کی مصروفیت کے بارے میں بات کر رہے ہیں، تو آپ جانتے ہیں، سارا سال، آپ نے اس کورس میں کتنی مہارت حاصل کی ہے؟ اور اس بات کو یقینی بنانا کہ\nطلباء، آپ جانتے ہیں، ترقی اور\nمہارت حاصل کرنا جاری رکھے ہوئے ہیں۔ مجھے لگتا ہے کہ یہ ہمیشہ ایسا ہی ہوتا ہے جیسے اس پہیلی کا بڑا ٹکڑا طلباء کی حوصلہ افزائی کرتا ہے۔ اور اس طرح اگر طلباء\nاس آخری مقصد کو ذہن میں رکھتے ہیں اور وہ جانتے ہیں کہ جیسے،\nارے، اگر میں اس کورس میں 80 یا 90 فیصد مہارت حاصل کر سکتا ہوں، ارے، جیسے میں اس دن\nبہت زیادہ پر اعتماد ہو جاؤں گا جس دن مجھے بیٹھنا ہے۔  SAT. تو ہاں، مجھے یہی پسند ہے۔ اور مجھے یہ بھی پسند ہے کہ طالب علم سے لے کر\nڈسٹرکٹ ایڈمن تک یہ کس طرح شفاف ہے۔ یہ میرے لیے واقعی اہم ہے\nتاکہ ہر کوئی طلبہ کے ساتھ اس گفتگو میں شامل ہو سکے۔ - اوہ، بالکل. میرا مطلب ہے، ایک ضلع، مدت میں تمام اسٹیک ہولڈرز کے لیے ڈیٹا کی ملکیت اور مرئی ہونے کی ضرورت ہے۔  اس\n طرح اس کا\nگہرا اثر پڑے گا۔ لیکن ریوین، آپ کے نقطہ نظر سے، یہاں تک کہ ایک سابقہ ​​عمارتی سطح کے\nرہنما کے طور پر، آپ کیا کرتے ہیں، خاص طور پر SAT کے بارے میں سوچتے وقت، مہارتوں میں مہارت اور طالب علم کی مشغولیت کے بارے میں آپ کے کیا خیالات ہیں؟ - ہاں، میں صرف\nثانوی دنیا کے بارے میں سوچ رہا ہوں، تم جانتے ہو، ٹھیک ہے؟ آپ کے بچے مختلف\nٹریکس پر مختلف کام کرتے ہیں، ضلع بھر میں مختلف نظام الاوقات۔ تو حقیقت یہ ہے کہ مہارت\nسیکھنا ایک ایسی چیز ہے جسے اساتذہ پہلے دن کا تعین کر سکتے ہیں\nاور بس اسے بہنے دیں اور بچے\nاپنے راستے پر چلیں گے، یہ بہت اچھا ہے کیونکہ اس میں وقت کم ہے، ٹھیک ہے؟ اساتذہ کے لیے۔ اب اساتذہ\nطالب علم کے چہرے کے وقت اور ان مہارتوں پر توجہ مرکوز کر سکتے ہیں جن میں طلباء\nماہر نہیں ہیں، ٹھیک ہے؟ اور دینا، چھوٹے\nگروپوں کو کرنا اور اس کا انتظام کرنا اور پھر، آپ جانتے ہیں،\nاپنے PLCs کے دوران ڈیٹا کا استعمال کرتے ہوئے ایک قسم کے ٹریک پر کرنا، ٹھیک ہے، شاید\nیہ وہ چیز ہے جسے ہمیں اپنے\nنصاب یا ہدایات میں تبدیل کرنے کی ضرورت ہے۔ میں نے دیکھا کہ زیادہ تر بچے ادبی مساواتوں پر\nواقعی خراب کارکردگی کا مظاہرہ کر رہے ہیں، اس لیے شاید\nہمیں پیچھے ہٹ کر اس مہارت کو دوبارہ آزمانے کی ضرورت ہے۔ لیکن\nمہارت سیکھنے کے بارے میں بڑی بات یہ ہے کہ اگر کلاس میں میرے چھ مختلف\nدرجے ہیں، تو یہ ٹھیک ہے کیونکہ خان اکیڈمی\nانہیں اس راستے پر لے جائے گی جس کی انہیں ضرورت ہے جو ان کے سیکھنے کے مطابق ہو۔ اور ایسی کوئی چیز نہیں ہے جو اسے شکست دے سکے کیونکہ یہ ایک استاد کو لے جائے گا،\nجیسا کہ ڈینیئل نے کہا تھا، جب میں\nکچھ سال پہلے کلاس روم میں تھا، اس سے ایک استاد کو اس بات کا خاکہ بنانے میں کافی وقت لگے گا کہ اسے \nمختصر عرصے میں کیا سیکھنے کی ضرورت ہے۔ SAT سے پہلے کا وقت اور یہ\nایک قابل انتظام کام نہیں ہے۔ لہٰذا خان اکیڈمی کا استعمال کرتے ہوئے اس میں\nسے کچھ کو فلٹر کرنے کے لیے اور استاد کو طلبا کو اس راستے پر ڈالنے کے لیے کہنے کے لیے اور اس طرح کا راستہ اختیار کرنے کے لیے وہ\nاس طالب علم کے وقت پر توجہ مرکوز کر سکتے ہیں اور وہ ون آن ون بات چیت\nصرف ایک گیم چینجر ہے۔ اور ان طلباء کے لیے جو اونچی پرواز کرنے والے ہیں جو وہاں بیٹھ کر\nآپ کو سننا نہیں چاہتے، اندازہ لگائیں کیا؟ ان کی ضرورت نہیں ہے۔ وہ خان اکیڈمی میں جاتے رہتے ہیں\nجہاں ان کی ضرورت ہوتی ہے۔ اور یہ میرے لیے صرف ایک چیز ہے،\nآپ جانتے ہیں، بطور معلم اور ایک استاد،\nآپ جانتے ہیں کہ میرے بچے، میرے تمام بچوں کو وہ چیز مل رہی ہے جس کی انہیں ضرورت ہے اور یہ سب سے اہم چیز ہے۔ - ہاں. اور بس اس بات کو یقینی بنائیں کہ آپ واپس جائیں اور صرف ریوین نے جو کچھ کہا اسے دوبارہ سنیں۔\n اس نے ابھی بہت اچھا ڈیٹا (ریوین ہنستے ہوئے) گرا دیا،\n بہترین پریکٹس کی حکمت عملی اس بات کو\nیقینی بنانے کے لیے کہ آپ سوچ رہے ہیں اور طالب علم کی تعلیم میں مدد کے لیے\nمہارت پر مبنی تجزیہ استعمال کر رہے ہیں۔ تو اب ہم\nایک ٹائم مشین میں واپس جانے والے ہیں۔ یہ \"مستقبل کی طرف واپس\" نہیں ہے\nلیکن شاید یہ ہے۔ (ریوین ہنستا ہے)\nیہ صرف نہیں ہے۔ میں چاہتا ہوں کہ آپ دوبارہ سوچیں، اس وقت کے بارے میں سوچیں جب آپ\n اپنے ہائی اسکول کے کلاس رومز میں پڑھانے میں واپس آئے تھے، اگلے تعلیمی سال کے لیے شروع کرنے کے بارے میں سوچ رہے تھے۔\n آپ\nطلباء کو ڈیجیٹل SAT کے لیے تیار کرنے کے بارے میں کیسے سوچیں گے اور کیسے، اب ہم\n\"مستقبل کی طرف واپس\" کی طرح ہیں جہاں وہ اسی کی\nدہائی سے ہے لیکن ہوور بورڈ پر۔ تو آپ واپس آگئے جب آپ نے پڑھایا اور پھر اب آپ کے پاس خانمیگو ہے اور آپ کی مدد کے لیے خان اکیڈمی ہے۔ تو آپ اس کے بارے میں کیسے سوچیں گے اور پھر AI کے\nمتعارف ہونے سے یہ کیسے بدلے گا ؟ آپ ہمیں سارہ سے کیوں نہیں نکال دیتے؟ ڈیلورین میں۔\n(سارہ ہنستی ہے) اس مشابہت سے بہت زیادہ۔ ٹھیک ہے، سارہ آگے بڑھو۔ (ریوین ہنستا ہے) - تو مجھے لگتا ہے کہ زیادہ تر سب جانتے ہیں، سائنس کو براہ راست\nSAT پر نہیں ماپا جاتا ہے، ٹھیک ہے؟ لیکن پڑھنے اور لکھنے کے سیکشن اور ریاضی کے سیکشن میں ایسے سوالات ہوتے ہیں جن کا سائنس سیاق و سباق ہوتا ہے۔ لہذا میں سائنس کا استاد تھا اور صرف اس وجہ سے کہ سائنس کی\nپیمائش نہیں کی جا رہی ہے اس کا مطلب یہ نہیں ہے کہ میں ہک سے دور ہوں۔ میں اب بھی اپنے طلباء کی SAT کی تیاری میں مدد کر سکتا ہوں۔\n تو میں کیا کروں گا کہ میرے\nطلباء سائنس کورسز میں خان اکیڈمی میں داخل ہوں۔ اس لیے بائیولوجی\nکورس یا کیمسٹری کورس، فزکس یا سائنس،\nجو بھی آپ کرنا چاہتے ہیں، پر جائیں۔ اور ان کورسز کے اندر\nمضامین ہوتے ہیں اور ان مضامین میں بہت زیادہ معلوماتی سائنس پر مبنی متن ہوتا ہے۔ اور اس لیے جتنا زیادہ میں\nاپنے طلباء کو ان سائنس کے سیاق و سباق کے متن کو پڑھنے اور ان کو پڑھنے میں آرام دہ اور پرسکون ہونے کی اجازت دے سکتا ہوں، یہ \nان کے لیے اتنا ہی بہتر ہوگا جب وہ SAT لینے جا رہے ہیں۔ لہذا میں واقعی سائنس کے معلوماتی متن کے پڑھنے، قریبی پڑھنے کی مہارت پر توجہ دوں گا۔\n اور پھر اگر طلباء کو\nKhanmigo تک رسائی حاصل ہے، تو وہ، آپ جانتے ہیں،\nان مضامین پر بھی Khanmigo کا استعمال کر سکتے ہیں۔ ارے، وضاحت کریں، میں نہیں\nجانتا کہ اس لفظ کا کیا مطلب ہے، اس میں میری مدد کریں۔ تو پھر، یہ وہ\nذاتی ٹیوٹر ہے جو ان کو معلوماتی متن کے ذریعے جانے میں مدد دے رہا ہے، جو دوبارہ SAT پر ان کی مدد کرے گا۔ - یہ حیرت انگیز ہے. اور مجھے پسند ہے کہ آپ کس طرح اشتراک کر رہے ہیں، حالانکہ آپ جانتے ہیں،\nسائنس کا براہ راست اندازہ نہیں لگایا جاتا، مجھے لگتا ہے کہ بہت سارے مواد کے اساتذہ\nکبھی کبھی ایسے ہوتے ہیں، کیا؟ میرے مضمون کا اس سے کیا تعلق؟ (ریوین ہنستا ہے)\nلیکن صرف طلباء کی حمایت کرنا اور تنقیدی\nسوچ رکھنے والے، مشغول سیکھنے والے، جیسا کہ اس میں ٹیم کی کوشش کی ضرورت ہوتی ہے۔ تو اس کی نشاندہی کرنے کا بھی شکریہ۔ الزبتھ، آپ کی ڈیلورین ٹائم مشین میں آپ کا نقطہ نظر کیا ہے؟ - ٹھیک ہے، آپ جانتے ہیں، میں نے پانچ سال تک 11 ویں جماعت ELA کو پڑھایا اور مجھے ہمیشہ ایسا لگا جیسے میں بہت منظم ہوں۔ مجھے پسند ہے کہ چیزیں\nایک خاص وقت پر ہوتی ہیں۔ اور اس لیے میں واقعی اس طرح کی\nطرح پیچھے کی طرف کی منصوبہ بندی کروں گا، ٹھیک ہے، میرا SAT اسکول کا دن کب ہے؟ مجھے اپنے طلباء کو\nبلیو بک پر کب مشق کرنی چاہیے؟ اور واقعی\nاگست میں دو چیزوں کے ساتھ شروع کریں۔ پہلی چیز جو میں واقعی شروع کروں گا وہ ہے\nکورس چیلنج کے ساتھ۔ ہمارے ڈیجیٹل SAT کورسز میں بہت اچھی چیز یہ ہے کہ\nآپ پہلے سے تشخیص کی طرح کچھ تفویض کر سکتے ہیں۔ اسے کورس چیلنج کہا جاتا ہے۔ اور یہ طلباء کو،\nآپ جانتے ہیں، دونوں کورسز کی مہارتوں کا بے ترتیب نمونہ فراہم کرتا ہے۔ اور آپ یہ واقعی\nتعلیمی سال کے شروع میں کر سکتے ہیں اور فوری طور پر\nمہارت کا ڈیٹا واپس حاصل کرنا شروع کر سکتے ہیں۔ لہذا آپ طلباء کو ہنر کے لحاظ سے گروپ بنانا شروع کر سکتے ہیں،\n آپ اس بات کا اندازہ حاصل کرنا شروع کر سکتے ہیں کہ طلباء کن کن مہارتوں میں پہلے سے تھوڑا سا ماہر ہو سکتے ہیں اور کن کن چیزوں میں انہیں مدد کی ضرورت ہو سکتی ہے۔ لہذا میں یقینی طور پر\n اس ابتدائی ڈیٹا کو حاصل کرنے کے لئے کورس کے چیلنج سے شروع کروں گا۔ اور پھر میں، آپ کو معلوم ہے، AI کے ساتھ اور Khanmigo کے ساتھ،\nشاید \nسال کے شروع میں اپنے طلباء کے ساتھ ماڈلنگ میں کافی وقت گزاروں گا، آپ\nجانتے ہیں، ارے، یہ اس مسئلے کی ایک مثال ہے جسے میں\nنہیں جانتا  جواب دینے کا طریقہ. اگر یہ میں ہوتا تو یہ ریاضی کا مسئلہ ہوتا۔ کہ میں اپنے طلباء کے ساتھ ماڈلنگ کروں گا۔ اور واقعی\nطالب علموں کو دکھائیں کہ آپ \nسوال کا جواب دینے یا ویڈیو کا خلاصہ یا\nمضمون کا خلاصہ کرنے کے لیے خانمیگو کے ساتھ کس طرح آگے پیچھے مشغول ہو سکتے ہیں۔ میں یہ بھی سوچتا ہوں کہ باہمی تعاون کے\nجوڑے، طلباء خانمیگو کے ساتھ مل کر کام کرتے ہیں تاکہ وہ دیکھیں کہ وہ کیا دریافت کرتے ہیں اور یہ دیکھتے ہیں کہ وہ کیا سیکھتے ہیں یہ بھی تعلیمی سال کے شروع میں میرے معمول کا حصہ ہوگا۔ اور پھر موسم خزاں کی طرف بڑھتے ہوئے، آپ جانتے ہیں، واقعی مہارت کے اعداد و شمار اور میری مہارت کے اعداد و شمار کو دیکھنا شروع کر رہے ہیں۔ تو، آپ جانتے ہیں، کیا میرے\nطلباء نے 15 اکتوبر تک کورس کے کم از کم 15% میں مہارت حاصل کی ہے ، مجھے\nنہیں معلوم؟ اور صرف اس بات کو یقینی بنانا کہ\nمیرے طلباء ہنر کے ذریعے آگے بڑھتے رہنے کے راستے پر ہیں\n اگر میں\nآج ELA کلاس روم میں ہوتا تو یقیناً میرا نقطہ نظر ہوتا۔ اور آپ جانتے ہیں، جنوری میں جانا، اس بات کو\nیقینی بنانا کہ انہوں نے\nبلیو بک پر مشق کی ہے بہت اہم ہے۔ اور آپ جانتے ہیں،\nخصوصیات اور تمام ٹولز اور کیلکولیٹر اور ان تمام چیزوں کو دیکھنا جو میرے خیال میں وہاں موجود ہیں طلباء کے ساتھ شفاف ہونا بھی بہت ضروری ہے۔ - اور مجھے واقعی پسند ہے کہ\nآپ ماڈلنگ کو بلا رہے ہیں۔ میں ایک سابقہ ​​مڈل اسکول ٹیچر تھا اور میں، شاید آپ بتا سکتے ہیں، کیا کبھی کسی نے مڈل اسکول کے بچوں کو ہائی لائٹر دیا ہے؟ - ہاں.\n- ماڈلنگ کے بغیر؟ بس آپ تصور کر سکتے ہیں، آپ جانتے ہیں، کیا ہوتا ہے، یہی بات ہے۔ لیکن اے آئی ایک اور ٹول ہے، لیکن\nماڈل بنانا اب بھی ضروری ہے۔ مجھے لگتا ہے کہ کبھی کبھی مڈل اسکول اور ہائی اسکول کے اساتذہ بھول جاتے ہیں۔ وہ سوچتے ہیں، وہ فرض کرتے ہیں کہ طلباء کو معلوم ہونا چاہیے کہ\nچیزوں کو کیسے استعمال کرنا ہے، لیکن اس نئی دنیا میں، نہیں، نہیں۔ ماڈلنگ واقعی، واقعی اہم ہے، خاص طور پر جب بہت زیادہ تبدیلیاں ہو رہی ہوں، بہت زیادہ جدت آ رہی ہے۔ تو میں واقعی، اس کے علاوہ آپ کا نقطہ نظر بہت لکیری ہے، تو اس کے لیے آپ کا شکریہ۔ ریوین، آپ کے بارے میں کیا خیال ہے؟ - لہذا میں صرف ایک بلڈنگ ایڈمنسٹریٹر کا نقطہ نظر لینے جا رہا ہوں کیونکہ \nسارہ اور الزبتھ ایک کلاس روم ٹیچر کے طور پر بہت ساری عمدہ تجاویز کا اشتراک کرتے ہیں۔ لیکن ابھی وہ وقت ہے جب آپ\nشیڈولنگ کی منصوبہ بندی کر رہے ہیں، ٹھیک ہے؟ کیونکہ وہ سب کچھ کیا ہے\nجو اساتذہ کہتے ہیں؟ میرے پاس اتنا وقت نہیں ہے، میں ایسا نہیں کر سکتا۔ میرے پاس اس کے لیے کافی وقت نہیں ہے۔ میرے پاس اس کے لیے کافی وقت نہیں ہے۔ ٹھیک ہے، ہم انچارج ہیں،\nبلڈنگ ایڈمنسٹریٹر، آپ شیڈول کے انچارج ہیں،\nآپ ان اساتذہ کو دینے کے انچارج ہیں جو\nوقت کا حوالہ دیتے ہیں۔ اور یہ واقعی اہم ہے، چاہے اس سے آپ کا شیڈول تبدیل نہ ہو۔ میرے ہائی اسکول کی طرح،\nہمارے پاس 90 منٹ کے بلاکس تھے، اس لیے میں نے انہیں کئی مختلف آپشنز دیے، آپ جانتے ہیں کہ\n وہ\nاپنی کلاس کیسے ترتیب دے سکتے ہیں تاکہ ان تمام مختلف چیزوں کی تیاری کی جاسکے جن کے لیے آپ کو ہائی اسکول میں تیاری کرنی ہوتی ہے، تمام مختلف امتحانات۔ اور اساتذہ کو صرف یہ جاننا ہوگا کہ آپ\nاس سفر میں ان کا ساتھ دے رہے ہیں۔ اور اس کا ایک حصہ\nانہیں رسائی میں آسانی فراہم کر رہا ہے۔ اور خانمیگو یہی کرتا ہے، ٹھیک ہے؟ تو\nاب ان کے پاس اتنی بڑی کتاب کی ضرورت نہیں ہے۔ وہ آگے بڑھ سکتے ہیں، وہ سال بھر میں اپنے مواد کو \nSAT سوالات کے ساتھ ترتیب دے سکتے ہیں۔ وہ SAT جمعہ کیوں نہیں کر سکتے؟ آپ جانتے ہیں، کہیں، \"ارے لوگ،\nاگر آپ ہیں،\" جیسا کہ سارہ نے کہا، اس سے کوئی فرق نہیں پڑتا کہ\nآپ کون سا مواد پڑھا رہے ہیں۔ جمعہ کو\nاپنے آخری بلاک کے پہلے 30 منٹ کے لیے، ہم خان اکیڈمی میں SAT کی تیاری کرنے والے ہیں۔ آپ جانتے ہیں، یہ والدین بھی\nاپنے اکاؤنٹس سے لنک کر سکتے ہیں۔ تو ہو سکتا ہے کہ اگر میرے پاس\nہوم ورک کے ساتھ کامیابی کی شرح اچھی ہے، تو میں اسے ہوم ورک کے لیے استعمال کرنے والا ہوں۔ لیکن خانمیگو اساتذہ کو ڈیٹا دے سکتے ہیں، جیسا کہ الزبتھ کہہ رہی تھی، تاکہ کلاس سے پہلے ہی یہ کام کیا جا سکے بجائے اس کے کہ انہیں کھودنا پڑے۔ خانمیگو آپ کے لیے گروپ بنائے گا۔ یہ آپ کو وہ ہنر بتائے گا جن\nپر کام کرنے کی ضرورت ہے، یہ آپ کو سبق کے منصوبے دے گا، یہاں تک کہ\nطلباء کو مشق کرنے کی اجازت دے گا۔ آپ صرف یہ کہتے ہیں \"خانمیگو،\nکچھ پریکٹس کے سوالات دو۔\" تو یہاں تک کہ\nبچوں کو ایسا کرنے کے لیے کافی وقت دینا یقینی طور پر \nان کے لیے آگے بڑھنے کے قابل ہونے کے لیے تبدیلی کا ایک ایجنٹ ثابت ہوگا۔ ہم جانتے ہیں کہ وقت طلبہ کے لیے، اساتذہ کے لیے اہم ہے۔ تو یہ\nاساتذہ، منتظمین کے لیے وقت بچانے، منصوبہ بندی کرنے، اور اس بات کو یقینی بنانے کا ایک اور طریقہ ہے کہ طلبہ تیار ہیں اور\nآخری لمحات تک گھسنے کا انتظار نہیں کریں گے، بلکہ اس پر سارا سال کام کرتے رہیں،\nجیسا کہ الزبتھ نے کہا، اس کورس کے چیلنج کے ساتھ زوال۔ اور پھر اسے\nسال بھر جاری رکھنے کی بجائے ٹیسٹ کے دن تک، آپ\nجانتے ہیں کہ ہر چیز کو\nتھوڑا سا وقت میں گھسیٹنے کی بے چینی ہے کیونکہ آپ کے پاس وقت نہیں ہے۔ - مجھے یقین ہے کہ کسی نے بھی جو\nدیکھ رہا ہے اس نے کبھی کسی چیز کے لئے گھبراہٹ نہیں کی ہے اور اس دباؤ کو محسوس کیا ہے۔ ٹھیک ہے؟\n(ریوین ہنستا ہے) خاص طور پر کالج میں نہیں جب آپ ایک نوجوان کے طور پر اپنے وقت کو سنبھالنے کی کوشش کر رہے ہوں۔ \n- ٹھیک ہے. - یہی کلید تیاری کی منصوبہ بندی ہے۔ اور ہم کوشش کرتے ہیں کہ اس ضروری کام کو\n انجام دینے میں خان اکیڈمی میں ہماری شراکت داری میں آپ کا ساتھ دیں۔\n تو اب میں چاہتا ہوں، ہم\nبھاگ رہے ہیں، وقت کی بات کرتے ہوئے، ہمارا وقت ختم ہو رہا ہے۔ لہذا میں چاہتا ہوں کہ ہم\nایک آخری نقطہ نظر، مستقبل کی پیشرفت کے بارے میں سوچیں۔ تو یہ سوچتے ہوئے کہ، آپ کو معلوم ہے کہ جس\nطرح سے SAT ڈیجیٹل فارمیٹ میں منتقل ہوا ہے،\nہم خان اکیڈمی میں کیا کر رہے ہیں یا کیا ہیں،\nآپ کے خیال میں تعلیم کی دنیا میں کیا ہو رہا ہے\nیا ہمیں اس کے استعمال کے لیے کیا امید ہے؟  AI اور ڈیجیٹل SAT کے لیے\nاس کام کو جاری رکھنے میں مدد کر رہے ہیں ؟ سارہ، تم ہمیں شروع کیوں نہیں کراتی؟ - مجھے لگتا ہے کہ تعلیم میں AI کے استعمال کے بارے میں بہت زیادہ تشویش ہے،\nاور بجا طور پر، ٹھیک ہے؟ ہم بالکل نئی دنیا میں ہیں۔ لیکن میں یہ بھی سوچتا ہوں کہ ہم ہیں،\nہم اس کے بارے میں اس طرح سوچتے ہیں جس طرح ہمیں سکھایا گیا تھا یا جس طرح سے ہمیں سکھایا گیا تھا۔ اور اس طرح کی تعلیم میں AI کے استعمال کی اس نئی دنیا میں منتقل ہونے کے بعد، میں جس چیز کو\nدیکھنے کی امید کروں گا وہ یہ ہے کہ AI تنقیدی\nسوچ کو تھوڑا بہتر، تھوڑا سا آسان سکھانے میں ہماری مدد کرنے کا ایک ٹول ہے۔ یہ سکھانا ایک مشکل چیز ہے\nاور یہ کرنا مشکل کام ہے۔ مجھے امید ہے کہ، آپ جانتے ہیں،\nتعاون میں اضافہ ہوگا۔ ہم AI لے رہے ہیں، آپ کو معلوم ہے، اس\nتمام روٹ علم کے لیے، جو یہ\nطالب علموں کے لیے کر سکتا ہے، ٹھیک ہے؟ لیکن پھر ہم انہیں مؤثر طریقے سے تعاون کرنے کے لیے کیسے حاصل کریں گے؟ اور میرے خیال میں ایک بڑی قسم کی جگہ ہے جہاں AI اساتذہ اور طلباء کو ان\nتنقیدی سوچ کی مہارتوں اور تعاون کی مہارتوں کو بہتر بنانے میں مدد کر سکتا ہے۔ اور میں امید کر رہا ہوں کہ\nہم آخر کار وہیں جا رہے ہیں۔ - اور جو میں نے آپ کو\nکہتے سنا ہے وہ انسانی مہارت ہے۔ - ٹھیک ہے.\n- ٹھیک ہے؟ تنقیدی سوچ، تعاون۔ کمپیوٹر ایسا نہیں کر سکتا۔ یہی انسانوں کا ہے، اور یہ دراصل ہمارے لیے عام طور پر سیکھنے کا ایک بہترین طریقہ ہے۔ تو، میں صرف، ایک بار پھر، میں جانتا ہوں کہ میرے پاس بہت کچھ ہے، تعلیم میں بہت سی باتیں ہوتی ہیں۔ یہ ہے، \"کمپیوٹر سنبھال رہے ہیں۔\" یہ\nانسان سازی کی مہارتوں میں مدد کرنے کا ایک ذریعہ ہو سکتا ہے۔ یہ ایک نیا لفظ ہے ہر کوئی، ہیومننگ۔ شاید یہ ایک حقیقی لفظ ہے؟\n- ٹھیک ہے. - الزبتھ، مجھے بچاؤ.  آپ کیا سوچتے ہیں؟ - آپ جانتے ہیں، میں مستقبل کے لیے امید کرتا ہوں\nکہ، آپ جانتے ہیں، ہر کوئی AI کے ساتھ زیادہ آرام دہ ہو جائے گا لیکن اس سمجھ کے ساتھ کہ کلاس روم میں اس استاد کو کبھی\nتبدیل نہیں کیا جا سکتا اور یہ کہ استاد اب بھی دنیا کا سب سے اہم انسانی\nتعلق ہے۔  . اور مجھے یاد ہے، آپ جانتے ہیں، آپ،\nہم ماڈلنگ کی طرف واپس جاتے ہیں اور مجھے کلاس روم میں یاد ہے، آپ جانتے ہیں، میرے طلباء نے میری طرف دیکھا اور آپ جانتے ہیں، اور میں نے اپنے طلباء کے ساتھ اپنے خاندان کے مقابلے میں زیادہ وقت گزارا۔ \nبہت سے، بہت سے مواقع. اور میں جانتا ہوں کہ انہوں نے بھی ایسا ہی کیا تھا اور وہ لمبی بس کی\nسواری کریں گے، آپ جانتے ہیں، میرے اسکول تک۔ اور، آپ جانتے ہیں، میں امید کرتا ہوں کہ مستقبل کے لیے، وہ طالب علم، جو آپ جانتے ہیں،\nاب بھی، آپ جانتے ہیں، کہ وہ انسانی تعلق اپنے ہم عمر طالب علموں کے ساتھ اور اپنے اردگرد کی دنیا اور کمیونٹی کے ساتھ ہے، لیکن وہ اس کا\nاستعمال زیادہ آرام دہ محسوس کرتے ہیں۔ ان کے پاس جو کچھ ہے اور وہ کیا\nجانتے ہیں اور وہ کیا سیکھ سکتے ہیں اسے بڑھانے کے لیے AI۔ میں یہ دیکھنا بھی پسند کروں گا کہ AI کا تشخیص میں کردار ہے۔ مجھے یقین ہے کہ ڈیٹا نہ صرف ہمارے اسکول ڈسٹرکٹ\nلیڈرز کے لیے بہت اہم ہے بلکہ ہمارے پرنسپلز اور ہمارے طلباء اور ہمارے والدین کے لیے بھی بہت اہم ہے۔ اور میں\n اپنے شارٹ سائیکل فارمیٹو اسیسمنٹس میں جو ہم اپنے طالب علموں کو دیتے ہیں ان میں AI کو شامل کرنا پسند کروں گا۔ یہ کیسا لگتا ہے،\nمجھے قطعی طور پر یقین نہیں ہے، لیکن یہ یقینی طور پر ایک ایسی چیز ہے جس کے\nبارے میں میں اپنے ذہن میں سوچ رہا ہوں کہ یہ\n مستقبل کے لیے تشخیص کی دنیا کو کیسے بدل سکتا ہے۔ - جی ہاں، بالکل. اور ریوین، مجھے پسند ہے کہ آپ ہمیں منتظم کا نقطہ نظر دیتے رہیں۔\n(ریوین ہنستا ہے) تو آئیے چلتے رہیں۔ آپ کے کیا خیالات ہیں؟ - میرا مطلب ہے، میں صرف\nیہ سوچ رہا تھا، آپ جانتے ہیں، جب میں خود ایک طالب علم تھا اس وقت سے جب میں اسکول میں پڑھاتا تھا\nاور آپ جانتے ہیں، منتظم اور پھر یہ\nنقطہ نظر بھی جو اب میرے پاس ہے، ہر ایک دن اضلاع کے ساتھ کام کرنا۔ آپ جانتے ہیں، ہمیشہ\nکچھ نیا ہونے والا ہے۔ اور تعلیم کے لیے، مجھے لگتا ہے کہ\nہم نے اسے نیچے رکھ دیا ہے، ٹھیک ہے؟ ہمیں ہر دوسرے منٹ میں ایک نیا نصاب ملتا ہے،\n ہمیں نئے اوزار ملتے ہیں، ہمیں تمام چیزیں ملتی ہیں۔ تو یہ ان چیزوں میں سے ایک ہے۔ لیکن اس چیز کا ہمیں تھوڑا سا اور\nنازک سلوک کرنا ہے، ٹھیک ہے؟ ہمیں یہ یقینی بنانا ہوگا کہ ہم ماڈلنگ کر رہے ہیں۔ ہم نہ صرف اپنے\nاساتذہ اور اپنے طالب علموں اور اپنے منتظم کو، بلکہ اپنی\nکمیونٹی اور اپنے والدین کو بھی بے نقاب کر رہے ہیں کیونکہ یہ سب کو متاثر کرنے والا ہے۔ یہ پہلے سے ہی ہے، ٹھیک ہے؟ جیسا کہ ہم اسے روزانہ کی بنیاد پر استعمال کرتے ہیں، بعض اوقات جانے بغیر۔ اگر آپ کے گھر میں الیکسا ہے\n، اگر آپ کے پاس ہے، تو آپ جانتے ہیں، گوگل، اگر آپ کے\nپاس گوگل نیسٹ یا ان میں سے کوئی چیز ہے۔ - سری\n- تمہیں معلوم ہے۔ جی سری۔\n(ڈینیل ہنستے ہوئے) آپ ہر روز AI استعمال کر رہے ہیں اور آپ جانتے ہیں، آپ\nاس کے بارے میں دو بار نہیں سوچتے۔ تو اس کی ضرورت ہے۔\nمیں مستقبل کے لیے یہی امید رکھتا ہوں۔ یہ ایسی چیز ہے جس کے بارے میں آپ\nدو بار بھی نہیں سوچیں گے۔ آپ جانتے ہیں، COVID سے پہلے، ہر ایک کے پاس ون ٹو ون ڈیوائسز بھی نہیں تھیں۔ ہم نے کبھی سوچا بھی نہیں تھا کہ ٹھیک ہے، ہر ایک کے پاس کمپیوٹر ہوگا اور آپ\nکمپیوٹر پر اپنا کام کرنے والے ہیں۔ اسکول کی عمارت میں بھی نہیں،\nلیکن ہم نے یہ کیا۔ تو یہ\nان چیزوں میں سے ایک اور چیز ہے جو آپ کو معلوم ہے، سامنے آئی ہے اور ہمیں اسے لینا ہے\nاور ہمیں اسے سیکھنا ہے۔ اس سے مت ڈرو۔ اور پھر سکھائیں، سکھائیں،\nسکھائیں، ماڈل، ماڈل، ماڈل بنائیں اور اس بات کو یقینی بنائیں کہ اس کا\nاستعمال مناسب طریقے سے ہو رہا ہے اور طلباء اس کی قدر جانتے ہیں، کیونکہ یہ قیمتی ہے۔ یہ صرف طالب علموں کے لیے دھوکہ دہی کا ایک ٹول نہیں ہے یا آپ جانتے ہیں کہ گڑبڑ کرنا 'کیونکہ میں جانتا ہوں کہ\nبہت سے لوگ یہی سوچتے ہیں، لیکن یہ واقعی قیمتی ہے۔ اور میں ایک چھوٹی سی کہانی سنانے جا رہا ہوں کیونکہ میں جانتا ہوں کہ ہمارا وقت ختم ہو رہا ہے، لیکن جیسا کہ باقی سب لوگ، جب آپ جانتے ہیں کہ خانمیگو باہر آیا ہے، ایک سال پہلے پیدا ہوا تھا،\nآپ جانتے ہیں، مارچ یا اس سے زیادہ۔ میں اس طرح تھا، اوہ میرے خدا،\nجیسے ہم کیا کر رہے ہیں؟ جیسا کہ یہ پاگل ہے،\nایک AI کی طرح، جیسا کہ، آپ جانتے ہیں، میں\nکتابیں پڑھنے اور مضامین تلاش کرنے کی کوشش کر رہا تھا، آپ جانتے ہیں، یہ سمجھنے میں اپنی مدد کریں کہ کیا ہو رہا ہے۔ اور میں اپنے مینیجر کا یہ کہنا کبھی نہیں بھولوں گا، \"تم جانتے ہو، یہ یہاں ہے لوگ۔ جیسے کہ ہمیں\nاسے اپنانا ہے، ہمیں اسے استعمال کرنا ہے، ہمیں اسے جاننا ہے تاکہ ہم\nاپنے ضلعی شراکت داروں کی مدد کر سکیں۔\" اور میں نے اس کے بارے میں سوچا اور میں ایسا ہی تھا، تم جانتے ہو، وہ ٹھیک ہے۔ اور، لیکن میں پسند کرتا ہوں، مجھے صرف\nاسے اپنے لیے دیکھنے کی ضرورت ہے۔ لہذا مجھے\nکیلیفورنیا کے ایک اسکول میں جانے کا موقع ملا اور اسے عملی طور پر اور اس اسکول کو\nایک خاص آبادی کا استعمال کرتے ہوئے دیکھنے کا موقع ملا۔ لہذا وہ اسے شوقین طلباء، خصوصی ایڈ طلباء اور ELL طلباء کے ساتھ استعمال کرتے ہیں۔ اور اس نے میرا پورا نقطہ نظر بدل دیا کیونکہ بنیادی طور پر جیسا کہ ہم چاہتے تھے، ایک ٹیچر، تمام\nبچے، ان کی مدد کے لیے ان کے پاس خانمیگو تھا اور انہوں نے کوئی شکست نہیں دی۔ تو وہاں کوئی بچہ\nانتظار میں بیٹھا، پیچھے جھک کر، کچھ نہیں کر رہا تھا۔ وہ فوراً، جب\nاستاد دوسرے طلباء کے ساتھ کام کر رہے تھے، وہ\nفوراً خانمیگو پر آگئے، خانمیگو سے پوچھا کہ انہیں کیا\nچاہیے اور وہ آگے بڑھتے رہے۔ اور یہ ایسا ہی تھا، اوہ میرے خدا، جیسے میرے پاس\nبچوں کی لائن نہیں ہے جو مدد کے لیے مجھ سے انتظار کر رہے ہوں۔ میں، آپ جانتے ہیں، وہاں\nکوئی نہیں ہے، مجھے اس بات کی فکر کرنے کی ضرورت نہیں ہے کہ مجھے یہ سبق مجھے اس سے زیادہ تین دن تک کرنا پڑے گا کیونکہ میری آدھی کلاس کو یہ نہیں ملا۔ ان کے پاس وہاں کوئی تھا\nجو ان کی مدد کر سکتا تھا اور زبان بدل سکتا تھا تاکہ ان کی ضرورت کی زبان میں مدد کی جا سکے۔\n لہذا اساتذہ کی تمام\nکمیوں کے ساتھ، ان تمام کمیوں کے ساتھ جو ارد گرد چل رہی ہیں،\nواقعی، آپ جانتے ہیں، ایک خاص چیز تھی جو میں نے دیکھی اور واقعی مجھے یہ احساس دلایا کہ\nہم صحیح کام کر رہے ہیں اور خانمیگو\nواقعی ہونے والا ہے۔  ایسی چیز جو\nبہت سے لوگوں کی زندگیوں کو بدل دے گی۔ - ٹھیک ہے، ریوین، سارہ، الزبتھ، یہ ایک شاندار بات چیت تھی. میں آپ کے تمام وقت اور آپ کے خیالات اور آپ کے نقطہ نظر کی تعریف کرتا ہوں۔ اور ریوین کی بات پر، امید ہے کہ آپ اسے دیکھ سکتے ہیں، ہم یہاں جاتے ہیں۔ کیا آپ سب یہ دیکھ سکتے ہیں؟ ہم یہاں آپ کے ساتھ ہیں۔ خانمیگو، ٹھیک ہے؟  آپ کے ساتھ۔ ہم آپ کے ساتھ کام کرنا پسند کریں گے۔ ہم آپ کے ساتھ شراکت کرنا پسند کریں گے۔ ہم آپ کے ساتھ مستقبل میں قدم رکھنا چاہتے ہیں۔ لہذا اگر آپ\nخان اکیڈمی میں ہمارے ساتھ شراکت کرنا چاہتے ہیں، تو آپ کے پاس بہت سے مختلف فوائد ہیں۔ سب سے پہلے، تمام کورسز مفت ہیں۔ آپ سب جانتے ہیں، امید ہے کہ آپ یہ جانتے ہوں گے، لیکن آپ کو کورسز مفت میں ملتے ہیں۔ لیکن، جب آپ\nہمارے ساتھ شراکت کرتے ہیں، تو ہم آپ کی مدد کرتے ہیں۔  اس پینل پر یہ حیرت انگیز انسان\n ہر ایک دن اضلاع کے ساتھ شراکت کر رہے ہیں۔ آپ کو سفید دستانے کی سروس ملتی ہے،\nآپ کے پاس پیشہ ورانہ تعلیم ہے، آپ کے پاس آٹو روسٹرنگ، حسب ضرورت ڈیٹا ہے۔ ہم\nتمام طلباء کو \nگریڈ لیول کے مواد تک مساوی رسائی حاصل کرنے، اس بات کو یقینی بنانے کے لیے کہ وہ تمام کام کر رہے ہیں اور ان مہارتوں کو تیار کر رہے ہیں، سیکھنے میں مشغول ہونے کے لیے بااختیار بنانے میں بھی آپ کی مدد کرنا چاہتے ہیں۔ لہذا ہم آپ کی پیشرفت کو ٹریک کرنے میں مدد کرتے ہیں۔ اور سب سے اہم بات، میرا مطلب ہے کہ\nیہ سب واقعی اہم ہے۔ لیکن سب سے اہم بات،\nہم نے Khanmigo میں ایک محفوظ اور اخلاقی AI تیار کیا ہے۔ ہم قدر کرتے ہیں، ہم جانتے ہیں کہ طالب علم کا ڈیٹا اور رازداری واقعی اہم ہے۔ ہمارے پاس خاص محافظ ہیں کیونکہ آپ سب ایک حیرت\nانگیز، حیرت انگیز انسانوں کے ساتھ کام کرتے ہیں اور اساتذہ کی کمی ہے اور بعض اوقات طلباء کو مدد کی ضرورت ہوتی ہے اور بعض اوقات وہ\nخانمیگو کے ساتھ مدد طلب کرتے ہیں اور ہم اس بات کو یقینی بنانا چاہتے ہیں کہ\nہم بالغوں کا اندراج کر رہے ہیں اور  انسان جو اس میں مدد کر سکتے ہیں۔ لہذا اگر آپ مزید جاننے میں دلچسپی رکھتے ہیں، تو ہم نے چیٹ میں ایک لنک ڈال دیا ہے۔ یہ ہماری ضلعی پارٹنر\nٹیم ہے۔  براہ کرم ہم تک پہنچیں۔ آپ اس QR کوڈ کو بھی اسکین کر سکتے ہیں۔ آپ ہماری ویب سائٹ پر جا سکتے ہیں\n، اسے آج ہی دیکھ سکتے ہیں اور بس، ہم آپ کی بہت تعریف کرتے ہیں۔ اور جب تک ہم دوبارہ نہیں ملتے،\nآپ کے ساتھ سیکھنا بہت اچھا تھا۔ آپ کا دن شاندار آرام کریں۔",
    "t_spanish": "- Muy bien a todos. Bueno,\nahora nos tomaremos el tiempo para presentarme como el anfitrión y luego dejaré que\nmis increíbles panelistas sigan adelante y se presenten. Mucho gusto.  Mi\nnombre es Danielle Sullivan. Soy Gerente Senior de\nAsociaciones Distritales en el Noreste de Khan Academy. Y antes de todo esto, hace mucho tiempo, estuve en tecnología educativa por un tiempo, pero también fui maestra de educación especial de quinto y sexto grado en el norte del estado de Nueva York y en Washington DC.  Por eso estoy emocionado de estar aquí\nhoy para hablar todo sobre los SAT. Sarah, ¿por qué no\ncontinúas y comienzas con las presentaciones del panel? - Seguro.  Hola a todos. Mi nombre es Sarah Thaler. Soy Gerente de Éxito del Distrito. Trabajo principalmente con\ndistritos de Michigan y Ohio. Antes de estar en Khan Academy, fui profesor de ciencias en una escuela secundaria\ndurante unos 10 años y luego estuve en administración,\ndirector del plan de estudios K-12. Y luego\nestuve en el College Board durante unos nueve años. Y por eso estaba trabajando con los\nDepartamentos de Educación estatales, ayudando a administrar el\nconjunto de evaluaciones SAT para sus\nevaluaciones estatales de responsabilidad federal.  Por eso, estoy muy feliz de\npoder aplicar mi conocimiento del SAT a los distritos con los que\ntrabajo en Khan Academy. - Genial, Sara.  Gracias. Muy bien, Isabel. - Hola, buenas tardes. Mi nombre es Elizabeth Hadley y también soy gerente de éxito del distrito y trabajo con distritos de todo\nEstados Unidos, enfocándome en su\nimplementación digital del SAT con Khan Academy. Antes de mi llegada a Khan Academy, trabajaba en un condado de\nOrlando llamado Condado de Osceola. Fui maestra, ex entrenadora de alfabetización y pasé cuatro años en una oficina de investigación y evaluación\nimplementando evaluaciones, evaluaciones formativas de ciclo corto PLC y también implementando Khan Academy con nuestros 20,000 estudiantes de secundaria. Así que es un placer\npoder compartir toda esa información que\ntengo con los distritos con los que trabajo ahora en Khan Academy. - No es gran cosa, sólo implementar, ya\nsabes, 20.000 niños. - Un poco en Khan.\n- Es como trabajar con varios departamentos estatales. No es gran cosa. Y Cuervo. - Hola a todos.  Estoy muy feliz\nde verlos a todos hoy. Mi nombre es Cuervo Casseus. Soy Gerente de Éxito del Distrito, trabajo principalmente con\ndistritos en el Noreste y veo a alguien de\nGreensboro en adelante, así que bienvenido. Y antes de esto, estuve\nen K-12 durante unos 22 años. Fui profesora de ciencias,\nformadora de instrucción y, más recientemente, directora de una escuela secundaria. Estoy muy familiarizado con el\nSAT y estoy preparando e involucrando a padres, estudiantes y maestros\nen el proceso.  Estoy muy feliz de poder compartir mi experiencia hoy sobre todo lo\nrelacionado con el SAT. - Maravilloso.  Así que\ndejaré de compartir mi pantalla porque el objetivo de hoy es tener una\nconversación interactiva y colaborativa sobre cómo los apoyaremos y cómo prepararemos a los\nestudiantes para el SAT digital. Entendemos que\ndondequiera que estén viendo esto, aquellos de ustedes aquí hoy,\nestán en un viaje diferente. Y si estás viendo esto en el futuro, es posible que estés en un\nviaje diferente en la línea de tiempo. Pero nuestro objetivo hoy es realmente\nayudarlos a comprender, a través de diferentes perspectivas y puntos de vista, cómo los\nestudiantes pueden ayudarlos a ponerse al día en ELA y matemáticas, especialmente después de la\npandemia, que fue mucho. Quiero decir, ¿alguien\nrecuerda el año 2019?  ¿ Alguien?\n(Raven se ríe) Yo, no.  ¿Bien? Quiero decir, ¿quién lo sabe? Entonces, cómo podemos hacer la transición al nuevo formato de evaluación digital\npuede ser un desafío.  Por eso estamos aquí para\napoyarlo y comprender las piezas y nuestras perspectivas. Puedes tener, hacer preguntas en el chat. Pueden colaborar entre\nsí en el chat o pueden enviar\npreguntas de Preguntas y respuestas. Así que tengo ambos listos y listos. Haré preguntas a nuestros panelistas, pero por favor, nos encantaría\nsaber de usted también. Para empezar, Sarah,\nel SAT existe desde hace mucho tiempo. Llevamos varios meses de transición a una prueba digital.  ¿ Cómo ha sido la transición para las escuelas y cómo ha observado\nla preparación para las pruebas y cómo ha sido? - Seguro.  Ya sabes, el cambio es difícil. Y este año hubo mucho de eso. Si administró el día escolar del SAT o si fue un centro de exámenes de fin de semana, probablemente esté concentrado en muchos de los cambios administrativos que tuvieron que ocurrir con el examen digital. Entonces, cómo instalar Blue Book, cómo inician los estudiantes en\nBlue Book, el kit de herramientas de prueba, los pedidos, el registro,\nlas salas, la capacitación del personal, todas esas cosas logísticas fueron muchas para los educadores este año si administraron en su edificio. Pero ahora, con suerte, tal vez tenga una o más administraciones en su haber y se sienta un poco más seguro al administrar el examen y pueda concentrarse ahora en\nayudar a los estudiantes y profundizar realmente en los datos\nque podría obtener para eso.  . - Excelente. Elizabeth, ¿qué pasa con lo que has visto desde tu perspectiva? - Bueno, ya sabes, tal como dijo Sarah, el cambio es muy difícil. Y tengo que ser honesto, he\ntrabajado con lectores intensivos durante mucho tiempo tratando\nde llevarlos a la meta con el SAT y estaba realmente nervioso por todos los cambios. Estaba nervioso por los profesores, especialmente en las aulas de lectura, al tener que pasar de anotar texto y trabajar con textos con los dedos, fragmentando texto a un formato digital. Y para ser honesto, a medida que avanzaba el año, la transición fue mucho más\nfluida de lo que había anticipado. Si hablabas conmigo el\nverano pasado, estaba bastante nervioso. Pero una vez que nos acostumbramos a las cosas y los estudiantes estaban\npracticando en Khan Academy y estaban expuestos\na esos elementos digitales, comencé a sentir que así era, los distritos me informaban como si les estuviera yendo muy bien con eso. y les va bien\ncon las calculadoras en línea y cosas así. Ahora, en los distritos con los que he\nestado hablando, los estudiantes informan\na los educadores que les\ngustó mucho más. No fue tanto tiempo. Fue un poco más fácil responder algunas de las preguntas. Obviamente los datos\nnos dirán si fue más fácil o no, pero ya sabes, el hecho de que los estudiantes estén\nrespondiendo un poco mejor a ese formato digital no\nsólo fue una agradable sorpresa para mí, sino que también fue emocionante, ya\nsabes,  para escuchar esos comentarios y noticias de nuestros socios del distrito. - Oh, absolutamente. Yo, ¿recuerdan haber tomado el SAT?  ¿ Recuerdas cuando en el 19- (Danielle se aclara la garganta) El cambio siempre es difícil, ¿verdad? Raven, ¿qué estás viendo\ndesde tu perspectiva? - Sólo quería decir que el año pasado nos asociamos con College Board, que es una gran\nasociación que tuvimos. Y comenzamos la transición de\nnuestros distritos el año pasado. Comenzamos a prepararlos,\ncomenzamos a prepararlos, comenzamos a brindarles tanta\ninformación como pudimos, para prepararlos, preparar a sus estudiantes,\ntener un plan en marcha. Entonces siento que estaban listos. Nos pidieron ayuda y estuvimos felices de\ncolaborar con ellos. Y luego, con la ayuda del\nnuevo curso SAT de Khan Academy y la aplicación Blue Book, pudimos poner a los\nestudiantes en funcionamiento. Y como dijo Sarah,\ncreo que el mayor cambio fue para los maestros y administradores. Nuestros hijos son muy resistentes, ¿verdad?  Se adaptan a la tecnología muy rápidamente. Entonces esto no fue tan difícil para los estudiantes.  Creo que fue más difícil para los profesores prepararse, sobre todo. Pero como dijo Elizabeth,\nsólo los datos lo dirán. Y creo que con la preparación que tuvieron los estudiantes en Khan Academy, estoy emocionado de saber de los distritos una vez que comiencen a recuperar esos puntajes. - Absolutamente. Y nuevamente, en el chat,\nsi quieres comentar, ¿ cuál fue tu experiencia con el cambio?  ¿ Funcionó?  ¿Cómo te sientes al respecto?  Y, pero Sarah, dado que vamos a hacer la\nconexión con College Board, me encantaría que pensaras en el enfoque de Khan Academy\npara la preparación para el SAT.  ¿ Cómo pensamos en\nesto en Khan Academy para ayudar a los estudiantes a estar preparados y asegurarnos de que\ncomprendan qué hacer? - Seguro. Quiero decir, creo que cuando\npensamos en la preparación para el SAT, pensamos en todas esas\nactividades de preparación.  Ya sabes, familiarizarte con el Libro Azul, cuántas preguntas, el tipo\nde preguntas, gestión del tiempo. Y si bien es importante que los estudiantes\ntengan esas habilidades, lo que realmente queremos es tratar de enfocarnos y mejorar realmente los puntajes del SAT y, por supuesto, eso significa preparación para la universidad porque para eso\nestá diseñado el SAT. Realmente necesitamos centrarnos en las habilidades. Y estas no son sólo habilidades en el SAT, son habilidades duraderas de lectura\n, escritura y matemáticas que los estudiantes necesitan saber,\nno sólo para prepararse para la universidad, sino también para tener éxito en sus otros cursos de la escuela secundaria. Así que creo que nuestro enfoque en esas habilidades duraderas es\nrealmente importante. - Gracias. Elizabeth, cuéntanos cómo abordamos las habilidades en Khan Academy. - Sí, gran pregunta. Como dijo Raven, estamos asociados con College Board, por lo que nos ayudan a diseñar esas preguntas para asegurarnos de que estén 100% alineadas. Pero ya sabes, hablando\nespecíficamente de las habilidades, ambos de nuestros cursos SAT digitales, matemáticas y lectura y escritura,\ntienen una serie de habilidades. El de matemáticas tiene como 111 y el de ELA tiene entre 41 y 50 habilidades. Y cuando hablamos de aprendizaje de dominio y hablamos de que nuestros estudiantes\naprenden auténticamente esas habilidades, como\nmencionó Sarah para la universidad , la carrera y la vida en general. Lo que me encanta de Khan\nAcademy es que los estudiantes, los maestros y los\nadministradores pueden realizar un seguimiento del\nnivel de competencia del estudiante en esas habilidades. Y así, durante todo el año, a partir de agosto, hacemos un seguimiento de los estudiantes que\ntrabajan en esas habilidades y si están alcanzando o no el\ndominio de esas habilidades. Porque si son competentes,\nentonces, como profesor, tengo más confianza en que\npodrán responder esa pregunta por sí solos\ncuando se trata del PSAT o el SAT el día del examen. Y eso es algo\nen lo que Sarah, Raven y yo trabajamos muy duro\ncon nuestros socios del distrito: ya sabes, estas son las habilidades en las que sus estudiantes están sobresaliendo. Estas son en las que\ndebemos apoyarnos y realmente obtener más.  apoyo para ir. Y eso es realmente lo que\nenmarca nuestras conversaciones con nuestros socios todo el\ntiempo: ¿cuáles son las habilidades y cómo les está yendo a los estudiantes\nen esas habilidades? - Y Raven, desde tu perspectiva, ¿en qué más estás pensando\ncuando se trata de habilidades? Porque sé que estás\npensando mucho en las habilidades. - Sí. Entonces, para aprovechar lo que\ndijeron Elizabeth y Sarah, lo mejor de Khan\nAcademy es que es una ventanilla única para el SAT, ¿verdad? Al igual que los estudiantes pueden ingresar,\npueden aceptar el desafío del curso. Eso nos puede dar a nosotros, los maestros\ndesde el comienzo del año escolar, dónde\nnecesitan apoyarse. Entonces, en lugar de perder el tiempo, haciendo que los niños simplemente entrenen y maten, vamos a adoptar el enfoque, apoyémonos en lo que  necesitan. Si ya lo saben, que así sea, obtendrán esas habilidades\na lo largo del año escolar de su maestro. Pero las habilidades en las que necesitan un poco, un poco de ayuda adicional,\nnos apoyaremos allí y luego los maestros\nmirarán sus informes y luego regresarán y\ntal vez formarán grupos pequeños o darán tareas de refuerzo adicionales fuera de su curso.  objetivo de dominio. Así que hicimos un buen trabajo\nalineándonos con College Board y creando esas tres\ncategorías diferentes en nuestro curso de preparación para el SAT. Tenemos la base, el\nmedio y el avanzado. Entonces, al igual que el SAT,\nporque ahora es adaptable, queremos asegurarnos de que nuestros\nestudiantes obtengan todo lo que necesitan en todas\nlas áreas del examen. - Genial. Entonces quiero que comencemos a analizar cómo pensamos sobre la\nIA en el uso de los cursos. Entonces, Sarah, pensando en la IA, ¿\ncuáles son algunos de los desafíos y oportunidades que se\npresentan al usar una IA para la preparación digital para el SAT? - Sí, uno de los ejemplos inmediatos que me vino a la cabeza es que\ncuando estaba enseñando ciencias, hicimos un campamento de preparación para el SAT\nque era como un curso de dos semanas que los estudiantes\ntomaban durante el verano. Podrían inscribirse. Pero realmente me costó\ndescubrir cómo enseñar eso, cómo mantener a los estudiantes interesados\nen algunos de estos contenidos que probablemente no sean muy\nemocionantes para ellos. Sé que muchos de ustedes probablemente\ntengan cursos de preparación para el SAT o materias optativas en su escuela.  Por eso creo que la IA podría\nhaber sido una oportunidad para mí y ahorrarme\nmucho tiempo es utilizar nuestras herramientas para profesores Khanmigo. Y esto habría hecho\nmi vida mucho más fácil porque pasé mucho tiempo\ntratando de descubrir cómo mantener a los estudiantes interesados\ny hacer estas cosas. Pero tenemos generadores de planes de lecciones que hubieran sido muy útiles. Existe una herramienta para profesores Khanmigo que crea texto informativo y, como sabemos, el tipo de lectura y tener esas habilidades de lectura atenta\nson muy importantes. Así generar ese\ntexto informativo para que mis alumnos puedan practicar. Tenemos una herramienta docente de Khanmigo\npara mantenerlo relevante, generadores de contexto del mundo real,\ntodas esas cosas en las que gasté tanta\nenergía mental tratando de pensar por mi cuenta, Khanmigo\npodría haberlo hecho por mí. Y entonces desearía haber tenido esas herramientas en mi época de profesora,\nhace mucho tiempo. (Raven se ríe) - ¿Alguien más se siente así? Cualquier otra persona que dedique tiempo a la planificación. (Raven se ríe)\nEs broma.  Sé que eres. Entonces, Elizabeth, te veo empática y realmente asientes con la cabeza.\nEsa es la palabra ahí mismo. Entonces, ¿qué añades a la conversación? - Sí, quiero decir, recuerdo\nmuchos domingos preparándome para mis múltiples preparativos y ya sabes, asegurándome de tener todo\nplaneado para la semana. Y me sorprende lo rápido que algo de esto ahora se automatiza con Khanmigo. Ya sabes, la IA es nueva para todos nosotros. Khanmigo, ya sabes, varias de las otras herramientas de inteligencia artificial que\nexisten no solo son nuevas para nosotros, como en Khan Academy y\nmis colegas en esta llamada, sino que también son nuevas para nuestros maestros, son nuevas para nuestros padres y\nnuestro administrador del distrito. Y ha sido realmente un gran año de descubrimiento y aprendizaje. Y creo que\nuno de los desafíos que enfrentan los educadores hoy en día en el aula es que los estudiantes\ncomprendan cómo interactuar con Khanmigo y con la IA y realmente he llegado a la conclusión de que es necesario involucrar muchos modelos.\n para nuestros estudiantes. Ya sabes, esto no es Google. No es una forma rápida\nde obtener una respuesta. Realmente tienes que\ntrabajar con los estudiantes sobre cómo hablar con Khanmigo y cómo puedes usar Khanmigo de manera auténtica para ayudarte a aprender y, ya sabes, captar\nnuevas habilidades y tareas. Lo que veo que es realmente beneficioso para la preparación para el SAT es, ya sabes, la instrucción en grupos pequeños en el aula y, ya sabes, tener un\ntutor personalizado en cada escritorio.  Por lo tanto, normalmente solo hay un profesor\nen el aula. Si tienen suerte, consiguen\ndos o una ayuda o un ayudante. Pero poder hacer que los estudiantes obtengan esa retroalimentación inmediata y trabajen en algo\nque están tratando de aprender al alcance de su mano sin tener a ese\nmaestro a su lado, realmente creo que es lo\npoderoso de todo esto. Y cuando se trata de preparación para el SAT, todos los estudiantes merecen toda\nla ayuda que puedan recibir y eso es definitivamente algo que\nveo muy poderoso en el futuro en las aulas. - Oh, absolutamente. Quiero decir, la tecnología ha avanzado mucho, pero como hemos compartido, el cambio puede ser difícil. Quiero decir, recuerdo que la preparación para el SAT\nera un libro gigante como este. Una vez más, todos ustedes recuerdan, quiero decir, en el año, bla, bla, bla. Entonces, pensando en la\nevolución, pensando en la IA, Raven, ¿qué estás viendo en los distritos con los que trabajas en cuanto a oportunidades y desafíos? - Entonces, ya sabes, las oportunidades son\nsólo el capital, ¿verdad? Sabemos que no todo el mundo\ntiene una madre que se queda en casa o tiene acceso a un tutor. Entonces, el hecho de que tengamos una herramienta que todos los estudiantes pueden usar\nsin importar el nivel de grado o el estado en el que se encuentren es sorprendente. Sabes, y honestamente,\ntengo dos hijos adolescentes y no sé todo lo que están aprendiendo ahora\na pesar de que soy educador. Así que imagínese a un\npadre no educador tratando de navegar por todas las diferentes cosas que los estudiantes están aprendiendo hoy en día. Entonces, no solo puede ayudar a los padres, porque uso Khanmigo con bastante\nfrecuencia para ayudar a mis propios hijos, sino que, como dijo Elizabeth, es un tutor personalizado\npara cada estudiante en cada aula de\ntodo el país. Y ya sabes, como cualquier herramienta nueva, los desafíos siempre\nllegan con el tiempo, ¿verdad?  ¿ Cuándo voy a capacitar a\nmis profesores para que utilicen esto?  ¿ Cómo voy a usar\nesto para que lo usen de manera segura? Esas son todas las cosas\nque siempre son desafíos. Pero siento que en Khan\nAcademy realmente hicimos un muy buen trabajo al\nresolver todas esas cosas, ya sabes, mientras teníamos la moderación y los maestros\npodían monitorear el chat y los padres\npodían vincularse a cuentas y  monitorear su chat. Entonces, siempre habrá\ndesafíos porque ChatGPT y toda la tecnología de inteligencia artificial\ncambian constantemente, ¿verdad?  Los grandes modelos de lenguaje alucinan,\nhay de todo, pero ya sabes, incluso con cualquier nueva tecnología o cualquier nuevo plan de estudios, la adaptación o cualquiera de esas cosas en una\nescuela siempre es un desafío. Y solo hace falta, ya\nsabes, el líder adecuado y que nosotros lo guiemos a través de la\nimplementación para garantizar que los\ndesafíos sean mínimos. Pero no sería un ex\ndirector de escuela secundaria si me sentara aquí y dijera que no habrá\nningún desafío porque definitivamente los habrá. Pero ya sabes, con suerte esas son cosas que nuestro equipo puede resolver por ti y ayudarte a navegar\nalgunas de esas cosas. - ¿Bien? Y hubo una pregunta en\nel chat sobre una demostración visual. Queremos centrarnos en una mayor\nconversación hoy, pero, antes de\ndejarlos a todos hoy, les daremos algunos,\nles indicaremos una dirección donde pueden acceder a las\ncosas y verlas y hay muchos recursos. pero estamos tratando de brindarles más perspectiva de educador en lugar de mostrarles un montón de cosas. (Raven se ríe)\nEs increíble. Es muy asombroso. Sin embargo, queremos hablar más sobre el por qué y el cómo detrás de esto y, como dijo Raven, les daré un\npoco más de información sobre cómo nos encantaría\napoyarlos en este trabajo. Pero quiero volver a\naprender y dominar el aprendizaje. Ese es un término que es realmente interesante y creo que necesitamos hablar mucho más desde los tejados de la educación\nsobre la protección del aprendizaje.  ¿ Qué significa dominar las habilidades? Entonces, Sarah, me encantaría que\npensaras en cómo y qué papel juega el aprendizaje de dominio y ayuda a los estudiantes incluso con\nel nuevo formato digital SAT. - Sí, creo que la\nnaturaleza inherente del aprendizaje de dominio es garantizar que los estudiantes\ntengan una base sólida y ese\nconocimiento previo sobre el cual construir. Así que no hay lagunas ni agujeros en su aprendizaje. Y luego el\ncurso de preparación digital para el SAT refleja esto, y Raven mencionó esto antes, al estructurar esas habilidades, tenemos esos\nniveles básicos, la dificultad media, la dificultad avanzada para\ngarantizar no solo la amplitud de las habilidades que\nofrecemos para asegurarnos  esos se alinean con lo que se evalúa en el SAT y nuevamente, esas habilidades duraderas, pero también la profundidad de esas habilidades. - Si absolutamente. Quiero decir, incluso pensando en el\nSAT, ¿por qué tomamos eso?  ¿ Alguien, Bueller?  es una broma.  Lo estamos tomando para que los estudiantes\npuedan seguir aprendiendo, seguir dominando el aprendizaje, con suerte en diferentes instituciones. Entonces, Sarah o Elizabeth, ¿ qué han visto desde su perspectiva sobre el aprendizaje del dominio? - Bueno, ya sabes,\npara mí aprender a dominar siempre ha sido, ya sabes, que los estudiantes\nrealmente lleguen a la profundidad de esa habilidad y puedan\nreproducir su dominio en ella muchas veces diferentes. Y realmente, para que nuestros estudiantes\ndemuestren competencia en una habilidad en Khan Academy, tienen que verla al menos dos veces y corregir esa habilidad\nen una evaluación , una prueba de unidad o un desafío del curso. Así que siempre me siento\nmás seguro al saber que cuando el estudiante\ndomina esta habilidad, es algo que\npuede hacer varias veces a través de la práctica. Otra cosa que veo que es realmente\nbeneficiosa es que los estudiantes, los padres, los\nmaestros y el administrador pueden realizar un seguimiento de cómo les gusta a los estudiantes o cuántas habilidades\nhan dominado. Entonces, en nuestra plataforma\npuede realizar un seguimiento del progreso del dominio por unidad o incluso durante todo el curso y mantener a los estudiantes interesados. Cuando hablamos de\nparticipación estudiantil aquí, ya sabes, durante todo el año, ¿ cuánto de este curso has dominado? Y asegurarse de que los\nestudiantes continúen progresando y\nadquiriendo dominio. Creo que la gran pieza de este rompecabezas siempre es motivar a los estudiantes. Entonces, si los estudiantes tienen\nese objetivo final en mente y saben que,\noye, si puedo llegar al 80 o 90% de dominio de este curso, oye, tendré\nmucha más confianza el día que tenga que sentarme.  el SAT. Así que sí, eso es lo que me gusta. Y también me encanta cómo es transparente desde el estudiante hasta\nel administrador del distrito. Para mí eso es muy importante\npara que todos puedan participar en esa conversación con los estudiantes. - Oh, absolutamente. Quiero decir, los datos deben ser propiedad de todas las partes interesadas\nde un distrito y ser visibles para todos, punto. Así es como va a\ntener un impacto profundo. Pero Raven, desde su perspectiva, incluso como ex líder a nivel de edificio\n, ¿ qué piensa usted sobre la participación y el dominio de, bueno, el dominio de las habilidades y la participación de los estudiantes cuando piensa en el SAT en particular? - Sí, sólo estoy pensando\nen el mundo secundario, ¿ sabes, verdad? Tienes niños en diferentes\ncaminos haciendo diferentes cosas, diferentes horarios en todo el distrito. Entonces, el hecho de que el aprendizaje de dominio\nes algo que los maestros pueden establecer desde el primer día\ny simplemente dejar que fluya y los niños seguirán\nsu propio camino, eso es genial porque es menos tiempo, ¿verdad? Para profesores. Ahora los profesores pueden centrarse\nen el tiempo presencial de los estudiantes y repasar aquellas habilidades en las que los estudiantes no\ndominan, ¿verdad? Y dar, hacer\ngrupos pequeños y administrar eso y luego, ya sabes, hacerlo\ndurante sus PLC usando los datos para realizar un seguimiento, está bien, tal vez\nesto sea algo que debamos cambiar en nuestro\nplan de estudios o instrucción. Me di cuenta de que a la mayoría de los niños les\nva muy mal en ecuaciones literarias, así que tal vez\ndebamos volver atrás y probar esa habilidad nuevamente. Pero lo mejor\ndel aprendizaje de dominio es que si tengo seis\nniveles diferentes en la clase, está bien porque Khan Academy\nlos guiará por el camino que necesitan y que se ajuste a su aprendizaje. Y no hay nada que pueda superar eso porque eso le tomará a un\nmaestro, como dijo Danielle, cuando yo estaba en el\naula hace algunos años, le tomará mucho tiempo a un maestro definir quién necesita\naprender qué en un corto período de tiempo.  tiempo antes del SAT y\nsimplemente no es una tarea manejable. Entonces, usar Khan Academy para\nfiltrar algo de eso y hacer que el maestro coloque a los estudiantes y tenga ese camino y luego puedan concentrarse\nen ese tiempo cara a cara con los estudiantes y esa interacción uno a uno\nes simplemente un cambio de juego. Y para aquellos estudiantes de alto nivel que no quieren sentarse ahí y\nescucharte, ¿adivinen qué? No es necesario. Continúan en Khan\nAcademy donde deben estar. Y eso para mí es, ya\nsabes, algo, como educador y maestro, es decir, ya\nsabes, mis hijos, todos mis hijos, obtienen lo que necesitan y eso es lo más importante. - Sí. Y asegúrate de regresar y volver a escuchar\nlo que acaba de decir Raven. Simplemente dejó caer una gran cantidad (Raven se ríe)\nde datos excelentes y estrategias de mejores prácticas\npara asegurarse de que estuvieran pensando y\nutilizando análisis basados ​​en habilidades para respaldar el aprendizaje de los estudiantes. Ahora vamos a\nretroceder en una máquina del tiempo. Esto no es \"Regreso al\nfuturo\", pero tal vez lo sea. (Raven se ríe)\nNo es justo. Quiero que piensen en el pasado, en el momento en que volvían a\nenseñar en las aulas de la escuela secundaria, pensando en cómo empezar\nel próximo año escolar.  ¿ Cómo pensarías\nen preparar a los estudiantes para el SAT digital y cómo ahora estamos como en\n\"Regreso al futuro\", donde él es como de los\naños ochenta pero en una patineta flotante? Entonces volviste a cuando enseñabas y ahora tienes a Khanmigo y tienes a Khan Academy para ayudarte. Entonces, ¿cómo lo considerarías y cómo\ncambiaría con la introducción de la IA?  ¿ Por qué no nos echas de Sarah? En el DeLorean.\n(Sarah se ríe) Demasiada analogía. Muy bien, adelante Sara. (Raven se ríe) - Creo que casi todo el mundo sabe que la ciencia no se\nmide directamente en el SAT, ¿verdad? Pero dentro de la sección de lectura y escritura y de la sección de matemáticas, hay preguntas que tienen un contexto científico. Entonces yo era profesora de ciencias y el hecho de que la ciencia\nno se mida no significa que esté libre de culpa. Todavía puedo ayudar a mis alumnos\na prepararse para el SAT. Entonces, lo que haría es que mis\nalumnos ingresen a Khan Academy en los cursos de ciencias. Así que ve al\ncurso de biología o de química, de física o de ciencias,\nlo que quieras hacer. Y dentro de esos cursos\nhay artículos y esos artículos tienen mucho texto rico e informativo basado en la ciencia. Y entonces, cuanto más pueda\nlograr que mis alumnos lean ese tipo de texto de contexto científico y se sientan cómodos leyéndolos, \nles será mucho mejor cuando vayan a tomar el SAT. Así que realmente me concentraría en la lectura, las habilidades de lectura minuciosa de\ntextos informativos científicos. Y luego, si los estudiantes\ntienen acceso a Khanmigo, también pueden usar Khanmigo\nen esos artículos. Oye, explica, no\nsé qué significa esta palabra, ayúdame con esto. Nuevamente, es ese\ntutor personal que los ayuda a leer ese texto informativo, lo que nuevamente los ayudará en el SAT. - Eso es increíble. Y me encanta cómo compartes, aunque, ya sabes, las\nciencias no se evalúan directamente, creo que muchos profesores de contenido\na veces dicen, ¿qué?  ¿ Qué tiene que ver mi tema con esto? (Raven se ríe)\nPero simplemente apoyar a los estudiantes y ser\npensadores críticos, estudiantes comprometidos, requiere un esfuerzo de equipo. Así que gracias por señalarlo también. Elizabeth, ¿cuál es tu perspectiva en tu máquina del tiempo DeLorean? - Bueno, ya sabes, enseñé ELA en el grado 11 durante cinco años y siempre sentí que era muy sistemático. Me gusta que las cosas\nsucedan en un momento determinado. Y entonces realmente me\ngustaría hacer un plan al revés desde, ¿cuándo es mi día escolar SAT?  ¿ Cuándo debo hacer que mis alumnos\npractiquen en el Libro Azul? Y realmente empezar en\nagosto con dos cosas. Lo primero que realmente comenzaría es\ncon el desafío del curso. Lo bueno de nuestros\ncursos SAT digitales es que puedes asignar algo así como una evaluación previa.  Se llama desafío de curso. Y les da a los estudiantes,\nya sabes, una muestra aleatoria de las habilidades de ambos cursos. Y puede hacerlo muy\ntemprano en el año escolar y comenzar a recuperar\ndatos de habilidades de inmediato. Entonces, puede comenzar a agrupar a\nlos estudiantes por habilidades, puede comenzar a tener una idea de en qué habilidades los estudiantes ya pueden ser un poco competentes y con cuáles pueden necesitar ayuda. Así que definitivamente comenzaría\ncon el desafío del curso solo para obtener esos datos iniciales. Y luego, ya sabes, con IA y con Khanmigo\nprobablemente pasaría mucho tiempo modelando a\nprincipios de año con mis alumnos, ya\nsabes, oye, este es un ejemplo de un problema que\nno conozco.  cómo responder. Si fuera yo, sería un problema de matemáticas. Que modelaría con mis alumnos. Y realmente muestre a los\nestudiantes cómo pueden interactuar con Khanmigo\npara responder la pregunta, resumir un video o\nresumir un artículo. También creo que las\nparejas colaborativas, los estudiantes que trabajan junto con Khanmigo para ver qué descubren y qué aprenden también serían parte de mi rutina al principio del año escolar. Y luego, avanzando hacia el otoño, ya sabes, comenzando a mirar realmente los datos de habilidades y mis datos de dominio. Entonces, ya sabes, ¿mis\nalumnos han dominado al menos el 15% del curso para, no\nsé, el 15 de octubre? Y simplemente asegurarme de que\nmis alumnos estuvieran encaminados para seguir avanzando en las\nhabilidades probablemente sería mi enfoque si estuviera\nen un salón de clases de ELA hoy. Y ya sabes, a partir de\nenero, asegurarse de que hayan practicado en el\nLibro Azul es muy importante. Y ya sabes, repasar\nlas funciones, todas las herramientas , la calculadora y todo lo que está integrado allí, creo que también es muy importante ser transparente con los estudiantes. - Y realmente me encanta que\nestés criticando el modelaje. Yo era un ex maestro de escuela secundaria y, tal vez puedas identificarte, ¿alguien alguna vez entregó resaltadores a niños de secundaria? - Sí.\n- ¿Sin modelar? Puedes imaginar, ya sabes, lo que sucede, esa es la cuestión. Pero una IA es otra herramienta, pero\nsigue siendo importante modelar. Creo que a veces los profesores de secundaria y preparatoria se olvidan. Piensan, dan por sentado que los estudiantes deben\nsaber usar las cosas, pero en este nuevo mundo, no, no.  El modelado es realmente importante, especialmente cuando hay tantos cambios y tanta innovación. Realmente, además, su enfoque es muy lineal, así que gracias por eso. Cuervo, ¿y tú? - Así que voy a tomar la perspectiva de un administrador de un edificio\nsólo porque Sarah y Elizabeth comparten muchos consejos fantásticos como maestras de aula. Pero ahora es el momento en que planearás\nla programación, ¿verdad? Porque ¿qué es todo lo\nque dicen los profesores? No tengo suficiente tiempo, no puedo hacer eso. No tengo suficiente tiempo para esto. No tengo suficiente tiempo para eso. Bueno, nosotros estamos a cargo, los\nadministradores del edificio, ustedes están a cargo del\nhorario, están a cargo de darles a los maestros ese\ntiempo entre comillas. Y eso es realmente importante, incluso si no cambia tu horario. Como en mi escuela secundaria,\nteníamos bloques de 90 minutos, así que les di, ya sabes,\nvarias opciones diferentes sobre cómo podrían organizar\nsu clase para prepararse para todas las diferentes cosas para las que tienes que prepararte en la escuela secundaria. todos los diferentes exámenes. Y los profesores sólo tienen que saber que usted los está apoyando\nen este viaje. Y parte de eso es brindarles\nfacilidad de acceso. Y eso es lo que hace Khanmigo, ¿verdad? Para que ya no tengan que tener\nese gran libro. Pueden continuar, pueden alinear su contenido durante todo el año\ncon las preguntas del SAT.  ¿ Por qué no pueden tener sábados los viernes? Ya saben, digan: \"Hola chicos,\nsi es así\", como dijo Sarah, no importa qué\ncontenido estén enseñando.  Los viernes, durante los primeros 30\nminutos de nuestro último bloque, haremos la preparación para el SAT en Khan Academy. Ya sabes, los padres también\npueden vincular sus cuentas. Entonces, tal vez si tengo una buena\ntasa de éxito con la tarea, la usaré para la tarea. Pero Khanmigo puede darles datos a los maestros, como decía Elizabeth, para que puedan hacerlo justo antes de la clase en lugar de que tengan que investigar. Khanmigo hará grupos para ti. Le dirá las habilidades\nque necesita trabajar, le dará planes de lecciones e incluso permitirá que los\nestudiantes practiquen. Simplemente dices \"Khanmigo, dame\nalgunas preguntas de práctica\". Entonces, incluso darles a los\nniños suficiente tiempo para hacer eso definitivamente será un\nagente de cambio para que puedan seguir adelante. Sabemos que el tiempo es esencial para los estudiantes, para los profesores. Entonces, esta es solo otra forma\npara que los maestros y administradores ahorren tiempo, tengan un plan y se aseguren de que los estudiantes estén preparados y no esperen hasta\nel último minuto para estudiar, sino que trabajen en esto durante todo el\naño, como dijo Elizabeth, desde  el otoño con ese desafío del curso. Y luego mantenerlo\ndurante todo el año hasta el día del examen en lugar de, ya\nsabes, tener esa ansiedad de meter todo\nen un poco de tiempo porque no tienes tiempo. - Estoy seguro de que ninguno de los que están\nmirando se ha preparado para nada y ha sentido esa presión.  ¿ Bien?\n(Raven se ríe) Especialmente no en la universidad cuando intentas administrar tu tiempo cuando eres joven.\n- Bien. - Esa es la clave: la planificación de la preparación. Y tratamos de\napoyarlo en nuestras asociaciones en Khan Academy para realizar\neste trabajo esencial. Así que ahora quiero, estamos\ncorriendo, hablando de tiempo, casi se nos está acabando el tiempo.  Por eso quiero que pensemos\nen una última perspectiva: los desarrollos futuros. Entonces, al pensar que, ya sabes,\nla forma en que el SAT se ha movido al formato digital, qué\nestamos haciendo en Khan Academy o qué, qué\ncrees que está sucediendo en el mundo de la educación\no qué esperamos para el uso de  ¿AI y\nayudar a continuar este trabajo para el SAT digital?  ¿ Por qué no nos haces empezar, Sarah? - Creo que hay mucha preocupación por el uso de la IA en la educación,\ny con razón, ¿no? Estamos en un mundo completamente nuevo. Pero también creo que lo somos,\ntendemos a pensar en ello de la manera en que nos enseñaron o en la forma en que nos enseñaron a enseñar. Y al avanzar hacia este nuevo mundo del uso de la IA en la educación, lo que espero\nver es que la IA sea una herramienta que nos ayude a enseñar el\npensamiento crítico un poco mejor, un poco más fácilmente. Es algo difícil de enseñar\ny es algo difícil de hacer. Espero que, ya sabes,\nuna mayor colaboración. Estamos tomando IA, ya sabes,\npara todo ese conocimiento de memoria que puede ser\nútil para los estudiantes, ¿verdad? Pero entonces, ¿cómo vamos a conseguir que colaboren de forma eficaz? Y creo que hay un gran lugar donde la IA puede ayudar a profesores y estudiantes a mejorar esas\nhabilidades de pensamiento crítico y colaboración. Y espero que ahí es hacia donde\nnos dirigimos eventualmente. - Y lo que te escuché\ndecir es habilidades humanas. - Bien.\n- ¿Bien? Pensamiento crítico, colaboración. Una computadora no puede hacer eso. Eso es lo que hacen los humanos, y en realidad es una excelente manera de aprender en general. Entonces, nuevamente, sé que tengo mucho, se habla mucho en educación. Es: \"Las computadoras se están haciendo cargo\". Esta puede ser una herramienta para ayudar\ncon las habilidades humanas. Esa es una palabra nueva para todos: humanitario.  ¿ Quizás sea una palabra real?\n- Bien. - Isabel, sálvame.  ¿Qué opinas? - Sabes, espero\nque en el futuro todos se sientan más cómodos con la IA, pero también con el entendimiento de que ese maestro en el aula\nnunca podrá ser reemplazado y que el maestro sigue siendo la conexión humana más importante\ndel mundo.  . Y recuerdo, ya sabes,\nvolvimos al modelaje y recuerdo en el aula, ya sabes, mis alumnos me admiraban y ya sabes, y pasé más tiempo con mis alumnos que con mi propia familia.\nmuchas, muchas ocasiones. Y sé que ellos hacían lo mismo y tomaban largos\nviajes en autobús, ya sabes, hasta mi escuela. Y, ya sabes, espero que en el futuro, los estudiantes, ya sabes,\ntodavía tengan, ya sabes, esa conexión humana con sus compañeros y con sus estudiantes y el mundo y la comunidad que los rodea, pero que se sientan más\ncómodos usando  IA para mejorar lo que tienen, lo que\nsaben y lo que pueden aprender. También me encantaría que la IA tuviera un papel en las evaluaciones. Creo que los datos son muy importantes no solo para los líderes de nuestros distritos escolares\n, sino también para nuestros directores, estudiantes y padres. Y me encantaría ver algún\ntipo de incorporación de IA en nuestras evaluaciones formativas de ciclo corto que les damos a nuestros estudiantes. \nNo estoy exactamente seguro de cómo se ve eso, pero definitivamente es algo en lo que he\nestado pensando en cómo esto\npodría cambiar el mundo de las evaluaciones en el futuro. - Si absolutamente. Y Raven, me encanta que sigas dándonos la perspectiva administrativa.\n(Raven se ríe) Así que sigamos adelante.  ¿ Cuáles son tus pensamientos? - Quiero decir, estaba\npensando en eso, ya sabes, desde que era estudiante hasta que enseñaba en la\nescuela y ya sabes, administrador e incluso esta\nperspectiva que tengo ahora, trabajando con los distritos todos los días.  Ya sabes, siempre\nhabrá algo nuevo. Y en el caso de la educación, creo que\nlo tenemos claro, ¿verdad? Recibimos un nuevo plan de estudios\ncada dos minutos, obtenemos nuevas herramientas, obtenemos de todo. Entonces esta es una de esas cosas. Pero esto lo tenemos que tratar con un poco\nmás de delicadeza, ¿no? Tenemos que asegurarnos de que estamos modelando. Estamos exponiendo no solo a nuestros\nmaestros, estudiantes y administradores, sino también a nuestra\ncomunidad y a nuestros padres porque afectará a todos. Ya lo es, ¿verdad? Como lo utilizamos en el día a día, a veces sin saberlo. Si tienes Alexa en\ntu casa, si tienes, ya sabes, Google, si\ntienes Google Nest o cualquiera de esas cosas. -Siri.\n- Sabes. Sí, Siri.\n(Danielle se ríe) Usas IA todos los días y sabes, no lo\npiensas dos veces. Entonces eso es lo que necesita.  Eso es\nlo que espero para el futuro. Eso es algo que\nni siquiera te lo pensarás dos veces.  Ya sabes, antes de COVID, no todo el mundo tenía ni siquiera dispositivos uno a uno. Ni siquiera pensamos, está bien, todos tendrán una computadora y harán\nsu trabajo en la computadora. Ni siquiera en el\nedificio de la escuela, pero lo logramos. Así que esta es sólo\notra de esas cosas que han pasado a primer plano y tenemos que aceptarla\ny aprenderla. No le tengas miedo. Y luego enseñe, enseñe,\nenseñe, modele, modele, modele y asegúrese de que se\nutilice de la manera adecuada y que los estudiantes conozcan su valor, porque es valioso. No es sólo una herramienta para que los estudiantes hagan trampa o, ya sabes, pierdan el tiempo porque sé que eso es lo que\nmucha gente piensa, pero es realmente valioso. Y voy a decir una pequeña historia porque sé que se nos está acabando el tiempo, pero como todos los demás, cuando sabes que Khanmigo salió, nació hace un año, ya\nsabes, en marzo más o menos. Yo estaba como, oh Dios mío, ¿\nqué estamos haciendo? Como si esto fuera una locura, como\nuna IA, ya sabes, estaba tratando de leer\nlibros y buscar artículos y todas las cosas para intentar, ya sabes, ayudarme a entender lo que estaba pasando. Y nunca olvidaré a mi gerente diciendo: \"Saben, esto está aquí, muchachos. Tenemos que\naceptarlo, tenemos que usarlo, tenemos que saberlo para poder ayudar a\nnuestros socios del distrito\". Y pensé en eso y pensé, ya sabes, ella tiene razón. Y, pero pienso, sólo\nnecesito verlo por mí mismo. Entonces tuve la oportunidad de\nir a una escuela en California y verla en acción y esta escuela usando\nuna población especial. Por eso lo utilizan con estudiantes ávidos, estudiantes de educación especial y estudiantes ELL. Y eso cambió toda mi perspectiva porque básicamente, tal como lo queríamos, un maestro, todos los\nniños, tenían a Khanmigo para ayudarlos y no perdieron el ritmo. Así que no había niños\nsentados allí esperando, reclinados, sin hacer nada. Inmediatamente, cuando\nel maestro estaba trabajando con otros estudiantes,\ninmediatamente se subieron a Khanmigo, le preguntaron a Khanmigo qué\nnecesitaban y continuaron. Y eso fue como, Dios mío, como si no tuviera una fila\nde niños esperando que les pidiera ayuda. Yo, ya sabes, no hay\nnadie, no tengo que preocuparme de tener que hacer esta lección durante tres días más de los necesarios porque la mitad de mi clase no la entendió. Tenían a alguien allí\nque podía ayudarlos y cambiar el idioma para que pudieran recibir apoyo en\nel idioma que necesitaban. Entonces, con toda la\nescasez de maestros, con toda la escasez que está sucediendo,\neso realmente, ya sabes, fue algo especial que vi y realmente me hizo sentir que\nestamos haciendo lo correcto y que Khanmigo\nva a ser realmente  algo que cambiará la\nvida de mucha gente. - Bueno, Raven, Sarah, Elizabeth, ésta fue una conversación maravillosa. Aprecio todo su tiempo, sus pensamientos y sus perspectivas. Y en cuanto al punto de Raven, espero que puedas ver esto, allá vamos.  ¿ Pueden ver esto? Estamos aquí contigo. Khanmigo, ¿verdad?  Contigo. Nos encantaría trabajar con usted. Nos encantaría asociarnos con usted. Queremos avanzar hacia el futuro contigo. Entonces, si quieres asociarte\ncon nosotros en Khan Academy, tienes muchas ventajas diferentes. En primer lugar, todos los cursos son gratuitos. Todos lo saben, ojalá lo sepan, pero los cursos los obtienen gratis. Pero, cuando se asocia\ncon nosotros, le ayudamos. Estos increíbles humanos en\neste panel se asocian con los distritos todos los días. Obtiene un servicio de guante blanco,\ntiene aprendizaje profesional, tiene listas automáticas y datos personalizados. También queremos ayudarlos\na empoderar a todos los estudiantes para que tengan ese acceso equitativo\nal contenido de su nivel de grado, para que tengan ese aprendizaje comprometido y se aseguren de que estén haciendo todas las cosas y desarrollando esas habilidades. Por eso te ayudamos a seguir el progreso. Y lo más importante, quiero decir que\ntodo eso es realmente importante. Pero lo más importante es que\nhemos desarrollado una IA segura y ética en Khanmigo. Valoramos, sabemos que los datos y la privacidad de los estudiantes son realmente importantes. Tenemos barreras de seguridad particulares porque todos ustedes trabajan con\nhumanos maravillosos e increíbles y hay escasez de maestros y a veces los estudiantes necesitan ayuda y a veces van a\npedir ayuda con Khanmigo y queremos asegurarnos de que\nestamos inscribiendo a los adultos y  los humanos que pueden ayudar con eso. Entonces, si está interesado en obtener más información, pusimos un enlace en el chat. Este es nuestro equipo de socios distritales\n.  Comuníquese con nosotros. También puedes escanear este código QR. Puede ingresar a nuestro\nsitio web, verlo hoy y simplemente, lo apreciamos mucho. Y hasta que nos volvamos a encontrar, fue\nmaravilloso aprender contigo.  Que tengas un maravilloso resto de tu día.",
    "t_arabic": "- حسنًا جميعًا. حسنًا، سنأخذ بعض\nالوقت الآن لتقديم نفسي كمضيف وبعد ذلك سأسمح\nلأعضاء اللجنة الرائعين بالمضي قدمًا وتقديم أنفسهم. امر جميل ان التقى بك.\nاسمي دانييل سوليفان. أنا مدير أول\nلشراكات المنطقة في الشمال الشرقي لأكاديمية خان. وقبل كل هذا، منذ فترة طويلة، كنت أعمل في مجال تكنولوجيا التعليم لفترة قصيرة، لكنني كنت أيضًا مدرسًا للتعليم الخاص للصف الخامس والسادس في شمال ولاية نيويورك وفي واشنطن العاصمة. لذلك أنا متحمس لوجودي هنا\nاليوم للحديث عن اختبارات SAT. سارة، لماذا لا تمضي\nقدمًا وتبدأنا بمقدمات اللجنة. - بالتأكيد.  مرحباً جميعاً. اسمي سارة ثالر. أنا مدير نجاح المنطقة. أعمل بشكل أساسي مع\nمناطق في ميشيغان وأوهايو. قبل انضمامي إلى أكاديمية خان، كنت مدرسًا للعلوم في المدرسة الثانوية\nلمدة 10 سنوات تقريبًا، وبعد ذلك كنت في الإدارة\nومدير المناهج الدراسية من مرحلة الروضة حتى الصف الثاني عشر. وبعد ذلك\nكنت لمدة تسع سنوات تقريبًا في College Board. ولذلك كنت أعمل مع\nإدارات التعليم بالولاية، للمساعدة في إدارة\nمجموعة تقييمات اختبار SAT \nلتقييمات المساءلة الفيدرالية الخاصة بالولاية. ولذلك أنا سعيد جدًا لأنني\nقادر على تطبيق معرفتي باختبار SAT في المناطق التي\nأعمل معها في أكاديمية خان. - عظيم يا سارة.  شكرًا لك. حسنًا يا إليزابيث. - مرحبا مساء الخير. اسمي إليزابيث هادلي وأنا أيضًا مديرة نجاح المنطقة، وأعمل مع المناطق في جميع\nأنحاء الولايات المتحدة، مع التركيز على\nتنفيذ اختبار SAT الرقمي مع أكاديمية خان. قبل وصولي إلى أكاديمية خان، كنت أعمل في مقاطعة في\nأورلاندو تسمى مقاطعة أوسيولا. كنت مدرسًا ومدربًا سابقًا لمحو الأمية وقضيت أربع سنوات في مكتب بحث وتقييم في\nتنفيذ التقييمات، والتقييمات التكوينية للدورة القصيرة من PLC، وكذلك تنفيذ أكاديمية خان مع طلاب المدارس الثانوية البالغ عددهم 20000 طالب. لذلك، إنه لمن دواعي سروري\nأن أتمكن من مشاركة كل تلك المعلومات التي\nلدي مع المناطق التي أعمل معها الآن في أكاديمية خان. - ليس بالأمر المهم، فقط تنفيذ\n20 ألف طفل. - قليلا في خان.\n- تماما مثل العمل مع العديد من دوائر الدولة. ليس مهما. والغراب. - أهلا جميعا.  سعيد جدا\nلرؤيتكم جميعا اليوم. اسمي رافين كاسيوس. أنا مدير نجاح المنطقة، وأعمل في الغالب مع\nالمناطق في الشمال الشرقي وأرى شخصًا من\nجرينسبورو، لذا نرحب به. وقبل ذلك، كنت\nفي مرحلة الروضة وحتى الصف الثاني عشر لمدة 22 عامًا تقريبًا. كنت مدرسًا للعلوم،\nومدربًا تعليميًا، ومؤخرًا مديرًا لمدرسة ثانوية.  على دراية كبيرة باختبار\nSAT وإعداد أولياء الأمور والطلاب والمدرسين\nوالمشاركة في هذه العملية. يسعدني جدًا أن أشارك خبرتي اليوم حول كل الأشياء التي\nتتوافق مع اختبار SAT. - رائع.  لذا سأتوقف عن\nمشاركة شاشتي لأن الهدف من اليوم هو إجراء \nمحادثة تفاعلية وتعاونية حول كيفية دعمنا لك والتفكير من خلال إعداد\nالطلاب لامتحان SAT الرقمي. نحن ندرك أنه\nأينما تشاهدون هذا، فأنتم الموجودون هنا اليوم،\nفي رحلة مختلفة. وإذا كنت تشاهد هذا في المستقبل، فقد تكون في\nرحلة مختلفة للخط الزمني. لكن هدفنا اليوم هو حقًا\nمساعدتك على الفهم من خلال وجهات نظر ووجهات نظر مختلفة كيف\nيمكن للطلاب مساعدتهم في تعلم اللغة الإنجليزية والرياضيات واللحاق بها، خاصة بعد\nالوباء، الذي كان كثيرًا. يعني حد\nفاكر سنة 2019؟ هل من احد؟\n(ريفين يضحك) أنا، لا.  يمين؟ أعني، من يعرف حتى؟ لذا فإن كيفية الانتقال إلى تنسيق التقييم الرقمي الجديد\nقد يكون أمرًا صعبًا. لذلك نحن هنا\nلدعمك وفهم القطع ووجهات نظرنا. يمكنك طرح الأسئلة في الدردشة. يمكنكم التعاون مع\nبعضكم البعض في الدردشة أو يمكنك إرسال\nأسئلة من الأسئلة والأجوبة. لذا فأنا جاهز وجاهز. سأطرح أسئلة على أعضاء اللجنة، ولكن من فضلك، نود\nأن نسمع منك أيضًا. لذا، لنبدأ يا سارة، لقد كان\nاختبار SAT موجودًا منذ فترة طويلة. لدينا عدة أشهر في الانتقال إلى الاختبار الرقمي. كيف كان التحول بالنسبة للمدارس وكيف لاحظت\nالاستعداد للاختبارات وكيف كان ذلك، كيف كان ذلك؟ - بالتأكيد.  كما تعلمون، التغيير صعب.  وكان هناك الكثير منه هذا العام. إذا كنت تدير يومًا دراسيًا لاختبار SAT أو إذا كنت مركز اختبار في عطلة نهاية الأسبوع، فمن المحتمل أنك تركز على الكثير من التغييرات الإدارية التي كان يجب أن تحدث مع الاختبار الرقمي. إذن، كيفية تثبيت الكتاب الأزرق، وكيف يقوم الطلاب بتسجيل الدخول إلى\nالكتاب الأزرق، ومجموعة أدوات الاختبار، والطلب، والتسجيل،\nوالغرف، وتدريب موظفيك، كل تلك الأشياء اللوجستية كانت كثيرة بالنسبة للمعلمين هذا العام إذا كنت تدير في المبنى الخاص بك. ولكن الآن نأمل، ربما يكون لديك إدارة واحدة أو أكثر تحت حزامك وتشعر بثقة أكبر بشأن إدارة الاختبار فعليًا ويمكنك التركيز الآن،\nكما تعلم، على مساعدة الطلاب والتعمق في البيانات\nالتي قد تحصل عليها مقابل ذلك  . - عظيم. إليزابيث، ماذا عن ماذا رأيت من وجهة نظرك؟ - حسنًا، كما تعلم، تمامًا كما قالت سارة، التغيير صعب حقًا. ويجب أن أكون صادقًا، لقد\nعملت مع القراء المكثفين لفترة طويلة جدًا في محاولة لإيصالهم\nإلى خط النهاية في اختبار SAT وكنت متوترًا حقًا بشأن كل التغييرات.  لقد كنت متوترًا من اضطرار المعلمين، خاصة في فصول القراءة، إلى الانتقال من كتابة التعليقات التوضيحية على النص والعمل مع النصوص بأصابعهم، وتقسيم النص إلى تنسيق رقمي. ولكي أكون صادقًا معك، مع مرور العام، كان الانتقال أكثر\nسلاسة مما كنت أتوقعه. إذا كنت تتحدث معي في\nالصيف الماضي، كنت متوترًا جدًا. ولكن بمجرد أن دخلنا في تقلبات الأمور وكان الطلاب\nيتدربون في أكاديمية خان وكانوا يتعرفون\nعلى تلك العناصر الرقمية، بدأت أشعر أن الأمر كذلك، وكانت المناطق تبلغني بأنهم يقومون بعمل جيد حقًا في ذلك وهم يعملون بشكل جيد\nمع الآلات الحاسبة عبر الإنترنت وأشياء من هذا القبيل. الآن مع المناطق التي\nكنت أتحدث إليها، يقوم الطلاب بإبلاغ\nالمعلمين بأنهم، كما تعلمون،\nأحبوا ذلك كثيرًا.  لم يكن طويلا. لقد كان من الأسهل قليلاً الإجابة على بعض الأسئلة. من الواضح أن البيانات\nستخبرنا ما إذا كان الأمر أسهل أم لا، لكن كما تعلمون، حقيقة أن الطلاب\nيستجيبون بشكل أفضل قليلاً لهذا التنسيق الرقمي لم تكن\nمفاجأة جميلة بالنسبة لي فحسب، ولكنها كانت أيضًا مثيرة، كما\nتعلمون،  لسماع تلك التعليقات والأخبار من شركائنا في المنطقة. - أوه، بالتأكيد. أنا، هل تتذكرون جميعًا أخذ اختبار SAT؟ تذكر عندما كانت في التاسعة عشرة من عمرها (دانييل تنظف حلقها) التغيير دائمًا صعب، أليس كذلك؟ رافين، ماذا ترى\nمن وجهة نظرك؟ - لذلك أردت فقط أن أقول إنه في العام الماضي، كنا في شراكة مع College Board، وهي\nشراكة رائعة كانت لدينا. وبدأنا في نقل\nمناطقنا العام الماضي. بدأنا في إعدادهم،\nوبدأنا في إعدادهم، وبدأنا في منحهم أكبر قدر ممكن من\nالمعلومات، بقدر ما نستطيع، لتجهيزهم نوعًا ما، وإعداد طلابهم، ووضع\nخطة نوعًا ما. لذلك أشعر أنهم كانوا جاهزين.  لقد طلبوا المساعدة منا، ونحن سعداء\nبالتعاون معهم. وبعد ذلك، بمساعدة\nدورة Khan Academy SAT الجديدة وتطبيق Blue Book، تمكنا من\nإعداد الطلاب وتشغيلهم. وكما قالت سارة،\nأعتقد أن التغيير الأكبر كان بالنسبة للمعلمين والإداريين. أطفالنا مرنون للغاية، أليس كذلك؟ إنهم يلجأون إلى التكنولوجيا بسرعة كبيرة. لذلك لم يكن الأمر صعبًا على الطلاب.  أعتقد أنه كان من الصعب على المعلمين الاستعداد أكثر من أي شيء آخر. ولكن كما قالت إليزابيث،\nالبيانات فقط هي التي ستخبرنا. وأعتقد أنه مع الاستعدادات التي أجراها الطلاب في أكاديمية خان، فأنا متحمس لسماع أخبار المناطق بمجرد أن يبدأوا في استعادة تلك النتائج. - قطعاً. ومرة أخرى، في الدردشة،\nإذا كنت تريد المشاركة، ما هي تجربتك مع التغيير؟  هل نجحت؟  كيف تشعر حيال ذلك؟ لكن سارة، بما أننا سنقوم\nبالاتصال بمجلس الكلية، أود منك أن تفكري في نهج أكاديمية خان\nللتحضير لاختبار SAT. كيف نفكر في\nهذا الأمر في أكاديمية خان لمساعدة الطلاب على الاستعداد والتأكد من أنهم\nيفهمون ما يجب عليهم فعله؟ - بالتأكيد. أعني، أعتقد أنه عندما\nنفكر في الإعداد لاختبار SAT، فإننا نفكر في كل تلك\nالأنشطة التحضيرية.  كما تعلم، من خلال التعرف على الكتاب الأزرق، وعدد الأسئلة، ونوع\nالأسئلة، وإدارة الوقت. وعلى الرغم من أهمية\nوحاجة الطلاب إلى هذه المهارات، إلا أن ما نريد حقًا أن نحاول التركيز عليه وتحسين درجات اختبار SAT وبالطبع يعني ذلك الاستعداد للكلية لأن هذا هو ما\nتم تصميم اختبار SAT لقياسه. نحن حقا بحاجة إلى التركيز على المهارات. وهذه ليست مجرد مهارات في اختبار SAT، بل هي\nمهارات القراءة والكتابة والرياضيات الدائمة التي يحتاج الطلاب إلى معرفتها،\nليس فقط من أجل الاستعداد للكلية، ولكن ليكونوا ناجحين أيضًا في دوراتهم الدراسية الأخرى في المدرسة الثانوية. لذلك أعتقد أن تركيزنا على تلك المهارات الدائمة أمر\nمهم حقًا. - شكرًا لك. لذا، إليزابيث، تعرّفي معنا على كيفية التعامل مع المهارات في أكاديمية خان. - نعم، سؤال عظيم. كما قال Raven، كما تعلمون، نحن في شراكة مع College Board، لذا فهم يساعدوننا في تصميم تلك الأسئلة للتأكد من توافقها بنسبة 100%. لكن كما تعلمون، عند الحديث\nعلى وجه التحديد عن المهارات، فإن كلاً من دوراتنا الرقمية لاختبار SAT والرياضيات والقراءة والكتابة\nلديها سلسلة من المهارات. الرياضيات لديها مثل 111 و ELA لديها حوالي 41 إلى 50 مهارة. وعندما نتحدث عن تعلم الإتقان ونتحدث عن تعلم طلابنا\n لهذه المهارات بشكل أصيل، مثلما\nذكرت سارة في الكلية والعمل والحياة بشكل عام. ما أحبه في\nأكاديمية خان هو أن الطلاب والمدرسين\nوالإداريين قادرون على تتبع\nمستوى كفاءة الطالب في تلك المهارات. وهكذا طوال العام، بدءًا من أغسطس، نقوم بتتبع الطلاب الذين\nيعملون من خلال تلك المهارات وما إذا كانوا قد\nوصلوا إلى إتقان تلك المهارات أم لا. لأنهم إذا كانوا ماهرين،\nفأنا، كمعلم، أكثر ثقة بأنهم\nسيكونون قادرين على الإجابة على هذا السؤال بأنفسهم\nعندما يتعلق الأمر باختبار PSAT أو SAT في يوم الاختبار. وهذا هو الشيء\nالذي أعمل عليه أنا وسارة ورافين بجد\nمع شركائنا في المنطقة، كما تعلمون، إليك المهارات التي يتفوق فيها طلابك. هذه هي المهارات التي نحتاج\nإلى الاعتماد عليها والحصول على المزيد منها  دعم الذهاب.  وهذا ما \nيشكل إطارًا لمحادثاتنا مع شركائنا طوال\nالوقت، ما هي المهارات وكيف\nيقوم الطلاب بهذه المهارات؟ - ورافين، من وجهة نظرك، ما الذي تفكر\nفيه أيضًا عندما يتعلق الأمر بالمهارات؟ لأنني أعلم أنك\nتفكر في المهارات كثيرًا. - نعم. لذا فقط للاستفادة من ما\nقالته إليزابيث وسارة، فإن الشيء العظيم في\nأكاديمية خان هو أنها متجر شامل لاختبار SAT، أليس كذلك؟ كما يمكن للطلاب الدخول،\nيمكنهم خوض تحدي الدورة. يمكن أن يمنحنا ذلك، نحن المعلمين،\nمن بداية العام الدراسي حيث\nيحتاجون إلى الاعتماد. لذا بدلاً من إضاعة الوقت، وإنجاب الأطفال مجرد نوع من التدريب والقتل، سنتبع النهج، دعونا نعتمد على ما  إنهم بحاجة. إذا كانوا يعرفون ذلك بالفعل، فليكن، فسوف يحصلون على هذه المهارات\nطوال العام الدراسي من معلمهم. لكن المهارات التي يحتاجون إليها قليلًا، وقليلًا من المساعدة الإضافية،\nسنركز عليها ومن ثم\nسينظر المعلمون في تقاريرهم ثم يعودون وربما\nيشكلون مجموعات صغيرة أو يمنحون مهام تعزيز إضافية خارج المقرر الدراسي  هدف الإتقان.  لقد قمنا بعمل جيد\nبالتوافق مع College Board وإنشاء هذه\nالفئات الثلاث المختلفة في الدورة الإعدادية لاختبار SAT. لدينا الأساس\nوالمتوسط ​​والمتقدم. لذا، تمامًا مثل اختبار SAT\nلأنه أصبح قابلاً للتكيف الآن، نريد التأكد من\nحصول طلابنا على كل ما يحتاجون إليه في جميع\nمجالات الاختبار. - ذلك رائع. لذلك أريد أن نبدأ الآن في شرح كيفية تفكيرنا\nفي استخدام الذكاء الاصطناعي للدورات التدريبية. إذن سارة، بالتفكير في الذكاء الاصطناعي،\nما هي بعض التحديات والفرص التي يتم\nتقديمها عند استخدام الذكاء الاصطناعي للتحضير الرقمي لاختبار SAT؟ - نعم، أحد الأمثلة المباشرة التي خطرت في ذهني هو\nعندما كنت أقوم بتدريس العلوم، قمنا بتنظيم معسكر تدريبي للإعداد لاختبار SAT\nكان بمثابة دورة مدتها أسبوعين كان لدينا الطلاب\nيأخذونها خلال فصل الصيف. يمكنهم الاشتراك في ذلك. لكنني واجهت صعوبة حقيقية في\nمعرفة كيفية تدريس ذلك، وكيفية إبقاء الطلاب منخرطين\nفي بعض هذا المحتوى الذي، كما تعلمون، ربما لا يكون\nمثيرًا للغاية بالنسبة لهم. أعلم أن الكثير منكم ربما يكون\nلديه دورات إعدادية أو مواد اختيارية في مدرستك. ولذلك أعتقد أن الذكاء الاصطناعي كان من الممكن أن يكون\nفرصة بالنسبة لي ويوفر لي\nالكثير من الوقت وهو استخدام أدوات معلم خانميغو الخاصة بنا. وهذا كان سيجعل\nحياتي أسهل كثيرًا لأنني أمضيت الكثير من الوقت\nمحاولًا اكتشاف كيفية إبقاء الطلاب منخرطين\nوالقيام بهذه الأشياء. لكن لدينا مولدات لخطط الدروس والتي كانت ستكون مفيدة للغاية. هناك مثل أداة المعلم Khanmigo حيث تقوم بإنشاء نص معلوماتي، وكما نعلم، يعد نوع القراءة وامتلاك مهارات القراءة القريبة أمرًا في\nغاية الأهمية. لذلك، تم إنشاء هذا\nالنص المعلوماتي لطلابي ليتمكنوا من التدرب عليه. لدينا أداة معلم خانميغو\nحول إبقائها ذات صلة، ومولدات سياق العالم الحقيقي،\nوكل تلك الأشياء التي أنفقت للتو الكثير من\nالطاقة العقلية في محاولة التوصل إليها بمفردي،\nكان بإمكان خانميغو أن يفعل ذلك من أجلي. ولذا أتمنى لو كان لدي تلك الأدوات في يوم التدريس،\nفي الماضي. (ريفين يضحك) - هل يشعر أي شخص آخر بهذه الطريقة؟ أي شخص آخر يقضي أي وقت في التخطيط. (ريفين يضحك)\nمجرد مزاح.  أعرف أنك. إليزابيث، أراك متعاطفة، وتهزين برأسك حقًا.\nهذه هي الكلمة هناك. إذن ماذا تضيف إلى المحادثة؟ - نعم، أعني، أتذكر\nالكثير من أيام الأحد التي كنت أقوم فيها بالتحضير لتحضيراتي المتعددة، كما تعلم، والتأكد من التخطيط لكل شيء\nلهذا الأسبوع. ومن المدهش بالنسبة لي مدى سرعة تنفيذ بعض هذه الأشياء تلقائيًا باستخدام Khanmigo.  كما تعلمون، الذكاء الاصطناعي جديد بالنسبة لنا جميعًا.  كما تعلمون، فإن العديد من أدوات الذكاء الاصطناعي الأخرى\nالموجودة في خانميغو ليست جديدة بالنسبة لنا فقط كما هو الحال في أكاديمية خان\nوزملائي في هذه الدعوة، ولكنها جديدة بالنسبة لمدرسينا، وهي جديدة بالنسبة لآبائنا،\nومدير منطقتنا.  لقد كان عامًا رائعًا حقًا، مجرد نوع من الاكتشاف والتعلم.  وأعتقد، كما تعلمون، أن\nأحد التحديات التي يواجهها المعلمون اليوم في الفصل الدراسي هو\nفهم الطلاب لكيفية التفاعل مع خانميغو ومع الذكاء الاصطناعي، وقد توصلت بالفعل إلى نتيجة مفادها أن هناك الكثير من النمذجة\nالتي يجب إشراكها لطلابنا.  كما تعلمون، هذا ليس جوجل. إنها ليست طريقة سريعة\nللحصول على إجابة. يجب عليك حقًا\nالعمل مع الطلاب حول كيفية التحدث إلى Khanmigo وكيف يمكنك استخدام Khanmigo بشكل أصيل لمساعدتك على التعلم، كما تعلم، فهم\nالمهارات والمهام الجديدة. حيث أرى أنه مفيد حقًا مثلما هو الحال في الإعداد لاختبار SAT، كما تعلمون، التدريس في مجموعات صغيرة في الفصل الدراسي، كما تعلمون، وجود\nمدرس شخصي في كل مكتب. لذلك عادة ما يكون هناك معلم واحد فقط\nفي الفصل الدراسي. إذا كانوا محظوظين يحصلون على\nاثنين أو معونة أو مساعد. لكن القدرة على جعل الطلاب يحصلون على تلك التعليقات الفورية ويعملون على شيء\nيحاولون تعلمه في متناول أيديهم دون وجود ذلك\nالمعلم بجوارهم، أعتقد حقًا أن هذا هو الشيء\nالقوي في كل هذا. وعندما يتعلق الأمر بالتحضير لامتحان SAT، كما تعلمون، فإن جميع الطلاب يستحقون كل\nالمساعدة التي يمكنهم الحصول عليها، وهذا بالتأكيد شيء\nأراه قويًا جدًا في الفصول الدراسية في المستقبل. - أوه، بالتأكيد. أعني أن التكنولوجيا قطعت شوطا طويلا، ولكن كما شاركنا، قد يكون التغيير صعبا. أعني أنني أتذكر أن اختبار SAT الإعدادي\nكان كتابًا ضخمًا مثل هذا. مرة أخرى، تتذكرون جميعًا، أعني، في العام، بلا، بلا بلا. إذن، بالتفكير في\nالتطور، والتفكير في الذكاء الاصطناعي، ما الذي تراه في المناطق التي تعمل معها بشأن الفرص والتحديات؟ - إذًا، كما تعلم، الفرص هي\nمجرد الأسهم، أليس كذلك؟ نحن نعلم أن الجميع ليس\nلديهم أم تبقى في المنزل أو الوصول إلى مدرس. لذا فإن حقيقة أن لدينا أداة يمكن لجميع الطلاب استخدامها\nبغض النظر عن مستوى الصف الدراسي، والحالة التي يعيشون فيها، أمر مذهل.  كما تعلمون، وبصراحة،\nلدي مراهقين ولا أعرف كل الأشياء التي يتعلمونها الآن\nعلى الرغم من أنني معلمة. لذا تخيل فقط\nوالدًا غير معلم يحاول التنقل بين جميع الأشياء المختلفة التي يتعلمها الطلاب في الوقت الحاضر. لذا فهو لا يمكنه فقط مساعدة الآباء، لأنني أستخدم خانميجو في كثير من\nالأحيان لمساعدة أطفالي، ولكن هذا، كما قالت إليزابيث، هذا مدرس مخصص\nلكل طالب في كل فصل دراسي في\nجميع أنحاء البلاد. وكما تعلمون، تمامًا مثل أي أداة جديدة، فإن التحديات\nتأتي دائمًا مع الوقت، أليس كذلك؟ متى سأقوم بتدريب\nأساتذتي على استخدام هذا؟ كيف سأستخدم\nهذا حتى يستخدموه بأمان؟ هذه هي كل الأشياء\nالتي تمثل تحديات دائمًا. لكنني أشعر أننا في\nأكاديمية خان، قمنا بعمل جيد حقًا في\nاكتشاف كل هذه الأشياء، كما تعلمون، مع وجود الإشراف وتمكين المعلمين من\nمراقبة الدردشة وتمكين الآباء من\nالارتباط بالحسابات و  مراقبة الدردشة الخاصة بهم. لذلك ستكون هناك دائمًا\nتحديات لأن ChatGPT وكل تقنيات الذكاء الاصطناعي\nتتغير باستمرار، أليس كذلك؟ نماذج اللغة الكبيرة تهلوس،\nهناك كل الأشياء، لكن كما تعلمون، حتى مع أي تكنولوجيا جديدة أو أي منهج جديد، فإن التكيف أو أي من تلك الأشياء في\nالمدرسة يمثل دائمًا تحديًا. ويتطلب الأمر فقط، كما\nتعلمون، القائد المناسب ونحن نرشدك خلال\nالتنفيذ للتأكد من أن\nالتحديات في حدها الأدنى. لكنني لن أكون\nمديرة مدرسة ثانوية سابقة إذا جلست هنا وقلت أنه لن تكون هناك\nأية تحديات لأنها ستكون موجودة بالتأكيد. ولكن كما تعلمون، نأمل أن تكون هذه هي الأشياء التي يستطيع فريقنا اكتشافها لك ومساعدتك في التنقل بين\nبعض هذه الأشياء. - يمين؟  وكان هناك سؤال في\nالدردشة حول العرض التوضيحي المرئي. نريد التركيز على المزيد\nمن المحادثة اليوم، ولكننا، قبل أن\nنترككم جميعًا اليوم، سنقدم لكم بعضًا منها،\nونوجهكم في اتجاه حيث يمكنك الوصول إلى\nالأشياء ورؤية الأشياء وهناك الكثير من الموارد، ولكننا نحاول أن نقدم لك المزيد من وجهة نظر المعلم بدلاً من أن نعرض لك مجموعة من الأشياء. (ريفين يضحك)\nإنه رائع. إنه رائع جدًا. ومع ذلك، نريد أن نتحدث أكثر عن السبب والكيفية وراء ذلك، وكما قال Raven، سأقدم لك\nالمزيد من المعلومات حول الطريقة التي نود أن\nندعمك بها في هذا العمل. لكني أريد العودة إلى\nالتعلم وإتقان التعلم. هذا مصطلح مثير للاهتمام حقًا وأشعر أننا بحاجة إلى التحدث أكثر من أسطح التعليم\nحول حماية التعلم. ماذا يعني إتقان المهارات؟ سارة، أود\nمنك أن تفكري في كيفية، ما هو الدور الذي يلعبه تعلم الإتقان ومساعدة الطلاب حتى في\nتنسيق SAT الرقمي الجديد؟ - نعم، أعتقد أن\nالطبيعة المتأصلة لتعلم الإتقان هي التأكد من أن الطلاب\nلديهم أساس قوي وتلك\nالمعرفة الأساسية للبناء عليها. لذلك لا توجد أي فجوات، ولا توجد فجوات في تعلمهم. ومن ثم\nتعكس الدورة الإعدادية الرقمية لاختبار SAT هذا، وقد ذكر Raven هذا من قبل، من خلال تعزيز تلك المهارات، لدينا تلك\nالمستويات الأساسية، الصعوبة المتوسطة، والصعوبة المتقدمة\nلضمان ليس فقط اتساع نطاق المهارات التي\nنقدمها للتأكد  تلك تتماشى مع ما يتم تقييمه في اختبار SAT، ومرة ​​أخرى، تلك المهارات الدائمة، ولكن عمق تلك المهارات أيضًا. - نعم على الاطلاق. أعني حتى التفكير في\nاختبار SAT، لماذا نأخذ ذلك؟  هل من أحد يا بيولر؟  أنا فقط أمزح. نحن نأخذها حتى\nيتمكن الطلاب من مواصلة التعلم، والاستمرار في إتقان التعلم، ونأمل أن يكون ذلك في مؤسسات مختلفة. حسنًا، سارة أو إليزابيث، ما الذي رأيته من وجهة نظرك حول التعلم المتقن؟ - حسنًا، كما تعلمون،\nكان تعلم الإتقان بالنسبة لي دائمًا هو \nوصول الطلاب حقًا إلى عمق تلك المهارة والقدرة\nعلى إعادة إنتاج كفاءتها عدة مرات مختلفة. ولكي\nيظهر طلابنا كفاءتهم في إحدى المهارات الموجودة في أكاديمية خان، يجب عليهم رؤيتها مرتين على الأقل والحصول على هذه المهارة بشكل\nصحيح في تقييم أو اختبار وحدة أو تحدي الدورة التدريبية. لذلك أشعر دائمًا\nبثقة أكبر عندما أعلم أنه عندما\nيتقن الطالب هذه المهارة، فهذا شيء\nكان قادرًا على القيام به عدة مرات من خلال التدريب. الشيء الآخر الذي أرى أنني\nمفيد حقًا هو أنه يمكن للطلاب وأولياء الأمور والمعلمين\nوالمشرفين تتبع كيفية إعجاب الطلاب أو عدد المهارات التي\nأتقنها الطلاب. لذلك، في منصتنا،\nيمكنك تتبع تقدم الإتقان حسب الوحدة أو حتى الدورة التدريبية بأكملها، ويمكنك الحفاظ على تفاعل الطلاب. عندما نتحدث عن\nمشاركة الطلاب هنا، كما تعلم، طوال العام، ما مقدار ما أتقنته من هذه الدورة؟ والتأكد من أن\nالطلاب مستمرون في التقدم\nوالاستمرار في اكتساب الإتقان. أعتقد أن هذا دائمًا هو أن الجزء الكبير من هذا اللغز هو تحفيز الطلاب.  ولذا، إذا كان الطلاب يعرفون\nهذا الهدف النهائي في ذهنهم ويعرفون ذلك،\nمهلاً، إذا تمكنت من الوصول إلى 80 أو 90٪ في إتقان هذه الدورة، مهلاً، سأكون\nأكثر ثقة في اليوم الذي يجب أن أجلس فيه  السبت. لذا نعم، هذا ما أحب. وأنا أحب أيضًا مدى الشفافية بدءًا من الطالب وصولاً\nإلى مسؤول المنطقة. وهذا أمر مهم جدًا بالنسبة لي\nحتى يتمكن الجميع من المشاركة في تلك المحادثة مع الطلاب. - أوه، بالتأكيد. أعني أن البيانات يجب أن تكون مملوكة ومرئية لجميع أصحاب المصلحة\nفي منطقة ما. بهذه الطريقة\nسيكون لها تأثير عميق. لكن ريفين، من وجهة نظرك، حتى كقائد سابق على مستوى البناء\n، ما رأيك، ما هي أفكارك حول المشاركة والإتقان، حسنًا، إتقان المهارات ومشاركة الطلاب عند التفكير في اختبار SAT على وجه الخصوص؟ - نعم، أنا أفكر فقط\nفي العالم الثانوي، كما تعلمون، أليس كذلك؟ لديك أطفال في\nمسارات مختلفة يقومون بأشياء مختلفة، وجداول زمنية مختلفة في جميع أنحاء المنطقة. لذا فإن حقيقة أن\nالتعلم المتقن هو شيء يمكن للمعلمين تحديده في اليوم الأول\nوتركه يتدفق وسيذهب الأطفال في\nطريقهم الخاص، وهذا أمر رائع لأنه يتطلب وقتًا أقل، أليس كذلك؟ للمعلمين. الآن يمكن للمعلمين التركيز\nعلى لقاء الطلاب وجهاً لوجه ودراسة تلك المهارات التي لا\nيتقنها الطلاب، أليس كذلك؟ وإعطاء، القيام\nبمجموعات صغيرة وإدارة ذلك ومن ثم، كما تعلمون، القيام بذلك\nخلال PLCs الخاصة بهم باستخدام البيانات لنوع من التتبع، حسنًا، ربما يكون\nهذا شيئًا نحتاج إلى تغييره في\nمناهجنا أو تعليماتنا.  لقد لاحظت أن أداء معظم الأطفال\nسيئ جدًا في المعادلات الأدبية، لذا ربما\nنحتاج إلى الرجوع مرة أخرى وتجربة هذه المهارة مرة أخرى. لكن الشيء العظيم\nفي التعلم المتقن هو أنه إذا كان لدي ستة\nمستويات مختلفة في الفصل، فلا بأس لأن أكاديمية خان\nستسحبهم عبر المسار الذي يحتاجون إليه والذي يناسب تعلمهم. ولا يوجد شيء يمكنه التغلب على ذلك لأن ذلك سيستغرق من\nالمعلم، كما قالت دانييل، عندما كنت في الفصل\nالدراسي منذ بضع سنوات، سيستغرق ذلك من المعلم وقتًا طويلاً جدًا لتحديد من يحتاج إلى\nتعلم ما في فترة قصيرة من  الوقت قبل اختبار SAT وهي\nليست مهمة يمكن التحكم فيها. لذا فإن استخدام أكاديمية خان\nلتصفية بعض ذلك وجعل المعلم يضع الطلاب في المسار الصحيح ومن ثم يمكنهم التركيز\nعلى ذلك الطالب وجهًا لوجه وهذا التفاعل الفردي\nهو مجرد تغيير في قواعد اللعبة. وبالنسبة لأولئك الطلاب المتفوقين الذين لا يريدون الجلوس هناك\nوالاستماع إليك، خمن ماذا؟ ليس عليهم أن يفعلوا ذلك. إنهم يواصلون الذهاب إلى\nأكاديمية خان حيث يجب أن يكونوا. وهذا بالنسبة لي مجرد شيء،\n كمعلم ومعلم،\nأي أنك تعرف ما يحتاجه أطفالي، كل أطفالي يحصلون على ما يحتاجون إليه وهذا هو الشيء الأكثر أهمية. - نعم. وتأكد فقط من عودتك وإعادة الاستماع إلى\nما قاله Raven للتو.  لقد أسقطت للتو الكثير (يضحك رافين)\nمن البيانات الرائعة واستراتيجيات أفضل الممارسات\nللتأكد من أنك تفكر\nوتستخدم التحليل القائم على المهارات لدعم تعلم الطلاب. والآن\nسنعود في آلة الزمن. هذا ليس \"العودة إلى\nالمستقبل\"، ولكن ربما يكون كذلك. (ريفين يضحك)\nالأمر ليس كذلك. أريدك أن تفكر مرة أخرى، تفكر في الوقت الذي\nعدت فيه إلى التدريس في الفصول الدراسية في مدرستك الثانوية، وتفكر في البدء\nللعام الدراسي المقبل. كيف تفكر\nفي إعداد الطلاب لامتحان SAT الرقمي وكيف، نحن الآن مثل\n\"العودة إلى المستقبل\" حيث كان يشبه من\nالثمانينيات ولكن على لوح التزلج. لقد عدت عندما كنت تدرس والآن لديك خانميغو ولديك أكاديمية خان لمساعدتك. إذن، كيف ستفكر في الأمر، ثم كيف\nسيتغير مع ظهور الذكاء الاصطناعي؟ لماذا لا تطردنا من سارة؟ في ديلوريان.\n(سارة تضحك) هناك الكثير من هذا التشبيه. حسنًا، تفضلي يا سارة. (ريفين يضحك) - أعتقد أن الجميع يعلم أن العلوم لا يتم\nقياسها مباشرة في اختبار SAT، أليس كذلك؟ لكن ضمن قسم القراءة والكتابة وقسم الرياضيات، هناك أسئلة ذات سياق علمي.  لقد كنت مدرسًا للعلوم، وكون العلوم\nلا يتم قياسها لا يعني أنني خارج نطاق المسؤولية.  لا يزال بإمكاني مساعدة طلابي\nفي التحضير لامتحان SAT. لذا ما سأفعله هو أن\nيذهب طلابي إلى أكاديمية خان في دورات العلوم. لذا اذهب إلى دورة علم الأحياء\nأو دورة الكيمياء أو الفيزياء أو العلوم،\nأيًا كان ما تريد القيام به. وضمن تلك الدورات\nهناك مقالات، وهذه المقالات تحتوي على الكثير من النصوص الغنية بالمعلومات والمبنية على العلوم. ولذا، كلما تمكنت من جعل\nطلابي يقرأون هذا النوع من النصوص العلمية ويكونون مرتاحين لقراءتها، فهذا\nسيخدمهم بشكل أفضل بكثير عندما يجرون اختبار SAT. لذلك سأركز حقًا على القراءة ومهارات القراءة الدقيقة\nللنص المعلوماتي العلمي. وبعد ذلك، إذا كان\nلدى الطلاب إمكانية الوصول إلى خانميغو، فيمكنهم، كما تعلمون، استخدام خانميغو\nفي تلك المقالات أيضًا. يا وضح أنا لا\nأعرف ماذا تعني هذه الكلمة، ساعدني في هذا. لذا مرة أخرى، فإن ذلك\nالمعلم الشخصي هو الذي يساعدهم في الاطلاع على هذا النص المعلوماتي، والذي سيساعدهم مرة أخرى في اختبار SAT. - هذا مذهل. وأنا أحب الطريقة التي تشارك بها، على الرغم من أنه، كما تعلمون،\nلا يتم تقييم العلوم بشكل مباشر، أعتقد أن الكثير من المعلمين\nيشبهون المحتوى أحيانًا، ماذا؟ ما علاقة موضوعي به؟ (ريفين يضحك)\nولكن مجرد دعم الطلاب والتفكير النقدي\n، يتطلب متعلمين مشاركين، وهو ما يتطلب جهدًا جماعيًا. لذا أشكرك على الإشارة إلى ذلك أيضًا. إليزابيث، ما هو منظورك لآلة الزمن ديلوريان؟ - حسنًا، كما تعلم، لقد قمت بتدريس الصف الحادي عشر في برنامج اللغة الإنجليزية لمدة خمس سنوات وكنت أشعر دائمًا أنني كنت منهجيًا جدًا. أحب الأشياء التي أحب أن\nتحدث في وقت معين. لذا، أود\nحقًا أن أخطط بشكل عكسي، حسنًا، متى يكون يوم امتحان SAT الخاص بي؟ متى يجب أن أطلب من طلابي\nالتدرب على الكتاب الأزرق؟ وتبدأ حقًا في\nشهر أغسطس بشيئين. أول شيء سأبدأ به حقًا هو\nتحدي الدورة التدريبية. الشيء الرائع في دوراتنا الرقمية لاختبار\nSAT هو أنه يمكنك تعيين شيء يشبه التقييم المسبق. يطلق عليه تحدي الدورة. ويعطي الطلاب، كما\nتعلمون، عينة عشوائية من المهارات من كلا الدورتين. ويمكنك القيام بذلك في\nوقت مبكر من العام الدراسي والبدء فورًا في\nاستعادة بيانات المهارات. لذلك، يمكنك البدء في تجميع\nالطلاب حسب المهارات، ويمكنك البدء في الحصول على فكرة عن المهارات التي قد يكون الطلاب بارعين فيها بالفعل والمهارات التي قد يحتاجون إلى المساعدة فيها. لذلك سأبدأ بالتأكيد\nبتحدي الدورة التدريبية فقط للحصول على تلك البيانات الأولية. وبعد ذلك، كما تعلمون، مع الذكاء الاصطناعي ومع خانميجو،\nربما سأقضي الكثير من الوقت في عرض الأزياء في\nبداية العام مع طلابي، كما\nتعلمون، هذا مثال لمشكلة\nلا أعرفها  كيفية الإجابة. لو كنت أنا، ستكون مسألة حسابية. التي سأصممها مع طلابي. وفي الواقع، أظهر\nللطلاب كيف يمكنك التفاعل ذهابًا وإيابًا مع خانميجو\nللإجابة على السؤال أو تلخيص مقطع فيديو أو\nتلخيص مقال. أعتقد أيضًا أن العمل الثنائي التعاوني، أي\nالطلاب الذين يعملون معًا مع خانميجو لمعرفة ما يكتشفونه وما يتعلمونه، سيكون أيضًا جزءًا من روتيني في وقت مبكر من العام الدراسي. ومن ثم الانتقال إلى الخريف، كما تعلمون، البدء في النظر حقًا إلى بيانات المهارات وبيانات إتقاني. إذًا، كما تعلم، هل\nأتقن طلابي ما لا يقل عن 15% من الدورة بحلول\nالخامس عشر من أكتوبر، لا أعلم؟ ومجرد التأكد من أن\nطلابي يسيرون على الطريق الصحيح لمواصلة التقدم من خلال\nالمهارات سيكون بالتأكيد أسلوبي إذا كنت\nفي أحد الفصول الدراسية في ELA اليوم. وكما تعلمون، مع حلول\nشهر يناير، يعد التأكد من تدربهم على\nالكتاب الأزرق أمرًا في غاية الأهمية. وكما تعلمون، من خلال الاطلاع على\nالميزات وجميع الأدوات والآلة الحاسبة وكل ما هو مضمن هناك، أعتقد أنه من المهم جدًا أيضًا أن تكون شفافًا مع الطلاب. - وأنا أحب حقًا أنك\nتنادي بعرض الأزياء.  لقد كنت مدرسًا سابقًا في المدرسة الإعدادية، وربما يمكنك أن تفهم، هل قام أي شخص بتسليم أقلام التحديد لأطفال المدرسة الإعدادية من قبل؟ - نعم.\n- بدون النمذجة؟ فقط يمكنك أن تتخيل، كما تعلم، ما يحدث، هذا هو الأمر. لكن الذكاء الاصطناعي هو أداة أخرى، لكن لا\nيزال من المهم تصميم النماذج. أعتقد أن معلمي المدارس المتوسطة والثانوية ينسون أحيانًا. إنهم يعتقدون، ويفترضون أن الطلاب يجب أن\nيعرفوا كيفية استخدام الأشياء، ولكن في هذا العالم الجديد، لا، لا.  إن النمذجة مهمة حقًا، خاصة عندما يكون هناك الكثير من التغيير، وهناك الكثير من الابتكار الذي يحدث. لذا فأنا حقًا، بالإضافة إلى أن أسلوبك خطي جدًا، لذا شكرًا لك على ذلك. رافين ماذا عنك؟ - لذا سأأخذ وجهة نظر مسؤول المبنى\nفقط لأن سارة وإليزابيث تتشاركان الكثير من النصائح الرائعة كمدرستين في الفصل. لكن الآن هو الوقت المناسب للتخطيط\nلجدولتك، أليس كذلك؟ لأن ما هو كل\nما يقوله المعلمون؟ ليس لدي الوقت الكافي، لا أستطيع أن أفعل ذلك. ليس لدي الوقت الكافي لهذا. ليس لدي الوقت الكافي لذلك. حسنًا، نحن مسؤولون،\nمسؤولو البناء، أنت مسؤول عن\nالجدول الزمني، أنت مسؤول عن منح المعلمين الذين\nيقتبسون وقتًا غير محدد. وهذا مهم جدًا، حتى لو لم يغير جدولك الزمني. كما هو الحال في مدرستي الثانوية،\nكان لدينا كتل مدتها 90 دقيقة، لذلك أعطيتهم، كما تعلمون،\nعدة خيارات مختلفة لكيفية إعداد\nصفهم من أجل الاستعداد لجميع الأشياء المختلفة التي يتعين عليك الاستعداد لها في المدرسة الثانوية. جميع الامتحانات المختلفة.  وعلى المعلمين أن يعرفوا أنك\nتدعمهم في هذه الرحلة. وجزء من ذلك هو منحهم\nسهولة الوصول. وهذا ما يفعله خانميغو، أليس كذلك؟ لذلك ليس من الضروري أن يكون لديهم\nهذا الكتاب الكبير بعد الآن. يمكنهم الاستمرار، ويمكنهم مواءمة المحتوى الخاص بهم على مدار العام\nمع أسئلة اختبار SAT. لماذا لا يمكنهم الحصول على SAT أيام الجمعة؟  كما تعلمون، قل، \"مرحبًا يا شباب،\nإذا كنتم كذلك،\" كما قالت سارة، فلا يهم\nالمحتوى الذي تقومون بتدريسه. في أيام الجمعة، خلال أول 30\nدقيقة من آخر كتلة لدينا، سنقوم بالتحضير لاختبار SAT في أكاديمية خان.  كما تعلمون، يمكن للوالدين أيضًا\nالارتباط بحساباتهم. لذا ربما إذا كان لدي\nمعدل نجاح جيد في الواجب المنزلي، سأستخدمه في الواجب المنزلي. لكن خانميغو يمكنه إعطاء بيانات للمدرسين، كما كانت تقول إليزابيث، بحيث يمكن القيام بذلك قبل الفصل مباشرة بدلاً من الاضطرار إلى البحث فيها. سيقوم خانميغو بإنشاء مجموعات لك. سيخبرك بالمهارات\nالتي يجب العمل عليها ، وسيعطيك خطط الدروس، وسيسمح\nللطلاب بالتدرب.  كل ما عليك هو أن تقول \"خانميغو، أعطني\nبعض الأسئلة التدريبية\". لذا فإن مجرد منح\nالأطفال الوقت الكافي للقيام بذلك سيكون بالتأكيد\nعامل تغيير بالنسبة لهم حتى يتمكنوا من المضي قدمًا. نحن نعلم أن الوقت أمر جوهري بالنسبة للطلاب والمعلمين. هذه مجرد طريقة أخرى\nللمعلمين والإداريين لتوفير الوقت والحصول على خطة والتأكد من أن الطلاب مستعدون ولا ينتظرون حتى\nاللحظة الأخيرة للحشو، بل يعملون على هذا\nطوال العام، كما قالت إليزابيث، من  السقوط مع هذا التحدي بالطبع. ثم استمر في ذلك\nطوال العام حتى يوم الاختبار بدلاً من\nالقلق من حشر كل شيء\nفي جزء واحد من الوقت لأنه ليس لديك الوقت. - أنا متأكد من أنه لم يسبق لأي شخص يشاهد\n أي شيء أن شعر بهذا الضغط. يمين؟\n(يضحك رافين) خاصة ليس في الكلية عندما تحاول إدارة وقتك كشاب.\n- يمين. - هذا هو المفتاح هو التخطيط للتأهب. ونحن نحاول\nدعمكم في شراكاتنا في أكاديمية خان للقيام\nبهذا العمل الأساسي. إذن الآن أريد، نحن\nنركض، نتحدث عن الوقت، الوقت ينفد تقريبًا. لذلك أريد أن نفكر\nفي منظور أخير، وهو التطورات المستقبلية. لذا، بالتفكير في\nالطريقة التي انتقل بها اختبار SAT إلى التنسيق الرقمي، ما الذي\nنفعله في أكاديمية خان أو ما هو\nرأيك في ما يحدث في عالم التعليم\nأو ما الذي نأمله لاستخدام  الذكاء الاصطناعي\nوالمساعدة في مواصلة هذا العمل من أجل SAT الرقمي؟ لماذا لا تجعلينا نبدأ يا سارة؟ - أعتقد أن هناك الكثير من القلق بشأن استخدام الذكاء الاصطناعي في التعليم، وهذا صحيح، أليس\nكذلك؟ نحن في عالم جديد تمامًا. لكنني أعتقد أيضًا أننا\nنميل إلى التفكير في الأمر بالطريقة التي تعلمنا بها أو الطريقة التي تعلمنا بها التدريس.  وهكذا، كنوع من الانتقال إلى هذا العالم الجديد لاستخدام الذكاء الاصطناعي في التعليم، ما أتمنى\nرؤيته هو أن الذكاء الاصطناعي هو أداة لمساعدتنا في تعليم\nالتفكير النقدي بشكل أفضل قليلاً، وأسهل قليلاً. إنه أمر صعب التدريس\nومن الصعب القيام به. وآمل، كما تعلمون،\nزيادة التعاون. نحن نستخدم الذكاء الاصطناعي، كما تعلمون،\nلكل تلك المعرفة الروتينية التي يمكن أن تفعل\nذلك للطلاب، أليس كذلك؟ ولكن كيف سنجعلهم يتعاونون بشكل فعال؟ وأعتقد أن هناك مكانًا كبيرًا حيث يمكن للذكاء الاصطناعي مساعدة المعلمين والطلاب على تحسين\nمهارات التفكير النقدي ومهارات التعاون. وآمل أن هذا هو المكان الذي\nنتجه إليه في النهاية. - وما سمعتك\nتقوله هو مهارات إنسانية. - يمين.\n- يمين؟ التفكير النقدي والتعاون. الكمبيوتر لا يستطيع أن يفعل ذلك. هذا ما يفعله البشر، وهذه في الواقع طريقة رائعة بالنسبة لنا للتعلم بشكل عام. لذلك، مرة أخرى، أعلم أن لدي الكثير، وهناك الكثير من الحديث في مجال التعليم. إنها \"أجهزة الكمبيوتر تتولى المسؤولية.\" يمكن أن يكون هذا أداة للمساعدة\nفي المهارات الإنسانية. هذه كلمة جديدة للجميع، إنسانية. ربما هي كلمة حقيقية؟\n- يمين. - إليزابيث، أنقذيني.  ماذا تعتقد؟ - كما تعلمون، آمل في\nالمستقبل، كما تعلمون، أن يشعر الجميع براحة أكبر مع الذكاء الاصطناعي ولكن أيضًا مع إدراك أن هذا المعلم في الفصل الدراسي لا\nيمكن استبداله أبدًا وأن المعلم لا يزال مجرد أهم\nرابط بشري في العالم  . وأتذكر، كما تعلمون، أننا\nعدنا إلى عرض الأزياء وأتذكر في الفصل الدراسي، أن طلابي كانوا يتطلعون إلي، كما تعلمون، وقضيت وقتًا أطول مع طلابي مما أمضيته مع عائلتي\nالعديد والعديد من المناسبات. وأنا أعلم أنهم فعلوا الشيء نفسه وكانوا يستقلون رحلات طويلة بالحافلة\n، كما تعلمون، إلى مدرستي.  وكما تعلمون، آمل أنه في المستقبل، لا يزال \nلدى الطلاب، كما تعلمون، ذلك الاتصال الإنساني مع أقرانهم ومع طلابهم والعالم والمجتمع من حولهم، ولكنهم يشعرون\nبراحة أكبر في الاستخدام  الذكاء الاصطناعي لتعزيز ما لديهم وما\nيعرفونه وما يمكنهم تعلمه. أود أيضًا أن أرى دور الذكاء الاصطناعي في التقييمات. أعتقد أن البيانات مهمة جدًا ليس فقط\nلقادة منطقتنا التعليمية، ولكن لمديرينا وطلابنا وأولياء أمورنا. وأود أن أرى\nنوعًا من دمج الذكاء الاصطناعي في التقييمات التكوينية للدورة القصيرة التي نقدمها لطلابنا. \nلست متأكدًا تمامًا من شكل ذلك، لكنه بالتأكيد شيء\nكنت أفكر فيه في ذهني حول كيف\nيمكن أن يغير هذا عالم التقييمات في المستقبل. - نعم على الاطلاق. ورافين، أحب أن تستمر في تقديم وجهة نظر إدارية لنا.\n(ريفين يضحك) لذا دعونا نستمر. ما رأيك؟ - أعني، كنت\nأفكر في ذلك، كما تعلمون، منذ أن كنت طالبًا وحتى عندما كنت أقوم بالتدريس في\nالمدرسة، كما تعلمون، أيها المشرف، وحتى هذا\nالمنظور الذي لدي الآن، حيث أعمل مع المناطق كل يوم.  كما تعلم، سيكون هناك دائمًا\nشيء جديد. وبالنسبة للتعليم، أعتقد أننا\nحصلنا على هذا الأمر، أليس كذلك؟ نحصل على منهج جديد\nكل دقيقة، ونحصل على أدوات جديدة، ونحصل على كل الأشياء. لذلك هذا هو واحد من تلك الأشياء. لكن هذا الشيء يجب أن نتعامل معه \nبحذر أكثر، أليس كذلك؟ علينا أن نتأكد من أننا نقوم بالنمذجة. نحن لا نكشف\nمعلمينا وطلابنا ومشرفينا فحسب، بل أيضًا\nمجتمعنا وأولياء أمورنا لأنه سيؤثر على الجميع. إنه كذلك بالفعل، أليس كذلك؟ وكأننا نستخدمها يوميًا، وأحيانًا دون أن نعرف. إذا كان لديك Alexa في\nمنزلك، أو إذا كان لديك Google، أو إذا كان\nلديك Google Nest أو أيًا من هذه الأشياء. - سيري.\n- أنت تعرف. نعم سيري.\n(تضحك دانييل) أنت تستخدم الذكاء الاصطناعي كل يوم، وأنت تعلم أنك لا\nتفكر في الأمر مرتين. هذا ما يحتاجه.  وهذا\nما أتمناه للمستقبل. وهذا شيء\nلن تفكر فيه مرتين.  كما تعلمون، قبل فيروس كورونا، لم يكن لدى الجميع حتى أجهزة فردية. لم نفكر مطلقًا، حسنًا، سيكون لدى الجميع جهاز كمبيوتر وستقوم أنت\nبعملك على الكمبيوتر. ولا حتى في\nمبنى المدرسة، لكننا فعلنا ذلك. إذن هذا مجرد\nشيء آخر من تلك الأشياء التي ظهرت، كما تعلمون، في المقدمة وعلينا أن نأخذها\nوعلينا أن نتعلمها. لا تخافوا منه. ثم قم بالتدريس، والتدريس،\nوالتدريس، والنموذج، والنموذج، والنموذج والتأكد من أنه يتم\nاستخدامه بالطريقة المناسبة وأن الطلاب يعرفون قيمته، لأنه ذو قيمة. إنها ليست مجرد أداة للطلاب للغش أو العبث، كما تعلمون، لأنني أعلم أن هذا ما\nيعتقده الكثير من الناس، لكنها ذات قيمة حقًا. وسأقول قصة قصيرة واحدة لأنني أعلم أن الوقت ينفد لدينا، ولكن تمامًا كما هو الحال مع أي شخص آخر، عندما تعلم أن خانميجو قد ولد قبل عام واحد، كما\nتعلم، في مارس أو نحو ذلك. فقلت، يا إلهي،\nماذا نفعل؟ مثل هذا أمر جنوني، مثل\nالذكاء الاصطناعي، كما تعلمون، كنت أحاول قراءة\nالكتب والبحث عن المقالات وكل الأشياء التي أحاول، كما تعلمون، مساعدة نفسي على فهم ما يجري.  ولن أنسى أبدًا قول مديري، \"كما تعلمون، هذا هنا يا رفاق. مثلما يجب علينا أن\nنتقبله، علينا أن نستخدمه، علينا أن نعرفه حتى نتمكن من مساعدة\nشركائنا في المنطقة.\" وفكرت في ذلك وقلت، كما تعلم، إنها على حق. ولكنني أريد فقط\nأن أرى ذلك بنفسي. لذلك أتيحت لي الفرصة\nللذهاب إلى مدرسة في كاليفورنيا ورؤيتها على أرض الواقع وهذه المدرسة تستخدم\nمجموعة سكانية خاصة. لذلك يستخدمونه مع الطلاب المتحمسين وطلاب التعليم الخاص وطلاب متعلمي اللغة الإنجليزية. وهذا غيّر وجهة نظري بالكامل لأنه في الأساس، تمامًا كما أردنا ذلك، المعلم الوحيد، جميع\nالأطفال، كان لديهم خانميغو لمساعدتهم ولم يتخطوا أي شيء. لذلك لم يكن هناك أطفال\nيجلسون هناك منتظرين، متكئين على الظهر، ولا يفعلون شيئًا. على الفور، عندما\nكان المعلم يعمل مع الطلاب الآخرين،\nوصلوا على الفور إلى خانميغو، وسألوا خانميغو عما\nيحتاجون إليه واستمروا في المضي قدمًا. وكان ذلك مثل، يا إلهي، ليس لدي صف\nمن الأطفال ينتظرونني لطلب المساعدة.  كما تعلمون، لا يوجد\nأحد، ولا داعي للقلق من أنني سأضطر إلى أداء هذا الدرس لمدة ثلاثة أيام أكثر مما يجب لأن نصف طلابي لم يستوعبوه.  كان لديهم شخص\nما يمكنه مساعدتهم ويمكنه تغيير اللغة حتى يمكن دعمهم باللغة\nالتي يحتاجون إليها. لذا، مع كل\nالنقص في المعلمين، مع كل النقص الذي يحدث حولنا،\n كان هذا أمرًا مميزًا رأيته حقًا وجعلني أشعر حقًا أننا\nنفعل الشيء الصحيح وأن خانميجو\nسيكون حقًا  شيء سيغير\nحياة الكثير من الناس. - حسنًا، رافين، سارة، إليزابيث، كانت هذه محادثة رائعة. أنا أقدر كل وقتك وأفكارك ووجهات نظرك. وبالنسبة لنقطة رافين، آمل أن تتمكن من رؤية هذا، ها نحن ذا.  هل يمكنكم رؤية هذا؟ نحن هنا معك. خانميجو، أليس كذلك؟  معك. نحن نتمنى العمل معك. نحن نحب أن نتشارك معك. نريد أن نخطو إلى المستقبل معك. لذا، إذا كنت تريد الشراكة\nمعنا في أكاديمية خان، فلديك العديد من المزايا المختلفة. أولاً، جميع الدورات مجانية. تعلمون جميعًا، ونأمل أن تكونوا على علم بذلك، ولكنكم تحصلون على الدورات التدريبية مجانًا. ولكن عندما تكون شريكًا\nمعنا، فإننا نساعدك. هؤلاء البشر الرائعون في\nهذه اللوحة يتشاركون مع المقاطعات كل يوم. يمكنك الحصول على خدمة القفازات البيضاء،\nولديك تعلم احترافي، ولديك قائمة تلقائية، وبيانات مخصصة. نريد أيضًا أن ندعمك\nفي تمكين جميع الطلاب من الوصول العادل\nإلى المحتوى على مستوى الصف الدراسي، والحصول على هذا التعلم التفاعلي للتأكد من أنهم يقومون بكل الأشياء ويبنون تلك المهارات. لذلك نحن نساعدك على تتبع التقدم. والأهم من ذلك، أعني أن\nكل هذا مهم حقًا. ولكن الأهم من ذلك هو أننا\nقمنا بتطوير نظام ذكاء اصطناعي آمن وأخلاقي في خانميغو. نحن نقدر ونعلم أن بيانات الطلاب وخصوصيتهم مهمة حقًا. لدينا حواجز حماية خاصة لأنكم جميعًا تعملون مع\nبشر رائعين ومدهشين وهناك نقص في المعلمين وأحيانًا يحتاج الطلاب إلى المساعدة وأحيانًا سيطلبون\nالمساعدة مع خانميجو ونريد التأكد من أننا نقوم\nبتسجيل البالغين و  البشر الذين يمكنهم المساعدة في ذلك. لذا، إذا كنت مهتمًا بمعرفة المزيد، فقد وضعنا رابطًا في الدردشة. هذا هو فريق شريك منطقتنا\n.  يرجى التواصل معنا. يمكنك أيضًا مسح رمز الاستجابة السريعة هذا. يمكنك الذهاب إلى\nموقعنا على الإنترنت، وإلقاء نظرة عليه اليوم ، ونحن نقدر لك ذلك كثيرًا. وإلى أن نلتقي مرة أخرى، كان\nالتعلم معك رائعًا.  أتمنى لك راحة رائعة من يومك.",
    "t_italian": "-Va bene a tutti. Bene,\nora ci prenderemo del tempo per presentarmi come ospite e poi lascerò che i\nmiei fantastici relatori si presentino. Piacere di conoscerti.  Mi\nchiamo Danielle Sullivan. Sono Senior Manager dei\npartenariati distrettuali nel nord-est per Khan Academy. E prima di tutto questo, molto tempo fa, ho lavorato per un po' con la tecnologia informatica, ma ero anche un insegnante di educazione speciale di quinta e sesta elementare nello stato di New York e a Washington DC. Quindi sono entusiasta di essere qui\noggi per parlare di SAT. Sarah, perché non vai\navanti e ci dai il via con le presentazioni del panel. - Sicuro.  Ciao a tutti. Mi chiamo Sarah Thaler. Sono un District Success Manager. Lavoro principalmente con i\ndistretti del Michigan e dell'Ohio. Prima di lavorare alla Khan Academy, sono stato insegnante di scienze al liceo\nper circa 10 anni, e poi ho lavorato in amministrazione,\ndirettore del curriculum K-12. E poi per circa nove\nanni sono stato al College Board. E così stavo lavorando con i\nDipartimenti statali dell'Istruzione, aiutando ad amministrare la\nsuite di valutazioni SAT per le loro\nvalutazioni di responsabilità federale statale. E quindi sono molto felice di\npoter applicare la mia conoscenza del SAT ai distretti\ncon cui lavoro alla Khan Academy. - Ottimo, Sara.  Grazie. Va bene, Elisabetta. - Ciao buon pomeriggio. Mi chiamo Elizabeth Hadley e sono anche District Success Manager, lavoro con distretti in tutti\ngli Stati Uniti, concentrandomi sulla loro\nimplementazione del SAT digitale con Khan Academy. Prima del mio arrivo alla Khan Academy, lavoravo in una contea di\nOrlando chiamata Osceola County. Ero un insegnante, ex allenatore di alfabetizzazione e ho trascorso quattro anni in un ufficio di ricerca e valutazione\nimplementando valutazioni, valutazioni formative a ciclo breve PLC e implementando anche Khan Academy con i nostri 20.000 studenti delle scuole superiori. Quindi è semplicemente un piacere\npoter condividere tutte le informazioni che\nho con i distretti con cui lavoro ora alla Khan Academy. - Niente di grave, sto solo implementando,\nsai, 20.000 bambini. - Un po' a Khan.\n- Proprio come lavorare con diversi dipartimenti statali. Niente di grave. E Corvo. - Ciao a tutti.  Sono così felice\ndi vedervi tutti oggi.  Il mio nome è Raven Casseus. Sono un District Success Manager, lavoro principalmente con i\ndistretti del nord-est e vedo qualcuno da\nGreensboro in poi, quindi benvenuto. E prima di questo, sono stato\nnel K-12 per circa 22 anni. Sono stato un insegnante di scienze,\nun allenatore e, più recentemente, un preside di una scuola superiore. Quindi ho molta familiarità con il\nSAT e preparo genitori, studenti e insegnanti\ne li coinvolgo nel processo.  Sono così felice di condividere oggi la mia esperienza su tutte le cose che\nvanno di pari passo con il SAT. - Meraviglioso.  Quindi\nsmetterò di condividere il mio schermo perché lo scopo di oggi è semplicemente avere una\nconversazione interattiva e collaborativa su come ti supporteremo e pensare a come preparare\ngli studenti per il SAT digitale. Comprendiamo che\novunque stiate guardando questo, quelli di voi qui oggi, si\ntrovano in un viaggio diverso. E se lo guarderai in futuro, potresti trovarti in un diverso\nviaggio nella sequenza temporale. Ma il nostro obiettivo oggi è davvero quello\ndi aiutarvi a capire attraverso diverse prospettive e punti di vista come gli\nstudenti possono aiutarli a recuperare il ritardo in ELA e in matematica, soprattutto dopo la\npandemia, che è stato molto. Voglio dire, qualcuno\nricorda l'anno 2019? Qualcuno?\n(Raven ride) Io no.  Giusto? Voglio dire, chi lo sa? Quindi, il modo in cui possiamo passare al nuovo formato di valutazione digitale\npuò essere impegnativo. Quindi siamo qui per\nsupportarti e comprendere i pezzi e le nostre prospettive. Puoi fare domande nella chat. Potete collaborare tra\nloro nella chat o inviare\ndomande dalla sezione domande e risposte. Quindi li ho entrambi pronti e pronti. Farò domande ai nostri relatori, ma per favore, ci farebbe piacere\nsentire anche la tua opinione. Quindi, per darci il via, Sarah,\nil SAT esiste da molto tempo. Mancano diversi mesi alla transizione verso un test digitale. Come è stata la transizione per le scuole e come avete osservato\nla preparazione ai test e come è andata, come è andata? - Sicuro.  Sai, il cambiamento è difficile. E quest'anno ce n'è stato parecchio. Se gestisci il SAT scolastico diurno o se eri un centro di test del fine settimana, probabilmente ti concentrerai su molti dei cambiamenti amministrativi che dovevano avvenire con il test digitale. Quindi, come installare il Blue Book, come fanno gli studenti ad accedere al\nBlue Book, testare il toolkit, ordinare, registrare,\naule, formare il personale, tutte queste cose logistiche erano molte per gli educatori quest'anno se amministravi nel tuo edificio. Ma ora si spera, forse hai una o più amministrazioni alle tue spalle e ti senti un po' più sicuro nell'effettuare effettivamente il test e puoi concentrarti ora,\nsai, sull'aiutare gli studenti e approfondire davvero i dati\nche potresti ottenere per quello  . - Grande. Elizabeth, che ne dici di cosa hai visto dalla tua prospettiva? - Beh, sai, proprio come ha detto Sarah, il cambiamento è davvero difficile. E devo essere sincero, ho\nlavorato a lungo con lettori intensivi cercando\ndi portarli al traguardo con il SAT ed ero davvero nervoso per tutti i cambiamenti. Ero nervoso per gli insegnanti, soprattutto nelle aule di lettura, che dovevano passare dall'annotare il testo e lavorare con i testi con le dita, tagliando il testo in un formato digitale. E ad essere sincero con te, con il passare dell'anno, la transizione è stata molto più\nagevole di quanto mi aspettassi. Se mi parlavi l'\nestate scorsa, ero piuttosto nervoso. Ma una volta che siamo entrati nel vivo delle cose e gli studenti hanno iniziato a\nesercitarsi su Khan Academy e hanno iniziato a conoscere\nquegli oggetti digitali, ho iniziato a pensare che fosse così, i distretti mi riferivano come se stessero andando davvero bene con esso e se la passano bene\ncon i calcolatori online e cose del genere. Ora, nei distretti con cui\nho parlato, gli studenti\nriferiscono agli educatori che a loro è\npiaciuto molto di più. Non è stato così lungo.  È stato un po' più facile rispondere ad alcune domande. Ovviamente i dati\nci diranno se è stato più facile o meno, ma sai, il fatto che gli studenti\nrispondano un po' meglio a quel formato digitale non è stata\nsolo una bella sorpresa per me, ma è stato anche emozionante,\nsai,  per ascoltare feedback e notizie dai nostri partner distrettuali. - Oh, assolutamente. Io, vi ricordate di aver sostenuto il SAT? ricordi quando nel 19... (Danielle si schiarisce la voce) Il cambiamento è sempre difficile, vero? Raven, cosa vedi\ndalla tua prospettiva? - Quindi volevo solo dire che l'anno scorso abbiamo collaborato con il College Board, che è stata una partnership davvero fantastica\n. E abbiamo iniziato la transizione\ndei nostri distretti l'anno scorso. Abbiamo iniziato a prepararli,\nabbiamo iniziato a prepararli, abbiamo iniziato a fornire loro quante più\ninformazioni possibili, per prepararli, per preparare i loro studenti,\nper avere un piano in atto. Quindi sento che erano pronti. Hanno chiesto assistenza a noi, e siamo stati felici di\ncollaborare con loro. E poi, con l'aiuto del\nnuovo corso SAT Khan Academy e dell'app Blue Book, siamo riusciti a far sì che gli\nstudenti diventassero operativi. E come ha detto Sarah,\npenso che il cambiamento più grande sia avvenuto per insegnanti e amministratori. I nostri figli sono così resilienti, vero? Si avvicinano alla tecnologia così rapidamente. Quindi non è stato così difficile per gli studenti.  Penso che sia stato più difficile per gli insegnanti prepararsi . Ma come ha detto Elizabeth,\nsolo i dati lo diranno. E penso che, vista la preparazione che gli studenti hanno avuto alla Khan Academy, sono entusiasta di sentire i distretti una volta che inizieranno a recuperare quei punteggi. - Assolutamente. E ancora, nella chat,\nse vuoi intervenire, qual è stata la tua esperienza con il cambiamento? Ha funzionato?  Come ti senti a riguardo? E ma Sarah, visto che stabiliremo il\ncollegamento con il College Board, mi piacerebbe che tu pensassi all'approccio della Khan Academy\nalla preparazione al SAT. Come pensiamo a\nquesto alla Khan Academy per aiutare gli studenti a essere preparati e garantire che\ncapiscano cosa fare? - Sicuro. Voglio dire, penso che quando\npensiamo alla preparazione al SAT, pensiamo a tutte quelle\nattività di preppiness. Sai, familiarizzare con il Blue Book, quante domande, il tipo\ndi domande, la gestione del tempo. E sebbene sia importante che gli studenti\nabbiano quelle competenze, ciò su cui vogliamo davvero provare a concentrarci è migliorare davvero i punteggi SAT e, naturalmente, ciò significa essere pronti al college perché è ciò che il SAT\nè progettato per misurare. Dobbiamo davvero concentrarci sulle competenze. E queste non sono solo abilità del SAT, si tratta di \nabilità di lettura, scrittura e matematica durature che gli studenti devono conoscere,\nnon solo per prepararsi al college, ma per avere successo anche negli altri corsi delle scuole superiori. Quindi penso che la nostra attenzione su quelle capacità durature sia\ndavvero, davvero importante. - Grazie. Quindi Elizabeth, spiegaci come affrontiamo le competenze alla Khan Academy. - Sì, bella domanda. Come ha detto Raven, collaboriamo con il College Board, quindi ci aiutano a progettare quelle domande per assicurarci che siano allineate al 100%. Ma sai, parlando nello\nspecifico delle competenze, entrambi i nostri corsi SAT digitali, quello di matematica e quello di lettura e scrittura\nhanno una serie di competenze. Quello di matematica ne ha circa 111 e quello ELA ha circa 41-50 competenze. E quando parliamo di apprendimento della maestria e parliamo dei nostri studenti che\napprendono autenticamente quelle abilità, come Sarah\nmenzionava per il college , la carriera e la vita in generale. Ciò che mi piace di Khan\nAcademy è che gli studenti, gli insegnanti e gli\namministratori sono in grado di monitorare il\nlivello di competenza dello studente in tali competenze. E così per tutto l'anno, a partire da agosto, monitoriamo gli studenti che\nlavorano su quelle abilità e se stanno raggiungendo o meno la\ncompetenza in quelle abilità. Perché se sono competenti,\nallora sono, come insegnante, più fiducioso che saranno in\ngrado di rispondere da soli a questa domanda\nquando si tratta del PSAT o del SAT il giorno del test. E quindi questo è qualcosa\nsu cui io, Sarah e Raven lavoriamo davvero duramente\ncon i nostri partner distrettuali è, sai, ecco le abilità in cui i tuoi studenti eccellono. Queste sono quelle a cui\ndobbiamo in un certo senso appoggiarci e ottenere davvero qualcosa in più  supporto in corso. E quindi questo è davvero ciò che\ninquadra le nostre conversazioni con i nostri partner in\nogni momento: quali sono le competenze e come se la passano gli studenti con\ntali competenze? - E Raven, dal tuo punto di vista, a cos'altro stai pensando\nquando si tratta di abilità? Perché so che\npensi molto alle abilità. - SÌ. Quindi, giusto per riprendere quello che\nhanno detto Elizabeth e Sarah, la cosa bella della Khan\nAcademy è che è uno sportello unico per i SAT, giusto? Come gli studenti possono entrare,\npossono affrontare la sfida del corso. Questo può dare a noi insegnanti,\nfin dall'inizio dell'anno scolastico, il momento in cui\nhanno bisogno di appoggiarsi. Quindi, invece di perdere tempo, avendo i bambini che si limitano a esercitarsi e uccidere, adotteremo l'approccio, appoggiamoci a ciò che  loro hanno bisogno. Se lo sanno già, lascia che sia, acquisiranno quelle competenze\ndurante tutto l'anno scolastico dal loro insegnante. Ma ci appoggieremo alle competenze su cui hanno bisogno di un po', un po' di aiuto extra\n e poi gli insegnanti\nguarderanno i loro rapporti e poi torneranno indietro e\nmagari formeranno piccoli gruppi o daranno incarichi di rinforzo extra al di fuori del loro corso  obiettivo di maestria. Così abbiamo fatto, abbiamo fatto un buon lavoro\nallineandoci con il College Board e creando queste tre\ndiverse categorie nel nostro corso di preparazione al SAT. Abbiamo il fondamento, il\nmezzo e l'avanzato. Quindi, proprio come il SAT,\npoiché ora è adattivo, vogliamo assicurarci che i nostri\nstudenti ottengano tutto ciò di cui hanno bisogno in tutte\nle aree del test. - È fantastico. Quindi voglio che iniziamo ora a stratificare il modo in cui pensiamo\nall'intelligenza artificiale nell'uso dei corsi. Quindi Sarah, pensando all'intelligenza artificiale,\nquali sono alcune delle sfide e delle opportunità che si\npresentano quando si utilizza un'intelligenza artificiale per la preparazione al SAT digitale? - Sì, uno degli esempi immediati che mi è venuto in mente è che\nquando insegnavo scienze, abbiamo fatto un bootcamp di preparazione al SAT\nche era come un corso di due settimane che gli studenti\nseguivano durante l'estate. Potrebbero iscriversi. Ma ho davvero faticato a\ncapire come insegnarlo, come mantenere gli studenti coinvolti\nin alcuni di questi contenuti che probabilmente non sono terribilmente\nentusiasmanti per loro. So che molti di voi probabilmente\nhanno corsi di preparazione al SAT o facoltativi nella propria scuola. E quindi penso che l'intelligenza artificiale avrebbe potuto\nessere un'opportunità per me e farmi risparmiare\nmolto tempo è utilizzare i nostri strumenti per insegnanti Khanmigo. E quindi questo mi avrebbe reso la\nvita molto più semplice perché ho passato così tanto tempo\na cercare di capire come coinvolgere gli studenti\ne fare queste cose. Ma abbiamo generatori di piani di lezione che sarebbero stati molto utili. Esiste uno strumento per insegnanti di Khanmigo in cui crea testo informativo e, come sappiamo, il tipo di lettura e avere quelle capacità di lettura approfondita\nsono estremamente importanti. Quindi sto generando quel\ntesto informativo con cui i miei studenti possano esercitarsi. Abbiamo uno strumento per insegnanti di Khanmigo\nper mantenerlo rilevante, generatori di contesto nel mondo reale,\ntutte quelle cose che ho speso così tanta\nenergia mentale cercando di inventare da solo, Khanmigo\navrebbe potuto farlo per me. E quindi vorrei aver avuto quegli strumenti quando insegnavo,\nmolto tempo fa. (Raven ride) - Qualcun altro la pensa così? Chiunque altro spenda del tempo nella pianificazione. (Raven ride) Sto\nsolo scherzando.  Io so chi sei. Quindi Elizabeth, ti vedo empatica, annuisci davvero con la testa.\nQuesta è la parola proprio lì. Allora cosa aggiungi alla conversazione? - Sì, voglio dire, ricordo\nmolte domeniche in cui mi preparavo per le mie molteplici preparazioni e sai, mi assicuravo di avere tutto\npianificato per la settimana. Ed è sorprendente per me quanto velocemente alcune di queste cose siano ora automatizzate con Khanmigo. Sai, l'intelligenza artificiale è nuova per tutti noi. Khanmigo, sai, molti degli altri strumenti di intelligenza artificiale\nlà fuori non sono solo nuovi per noi come alla Khan Academy e per i\nmiei colleghi in questa chiamata, ma sai, è nuovo per i nostri insegnanti, è nuovo per i nostri genitori,\nil nostro amministratore distrettuale. Ed è stato davvero un anno fantastico, semplicemente per scoprire e imparare. E penso che\nuna delle sfide che gli educatori si trovano ad affrontare oggi in classe sia la\ncomprensione da parte degli studenti di come interagire con Khanmigo e con l'intelligenza artificiale e sono davvero giunto alla conclusione che c'è molta modellizzazione\nda coinvolgere per i nostri studenti. Sai, questo non è Google. Non è un modo veloce\nsolo per ottenere una risposta. Devi davvero\nlavorare davvero con gli studenti su come parli con Khanmigo e su come puoi usare autenticamente Khanmigo per aiutarti a imparare e, sai, ad acquisire\nnuove abilità e compiti. Dove trovo che sia davvero vantaggioso proprio come la preparazione al SAT è, sai, l'istruzione in piccoli gruppi in classe e sai, avere un\ntutor personalizzato su ogni singola scrivania. Quindi di solito c'è solo un insegnante\nin classe. Se sono fortunati ne ottengono\ndue o un aiuto o un aiutante. Ma riuscire a far sì che gli studenti ricevano quel feedback immediato e lavorino su qualcosa\nche stanno cercando di imparare a portata di mano senza avere quell'insegnante\nproprio accanto a loro, penso davvero che sia ciò che è\npotente in tutto questo. E quando si tratta di preparazione al SAT, sai, tutti gli studenti meritano tutto\nl'aiuto possibile e questo è sicuramente qualcosa che\nvedo essere molto potente in futuro nelle classi. - Oh, assolutamente. Voglio dire, la tecnologia ha fatto molta strada, ma come abbiamo detto, il cambiamento può essere difficile. Voglio dire, ricordo che la preparazione al SAT\nera un libro gigante come questo. Ancora una volta, vi ricordate tutti, voglio dire, nell'anno, blah, blah blah. Quindi, pensando\nall'evoluzione, pensando all'intelligenza artificiale, Raven, cosa vedi nei distretti con cui lavori riguardo alle opportunità e alle sfide? - Quindi, sai, le opportunità sono\nsolo equità, giusto? Sappiamo che non tutti\nhanno una mamma che resta a casa o l'accesso a un tutor. Quindi il fatto di avere uno strumento che tutti gli studenti possono utilizzare,\nindipendentemente dal livello scolastico e dallo stato in cui si trovano, è sorprendente. Sai, e onestamente,\nho due adolescenti e non so tutte le cose che stanno imparando adesso,\nanche se sono un educatore. Quindi immagina un\ngenitore non educatore che cerca di orientarsi tra tutte le diverse cose che gli studenti stanno imparando al giorno d'oggi. Quindi non solo può aiutare i genitori, perché uso Khanmigo abbastanza\nspesso per aiutare i miei figli, ma, come ha detto Elizabeth, è un tutor personalizzato\nper ogni singolo studente in ogni singola classe in\ntutto il paese. E sai, proprio come ogni nuovo strumento, le sfide\narrivano sempre con il tempo, giusto? Quando formerò i\nmiei insegnanti a usarlo? Come\nlo userò in modo che, sai, lo usino in sicurezza? Queste sono tutte cose\nche rappresentano sempre sfide. Ma ho la sensazione che alla Khan\nAcademy abbiamo fatto davvero un ottimo lavoro nel\ncapire tutte queste cose, sai, pur avendo la moderazione e avendo gli insegnanti in\ngrado di monitorare la chat e avendo i genitori in\ngrado di collegarsi agli account e  monitorare la loro chat. Quindi ci saranno sempre\ndelle sfide perché ChatGPT e tutta la tecnologia AI\ncambiano costantemente, giusto?  I grandi modelli linguistici creano allucinazioni,\nc'è di tutto, ma si sa, anche con qualsiasi nuova tecnologia o nuovo programma di studio, l'adattamento o qualsiasi di queste cose in una\nscuola è sempre una sfida. E ci vuole solo\nil leader giusto e noi che vi guidiamo attraverso l'\nimplementazione per garantire che le\nsfide siano minime. Ma non sarei un ex\npreside di scuola superiore se mi sedessi qui e dicessi che non ci saranno\nsfide perché lo saranno sicuramente. Ma sai, spero che queste siano cose che il nostro team possa capire per te e aiutarti a superare\nalcune di queste cose. - Giusto? E nella chat c'era una domanda\nsu una demo visiva.  Oggi vogliamo concentrarci su\nuna conversazione più approfondita, ma, prima di\nlasciarvi tutti oggi, ve ne daremo alcuni,\nvi indicheremo una direzione in cui potrete accedere alle\ncose e vederle e ci sono molte risorse, ma stiamo cercando di darti una prospettiva più educativa invece di mostrarti un sacco di cose. (Raven ride)\nÈ fantastico. È davvero fantastico. Tuttavia, vogliamo parlare di più del perché e del come dietro tutto ciò e, come ha detto Raven, ti darò qualche\ninformazione in più su come ci piacerebbe\nsupportarti in questo lavoro. Ma voglio tornare\nall'apprendimento e all'apprendimento della maestria. Questo è un termine davvero interessante e sento che dovremmo parlare molto di più dai tetti dell’istruzione\nsulla protezione dell’apprendimento. Cosa significa padroneggiare le competenze? Quindi Sarah, mi piacerebbe che\ntu pensassi a come, che ruolo gioca il Mastery Learning e l'aiuto agli studenti anche con\nil nuovo formato SAT digitale? - Sì, penso che la\nnatura intrinseca dell'apprendimento della maestria sia quella di assicurarsi che gli studenti\nabbiano una solida base e quella\nconoscenza prerequisita su cui costruire. Quindi non ci sono lacune, non ci sono buchi nel loro apprendimento. E poi il\ncorso di preparazione al SAT digitale rispecchia questo, e Raven lo ha menzionato prima, rafforzando quelle competenze, abbiamo quei\nlivelli fondamentali, la difficoltà media, la difficoltà avanzata per\ngarantire non solo l'ampiezza delle competenze che stiamo\noffrendo per essere sicuri  quelli si allineano a ciò che viene valutato sul SAT e ancora, quelle abilità durature, ma anche la profondità di quelle abilità. - Sì, assolutamente. Voglio dire, anche pensando al\nSAT, perché lo stiamo sostenendo? Qualcuno, Bueller?  stavo solo scherzando.  Lo stiamo facendo in modo che gli studenti\npossano continuare a imparare, continuare a padroneggiare l'apprendimento, si spera in diverse istituzioni. Quindi Sarah o Elizabeth, cosa hai visto dal tuo punto di vista sull'apprendimento della maestria? - Beh, sai,\nper me l'apprendimento della maestria è sempre stato, sai, che gli studenti\narrivassero davvero alla profondità di quell'abilità e fossero in grado\ndi riprodurla in molte volte diverse. E affinché i nostri studenti\ndimostrino competenza in una competenza su Khan Academy, devono vederla almeno due volte e ottenere quella competenza\ncorretta in una valutazione, in un quiz di unità o in una sfida del corso. Quindi mi sento sempre\npiù sicuro sapendo che quando lo studente\nha padroneggiato questa abilità, è qualcosa che è\nstato in grado di fare più volte attraverso la pratica. Un'altra cosa che vedo e che è davvero\nutile è che gli studenti, i genitori, gli\ninsegnanti e l'amministratore possono tenere traccia di come gli studenti e dei loro gusti, o quante abilità gli\nstudenti hanno padroneggiato. Quindi nella nostra piattaforma\npuoi monitorare i progressi della padronanza per unità o anche per l'intero corso e puoi mantenere gli studenti coinvolti. Quando parliamo di\ncoinvolgimento degli studenti qui , sai, durante tutto l'anno, quanto di questo corso hai imparato? E assicurarci che gli\nstudenti continuino a progredire e ad\nacquisire padronanza. Penso che sia sempre come se il grande pezzo di questo puzzle fosse motivare gli studenti. E quindi, se gli studenti conoscono\nl'obiettivo finale in mente e sanno che,\nehi, se riesco ad arrivare all'80 o al 90% di padronanza di questo corso, ehi, sarò\nmolto più fiducioso il giorno in cui dovrò sedermi  il SAT. Quindi sì, è quello che mi piace. E mi piace anche la trasparenza, dallo studente\nfino all'amministratore distrettuale. Per me questo è davvero importante\nin modo che tutti possano essere coinvolti nella conversazione con gli studenti. - Oh, assolutamente. Voglio dire, i dati devono essere di proprietà e visibili per tutte le parti interessate\nin un distretto, punto. Come se fosse così che\navrà un impatto profondo. Ma Raven, dal tuo punto di vista, anche come ex leader a livello di edificio\n, cosa ne pensi, quali sono i tuoi pensieri sull'impegno e la padronanza, beh, la padronanza delle competenze e il coinvolgimento degli studenti quando pensi al SAT in particolare? - Sì, sto solo pensando\nal mondo secondario, sai, vero?  Ci sono ragazzi su\nbinari diversi che fanno cose diverse, orari diversi in tutto il distretto. Quindi il fatto che l'apprendimento della maestria\nsia qualcosa che gli insegnanti possono impostare il primo giorno\ne in un certo senso lasciarlo fluire e i ragazzi andranno per la\nloro strada, è fantastico perché richiede meno tempo, giusto? Per gli insegnanti. Ora gli insegnanti possono concentrarsi\nsul contatto diretto con gli studenti e approfondire quelle competenze in cui gli studenti non sono\ncompetenti, giusto? E dare il, fare piccoli\ngruppi e gestirlo e poi, sai, fare\ndurante i loro PLC utilizzando i dati per tracciare, okay, forse\nquesto è qualcosa che dobbiamo cambiare nel nostro\ncurriculum o istruzione. Ho notato che la maggior parte dei ragazzi se la cava\ndavvero male con le equazioni letterarie, quindi forse\ndovremmo tornare indietro e provare di nuovo quell'abilità. Ma il bello\ndell'apprendimento della maestria è che se ho sei diversi\nlivelli nella classe, va bene perché Khan Academy\nli guiderà lungo il percorso di cui hanno bisogno e che si adatta al loro apprendimento. E non c'è niente che possa batterlo perché ci vorrà un\ninsegnante, come ha detto Danielle, quando ero in\nclasse alcuni anni fa, ci vorrà molto tempo per definire chi ha bisogno di\nimparare cosa in un breve periodo di tempo.  tempo prima del SAT e\nnon è un compito gestibile. Quindi utilizzare Khan Academy per\nfiltrare parte di ciò e fare in modo che l'insegnante inserisca gli studenti e in un certo senso abbia quel percorso e poi possano concentrarsi\nsul momento in cui lo studente faccia a faccia e quell'interazione individuale\nè solo un punto di svolta. E per quegli studenti che volano molto e non vogliono sedersi lì ad\nascoltarti, indovina un po'? Non è necessario. Continuano ad andare alla Khan\nAcademy dove devono essere. E questo per me è\nqualcosa, come educatore e insegnante,\nsai cosa i miei figli, tutti i miei figli ricevono ciò di cui hanno bisogno e questa è la cosa più importante. - Sì. E assicurati di tornare indietro e riascoltare\nquello che ha appena detto Raven. Ha appena rilasciato molti (Raven ride)\nottimi dati e strategie di best practice\nproprio per assicurarsi che tu stessi pensando e\nutilizzando analisi basate sulle competenze per supportare l'apprendimento degli studenti. Quindi ora torneremo indietro con la\nmacchina del tempo. Questo non è \"Ritorno al\nfuturo\", ma forse lo è. (Raven ride)\nNon è solo. Voglio che tu ripensi, ripensi a quando\ntornavi a insegnare nelle aule delle scuole superiori, pensando a come iniziare\nil prossimo anno scolastico. Come penseresti di\npreparare gli studenti per il SAT digitale e come, ora siamo\nproprio in \"Ritorno al futuro\" dove è come dagli\nanni Ottanta ma sull'hoverboard. Quindi sei tornato quando insegnavi e poi ora hai Khanmigo e Khan Academy per aiutarti. Quindi cosa ne pensi e come\ncambierebbe con l'introduzione dell'intelligenza artificiale? Perché non ci cacci via Sarah? Nella DeLorean.\n(Sarah ride) Troppa analogia. Va bene, vai avanti, Sarah. (Raven ride) - Quindi penso che quasi tutti sappiano che la scienza non si\nmisura direttamente sul SAT, giusto? Ma nella sezione di lettura e scrittura e in quella di matematica ci sono domande che hanno un contesto scientifico. Quindi ero un insegnante di scienze e solo perché la scienza\nnon viene misurata non significa che sono fuori dai guai. Posso ancora aiutare i miei studenti\na prepararsi per il SAT. Quindi quello che farei è far frequentare ai miei\nstudenti i corsi di scienze della Khan Academy. Quindi vai al\ncorso di biologia o di chimica, di fisica o di scienze,\nqualunque cosa tu voglia fare. E all'interno di questi corsi\nci sono articoli e quegli articoli contengono molti testi ricchi e informativi basati sulla scienza. E quindi più riesco a\nconvincere i miei studenti a leggere quei testi di contesto scientifico e a sentirsi a proprio agio nel leggerli, sarà\nloro molto utile quando sosterranno il SAT. Quindi mi concentrerei davvero sulla lettura e sulle capacità di lettura ravvicinata del\ntesto informativo scientifico. E poi, se gli studenti\nhanno accesso a Khanmigo, possono, sai, usare Khanmigo\nanche su quegli articoli. Ehi, spiegami, non\nso cosa significhi questa parola, aiutami. Quindi, ancora una volta, è quel\ntutor personale che li aiuta a leggere quel testo informativo, che ancora una volta li aiuterà durante il SAT. - È stupefacente. E mi piace il modo in cui condividi, anche se tu, sai, la\nscienza non viene valutata direttamente, penso che molti insegnanti di contenuti\na volte dicano, cosa? Cosa c'entra il mio argomento? (Raven ride)\nMa solo sostenere gli studenti ed essere\npensatori critici, studenti coinvolti, come se ci volesse uno sforzo di squadra. Quindi grazie anche a te per averlo sottolineato. Elizabeth, qual è la tua prospettiva nella tua macchina del tempo DeLorean? - Beh, sai, ho insegnato ELA all'undicesimo anno per cinque anni e mi sono sempre sentito molto sistematico. Mi piace che le cose\naccadano in un determinato momento. E quindi mi\npiacerebbe davvero fare un piano a ritroso a partire da, okay, quando sarà il mio giorno di scuola SAT? Quando dovrei far esercitare i miei studenti\nsu Blue Book? E iniziamo davvero\nagosto con due cose. La prima cosa che inizierei davvero è\ncon la sfida del percorso.  La cosa interessante nei nostri\ncorsi SAT digitali è che puoi assegnare qualcosa di simile a una pre-valutazione.  Si chiama sfida del percorso. E dà agli studenti\nun campione casuale delle competenze di entrambi i corsi. E puoi farlo molto\npresto durante l'anno scolastico e iniziare immediatamente a\nrecuperare i dati sulle competenze. Quindi puoi iniziare a raggruppare\ngli studenti per abilità, puoi iniziare a farti un'idea di quali abilità gli studenti potrebbero essere già un po' abili e per quali potrebbero aver bisogno di aiuto. Quindi inizierei sicuramente\ncon la sfida del corso solo per ottenere quei dati iniziali. E poi, sai, con l'intelligenza artificiale e con Khanmigo\nprobabilmente passerei molto tempo a fare da modello all'inizio\ndell'anno con i miei studenti di,\nsai, ehi, questo è un esempio di un problema che\nnon conosco  come rispondere. Se fossi stato io, sarebbe un problema di matematica. Che avrei modellato con i miei studenti. E in un certo senso mostra agli\nstudenti come puoi interagire avanti e indietro con Khanmigo\nper rispondere alla domanda o riassumere un video o\nriassumere un articolo. Penso anche che\ncoppie collaborative, studenti che lavorano insieme a Khanmigo per vedere cosa scoprono e cosa imparano, farebbero parte della mia routine all'inizio dell'anno scolastico. E poi spostandoci verso l'autunno, sai, iniziando a guardare davvero i dati sulle competenze e i dati sulle mie competenze. Quindi, sai, i miei\nstudenti hanno padroneggiato almeno il 15% del corso entro, non\nso, il 15 ottobre? E semplicemente assicurarmi che i\nmiei studenti siano sulla buona strada per continuare ad acquisire\ncompetenze sarebbe sicuramente probabilmente il mio approccio se fossi\nin una classe ELA oggi. E sai, verso\ngennaio, assicurarsi che si siano esercitati sul\nBlue Book è estremamente importante. E sai, esaminando\nle funzionalità, tutti gli strumenti , la calcolatrice e tutto ciò che è incorporato, penso che sia anche molto importante essere trasparenti con gli studenti. - E mi piace davvero che\ntu chiami la modella. Ero un ex insegnante di scuola media e, forse puoi capirlo, qualcuno ha mai consegnato evidenziatori ai ragazzi delle scuole medie? - Sì.\n- Senza fare la modella? Puoi solo immaginare, sai, cosa succede, questo è il punto. Ma l'intelligenza artificiale è un altro strumento, ma\nè comunque importante modellare. Penso che a volte gli insegnanti delle scuole medie e superiori se ne dimentichino. Pensano, danno per scontato che gli studenti debbano\nsapere come usare le cose, ma in questo nuovo mondo no, no.  La modellazione è davvero, davvero importante, soprattutto quando ci sono così tanti cambiamenti, c'è così tanta innovazione in atto. Quindi davvero, inoltre il tuo approccio è molto lineare, quindi grazie per questo. Corvo, e tu? - Quindi prenderò semplicemente la prospettiva di un amministratore di condominio\nsolo perché Sarah ed Elizabeth condividono così tanti ottimi consigli come insegnanti di classe. Ma proprio adesso è il momento in cui \npianificherai la programmazione, giusto? Perché cos'è tutto quello\nche dicono gli insegnanti? Non ho abbastanza tempo, non posso farlo. Non ho abbastanza tempo per questo. Non ho abbastanza tempo per quello. Bene, siamo responsabili noi,\namministratori dell'edificio, tu sei responsabile del\nprogramma, sei responsabile di dare agli insegnanti che\ncitano il tempo senza virgolette. E questo è davvero importante, anche se non cambia il tuo programma. Come al liceo,\navevamo blocchi da 90 minuti, quindi ho dato loro\ndiverse opzioni su come organizzare la\nlezione per prepararsi a tutte le diverse cose per cui devi prepararti al liceo, tutti i diversi esami. E gli insegnanti devono solo sapere che li stai supportando\nin questo viaggio. E parte di ciò è garantire\nloro un facile accesso. Ed è quello che fa Khanmigo, giusto? Quindi non devono\npiù avere quel grosso libro. Possono andare avanti, possono allineare i loro contenuti durante tutto l'anno\ncon le domande SAT. Perché non possono avere il SAT venerdì? Sapete, dite: \"Ehi ragazzi,\nse siete\", come ha detto Sarah, non importa quale\ncontenuto state insegnando. Il venerdì, per i primi 30\nminuti del nostro ultimo blocco, faremo la preparazione al SAT alla Khan Academy. Sai, anche i genitori\npossono collegarsi ai loro account. Quindi forse se avrò una buona\npercentuale di successo con i compiti, li userò per i compiti. Ma Khanmigo può fornire i dati agli insegnanti, come diceva Elizabeth, in modo che ciò possa essere fatto subito prima della lezione invece che loro debbano scavare a fondo. Khanmigo creerà gruppi per te. Ti dirà quali sono le sue competenze\nsu cui lavorare, ti fornirà programmi di lezione e consentirà persino agli\nstudenti di esercitarsi. Dici semplicemente \"Khanmigo, dammi\nalcune domande pratiche\". Quindi anche solo dare ai\nragazzi abbastanza tempo per farlo sarà sicuramente un\nagente di cambiamento affinché possano andare avanti. Sappiamo che il tempo è essenziale per gli studenti, per gli insegnanti. Quindi questo è solo un altro modo\nper insegnanti e amministratori di risparmiare tempo, avere un piano e assicurarsi che gli studenti siano preparati e non aspettino fino\nall'ultimo minuto per stipare, ma lavorarci sopra tutto l'\nanno, come ha detto Elizabeth, da  l'autunno con quella sfida del corso. E poi andare\navanti per tutto l'anno fino al giorno dell'esame invece di,\nsai, avere quell'ansia di stipare tutto\nin un po' di tempo perché non hai tempo. - Sono sicuro che nessuno di quelli che stanno\nguardando si è mai riempito di qualcosa e ha sentito quella pressione. Giusto?\n(Raven ride) Soprattutto non al college quando cerchi di gestire il tuo tempo da giovane.\n- Giusto. - La chiave è la pianificazione della preparazione. E cerchiamo di\nsupportarti nelle nostre partnership con Khan Academy nello svolgimento di\nquesto lavoro essenziale. Quindi ora voglio, stiamo\ncorrendo, parlando di tempo, stiamo quasi esaurendo il tempo. Quindi voglio che pensiamo\na un’ultima prospettiva, agli sviluppi futuri. Quindi, pensando che, sai,\nil modo in cui il SAT si è spostato nel formato digitale, cosa\nstiamo facendo alla Khan Academy o cosa sono, cosa\npensi che accada nel mondo dell'istruzione\no cosa speriamo per l'uso di  AI e\ncontribuire a continuare questo lavoro per il SAT digitale? Perché non ci fai iniziare, Sarah? - Penso che ci sia molta preoccupazione sull'uso dell'intelligenza artificiale nell'istruzione,\ned è giusto che sia così, giusto? Siamo in un mondo completamente nuovo. Ma penso anche che lo siamo,\ntendiamo a pensarci nel modo in cui ci è stato insegnato o nel modo in cui ci è stato insegnato a insegnare. E quindi, entrando in questo nuovo mondo di utilizzo dell'intelligenza artificiale nell'istruzione, quello che spero di\nvedere è che l'intelligenza artificiale sia uno strumento per aiutarci a insegnare il\npensiero critico un po' meglio, un po' più facilmente. È una cosa difficile da insegnare\ned è una cosa difficile da fare. Mi auguro che, sai, una\nmaggiore collaborazione. Stiamo prendendo l'intelligenza artificiale, sai,\nper tutta quella conoscenza meccanica che è, che può\nfarlo per gli studenti, giusto? Ma allora come faremo a convincerli a collaborare in modo efficace? E penso che esista un grande spazio in cui l'intelligenza artificiale può aiutare insegnanti e studenti a migliorare le\ncapacità di pensiero critico e di collaborazione. E spero che sia lì che\nandremo alla fine. - E quello che ti ho sentito\ndire sono abilità umane. - Giusto.\n- Giusto? Pensiero critico, collaborazione. Un computer non può farlo. Questo è ciò che fanno gli esseri umani, e in realtà è un ottimo modo per imparare in generale. Quindi, ancora una volta, so di avere molto, si parla molto di istruzione. È: \"I computer stanno prendendo il sopravvento\". Questo può essere uno strumento per aiutare\ncon le capacità umane. Questa è una parola nuova per tutti, umana. Forse è una parola vera?\n- Giusto. - Elisabetta, salvami.  Cosa ne pensi? - Sai, spero per\nil futuro che, sai, tutti si sentano più a loro agio con l'intelligenza artificiale, ma anche con la comprensione che quell'insegnante in classe non\npotrà mai essere sostituito e che l'insegnante è ancora solo la connessione umana più importante al\nmondo  . E ricordo, sai,\ntorniamo al lavoro di modella e ricordo in classe, sai, i miei studenti mi ammiravano e sai, e passavo più tempo con i miei studenti che con la mia famiglia\ntante, tantissime occasioni. E so che facevano lo stesso e facevano lunghi\nviaggi in autobus, sai, fino alla mia scuola. E, sai, spero che per il futuro, che gli studenti, sai,\nabbiano ancora, sai, quella connessione umana con i loro coetanei e con i loro studenti e il mondo e la comunità che li circonda, ma che si sentano più a loro\nagio nell'usare  L’intelligenza artificiale per migliorare ciò che hanno, ciò che\nsanno e ciò che possono imparare. Mi piacerebbe anche vedere l’intelligenza artificiale avere un ruolo nelle valutazioni. Credo che i dati siano così importanti non solo per i dirigenti dei nostri distretti scolastici\n, ma anche per i nostri presidi, i nostri studenti e i nostri genitori. E mi piacerebbe vedere una\nsorta di incorporazione dell'intelligenza artificiale nelle nostre valutazioni formative a ciclo breve che diamo ai nostri studenti. A cosa assomigli\nnon ne sono del tutto sicuro, ma è sicuramente qualcosa a cui ho\npensato su come questo\npotrebbe cambiare il mondo delle valutazioni per il futuro. - Sì, assolutamente. E Raven, mi piace che tu continui a darci la prospettiva amministrativa.\n(Raven ride) Quindi continuiamo ad andare avanti. Quali sono i tuoi pensieri? - Voglio dire, ci stavo\npensando, sai, da quando ero studente anch'io a quando insegnavo a\nscuola e sai, amministratore e poi anche questa\nprospettiva che ho ora, lavorando con i distretti ogni singolo giorno. Sai, ci sarà sempre\nqualcosa di nuovo. E per quanto riguarda l'istruzione, penso che\nabbiamo tutto sotto controllo, giusto? Riceviamo un nuovo curriculum\nogni due minuti, otteniamo nuovi strumenti, otteniamo tutto. Quindi questa è una di quelle cose. Ma questa cosa dobbiamo trattarla un po'\npiù delicatamente, giusto? Dobbiamo assicurarci di fare il modello. Stiamo esponendo non solo i nostri\ninsegnanti, i nostri studenti e il nostro amministratore, ma anche la nostra\ncomunità e i nostri genitori perché influenzerà tutti. Lo è già, vero? Come se lo usiamo quotidianamente, a volte senza saperlo. Se hai un Alexa a\ncasa tua, se hai, sai, Google, se\nhai un Google Nest o una qualsiasi di queste cose. - Siri.\n- Sai. Sì, Siri.\n(Danielle ride) Utilizzi l'intelligenza artificiale ogni giorno e sai, non ci\npensi due volte. Quindi è quello di cui ha bisogno.  Questo è\nciò che spero per il futuro. Questo è qualcosa a cui\nnon ci penserai nemmeno due volte. Sai, prima del COVID, non tutti avevano nemmeno dispositivi one-to-one. Non abbiamo mai nemmeno pensato, okay, tutti avranno un computer e tu farai il\ntuo lavoro sul computer. Neppure nell'edificio scolastico\n, ma ce l'abbiamo fatta. Quindi questa è solo\nun'altra di quelle cose che sono venute alla ribalta e dobbiamo prenderle\ne dobbiamo impararle. Non averne paura. E poi insegnare, insegnare,\ninsegnare, modellare, modellare, modellare e assicurarsi che venga\nutilizzato nel modo appropriato e che gli studenti ne conoscano il valore, perché è prezioso. Non è solo uno strumento per gli studenti per imbrogliare o, sai, scherzare perché so che è quello che\npensano molte persone, ma è davvero prezioso. E dirò una piccola storia perché so che stiamo finendo il tempo, ma proprio come tutti gli altri, quando sai che Khanmigo è uscito, è nato un anno fa,\nsai, a marzo o giù di lì.  Ho pensato, oh mio Dio,\ncosa stiamo facendo? Come se fosse pazzesco, come\nun'intelligenza artificiale, come, sai, stavo cercando di leggere\nlibri e cercare articoli e tutte le cose per cercare di, sai, aiutarmi a capire cosa stava succedendo. E non dimenticherò mai il mio manager che diceva: \"Sapete, questo è qui ragazzi. Dobbiamo\nabbracciarlo, dobbiamo usarlo, dobbiamo conoscerlo in modo da poter aiutare i\nnostri partner distrettuali\". E ci ho pensato e ho pensato, sai, ha ragione. E, ma dico, ho solo\nbisogno di vederlo con i miei occhi. Quindi ho avuto l'opportunità di\nandare in una scuola in California e vederla in azione e questa scuola utilizza\nuna popolazione speciale. Quindi lo usano con studenti accaniti, studenti di educazione speciale e studenti ELL. E questo ha cambiato tutta la mia prospettiva perché fondamentalmente, proprio come volevamo, l'unico insegnante, tutti i\nbambini, avevano Khanmigo per aiutarli e non hanno perso un colpo. Quindi non c'erano bambini\nseduti lì ad aspettare, appoggiati allo schienale, senza fare nulla. Immediatamente, quando\nl'insegnante stava lavorando con altri studenti, sono\nsaliti immediatamente su Khanmigo, hanno chiesto a Khanmigo di cosa avevano\nbisogno e hanno continuato ad andare. Ed era come, oh mio Dio, come se non avessi una fila\ndi ragazzi che aspettano che io chieda aiuto. Io, sai, non c'è\nnessuno, non devo preoccuparmi di dover fare questa lezione per tre giorni in più del dovuto perché metà della mia classe non l'ha capito. Avevano qualcuno lì\nche poteva aiutarli e cambiare la lingua in modo che potessero essere supportati\nnella lingua di cui avevano bisogno. Quindi, con tutta la\ncarenza di insegnanti, con tutta la carenza che si sta verificando in giro, quella\n che ho visto è stata davvero una cosa speciale e mi ha fatto davvero sentire che\nstiamo facendo la cosa giusta e che Khanmigo\nsarà davvero  qualcosa che cambierà la\nvita di molte persone. - Beh, Raven, Sarah, Elizabeth, è stata una conversazione meravigliosa. Apprezzo tutto il tuo tempo, i tuoi pensieri e le tue prospettive. E per quanto riguarda Raven, spero che tu possa vederlo, eccoci qui. Potete vederlo? Siamo qui con te. Khanmigo, vero?  Con te. Ci piacerebbe lavorare con te. Ci piacerebbe collaborare con te. Vogliamo entrare nel futuro con te. Quindi, se vuoi collaborare\ncon noi alla Khan Academy, avrai molti vantaggi diversi. Innanzitutto tutti i corsi sono gratuiti.  Lo sapete tutti, spero che lo sappiate, ma i corsi sono gratuiti. Ma quando collabori\ncon noi, ti aiutiamo. Questi straordinari esseri umani in\nquesto panel collaborano con i distretti ogni singolo giorno. Ottieni un servizio di guanti bianchi,\nhai un apprendimento professionale, hai turni automatici e dati personalizzati. Vogliamo anche supportarvi\nnel dare a tutti gli studenti la possibilità di avere un accesso equo\nai contenuti di livello scolastico, di avere un apprendimento coinvolto per assicurarsi che stiano facendo tutte le cose e sviluppando quelle abilità. Quindi ti aiutiamo a monitorare i progressi. E, cosa più importante, intendo dire che\ntutto ciò è davvero importante. Ma la cosa più importante è che\nabbiamo sviluppato un’intelligenza artificiale sicura ed etica a Khanmigo. Apprezziamo e sappiamo che i dati e la privacy degli studenti sono davvero importanti. Abbiamo dei guardrail particolari perché lavorate tutti con esseri\numani meravigliosi e straordinari e ci sono carenze di insegnanti e a volte gli studenti hanno bisogno di aiuto e a volte\nchiedono aiuto con Khanmigo e vogliamo assicurarci di\niscrivere gli adulti e  gli umani che possono aiutare in questo. Quindi, se sei interessato a saperne di più, abbiamo inserito un collegamento nella chat. Questo è il nostro team partner distrettuale\n.  Per favore, contattaci. Puoi anche scansionare questo codice QR. Puoi andare sul nostro\nsito web, guardarlo oggi e ti apprezziamo moltissimo. E finché non ci incontreremo di nuovo, è stato\nmeraviglioso imparare con te.  Ti auguro uno splendido resto della giornata."
}