{
    "source": "Je_f4RimfKI",
    "youtubelink": "https://www.youtube.com/watch?v=Je_f4RimfKI",
    "t_english": "- [Narrator] What's common between a wifi router, our bodies, and an incandescent bulb? We all give out electromagnetic waves. But why do we do that? And why are they, why are they all so different? And how do we use some of them for wireless communications? Let's answer all of them. Let's start by asking ourselves what exactly are electromagnetic waves? Electromagnetic waves consist of oscillating electric and magnetic fields. A changing electric field produces a changing magnetic field, which produces a changing electric field and so on and so forth. And that, as you can see in this animation, the disturbance gets propagated. But the beautiful thing is that this disturbance can get propagated in a vacuum. It does not require any medium, and it carries energy. That's for example, how we get energy from the sun in the form of electromagnetic waves. But how do you produce these electromagnetic waves, you ask? Well, just accelerate charges. Accelerating charges will change electric fields. It'll change magnetic fields, and that's how electromagnetic waves will be generated. A cool way to accelerate charge would be just to take an electron and just wiggle it up and down. If you continuously wiggle an electron up and down, it'll continuously keep losing energy as electromagnetic waves. So accelerated charges create electromagnetic waves. So if you consider the wifi antenna, for example, you'll find that there'll be electrons oscillating up and down very quickly, okay? And because electrons are charges oscillating up and down, they will generate electromagnetic waves, which we call radio waves. Similarly, if you consider your own bodies, you have electrons inside our body. There are charges inside that are vibrating because just because of the temperature, they're just vibrating over there. And that will, again, generate electromagnetic waves, which happen to be infrared radiation. And the same thing will happen inside an incandescent bulb. When the filament is heated, it heats to such a high temperature that the electrons are vibrating randomly. And as a result, you have electromagnetic waves being generated, giving us light. But of course, now comes the big question. Why do we get radio waves over here, infrared rays over here, light rays over here? What's the difference between them? In all the cases, it's the charges that are going up and down, right? Then why do we get different kinds of electromagnetic waves? What's the difference between them? To answer that question, we need to understand some of the key properties of these electromagnetic waves. So let's say this is our electromagnetic wave. Remember, it has both electric and magnetic fields. I'm not showing both of them. Imagine this is just electric field, and it's moving. So you can imagine the field is, the whole wave is moving to the right, for example, okay? And one of the key properties of the wave is how big the wave is, the height of the wave, okay? That's what I mean. So that technically is called the amplitude of the wave. So this height is what we call the amplitude. So for example, this would be a very small amplitude wave. This would be a very large amplitude wave. And of course, remember when I say height, I'm not, there is nothing physical over here. These are electric and magnetic field values, right? So going back to the animation, it's more appropriate to think of amplitude as the maximum strength of the electric or the magnetic fields. Another important feature of a wave is what we call its phase. It's easier to understand what phase is if I were to look at just two specific points on a wave. So let's compare only these two points on the wave and let's see what happens to them as I'll just only compare to those two points and see what happens to them as the wave moves forward. I'm gonna move the wave to the right. So notice they will start oscillating. They'll go up and down. But look, they are going up and down together. They are in sync with each other. So we say they are oscillating in phase with each other. So you can think of phase as kind of representing where they are in their cycles of oscillation. They're both, these two are in phase because they reach their valleys together. They reach the zero together, they reach the peak together, and so on and so forth. So any two points on the mountains are in phase. Any two points on the valleys are in phase with each other. But what about these two points? Are they in phase with each other? Let's see. Let's see, again, let's just concentrate on them and move the wave and see what happens. Hey, no, they're not. What do you see? You notice that when one is going up, the other one is going down. And so no, they are not oscillating together. They're not in phase with each other. In fact, we say they're out of, they're out of phase. That's what we say. But what's important is that they're not in phase with each other, okay? This idea of phase will be super important later on. We'll come back to it later on. Another important feature of our wave is its wavelength. You can think of wavelength as the distance between any two consecutive peaks or any two consecutive valleys, or in fact, any two consecutive points which are in phase with each other. We saw, which are in phase, right? So for example, if you consider the distance between these two consecutive peaks, this length is what we'll call the wavelength. And it is usually represented by the symbol lambda, okay? So again, if you go back to our wave, and this would represent short wavelengths. This would represent long wavelengths, okay? And one last important feature of our wave is its frequency. What is frequency, you ask? Well take any point you want and then measure in one second how many waves go past that point. Number of waves passing through a point per second is what we call frequency. You can think of it as number of waves passing through a point per second, okay? So the unit of the wavelength is meters because you're measuring distance. And what is the unit of frequency? Well, it's number of waves per second. So the frequency would be numerator is just a number. So number per second would be second inverse. But we often call second inverse when we use it for frequency as hertz. So for example, if I say frequency is 10 hertz, it means from a given point, 10 waves are passing by that point per second. Now, here's the cool thing about wavelength and frequency. If you know them, if you know the wavelength and frequency, you can figure out the speed of the wave. Let's see how. In fact, let's take some numbers directly to see how. So let's take some simple numbers. Let's say we have a wave which has a wavelength of two meters and it has a frequency of four hertz. How do we figure out the speed of this wave? Well, what we're gonna do is, let's imagine there's a wave that starts from here and we'll just wait for one second, okay? So wait for one second. Now in that one second, I know four waves that wanna pass by. So let me just draw them. So our wave are gonna start from here. It's a peak. So four waves are gonna pass by in one second. So here's wave number one. Peak to peak is one full wave, okay? Wave number two, wave number three, and wave number four. So in one second, this whole thing happened in one second. Now if I figure out how much this total distance is, I'm done because then that represents the total distance traveled by the wave in one second. And that is the speed. So I need to calculate what this distance is to figure out the speed. How do I do that? Well, I know what the wavelength of this wave is, right? It's given to me. So can you pause and think about what this total distance is going to be? And as a result, think about what the correlation between the velocity or the speed of the wave, the frequency and the wavelength would be. Why don't you pause and try? All right, okay, so since the wavelength is two meters and I have four waves, the total distance traveled by the wave would be two times four. It would be eight meters. So in general, if the wavelength is lambda, this would be lambda. And if the frequency is F, there would be F number of waves over here. That means the total distance traveled would be F times lambda in one second, and therefore the speed of the wave would be F times lambda. Now, looking at this equation, we might think that hey, the velocity of a wave depends on the frequency and the velocity of the wave depends on the wavelength, but turns out things are a little bit more complicated. It depends on which wave we are dealing with. So now let's come back to electromagnetic waves. Turns out for electromagnetic waves in vacuum, the velocity is just a constant. Any electromagnetic wave you take in vacuum, it'll always travel at approximately three times 10 to the power eight meters per second. We often call this C, the speed of light, speed of light in vacuum, okay? It is independent of the frequency of the wave. It is independent of the wavelength of the wave, which means for electromagnetic waves that are in vacuum, since this is a constant, we notice that that means if you have a high frequency wave, it should have a lower wavelength. If it has a high wavelength, it should have a lower frequency. So for electromagnetic waves in vacuum, you can see that the frequency and the wavelength are inversely related to each other. And now we can go back to our original question. Why are these things giving out different kinds of electromagnetic waves? Well, because the charges over here are oscillating at different frequencies. In your wifi, the charges are oscillating at lower frequencies. So you get low frequency electromagnetic waves, which we call radio waves. Inside our bodies, the charges are vibrating at slightly higher frequencies. And so now, you get a slightly higher frequency waves, which you call infrared waves. Inside the light bulb, it's even higher frequency, which we get, call visible light because we can see it. And just to give you a feeling for numbers, okay? So your radio wave that's coming from your wifi is in the order of about a billion hertz, meaning the electrons over here are oscillating about billion times per second, okay? And when it comes to infrared, it becomes 10 to the 13. For visible light, it becomes 10 to the 14. You can even have higher frequency waves, which goes into ultraviolet rays. You have X-rays, you have gamma rays, and so on. And you can also see as the frequency increases, the wave length is decreasing because we saw that the frequency and wavelength are inversely related for electromagnetic waves. But that brings up the last question. What really happens to these electromagnetic waves when they go and hit something? For example, what happens to these radio waves when, you know, from the wifi it goes to our phones, for example? Well, our phones also have a tiny antenna inside of them. Now, in this transmitter antenna, electron vibrates giving you electromagnetic waves. In the receiver antenna for a phone, the exact opposite happens. The electromagnetic waves will fall on it and makes the electrons go up and down. And that's how the energy from this oscillating electron is transferred to the electrons over here. Pretty cool, huh? But now we may be wondering, well, how do you transmit any information though? For example, the radio waves that we would be using in wifi could be about five gigahertz, meaning five times, 5 billion hertz. That means the electrons over here are oscillating about 5 billion times per second, and then the waves go and hit over here. The electrons inside the antenna of our phones will also oscillate 5 billion times per second. But what, where is information being transferred over here? How do you transform? How do you transfer information? That's a great question. In order to transfer information, we need to modulate this signal. What do you mean by that? Say for example, this is a signal that we want to send from the transmitter to receiver. Let's imagine radio transmitters and radio receivers. You can imagine this is, I don't know, a signal that represents some song, for example. How do you transmit that? Well, what we do is we take our radio wave and we modulate it. An example of this would be you can change the amplitude of this radio wave according to the message signal, and it will look somewhat like this. I know it sounds, it looks very complicated, but what's important is look at the amplitude. The amplitude nicely masses, sorry, nicely matches the message signal. This is called modulation. In fact, this is called the amplitude modulation because the amplitude of this radio wave is getting, is changing and according to the message. This is the message that is sent by the radio transmitter. And when your radios receive it, the electrons look, even though they're vibrating with the same frequency, the amplitude of the vibration will keep changing according to the message. And that's how your radio receivers will detect, you know, what the message was. This is what AM stands for, amplitude modulation. There are other kinds of modulation as well. There's something called frequency modulation, phase modulation, and so on. The idea is you change some property of your radio wave in accordance to the message that you want to send. But anyways, since this is a continuous wave that is being modulated, we call this an analog modulation. Your wifi does not do that. Your wifi does what we call digital modulation because it doesn't send analog signals like this. Your wifi sends messages in bits and zeros and months. This is a digital message. They're discreet. See, unlike the analog signal, you only have two values. You either get zero or one, nothing in between. So here we do digital modulation. What would that look like? Well, again, if we were to modulate the signal using this message, we might get a modulate signal that would look somewhat like this. Again, notice the amplitude is either maximum or zero, okay? Representing your zero or one bits that you get. And again, when this goes and hits the receiver and receiver antenna in your phone, for example, based on the electrons, will vibrate accordingly and we'll be able to detect what this message was. This is called digital modulation, and all of this is an oversimplification, and there's so much more to it. In a nutshell, this is how our communication works today, wireless long distance communication, satellite communication, whatever you wanna talk about. All of that is by using, by harnessing the power of electromagnetic waves. It's just fascinating stuff.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [راوی]\nوائی فائی راؤٹر، ہمارے جسموں، اور ایک تاپدیپت بلب کے درمیان کیا مشترک ہے؟ ہم سب برقی مقناطیسی لہریں دیتے ہیں۔ لیکن ہم ایسا کیوں کرتے ہیں؟ اور وہ کیوں ہیں،\nوہ سب اتنے مختلف کیوں ہیں؟ اور ہم ان میں سے کچھ کو\nوائرلیس مواصلات کے لیے کیسے استعمال کرتے ہیں؟ آئیے ان سب کا جواب دیں۔ آئیے اپنے آپ سے یہ پوچھ کر شروع کریں کہ برقی مقناطیسی لہریں دراصل کیا ہیں؟ برقی مقناطیسی لہریں\nدوغلی برقی اور مقناطیسی شعبوں پر مشتمل ہوتی ہیں۔ ایک بدلتا ہوا برقی میدان ایک بدلتا ہوا مقناطیسی میدان پیدا کرتا ہے، جو بدلتے ہوئے برقی میدان پیدا کرتا ہے اور اسی طرح آگے۔ اور یہ کہ، جیسا کہ آپ\nاس حرکت پذیری میں دیکھ سکتے ہیں، خلل پھیلایا جاتا ہے۔ لیکن خوبصورت بات یہ ہے\nکہ یہ خلل ایک خلا میں پھیل سکتا ہے۔ اسے کسی میڈیم کی ضرورت نہیں ہے\n، اور یہ توانائی لے کر جاتا ہے۔ مثال کے طور پر،\nہم سورج سے برقی مقناطیسی لہروں کی صورت میں توانائی کیسے حاصل کرتے ہیں۔ لیکن آپ ان\nبرقی مقناطیسی لہروں کو کیسے پیدا کرتے ہیں، آپ پوچھتے ہیں؟ ٹھیک ہے، صرف چارجز کو تیز کریں۔ چارجز کو تیز کرنے سے\nبجلی کی فیلڈز بدل جائیں گی۔ یہ مقناطیسی میدانوں کو بدل دے گا، اور اسی طرح برقی مقناطیسی\nلہریں پیدا ہوں گی۔ چارج کو تیز کرنے کا ایک ٹھنڈا طریقہ صرف ایک الیکٹران لینا اور اسے اوپر نیچے کرنا ہے۔ اگر آپ مسلسل\nایک الیکٹران کو اوپر نیچے کرتے ہیں تو یہ برقی مقناطیسی لہروں کے طور پر مسلسل توانائی کھوتا رہے گا۔ اس لیے تیز رفتار چارجز برقی\nمقناطیسی لہریں پیدا کرتے ہیں۔ تو اگر آپ\nوائی فائی اینٹینا پر غور کریں، مثال کے طور پر، آپ کو معلوم ہوگا کہ وہاں الیکٹران بہت تیزی سے اوپر اور نیچے دوہر رہے ہوں گے،\nٹھیک ہے؟ اور چونکہ الیکٹران\nاوپر اور نیچے دوہرتے ہوئے چارجز ہیں، وہ برقی مقناطیسی لہریں پیدا کریں گے، جسے ہم ریڈیو لہریں کہتے ہیں۔ اسی طرح اگر آپ\nاپنے جسم پر غور کریں تو آپ کے جسم کے اندر الیکٹران موجود ہیں۔ اندر چارجز ہیں\nجو ہل رہے ہیں کیونکہ صرف درجہ حرارت کی وجہ سے، وہ وہاں پر ہل رہے ہیں۔ اور یہ، دوبارہ،\nبرقی مقناطیسی لہریں پیدا کرے گا، جو کہ انفراریڈ تابکاری ہوتی ہیں۔ اور\nایک تاپدیپت بلب کے اندر بھی ایسا ہی ہوگا۔ جب تنت کو گرم کیا جاتا ہے، تو یہ اتنے زیادہ درجہ حرارت پر گرم ہوتا ہے کہ الیکٹران بے ترتیب طور پر ہل رہے ہوتے ہیں۔ اور اس کے نتیجے میں، آپ کے پاس\nبرقی مقناطیسی لہریں پیدا ہوتی ہیں، جو ہمیں روشنی دیتی ہیں۔ لیکن یقینا، اب بڑا سوال آتا ہے۔ ہمیں یہاں ریڈیو لہریں، انفراریڈ شعاعیں،\nروشنی کی شعاعیں یہاں کیوں ملتی ہیں؟ ان میں کیا فرق ہے؟ تمام معاملات میں، یہ الزامات ہیں جو\nاوپر اور نیچے جا رہے ہیں، ٹھیک ہے؟ پھر ہمیں مختلف\nقسم کی برقی مقناطیسی لہریں کیوں ملتی ہیں؟ ان میں کیا فرق ہے؟ اس سوال کا جواب دینے کے لیے،\nہمیں \nان برقی مقناطیسی لہروں کی کچھ اہم خصوصیات کو سمجھنے کی ضرورت ہے۔ تو ہم کہتے ہیں کہ یہ ہماری\nبرقی مقناطیسی لہر ہے۔ یاد رکھیں، اس میں\nبرقی اور مقناطیسی میدان دونوں ہیں۔ میں ان دونوں کو نہیں دکھا رہا ہوں۔ تصور کریں کہ یہ صرف برقی\nمیدان ہے، اور یہ حرکت کر رہا ہے۔ تو آپ تصور کر سکتے ہیں کہ فیلڈ ہے، پوری لہر\nدائیں طرف بڑھ رہی ہے، مثال کے طور پر، ٹھیک ہے؟ اور لہر کی اہم خصوصیات میں سے ایک یہ ہے کہ لہر کتنی بڑی ہے،\nلہر کی اونچائی، ٹھیک ہے؟ میرا یہی مطلب ہے۔ تو اسے تکنیکی طور پر\nلہر کا طول و عرض کہا جاتا ہے۔ تو اس اونچائی کو\nہم طول و عرض کہتے ہیں۔ تو مثال کے طور پر، یہ\nایک بہت ہی چھوٹی طول و عرض کی لہر ہوگی۔ یہ ایک بہت بڑی طول و عرض کی لہر ہوگی۔ اور یقینا، یاد رکھیں جب میں اونچائی کہتا ہوں، میں نہیں ہوں، یہاں کچھ بھی جسمانی نہیں ہے۔\n یہ برقی اور\nمقناطیسی فیلڈ کی قدریں ہیں، ٹھیک ہے؟ اس لیے حرکت پذیری کی طرف واپس جانا،\n طول و عرض کو\n برقی یا مقناطیسی شعبوں کی زیادہ سے زیادہ طاقت کے طور پر سوچنا زیادہ مناسب ہے۔ لہر کی ایک اور اہم خصوصیت ہے جسے ہم اس کا مرحلہ کہتے ہیں۔ یہ سمجھنا آسان ہے کہ کیا مرحلہ ہے اگر میں\nلہر پر صرف دو مخصوص نکات کو دیکھوں۔ تو آئیے\nلہر پر صرف ان دو پوائنٹس کا موازنہ کریں اور دیکھتے ہیں کہ ان کے ساتھ کیا ہوتا ہے کیونکہ میں صرف\nان دو پوائنٹس کا موازنہ کروں گا اور دیکھوں گا کہ\nلہر کے آگے بڑھنے پر ان کا کیا ہوتا ہے۔ میں لہر کو دائیں طرف لے جاؤں گا۔ تو نوٹس کریں کہ وہ ہلنا شروع کر دیں گے۔ وہ اوپر نیچے جائیں گے۔ لیکن دیکھو وہ ایک\nساتھ اوپر نیچے جا رہے ہیں۔ وہ ایک دوسرے کے ساتھ مطابقت پذیر ہیں۔ لہذا ہم کہتے ہیں کہ وہ\nایک دوسرے کے ساتھ مرحلے میں گھوم رہے ہیں۔ لہذا آپ مرحلے کے بارے میں سوچ سکتے ہیں کہ وہ اس\nطرح کی نمائندگی کرتا ہے جہاں وہ اپنے دولن کے چکر میں ہیں۔\n وہ دونوں ہیں، یہ دونوں مرحلے میں ہیں کیونکہ وہ ایک ساتھ اپنی وادیوں تک پہنچتے ہیں۔ وہ ایک ساتھ صفر تک پہنچتے ہیں،\nوہ ایک ساتھ چوٹی تک پہنچتے ہیں، وغیرہ وغیرہ۔ تو پہاڑوں پر کوئی بھی دو پوائنٹس\nمرحلے میں ہیں۔ وادیوں پر کوئی بھی دو پوائنٹس\nایک دوسرے کے ساتھ مرحلے میں ہیں۔ لیکن ان دو نکات کا کیا ہوگا؟  کیا وہ ایک دوسرے کے ساتھ مرحلے میں ہیں؟ چلو دیکھتے ہیں۔ آئیے، دوبارہ دیکھتے ہیں، آئیے\nصرف ان پر توجہ مرکوز کریں اور لہر کو حرکت دیں اور دیکھیں کہ کیا ہوتا ہے۔ ارے، نہیں، وہ نہیں ہیں۔ کیا دیکھتے ہو؟ آپ نے دیکھا کہ جب ایک اوپر جا رہا ہے تو دوسرا نیچے جا رہا ہے۔ اور تو نہیں، وہ ایک\nساتھ نہیں چل رہے ہیں۔ وہ ایک دوسرے کے ساتھ مرحلے میں نہیں ہیں۔ درحقیقت، ہم کہتے ہیں کہ وہ ختم ہو چکے ہیں،\nوہ مرحلے سے باہر ہیں۔ ہم یہی کہتے ہیں۔ لیکن کیا اہم ہے\nکہ وہ ایک دوسرے کے ساتھ مرحلے میں نہیں ہیں، ٹھیک ہے؟ مرحلے کا یہ خیال\nبعد میں انتہائی اہم ہوگا۔ ہم بعد میں اس پر واپس آئیں گے۔  ہماری لہر کی ایک اور اہم خصوصیت\nاس کی طول موج ہے۔ آپ\nطول موج کو کسی بھی دو لگاتار چوٹیوں یا کسی بھی دو لگاتار وادیوں کے درمیان فاصلے کے طور پر سوچ سکتے ہیں، یا درحقیقت، کوئی بھی دو لگاتار پوائنٹس جو ایک دوسرے کے ساتھ مرحلے میں ہیں۔ ہم نے دیکھا، جو مرحلے میں ہیں، ٹھیک ہے؟ تو مثال کے طور پر، اگر آپ\n ان دو لگاتار چوٹیوں کے درمیان فاصلے پر غور کریں، تو یہ لمبائی وہی ہے جسے ہم\nطول موج کہیں گے۔ اور یہ عام طور پر علامت لیمبڈا سے ظاہر ہوتا ہے، ٹھیک ہے؟ تو پھر، اگر آپ ہماری لہر پر واپس جائیں، اور یہ\nمختصر طول موج کی نمائندگی کرے گا۔ یہ\nلمبی طول موج کی نمائندگی کرے گا، ٹھیک ہے؟ اور ہماری لہر کی ایک آخری اہم خصوصیت اس کی فریکوئنسی ہے۔ تعدد کیا ہے، آپ پوچھتے ہیں؟ ٹھیک ہے جو بھی نقطہ آپ چاہتے ہیں لے لو اور پھر ایک سیکنڈ میں پیمائش کریں کہ اس نقطہ سے کتنی لہریں گزرتی ہیں۔  ایک نقطہ فی سیکنڈ سے گزرنے والی لہروں کی تعداد\n جسے ہم تعدد کہتے ہیں۔ آپ اسے ایک پوائنٹ فی سیکنڈ سے گزرنے والی لہروں کی تعداد کے طور پر سوچ سکتے ہیں، ٹھیک ہے؟ لہذا طول موج کی اکائی میٹر ہے کیونکہ آپ فاصلے کی پیمائش کر رہے ہیں۔ اور تعدد کی اکائی کیا ہے؟ ٹھیک ہے، یہ فی سیکنڈ لہروں کی تعداد ہے۔ تو فریکوئنسی\nعدد ہوگی صرف ایک عدد۔ تو نمبر فی سیکنڈ\nدوسرا الٹا ہوگا۔ لیکن جب ہم اسے فریکوئنسی کے لیے بطور ہرٹز استعمال کرتے ہیں تو ہم اکثر سیکنڈ انورس کہتے ہیں۔ تو مثال کے طور پر، اگر میں کہوں کہ\nفریکوئنسی 10 ہرٹز ہے، تو اس کا مطلب ہے کہ ایک دیئے گئے نقطہ سے، 10 لہریں\nاس پوائنٹ سے فی سیکنڈ گزر رہی ہیں۔ اب، یہاں\nطول موج اور تعدد کے بارے میں اچھی چیز ہے۔ اگر آپ انہیں جانتے ہیں، اگر آپ طول موج اور تعدد کو جانتے ہیں، تو آپ لہر کی رفتار کا اندازہ لگا سکتے ہیں۔ آئیے دیکھتے ہیں کہ کیسے۔ درحقیقت، آئیے کچھ\nنمبرز کو براہ راست یہ دیکھنے کے لیے لیتے ہیں کہ کیسے۔ تو آئیے کچھ آسان نمبر لیتے ہیں۔ ہم کہتے ہیں کہ ہمارے پاس ایک لہر ہے جس کی طول موج دو میٹر ہے اور اس کی فریکوئنسی چار ہرٹز ہے۔ ہم\nاس لہر کی رفتار کا اندازہ کیسے لگاتے ہیں؟ ٹھیک ہے، ہم کیا کرنے والے ہیں، آئیے تصور کریں کہ ایک\nلہر یہاں سے شروع ہوتی ہے اور ہم صرف ایک سیکنڈ کا انتظار کریں گے، ٹھیک ہے؟ تو ایک سیکنڈ انتظار کریں۔ اب اس ایک سیکنڈ میں، میں چار لہروں کو جانتا ہوں جو گزرنا چاہتی ہیں۔ تو مجھے صرف انہیں کھینچنے دو۔ تو ہماری لہر یہاں سے شروع ہونے والی ہے۔ یہ ایک چوٹی ہے۔ تو\nایک سیکنڈ میں چار لہریں گزر جائیں گی۔ تو یہاں لہر نمبر ایک ہے۔  چوٹی سے چوٹی ایک مکمل لہر ہے، ٹھیک ہے؟ لہر نمبر دو، لہر نمبر تین، اور لہر نمبر چار۔ تو ایک سیکنڈ میں یہ سارا\nمعاملہ ایک سیکنڈ میں ہوا۔ اب اگر میں اندازہ لگاتا ہوں کہ\nیہ کل فاصلہ کتنا ہے، تو میں کر چکا ہوں کیونکہ پھر یہ \nایک سیکنڈ میں لہر کے ذریعے طے شدہ کل فاصلے کی نمائندگی کرتا ہے۔ اور وہ رفتار ہے۔ لہٰذا مجھے حساب لگانے کی ضرورت ہے کہ \nرفتار کا پتہ لگانے کے لیے یہ فاصلہ کیا ہے۔ میں ایسا کیسے کروں؟ ٹھیک ہے، میں جانتا ہوں کہ اس لہر کی طول موج کیا ہے،\nٹھیک ہے؟ یہ مجھے دیا گیا ہے۔ تو کیا آپ رک کر سوچ سکتے ہیں کہ یہ کل فاصلہ کیا ہونے والا ہے؟ اور نتیجے کے طور پر، اس کے\nبارے میں سوچیں کہ رفتار یا\nلہر کی رفتار، تعدد اور طول موج کے درمیان کیا تعلق ہوگا۔ تم رک کر کوشش کیوں نہیں کرتے؟ ٹھیک ہے، ٹھیک ہے، تو چونکہ طول موج دو میٹر ہے اور میرے پاس چار لہریں ہیں، اس لیے لہر کے ذریعے طے شدہ کل فاصلہ دو گنا چار ہوگا۔ یہ آٹھ میٹر ہوگا۔ لہذا عام طور پر، اگر\nطول موج لیمبڈا ہے، تو یہ لیمبڈا ہوگا۔ اور اگر فریکوئنسی F ہے تو یہاں لہروں کا F نمبر ہوگا۔\n اس کا مطلب ہے کہ ایک سیکنڈ میں طے شدہ کل فاصلہ F گنا لیمبڈا ہوگا، اور اس وجہ سے لہر کی رفتار\nF گنا لیمبڈا ہوگی۔ اب، اس مساوات کو دیکھتے ہوئے، ہم سوچ سکتے ہیں کہ ارے،\nلہر کی رفتار تعدد پر منحصر ہے اور لہر کی رفتار\nطول موج پر منحصر ہے، لیکن پتہ چلتا ہے کہ چیزیں\nتھوڑی زیادہ پیچیدہ ہیں. یہ اس بات پر منحصر ہے کہ ہم کس لہر\nسے نمٹ رہے ہیں۔ تو اب آتے ہیں برقی\nمقناطیسی لہروں کی طرف۔  ویکیوم میں برقی مقناطیسی لہروں کا پتہ چلتا ہے،\n رفتار صرف ایک مستقل ہے۔ کوئی بھی برقی مقناطیسی\nلہر جسے آپ خلا میں لیتے ہیں، وہ ہمیشہ تقریباً تین گنا 10 سے\nآٹھ میٹر فی سیکنڈ کی طاقت سے سفر کرے گی۔ ہم اکثر اسے سی کہتے ہیں، روشنی کی رفتار، خلا میں روشنی کی رفتار، ٹھیک ہے؟ یہ\nلہر کی تعدد سے آزاد ہے۔ یہ\nلہر کی طول موج سے آزاد ہے، جس کا مطلب ہے برقی مقناطیسی\nلہروں کے لیے جو خلا میں ہیں، چونکہ یہ ایک مستقل ہے، ہم نے دیکھا کہ اس کا مطلب ہے کہ اگر\nآپ کے پاس ہائی فریکوئنسی لہر ہے، تو اس کی طول موج کم ہونی چاہیے۔ اگر اس کی طول موج زیادہ ہے تو اس کی تعدد کم ہونی چاہیے۔ لہذا ویکیوم میں برقی مقناطیسی لہروں کے لیے، آپ دیکھ سکتے ہیں کہ تعدد اور طول موج\nایک دوسرے سے الٹا تعلق رکھتی ہیں۔ اور اب ہم اپنے اصل سوال کی طرف واپس جا سکتے ہیں۔\n یہ چیزیں مختلف قسم کی برقی مقناطیسی لہریں کیوں دے رہی ہیں؟ ٹھیک ہے، کیونکہ یہاں چارجز مختلف فریکوئنسیوں پر گھوم رہے ہیں۔ آپ کے وائی فائی میں، چارجز کم فریکوئنسیوں پر گھوم رہے ہیں۔ تو آپ کو کم تعدد\nبرقی مقناطیسی لہریں ملتی ہیں، جنہیں ہم ریڈیو لہریں کہتے ہیں۔ ہمارے جسم کے اندر، چارجز\nقدرے زیادہ تعدد پر ہل رہے ہیں۔ اور اس طرح اب، آپ کو قدرے\nزیادہ فریکوئنسی لہریں ملتی ہیں، جنہیں آپ انفراریڈ لہریں کہتے ہیں۔ لائٹ بلب کے اندر،\nیہ اور بھی زیادہ فریکوئنسی ہے، جو ہمیں ملتی ہے، مرئی\nروشنی کہتے ہیں کیونکہ ہم اسے دیکھ سکتے ہیں۔ اور صرف آپ کو\nنمبروں کا احساس دلانے کے لیے، ٹھیک ہے؟ تو آپ کی ریڈیو لہر جو\nآپ کے وائی فائی سے آرہی ہے تقریباً ایک بلین ہرٹز کی ترتیب میں ہے، یعنی یہاں کے الیکٹران \nفی سیکنڈ میں تقریباً بلین بار گھوم رہے ہیں، ٹھیک ہے؟ اور جب انفراریڈ کی بات آتی ہے، تو یہ 10 سے 13 ہو جاتی ہے۔ نظر آنے والی روشنی کے لیے، یہ\n10 سے 14 ہو جاتی ہے۔ آپ کے پاس زیادہ فریکوئنسی لہریں بھی ہو سکتی ہیں، جو الٹرا وایلیٹ شعاعوں میں جاتی ہیں۔ آپ کے پاس ایکس رے ہیں، آپ کے پاس\nگاما شعاعیں ہیں، وغیرہ۔ اور آپ یہ بھی دیکھ سکتے ہیں کہ جیسے جیسے فریکوئنسی بڑھتی ہے،\nلہر کی لمبائی کم ہوتی جا رہی ہے کیونکہ ہم نے دیکھا کہ تعدد اور طول موج کا تعلق برقی مقناطیسی لہروں کے لیے الٹا ہے۔ لیکن یہ آخری سوال لاتا ہے۔ \nان برقی مقناطیسی لہروں کا واقعی کیا ہوتا ہے جب وہ جا کر کسی چیز سے ٹکراتی ہیں؟ مثال کے طور پر،\nان ریڈیو لہروں کا کیا ہوتا ہے جب، آپ جانتے ہیں، وائی فائی سے یہ ہمارے فون پر جاتی ہیں، مثال کے طور پر؟ ٹھیک ہے، ہمارے فونز کے\nاندر ایک چھوٹا سا اینٹینا بھی ہوتا ہے۔ اب، اس ٹرانسمیٹر اینٹینا میں، الیکٹران\nآپ کو برقی مقناطیسی لہریں دیتا ہے۔ فون کے لیے ریسیور اینٹینا میں، بالکل برعکس ہوتا ہے۔ برقی مقناطیسی لہریں اس پر گریں گی اور الیکٹران کو اوپر اور نیچے کی طرف لے جائے گی۔ اور اس طرح\nاس دوہری الیکٹران سے توانائی یہاں الیکٹرانوں میں منتقل ہوتی ہے۔ بہت اچھا، ہہ؟ لیکن اب ہم سوچ رہے ہوں گے، ٹھیک ہے، آپ\nکسی بھی معلومات کو کیسے منتقل کرتے ہیں؟ مثال کے طور پر، جو ریڈیو لہریں ہم وائی فائی میں استعمال کریں گے وہ تقریباً پانچ گیگاہرٹز ہو سکتی ہیں، یعنی پانچ گنا، 5 بلین ہرٹز۔ اس کا مطلب ہے کہ یہاں پر موجود الیکٹران \nفی سیکنڈ میں تقریباً 5 بلین بار گھوم رہے ہیں، اور پھر لہریں جا کر یہاں سے ٹکراتی ہیں۔ \nہمارے فونز کے انٹینا کے اندر موجود الیکٹران بھی\nفی سیکنڈ 5 بلین بار گھومتے ہیں۔ لیکن کیا، معلومات\nیہاں کہاں منتقل کی جا رہی ہیں؟ آپ کیسے تبدیل کرتے ہیں؟ آپ معلومات کیسے منتقل کرتے ہیں؟ یہ بہت اچھا سوال ہے۔ معلومات کی منتقلی کے لیے، ہمیں اس سگنل کو ماڈیول کرنے کی ضرورت ہے۔ اس سے اپ کا کیا مطلب ہے؟ مثال کے طور پر کہیں، یہ ایک سگنل ہے جسے ہم ٹرانسمیٹر سے وصول کنندہ کو بھیجنا چاہتے ہیں۔\n آئیے ریڈیو ٹرانسمیٹر\nاور ریڈیو ریسیورز کا تصور کریں۔ آپ تصور کر سکتے ہیں کہ یہ، مجھے نہیں معلوم، ایک سگنل ہے جو\nکسی گانے کی نمائندگی کرتا ہے، مثال کے طور پر۔ آپ اسے کیسے منتقل کرتے ہیں؟ ٹھیک ہے، ہم کیا کرتے ہیں کہ ہم اپنی ریڈیو لہر لیتے ہیں اور ہم اسے ماڈیول کرتے ہیں۔ اس کی ایک مثال یہ ہے کہ آپ میسج سگنل کے مطابق\nاس ریڈیو لہر کے طول و عرض کو تبدیل کر سکتے ہیں، اور یہ کچھ اس طرح نظر آئے گا۔ میں جانتا ہوں کہ یہ لگتا ہے، یہ\nبہت پیچیدہ لگتا ہے، لیکن جو چیز اہم ہے وہ\nطول و عرض کو دیکھنا ہے۔ طول و عرض اچھی طرح سے بڑے پیمانے پر، معذرت، اچھی طرح سے میسج سگنل سے میل کھاتا ہے۔ اسے ماڈیولیشن کہتے ہیں۔ درحقیقت، اسے\nطول و عرض ماڈیولیشن کہا جاتا ہے کیونکہ اس ریڈیو لہر کا طول و عرض پیغام کے مطابق ہو رہا ہے، تبدیل ہو رہا ہے۔\n یہ وہ پیغام ہے جو ریڈیو ٹرانسمیٹر کے ذریعے بھیجا جاتا ہے۔ اور جب آپ کے ریڈیو اسے وصول کرتے ہیں تو الیکٹران نظر آتے ہیں،\nاگرچہ وہ ایک ہی فریکوئنسی کے ساتھ ہل رہے ہوں، کمپن کا طول و عرض پیغام کے مطابق\nبدلتا رہے گا۔ اور اس طرح آپ کے ریڈیو\nریسیورز کو پتہ چل جائے گا کہ آپ جانتے ہیں کہ پیغام کیا تھا۔ یہ وہی ہے جو AM کا مطلب ہے،\nطول و عرض ماڈیولیشن۔ \nماڈیول کی دوسری قسمیں بھی ہیں۔ \nفریکوئنسی ماڈیولیشن، فیز ماڈیولیشن، وغیرہ نام کی کوئی چیز ہے۔ خیال یہ ہے کہ آپ\nاپنی ریڈیو لہر کی کچھ خاصیت کو اس پیغام کے مطابق تبدیل کرتے ہیں\nجو آپ بھیجنا چاہتے ہیں۔ لیکن بہرحال، چونکہ یہ\nایک مسلسل لہر ہے جسے ماڈیول کیا جا رہا ہے، اس لیے ہم\nاسے اینالاگ ماڈیولیشن کہتے ہیں۔ آپ کا وائی فائی ایسا نہیں کرتا۔ آپ کا وائی فائی وہی کرتا ہے جسے ہم\nڈیجیٹل ماڈیولیشن کہتے ہیں کیونکہ یہ اس طرح کے اینالاگ سگنل نہیں بھیجتا ہے۔\n آپ کا وائی فائی\nبٹس اور زیرو اور مہینوں میں پیغامات بھیجتا ہے۔ یہ ایک ڈیجیٹل پیغام ہے۔ وہ سمجھدار ہیں۔ دیکھیں، ینالاگ سگنل کے برعکس،\nآپ کے پاس صرف دو قدریں ہیں۔ آپ کو یا تو صفر ملے گا یا\nایک، درمیان میں کچھ نہیں۔ تو یہاں ہم ڈیجیٹل ماڈیولیشن کرتے ہیں۔ وہ کیسا نظر آئے گا؟ ٹھیک ہے، دوبارہ، اگر ہم اس پیغام کو استعمال کرتے ہوئے سگنل کو ماڈیول کریں، تو ہمیں ایک ماڈیول سگنل مل سکتا ہے جو کچھ اس طرح نظر آئے گا۔  ایک بار پھر، دیکھیں کہ طول و عرض یا تو زیادہ سے زیادہ ہے یا صفر، ٹھیک ہے؟ اپنے صفر\nیا ایک بٹس کی نمائندگی کرنا جو آپ کو ملتا ہے۔ اور دوبارہ، جب یہ آپ کے فون\n میں ریسیور اور ریسیور اینٹینا سے ٹکرائے گا،\nمثال کے طور پر، الیکٹرانز کی بنیاد پر، اس کے\nمطابق وائبریٹ ہو جائے گا اور ہم یہ پتہ لگانے کے قابل ہو جائیں گے کہ\nیہ پیغام کیا تھا۔ اسے ڈیجیٹل ماڈیولیشن کہا جاتا ہے، اور یہ سب ایک حد سے زیادہ آسانیاں ہیں، اور اس میں اور بھی بہت کچھ ہے۔ مختصراً،\nآج ہمارا مواصلات اس طرح کام کرتا ہے، وائرلیس لانگ ڈسٹنس کمیونیکیشن، سیٹلائٹ کمیونیکیشن،\nجس کے بارے میں آپ بات کرنا چاہتے ہیں۔  یہ سب برقی\n مقناطیسی لہروں کی طاقت کا استعمال کرتے ہوئے ہے۔ یہ صرف دلچسپ چیزیں ہیں۔",
    "t_spanish": "- [Narrador] ¿Qué tienen en común\nun enrutador wifi, nuestros cuerpos y una bombilla incandescente? Todos emitimos ondas electromagnéticas.  ¿ Pero por qué hacemos eso?  ¿ Y por qué son, por qué son\ntodos tan diferentes?  ¿ Y cómo utilizamos algunos de ellos\npara comunicaciones inalámbricas? Respondamos a todas. Empecemos por preguntarnos ¿ qué son exactamente las ondas electromagnéticas?  Las ondas electromagnéticas consisten\nen campos eléctricos y magnéticos oscilantes. Un campo eléctrico cambiante produce un campo magnético cambiante, el cual produce un campo eléctrico cambiante y así sucesivamente. Y que, como puedes\nver en esta animación, la perturbación se propaga. Pero lo bonito\nes que esta perturbación puede propagarse en el vacío. No requiere ningún\nmedio y transporta energía.  Así es, por ejemplo, cómo\nobtenemos energía del sol en forma de ondas electromagnéticas.  ¿ Pero cómo se producen estas\nondas electromagnéticas? Bueno, simplemente acelere los cargos. Las cargas aceleradas\ncambiarán los campos eléctricos. Cambiará los campos magnéticos y así es como se\ngenerarán las ondas electromagnéticas. Una forma genial de acelerar la carga sería simplemente tomar un electrón y moverlo hacia arriba y hacia abajo. Si mueves continuamente\nun electrón hacia arriba y hacia abajo, seguirá perdiendo energía en forma de ondas electromagnéticas. Entonces las cargas aceleradas\ncrean ondas electromagnéticas. Entonces, si consideras la\nantena wifi, por ejemplo, encontrarás que habrá electrones oscilando hacia arriba y hacia abajo\nmuy rápidamente, ¿de acuerdo? Y como los electrones son\ncargas que oscilan hacia arriba y hacia abajo, generarán ondas electromagnéticas, que llamamos ondas de radio. De manera similar, si\nconsideras tus propios cuerpos, tienes electrones dentro de nuestro cuerpo. Hay cargas en el interior\nque vibran porque, debido a la temperatura, simplemente vibran allí. Y eso, nuevamente, generará\nondas electromagnéticas, que resultan ser radiación infrarroja. Y lo mismo ocurrirá\ndentro de una bombilla incandescente. Cuando el filamento se calienta, alcanza una temperatura tan alta que los electrones vibran aleatoriamente. Y como resultado, se generan\nondas electromagnéticas que nos dan luz. Pero claro, ahora viene la gran pregunta.  ¿ Por qué recibimos ondas de radio por aquí, rayos infrarrojos por aquí,\nrayos de luz por aquí?  ¿ Cual es la diferencia entre ellos? En todos los casos, son los cargos los que\nsuben y bajan, ¿verdad? Entonces, ¿por qué recibimos diferentes\ntipos de ondas electromagnéticas?  ¿ Cual es la diferencia entre ellos? Para responder a esa pregunta,\nnecesitamos comprender algunas de las propiedades clave de\nestas ondas electromagnéticas. Entonces digamos que esta es nuestra\nonda electromagnética. Recuerde, tiene\ncampos eléctricos y magnéticos. No los mostraré a ambos. Imagínese que esto es solo un\ncampo eléctrico y se está moviendo. Entonces puedes imaginar que el campo es, toda la onda se mueve hacia\nla derecha, por ejemplo, ¿vale? Y una de las propiedades clave de la ola es el tamaño de la ola, la\naltura de la ola, ¿vale? Eso es lo que quiero decir. Eso técnicamente se llama\namplitud de la onda. Entonces esta altura es lo que\nllamamos amplitud. Por ejemplo, esta sería\nuna onda de amplitud muy pequeña. Esta sería una onda de amplitud muy grande. Y por supuesto, recuerda cuando digo altura, no lo soy, no hay nada\nfísico aquí. Estos son\nvalores de campo eléctrico y magnético, ¿verdad? Entonces, volviendo a la animación,\nes más apropiado pensar en la amplitud\ncomo la fuerza máxima de los campos eléctricos o magnéticos. Otra característica importante de una onda es lo que llamamos su fase. Es más fácil entender qué fase es si observara solo dos\npuntos específicos de una onda. Entonces, comparemos solo estos\ndos puntos en la onda y veamos qué les sucede, ya que solo los compararé\ncon esos dos puntos y veremos qué les sucede\na medida que la onda avanza. Voy a mover la ola hacia la derecha. Entonces observe que comenzarán a oscilar. Subirán y bajarán. Pero mira,\nsuben y bajan juntos. Están sincronizados entre sí. Entonces decimos que oscilan\nen fase entre sí. Entonces puedes pensar en la fase\ncomo una especie de representación de dónde se encuentran en sus\nciclos de oscilación. Son los dos, estos dos están en fase porque llegan juntos a sus valles. Alcanzan el cero juntos,\nalcanzan la cima juntos, y así sucesivamente. Entonces, dos puntos cualesquiera de las\nmontañas están en fase. Dos puntos cualesquiera de los valles\nestán en fase entre sí. Pero ¿qué pasa con estos dos puntos?  ¿ Están en sintonía entre sí? Vamos a ver. Veamos, nuevamente,\nconcentrémonos en ellos y muevamos la ola y veamos qué sucede. Oye, no, no lo son. ¿Que ves? Notas que cuando uno sube, el otro baja. Y entonces no, no están\noscilando juntos. No están en sintonía entre sí. De hecho, decimos que están\nfuera de fase. Eso es lo que decimos. Pero lo importante es\nque no estén en sintonía entre sí, ¿vale? Esta idea de fase será\nmuy importante más adelante. Volveremos a ello más adelante. Otra característica importante de\nnuestra onda es su longitud de onda. Puede pensar en la\nlongitud de onda como la distancia entre dos picos consecutivos o dos valles consecutivos o, de hecho, dos puntos consecutivos cualesquiera que estén en fase entre sí.  Ya vimos, que están en fase, ¿no? Entonces, por ejemplo, si\nconsidera la distancia entre estos dos picos consecutivos, esta longitud es lo que\nllamaremos longitud de onda. Y suele estar representado por el símbolo lambda, ¿vale? De nuevo, si volvemos a nuestra onda, esto representaría\nlongitudes de onda cortas. Esto representaría\nlongitudes de onda largas, ¿vale? Y una última característica importante de nuestra onda es su frecuencia.  ¿ Qué es la frecuencia, preguntas? Tomaremos cualquier punto que deseemos y luego mediremos en un segundo cuántas ondas pasan por ese punto.  El número de ondas que pasan\npor un punto por segundo es lo que llamamos frecuencia. Puedes pensar en ello como la cantidad de ondas que pasan por un punto por segundo, ¿de acuerdo? Entonces, la unidad de longitud de onda es metros porque estás midiendo distancia.  ¿ Y cuál es la unidad de frecuencia? Bueno, es el número de ondas por segundo. Entonces la frecuencia sería que el\nnumerador es solo un número. Entonces el número por segundo\nsería el segundo inverso. Pero a menudo llamamos segundo inverso cuando lo usamos para frecuencia como hercios. Entonces, por ejemplo, si digo que\nla frecuencia es 10 hercios, significa que desde un punto dado, 10 ondas pasan por\nese punto por segundo. Ahora bien, esto es lo interesante\nde la longitud de onda y la frecuencia. Si los conoces, si conoces la longitud de onda y la frecuencia, puedes calcular la velocidad de la onda. Veamos cómo. De hecho, tomemos algunos\nnúmeros directamente para ver cómo. Entonces tomemos algunos números simples. Digamos que tenemos una onda que tiene una longitud de onda de dos metros y una frecuencia de cuatro hercios.  ¿ Cómo calculamos\nla velocidad de esta onda? Bueno, lo que vamos a hacer es imaginar que hay una\nola que comienza desde aquí y esperaremos un segundo, ¿vale? Así que espera un segundo. Ahora, en ese segundo, conozco cuatro olas que quieren pasar. Así que déjame dibujarlos. Entonces nuestra ola comenzará desde aquí. Es un pico. Entonces pasarán cuatro ondas\nen un segundo. Así que aquí está la ola número uno.  De pico a pico es una ola completa, ¿vale? Ola número dos, onda número tres y onda número cuatro. Entonces, en un segundo, todo\nesto sucedió en un segundo. Ahora, si calculo\ncuánto es esta distancia total, ya terminé porque eso representa la distancia total recorrida\npor la onda en un segundo. Y esa es la velocidad. Entonces necesito calcular cuál es esta distancia\npara calcular la velocidad.  ¿ Cómo puedo hacer eso? Bueno, sé cuál es la longitud de onda\nde esta onda, ¿verdad? Me lo han dado. Entonces, ¿puedes hacer una pausa y pensar cuál será esta distancia total? Y como resultado, piensa\nen cuál sería la correlación entre la velocidad o\nrapidez de la onda, la frecuencia y la longitud de onda.  ¿ Por qué no haces una pausa y lo intentas? Muy bien, está bien, entonces como la longitud de onda es de dos metros y tengo cuatro ondas, la distancia total recorrida por la onda sería dos por cuatro. Serían ocho metros. Entonces, en general, si la\nlongitud de onda es lambda, ésta sería lambda. Y si la frecuencia es F, habría F número\nde ondas aquí. Eso significa que la distancia total recorrida sería F veces lambda en un segundo y, por lo tanto, la velocidad de la\nonda sería F veces lambda. Ahora, mirando esta ecuación, podríamos pensar que, bueno,\nla velocidad de una onda depende de la frecuencia y la velocidad de la onda\ndepende de la longitud de onda, pero resulta que las cosas son un\npoco más complicadas. Depende de con qué ola\nestemos tratando. Ahora volvamos\na las ondas electromagnéticas. Resulta que para las\nondas electromagnéticas en el vacío, la velocidad es simplemente una constante. Cualquier\nonda electromagnética que se tome en el vacío siempre viajará aproximadamente a tres veces 10 elevado a\nocho metros por segundo.  A esto a menudo lo llamamos C, la velocidad de la luz, la velocidad de la luz en el vacío, ¿vale? Es independiente de la\nfrecuencia de la onda. Es independiente de la\nlongitud de onda de la onda, lo que significa que para las\nondas electromagnéticas que están en el vacío, dado que es una constante, notamos que eso significa que si\ntienes una onda de alta frecuencia, debería tener una longitud de onda más baja. Si tiene una longitud de onda alta, debería tener una frecuencia más baja. Entonces, para las ondas electromagnéticas en el vacío, se puede ver que la frecuencia y la longitud de onda están\ninversamente relacionadas entre sí. Y ahora podemos volver\na nuestra pregunta original.  ¿ Por qué estas cosas emiten diferentes tipos de ondas electromagnéticas? Bueno, porque las cargas aquí oscilan a diferentes frecuencias. En tu wifi, las cargas oscilan a frecuencias más bajas. Entonces se obtienen\nondas electromagnéticas de baja frecuencia, que llamamos ondas de radio. Dentro de nuestros cuerpos, las cargas vibran a\nfrecuencias ligeramente más altas. Y ahora, obtienes\nondas de frecuencia ligeramente más alta, a las que llamas ondas infrarrojas. Dentro de la bombilla,\nhay una frecuencia aún más alta, que llamamos\nluz visible porque podemos verla. Y sólo para que tengas una\nidea de los números, ¿vale? Entonces, la onda de radio que\nproviene de tu wifi es del orden de mil millones de hercios, lo que significa que los electrones de aquí oscilan alrededor de mil millones de\nveces por segundo, ¿de acuerdo? Y cuando se trata de infrarrojos, se convierte en 10 a 13. Para la luz visible, se\nconvierte en 10 a 14. Incluso se pueden tener ondas de mayor frecuencia, que se convierten en rayos ultravioleta. Tienes rayos X, tienes\nrayos gamma, etc. Y también se puede ver que a medida que aumenta la frecuencia,\nla longitud de onda disminuye porque vimos que la frecuencia y la longitud de onda están inversamente relacionadas en el caso de las ondas electromagnéticas. Pero eso plantea la última pregunta.  ¿ Qué les sucede realmente a\nestas ondas electromagnéticas cuando chocan contra algo? Por ejemplo, ¿qué pasa\ncon estas ondas de radio cuando, ya sabes, del wifi pasa a nuestros teléfonos, por ejemplo? Bueno, nuestros teléfonos también tienen una\npequeña antena en su interior. Ahora, en esta antena transmisora, el electrón vibra\ndándole ondas electromagnéticas. En la antena receptora de un teléfono ocurre exactamente lo contrario. Las ondas electromagnéticas caerán sobre él y harán que los electrones suban y bajen. Y así es como la energía\nde este electrón oscilante se transfiere a los electrones de aquí. Muy bien, ¿eh? Pero ahora quizás nos preguntemos, bueno, ¿ cómo se transmite la\ninformación? Por ejemplo, las ondas de radio que usaríamos en wifi podrían ser de unos cinco gigahercios, es decir, cinco veces 5 mil millones de hercios. Eso significa que los electrones de aquí oscilan unos 5\nmil millones de veces por segundo, y luego las ondas van y golpean aquí. Los electrones dentro de la\nantena de nuestros teléfonos también oscilarán 5\nmil millones de veces por segundo. Pero ¿a dónde se\ntransfiere la información aquí?  ¿ Cómo te transformas?  ¿ Cómo se transfiere información? Esa es una gran pregunta. Para transferir información, necesitamos modular esta señal.  ¿ Qué quieres decir con eso? Digamos, por ejemplo, que esta es una señal que queremos enviar desde\nel transmisor al receptor. Imaginemos transmisores de radio\ny receptores de radio. Te puedes imaginar que esto es, no sé, una señal que representa\nalguna canción, por ejemplo.  ¿ Cómo transmites eso? Bueno, lo que hacemos es tomar nuestra onda de radio y la modulamos. Un ejemplo de esto sería que puedes cambiar la\namplitud de esta onda de radio de acuerdo con la señal del mensaje, y se verá más o menos así. Sé que suena,\nparece muy complicado, pero lo importante es\nobservar la amplitud. La amplitud se masasa muy bien, lo siento, coincide muy bien con la señal del mensaje. Esto se llama modulación. De hecho, esto se llama\nmodulación de amplitud porque la amplitud de esta onda de radio aumenta, cambia y\nsegún el mensaje. Este es el mensaje que envía el transmisor de radio. Y cuando sus radios lo reciben, los electrones miran,\naunque estén vibrando con la misma frecuencia, la amplitud de la\nvibración seguirá cambiando según el mensaje. Y así es como sus\nreceptores de radio detectarán cuál era el mensaje. Esto es lo que AM\nsignifica, modulación de amplitud.  También existen otros tipos\nde modulación. Hay algo que se llama\nmodulación de frecuencia, modulación de fase, etc. La idea es que cambies alguna\npropiedad de tu onda de radio de acuerdo al mensaje\nque quieras enviar. Pero de todos modos, dado que se trata de\nuna onda continua que se está modulando,\nlo llamamos modulación analógica. Tu wifi no hace eso. Tu wifi hace lo que\nllamamos modulación digital porque no envía\nseñales analógicas como esta. Tu wifi envía mensajes en\nbits, ceros y meses. Este es un mensaje digital. Son discretos. Mira, a diferencia de la señal analógica,\nsolo tienes dos valores.  O obtienes cero o\nuno, nada intermedio. Entonces aquí hacemos modulación digital. Como se veria eso? Bueno, nuevamente, si modulamos la señal usando este mensaje, podríamos obtener una señal modulada que se vería más o menos así. Nuevamente, observe que la amplitud es máxima o cero, ¿de acuerdo? Representando los\nbits cero o uno que obtienes. Y nuevamente, cuando esto\ngolpea el receptor y la antena del receptor en\nsu teléfono, por ejemplo, según los electrones,\nvibrará en consecuencia y podremos detectar\ncuál era este mensaje. Esto se llama modulación digital y todo esto es una simplificación excesiva y hay mucho más. En pocas palabras, así es como\nfunciona nuestra comunicación hoy en día: comunicación inalámbrica de larga distancia, comunicación por satélite,\nlo que sea de lo que quieras hablar. Todo eso es mediante el uso y\naprovechamiento del poder de las ondas electromagnéticas. Es simplemente algo fascinante.",
    "t_arabic": "- [الراوي] ما هو القاسم المشترك\nبين جهاز توجيه wifi وأجسادنا والمصباح المتوهج؟ نحن جميعا نعطي الموجات الكهرومغناطيسية. ولكن لماذا نفعل ذلك؟ ولماذا هم، لماذا\nهم جميعا مختلفون؟ وكيف نستخدم بعضها\nللاتصالات اللاسلكية؟ دعونا نجيب عليها جميعا. لنبدأ بسؤال أنفسنا ما هي الموجات الكهرومغناطيسية بالضبط؟ تتكون الموجات الكهرومغناطيسية\nمن مجالات كهربائية ومغناطيسية متذبذبة. وينتج المجال الكهربائي المتغير مجالا مغناطيسيا متغيرا، الذي ينتج مجالا كهربائيا متغيرا، وهكذا دواليك. وهذا، كما\nترون في هذه الرسوم المتحركة، يتم نشر الاضطراب. لكن الشيء الجميل\nهو أن هذا الاضطراب يمكن أن ينتشر في الفراغ. لا يتطلب أي\nوسط، ويحمل الطاقة. هذا على سبيل المثال، كيف\nنحصل على الطاقة من الشمس على شكل موجات كهرومغناطيسية. ولكن كيف يمكنك إنتاج هذه\nالموجات الكهرومغناطيسية؟ حسنًا، فقط قم بتسريع الرسوم. تسارع الشحنات\nسيغير المجالات الكهربائية. سوف يغير المجالات المغناطيسية، وهذه هي الطريقة التي\nسيتم بها توليد الموجات الكهرومغناطيسية. إحدى الطرق الرائعة لتسريع الشحنة هي أخذ إلكترون وتحريكه لأعلى ولأسفل. إذا قمت بهز\nالإلكترون باستمرار لأعلى ولأسفل، فسوف يستمر في فقدان الطاقة كموجات كهرومغناطيسية. لذا فإن الشحنات المتسارعة\nتولد موجات كهرومغناطيسية. لذا، إذا نظرت إلى\nهوائي الواي فاي، على سبيل المثال، ستجد أنه ستكون هناك إلكترونات تتأرجح لأعلى ولأسفل\nبسرعة كبيرة، حسنًا؟ ولأن الإلكترونات عبارة عن\nشحنات تتأرجح لأعلى ولأسفل، فإنها ستولد موجات كهرومغناطيسية، والتي نسميها موجات الراديو. وبالمثل، إذا\nنظرتم إلى أجسادكم، فستجدون أن لديكم إلكترونات داخل أجسادنا. هناك شحنات بالداخل\nتهتز لأنه فقط بسبب درجة الحرارة، فهي تهتز هناك. وسيؤدي ذلك مرة أخرى إلى توليد\nموجات كهرومغناطيسية، والتي هي أشعة تحت حمراء. وسوف يحدث نفس الشيء\nداخل المصباح المتوهج. عندما يتم تسخين الخيط، فإنه يسخن إلى درجة حرارة عالية بحيث تهتز الإلكترونات بشكل عشوائي. ونتيجة لذلك، يتم توليد\nموجات كهرومغناطيسية ، مما يمنحنا الضوء. لكن بالطبع، يأتي الآن السؤال الكبير. لماذا نحصل على موجات الراديو هنا، والأشعة تحت الحمراء هنا،\nوالأشعة الضوئية هنا؟ ما الفرق بينهما؟ في جميع الحالات، الرسوم هي التي\nترتفع وتنخفض، أليس كذلك؟ فلماذا نحصل على\nأنواع مختلفة من الموجات الكهرومغناطيسية؟ ما الفرق بينهما؟ للإجابة على هذا السؤال،\nعلينا أن نفهم بعض الخصائص الأساسية\nلهذه الموجات الكهرومغناطيسية. لنفترض أن هذه هي\nموجتنا الكهرومغناطيسية. تذكر أنه يحتوي على\nمجالات كهربائية ومغناطيسية. أنا لا أعرض كلاهما. تخيل أن هذا مجرد\nمجال كهربائي، وهو يتحرك. إذًا يمكنك أن تتخيل أن المجال هو أن الموجة بأكملها تتحرك نحو\nاليمين، على سبيل المثال، حسنًا؟ وأحد الخصائص الرئيسية للموجة هو حجم الموجة،\nوارتفاع الموجة، حسنًا؟ هذا ما اعنيه. لذلك من الناحية الفنية يسمى\nسعة الموجة. إذن هذا الارتفاع هو ما\nنسميه السعة. على سبيل المثال، ستكون هذه\nموجة ذات سعة صغيرة جدًا. ستكون هذه موجة ذات سعة كبيرة جدًا. وبالطبع، تذكر عندما أقول الطول، فأنا لست كذلك، لا يوجد شيء\nمادي هنا. هذه هي\nقيم المجال الكهربائي والمغناطيسي، أليس كذلك؟ لذا وبالعودة إلى الرسوم المتحركة،\nفمن الأفضل أن نفكر في السعة\nباعتبارها أقصى قوة للمجالات الكهربائية أو المغناطيسية. ميزة أخرى مهمة للموجة هي ما نسميه مرحلتها.  من الأسهل أن نفهم ما هي المرحلة إذا نظرت إلى\nنقطتين محددتين فقط على الموجة. لذلك دعونا نقارن فقط هاتين\nالنقطتين على الموجة ودعونا نرى ما يحدث لهما حيث سأقارن فقط\nهاتين النقطتين ونرى ما يحدث لهما\nمع تحرك الموجة للأمام. سأقوم بتحريك الموجة إلى اليمين. لذا لاحظ أنها ستبدأ في التذبذب.  سوف يذهبون لأعلى ولأسفل. لكن انظروا، إنهم\nيصعدون ويهبطون معًا. إنهم متزامنون مع بعضهم البعض. لذلك نقول إنهما يتأرجحان\nفي الطور مع بعضهما البعض. لذلك يمكنك التفكير في الطور\nكنوع من تمثيل مكان وجودهم في\nدورات التذبذب. إنهما كلاهما، هذان الاثنان في الطور لأنهما يصلان إلى أوديةهما معًا. إنهم يصلون إلى الصفر معًا،\nويصلون إلى القمة معًا، وهكذا دواليك. إذن أي نقطتين على\nالجبال متطابقتان في الطور. أي نقطتين على الوديان\nتكونان في الطور مع بعضهما البعض. ولكن ماذا عن هاتين النقطتين؟ هل هم في مرحلة مع بعضهم البعض؟ دعنا نرى. دعونا نرى، مرة أخرى، دعونا\nنركز عليهم ونحرك الموجة ونرى ما سيحدث. مهلا، لا، ليسوا كذلك. ماذا ترى؟ لاحظت أنه عندما يرتفع أحدهما، ينخفض ​​الآخر. وبالتالي لا، فهما لا\nيتأرجحان معًا. إنهم ليسوا في مرحلة مع بعضهم البعض. في الواقع، نحن نقول أنهم\nخرجوا، إنهم خارج المرحلة. هذا ما نقوله. لكن المهم هو\nأنهم ليسوا على توافق مع بعضهم البعض، حسنًا؟ ستكون فكرة المرحلة هذه ذات\nأهمية كبيرة لاحقًا. وسوف نعود إليها لاحقا. ميزة أخرى مهمة\nلموجتنا هي طولها الموجي. يمكنك التفكير في\nالطول الموجي باعتباره المسافة بين أي قمتين متتاليتين أو أي واديين متتاليين، أو في الواقع، أي نقطتين متتاليتين في الطور مع بعضهما البعض.  لقد رأينا، والتي هي في المرحلة، أليس كذلك؟ على سبيل المثال، إذا أخذت\nفي الاعتبار المسافة بين هاتين القمتين المتتاليتين، فإن هذا الطول هو ما\nسنسميه الطول الموجي. وعادةً ما يتم تمثيله بالرمز لامدا، حسنًا؟  مرة أخرى، إذا رجعت إلى الموجة، فسيمثل ذلك\nأطوالًا موجية قصيرة. وهذا من شأنه أن يمثل\nأطوال موجية طويلة، حسنا؟ وهناك خاصية أخيرة مهمة للموجة وهي ترددها. ما هو التردد، تسأل؟ حسنًا، خذ أي نقطة تريدها ثم قم بقياس عدد الموجات التي تتجاوز تلك النقطة في ثانية واحدة. عدد الموجات التي تمر\nعبر نقطة في الثانية هو ما نسميه التردد. يمكنك التفكير في الأمر على أنه عدد من الموجات التي تمر عبر نقطة في الثانية، حسنًا؟ وحدة الطول الموجي هي المتر لأنك تقيس المسافة. وما هي وحدة التردد؟ حسنًا، إنه عدد الموجات في الثانية. لذا فإن التردد سيكون\nالبسط مجرد رقم. لذا فإن الرقم في الثانية\nسيكون معكوسًا ثانيًا. لكننا غالبًا ما نسميه بالمعكوس الثاني عندما نستخدمه للتردد بالهرتز. على سبيل المثال، إذا قلت أن\nالتردد هو 10 هرتز، فهذا يعني أنه من نقطة معينة تمر\nبهذه النقطة 10 موجات في الثانية. الآن، هذا هو الشيء الرائع\nبشأن الطول الموجي والتردد. إذا كنت تعرفهم، إذا كنت تعرف الطول الموجي والتردد، يمكنك معرفة سرعة الموجة. دعونا نرى كيف. في الواقع، دعونا نأخذ بعض\nالأرقام مباشرة لنرى كيف. لذلك دعونا نأخذ بعض الأرقام البسيطة. لنفترض أن لدينا موجة يبلغ طولها الموجي مترين وترددها أربعة هرتز. كيف يمكننا معرفة\nسرعة هذه الموجة؟ حسنًا، ما سنفعله هو، لنتخيل أن هناك\nموجة تبدأ من هنا وسننتظر لثانية واحدة فقط، حسنًا؟ لذا انتظر ثانية واحدة. الآن، في تلك الثانية الواحدة، أعرف أربع موجات تريد المرور بها. لذلك اسمحوا لي أن أرسمهم. لذلك ستبدأ موجتنا من هنا. إنها الذروة. إذن، ستمر أربع موجات\nفي ثانية واحدة. إذن هذه هي الموجة رقم واحد. الذروة إلى الذروة هي موجة كاملة واحدة، حسنا؟ الموجة رقم اثنين، والموجة رقم ثلاثة، والموجة رقم أربعة. لذا، في ثانية واحدة،\nحدث هذا الأمر برمته في ثانية واحدة. الآن، إذا عرفت\nمقدار هذه المسافة الإجمالية، فقد انتهيت، لأن ذلك يمثل المسافة الإجمالية التي قطعتها\nالموجة في ثانية واحدة. وهذه هي السرعة. لذا أحتاج إلى حساب هذه المسافة\nلمعرفة السرعة. كيف يمكنني فعل ذلك؟ حسنًا، أعرف ما هو الطول الموجي\nلهذه الموجة، أليس كذلك؟ لقد أعطيت لي. إذن، هل يمكنك التوقف والتفكير فيما ستكون عليه هذه المسافة الإجمالية؟ ونتيجة لذلك، فكر\nفي العلاقة بين سرعة\nالموجة أو سرعتها والتردد وطول الموجة. لماذا لا تتوقف وتحاول؟ حسنًا، بما أن الطول الموجي يبلغ مترين ولدي أربع موجات، فإن المسافة الإجمالية التي تقطعها الموجة ستكون اثنين في أربعة. سيكون ثمانية أمتار. لذا بشكل عام، إذا\nكان الطول الموجي لامدا، فسيكون هذا لامدا. وإذا كان التردد F، فسيكون هناك عدد F\nمن الموجات هنا. وهذا يعني أن المسافة الإجمالية المقطوعة ستكون F مضروبة في لامدا في ثانية واحدة، وبالتالي فإن سرعة\nالموجة ستكون F في لامدا. الآن، بالنظر إلى هذه المعادلة، قد نعتقد أن\nسرعة الموجة تعتمد على التردد، وسرعة الموجة\nتعتمد على الطول الموجي، ولكن يتبين أن الأمور\nأكثر تعقيدًا بعض الشيء. ذلك يعتمد على الموجة التي\nنتعامل معها. والآن دعونا نعود\nإلى الموجات الكهرومغناطيسية. اتضح أنه بالنسبة\nللموجات الكهرومغناطيسية في الفراغ، فإن السرعة تكون ثابتة فقط. أي\nموجة كهرومغناطيسية تأخذها في الفراغ، ستنتقل دائمًا بسرعة حوالي ثلاثة ضرب 10 أس\nثمانية أمتار في الثانية. غالبًا ما نسميها C، سرعة الضوء، سرعة الضوء في الفراغ، حسنًا؟ وهي مستقلة عن\nتردد الموجة. وهو مستقل عن\nالطول الموجي للموجة، أي بالنسبة\nللموجات الكهرومغناطيسية الموجودة في الفراغ، وبما أن هذا ثابت، نلاحظ أن هذا يعني أنه إذا كان\nلديك موجة عالية التردد، فيجب أن يكون طولها الموجي أقل. إذا كان طولها الموجي مرتفعًا، فيجب أن يكون ترددها أقل. لذا بالنسبة للموجات الكهرومغناطيسية في الفراغ، يمكنك أن ترى أن التردد وطول الموجة\nيرتبطان عكسيًا ببعضهما البعض. والآن يمكننا العودة\nإلى السؤال الأصلي. لماذا تنتج هذه الأشياء أنواعًا مختلفة من الموجات الكهرومغناطيسية؟ حسنًا، لأن الشحنات هنا تتأرجح بترددات مختلفة. في شبكة wifi الخاصة بك، تتأرجح الشحنات بترددات أقل. وهكذا تحصل على\nموجات كهرومغناطيسية منخفضة التردد، والتي نسميها موجات الراديو. داخل أجسامنا، تهتز الشحنات\nبترددات أعلى قليلاً. والآن، تحصل على\nموجات ذات تردد أعلى قليلًا، والتي نسميها موجات الأشعة تحت الحمراء. داخل المصباح الكهربائي، يوجد\nتردد أعلى، وهو ما نسميه\nالضوء المرئي لأننا نستطيع رؤيته. وفقط لإعطائك\nشعوراً بالأرقام، حسناً؟ لذا فإن موجة الراديو\nالقادمة من شبكة wifi الخاصة بك تبلغ حوالي مليار هرتز، مما يعني أن الإلكترونات هنا تتأرجح حوالي مليار\nمرة في الثانية، حسنًا؟ وعندما يتعلق الأمر بالأشعة تحت الحمراء، تصبح 10 أس 13. وبالنسبة للضوء المرئي،\nتصبح 10 أس 14. ويمكن أن يكون لديك موجات ذات تردد أعلى، والتي تتحول إلى الأشعة فوق البنفسجية. لديك الأشعة السينية، لديك\nأشعة جاما، وما إلى ذلك. ويمكنك أيضًا أن ترى أنه مع زيادة التردد،\nيتناقص طول الموجة لأننا رأينا أن التردد وطول الموجة يرتبطان عكسيًا بالموجات الكهرومغناطيسية. لكن هذا يثير السؤال الأخير. ماذا يحدث حقًا\nلهذه الموجات الكهرومغناطيسية عندما تصطدم بشيء ما؟ على سبيل المثال، ماذا يحدث\nلموجات الراديو هذه عندما تنتقل من شبكة wifi إلى هواتفنا، على سبيل المثال؟ حسنًا، تحتوي هواتفنا أيضًا على\nهوائي صغير بداخلها. الآن، في هوائي الإرسال هذا، يهتز الإلكترون مما يمنحك\nموجات كهرومغناطيسية. في هوائي الاستقبال للهاتف، يحدث العكس تمامًا. سوف تسقط عليه الموجات الكهرومغناطيسية وتجعل الإلكترونات ترتفع وتنخفض. وهذه هي الطريقة التي يتم بها نقل الطاقة\nمن هذا الإلكترون المتذبذب إلى الإلكترونات هنا. رائع جدا، هاه؟ ولكن الآن قد نتساءل، حسنًا، كيف يمكنك نقل\nأي معلومات؟ على سبيل المثال، موجات الراديو التي سنستخدمها في شبكة wifi يمكن أن تبلغ حوالي خمسة جيجا هرتز، أي خمسة أضعاف، 5 مليار هرتز. وهذا يعني أن الإلكترونات هنا تتأرجح حوالي 5\nمليارات مرة في الثانية، ثم تذهب الموجات وتضرب هنا.  سوف تتأرجح الإلكترونات الموجودة داخل\nهوائي هواتفنا أيضًا بمقدار 5\nمليارات مرة في الثانية. ولكن ماذا، أين\nيتم نقل المعلومات هنا؟ كيف تتحول؟ كيف تقوم بنقل المعلومات؟ هذا سؤال عظيم. ومن أجل نقل المعلومات، نحتاج إلى تعديل هذه الإشارة. ماذا تقصد بذلك؟ لنفترض على سبيل المثال أن هذه إشارة نريد إرسالها من\nجهاز الإرسال إلى جهاز الاستقبال. دعونا نتخيل أجهزة إرسال الراديو\nوأجهزة استقبال الراديو. لك أن تتخيل أن هذه، لا أعلم، إشارة تمثل\nأغنية ما، على سبيل المثال. كيف تنقل ذلك؟ حسنًا، ما نفعله هو أننا نأخذ موجة الراديو ونقوم بتعديلها. مثال على ذلك هو أنه يمكنك تغيير\nسعة موجة الراديو هذه وفقًا لإشارة الرسالة، وسيبدو الأمر هكذا إلى حد ما. أعلم أن الأمر\nيبدو معقدًا للغاية، لكن المهم هو\nالنظر إلى السعة. السعة تتراكم بشكل جيد، آسف، تتطابق بشكل جيد مع إشارة الرسالة. وهذا ما يسمى التشكيل. في الواقع، يسمى هذا\nبتعديل السعة لأن سعة موجة الراديو هذه تتغير وتتغير\nوفقًا للرسالة. هذه هي الرسالة التي يرسلها جهاز إرسال الراديو. وعندما تستقبلها أجهزة الراديو الخاصة بك، تبدو الإلكترونات، على الرغم\nمن أنها تهتز بنفس التردد، فإن سعة\nالاهتزاز ستستمر في التغير وفقًا للرسالة. وهذه هي الطريقة التي ستكتشف بها أجهزة استقبال الراديو الخاصة بك،\n ما هي الرسالة. هذا هو ما يعنيه AM،\nتعديل السعة. هناك أنواع أخرى\nمن التعديل أيضًا. هناك شيء يسمى\nتعديل التردد، تعديل الطور، وما إلى ذلك. الفكرة هي تغيير بعض\nخصائص موجة الراديو الخاصة بك وفقًا للرسالة\nالتي تريد إرسالها. لكن على أية حال، نظرًا لأن هذه\nموجة مستمرة يتم تشكيلها، فإننا\nنسميها التشكيل التناظري. شبكة wifi الخاصة بك لا تفعل ذلك. يقوم جهاز wifi الخاص بك بما\nنسميه التعديل الرقمي لأنه لا يرسل\nإشارات تناظرية مثل هذه. يرسل جهاز wifi الخاص بك رسائل\nبالبت والأصفار والأشهر. هذه رسالة رقمية. إنهم متحفظون. انظر، على عكس الإشارة التناظرية،\nلديك قيمتان فقط. إما أن تحصل على صفر أو\nواحد، ولا شيء بينهما. إذن نحن هنا نقوم بالتعديل الرقمي. ماذا سيكون هذا يشبه؟ حسنًا، مرة أخرى، إذا أردنا تعديل الإشارة باستخدام هذه الرسالة، فقد نحصل على إشارة تعديل تبدو إلى حد ما مثل هذا. مرة أخرى، لاحظ أن السعة إما أن تكون حدًا أقصى أو صفرًا، حسنًا؟ تمثيل البتات الصفرية\nأو الواحدة التي تحصل عليها. ومرة أخرى، عندما يحدث هذا\nويضرب جهاز الاستقبال وهوائي جهاز الاستقبال في\nهاتفك، على سبيل المثال، بناءً على الإلكترونات،\nسوف يهتز وفقًا لذلك وسنكون قادرين على اكتشاف\nماهية هذه الرسالة. وهذا ما يسمى بالتعديل الرقمي، وكل هذا هو تبسيط مبالغ فيه، وهناك ما هو أكثر من ذلك بكثير. باختصار، هذه هي الطريقة التي\nتعمل بها اتصالاتنا اليوم، الاتصالات اللاسلكية لمسافات طويلة، والاتصالات عبر الأقمار الصناعية،\nوكل ما تريد التحدث عنه. كل ذلك يتم عن طريق\nتسخير قوة الموجات الكهرومغناطيسية. إنها مجرد أشياء رائعة.",
    "t_italian": "- [Narratore] Cosa c'è in comune\ntra un router Wi-Fi, i nostri corpi e una lampadina a incandescenza? Tutti emettiamo onde elettromagnetiche. Ma perché lo facciamo? E perché sono, perché sono\ntutti così diversi? E come ne utilizziamo alcuni\nper le comunicazioni wireless? Rispondiamo a tutti. Cominciamo col chiederci cosa sono esattamente le onde elettromagnetiche? Le onde elettromagnetiche sono costituite\nda campi elettrici e magnetici oscillanti. Un campo elettrico variabile produce un campo magnetico variabile, che produce un campo elettrico variabile e così via. E che, come puoi\nvedere in questa animazione, il disturbo si propaga. Ma la cosa bella\nè che questo disturbo può propagarsi nel vuoto. Non richiede alcun\nmezzo e trasporta energia. È così, ad esempio, che\notteniamo energia dal sole sotto forma di onde elettromagnetiche. Ma come si producono queste\nonde elettromagnetiche, chiedi? Bene, basta accelerare le accuse. Le cariche acceleranti\nmodificheranno i campi elettrici. Cambierà i campi magnetici, ed è così che\nverranno generate le onde elettromagnetiche. Un modo interessante per accelerare la carica sarebbe semplicemente prendere un elettrone e muoverlo su e giù. Se muovi continuamente\nun elettrone su e giù, continuerà a perdere energia sotto forma di onde elettromagnetiche. Quindi le cariche accelerate\ncreano onde elettromagnetiche. Quindi, se consideri l'\nantenna Wi-Fi, ad esempio, scoprirai che ci saranno degli elettroni che oscilleranno su e giù\nmolto velocemente, ok? E poiché gli elettroni sono\ncariche che oscillano su e giù, genereranno onde elettromagnetiche, che chiamiamo onde radio. Allo stesso modo, se\nconsiderate i vostri corpi, avete degli elettroni all'interno del nostro corpo. Ci sono delle cariche all'interno\nche vibrano perché proprio a causa della temperatura, stanno semplicemente vibrando laggiù. E questo, ancora una volta, genererà\nonde elettromagnetiche, che sono radiazioni infrarosse. E la stessa cosa accadrà\nall'interno di una lampadina a incandescenza. Quando il filamento viene riscaldato, raggiunge una temperatura così elevata che gli elettroni vibrano in modo casuale. E di conseguenza, si generano\nonde elettromagnetiche , che ci danno luce. Ma ovviamente ora arriva la grande domanda. Perché riceviamo onde radio qui, raggi infrarossi qui,\nraggi luminosi qui? Qual è la differenza tra loro? In tutti i casi, sono le accuse che\nvanno su e giù, giusto? Allora perché riceviamo diversi\ntipi di onde elettromagnetiche? Qual è la differenza tra loro? Per rispondere a questa domanda,\ndobbiamo comprendere alcune delle proprietà chiave di\nqueste onde elettromagnetiche. Quindi diciamo che questa è la nostra\nonda elettromagnetica. Ricorda, ha sia\ncampi elettrici che magnetici. Non li mostrerò entrambi. Immagina che questo sia solo un\ncampo elettrico e che si stia muovendo. Quindi puoi immaginare che il campo sia, l'intera onda si sta muovendo verso\ndestra, per esempio, ok? E una delle proprietà chiave dell'onda è quanto è grande l'onda, l'\naltezza dell'onda, ok? Questo è ciò che intendo. Tecnicamente questa si chiama\nampiezza dell'onda. Quindi questa altezza è ciò che\nchiamiamo ampiezza. Quindi, ad esempio, questa sarebbe\nun'onda di ampiezza molto piccola. Questa sarebbe un'onda di ampiezza molto grande. E ovviamente, ricorda che quando dico altezza, non lo sono, non c'è niente di\nfisico qui. Questi sono\nvalori del campo elettrico e magnetico, giusto? Quindi, tornando all'animazione,\nè più appropriato pensare all'ampiezza\ncome alla forza massima dei campi elettrici o magnetici. Un'altra caratteristica importante di un'onda è quella che chiamiamo la sua fase.  È più facile capire cos'è la fase se guardassi solo due\npunti specifici su un'onda. Quindi confrontiamo solo questi\ndue punti sull'onda e vediamo cosa succede loro mentre confronterò solo\nquesti due punti e vedrò cosa succede loro\nmentre l'onda avanza. Sposterò l'onda a destra. Quindi nota che inizieranno a oscillare. Andranno su e giù. Ma guarda, stanno andando\nsu e giù insieme. Sono in sincronia tra loro. Quindi diciamo che oscillano\nin fase tra loro. Quindi puoi pensare alla fase\ncome a una sorta di rappresentazione della posizione in cui si trovano nei loro\ncicli di oscillazione. Sono entrambi, questi due sono in fase perché raggiungono insieme le loro valli. Raggiungono insieme lo zero,\nraggiungono insieme il picco, e così via. Quindi due punti qualsiasi sulle\nmontagne sono in fase. Due punti qualsiasi sulle valli\nsono in fase tra loro. Ma che dire di questi due punti? Sono in fase tra loro? Vediamo. Vediamo, ancora una volta,\nconcentriamoci su di loro, muoviamo l'onda e vediamo cosa succede. Ehi, no, non lo sono. Cosa vedi? Noti che quando uno sale, l'altro scende. E quindi no, non\noscillano insieme. Non sono in fase tra loro. In effetti, diciamo che sono\nfuori fase. Questo è quello che diciamo. Ma l'importante è\nche non siano in fase tra loro, ok? Questa idea di fase sarà\nmolto importante in seguito. Ci torneremo più tardi. Un'altra caratteristica importante della\nnostra onda è la sua lunghezza d'onda. Puoi pensare alla\nlunghezza d'onda come la distanza tra due picchi consecutivi o due valli consecutive o, di fatto, due punti consecutivi in ​​fase tra loro. Abbiamo visto quali sono in fase, giusto? Quindi, per esempio, se\nconsideriamo la distanza tra questi due picchi consecutivi, questa lunghezza è quella che\nchiameremo lunghezza d'onda. E di solito è rappresentato dal simbolo lambda, ok? Quindi, ancora una volta, se torni alla nostra onda, questa rappresenterebbe\nlunghezze d'onda corte. Questo rappresenterebbe\nlunghezze d'onda lunghe, ok? E un'ultima caratteristica importante della nostra onda è la sua frequenza. Cos'è la frequenza, chiedi? Bene, prendi qualsiasi punto tu voglia e poi misura in un secondo quante onde passano oltre quel punto.  Il numero di onde che passano\nattraverso un punto al secondo è ciò che chiamiamo frequenza. Puoi pensarlo come il numero di onde che passano attraverso un punto al secondo, ok? Quindi l'unità della lunghezza d'onda è metri perché stai misurando la distanza. E qual è l'unità di frequenza? Beh, è ​​il numero di onde al secondo. Quindi la frequenza sarebbe il\nnumeratore è solo un numero. Quindi il numero al secondo\nsarebbe il secondo inverso. Ma spesso chiamiamo seconda inversa quando la usiamo per la frequenza come hertz. Quindi, ad esempio, se dico che\nla frequenza è 10 hertz, significa che da un dato punto passano 10 onde\nal secondo. Ora, ecco la cosa bella\ndella lunghezza d'onda e della frequenza. Se li conosci, se conosci la lunghezza d'onda e la frequenza, puoi capire la velocità dell'onda. Vediamo come. Infatti prendiamo\ndirettamente alcuni numeri per vedere come. Prendiamo quindi alcuni semplici numeri. Diciamo di avere un'onda che ha una lunghezza d'onda di due metri e una frequenza di quattro hertz. Come possiamo calcolare\nla velocità di quest'onda? Bene, quello che faremo è immaginare che ci sia\nun'onda che parte da qui e aspetteremo solo un secondo, ok? Quindi aspetta un secondo. Ora, in quel secondo, conosco quattro onde che vogliono passare. Quindi lasciatemi semplicemente disegnarli. Quindi la nostra ondata inizierà da qui. È un picco. Quindi quattro onde\npasseranno in un secondo. Quindi ecco l'ondata numero uno.  Da picco a picco è un'onda intera, ok? Onda numero due, onda numero tre e onda numero quattro. Quindi in un secondo, tutta questa\ncosa è accaduta in un secondo. Ora, se calcolo\nquant'è questa distanza totale, ho finito perché allora rappresenta la distanza totale percorsa\ndall'onda in un secondo. E questa è la velocità. Quindi devo calcolare quale sia questa distanza\nper capire la velocità. Come lo faccio? Beh, so qual è la lunghezza d'onda\ndi quest'onda, giusto? Mi è stato dato. Quindi puoi fermarti e pensare a quale sarà questa distanza totale? E di conseguenza, pensa\na quale sarebbe la correlazione tra la velocità o\nla velocità dell'onda, la frequenza e la lunghezza d'onda. Perché non ti fermi e provi? Va bene, va bene, quindi poiché la lunghezza d'onda è due metri e ho quattro onde, la distanza totale percorsa dall'onda sarebbe due volte quattro. Sarebbero otto metri. Quindi in generale, se la\nlunghezza d'onda è lambda, questo sarebbe lambda. E se la frequenza è F, ci sarebbe un numero F\ndi onde qui. Ciò significa che la distanza totale percorsa sarebbe F volte lambda in un secondo, e quindi la velocità\ndell'onda sarebbe F volte lambda. Ora, guardando questa equazione, potremmo pensare che ehi,\nla velocità di un'onda dipende dalla frequenza e la velocità dell'onda\ndipende dalla lunghezza d'onda, ma a quanto pare le cose sono un\npo' più complicate. Dipende da quale onda\nabbiamo a che fare. Quindi ora torniamo\nalle onde elettromagnetiche. Risulta che per le\nonde elettromagnetiche nel vuoto la velocità è semplicemente una costante. Qualsiasi\nonda elettromagnetica che prendi nel vuoto viaggerà sempre a circa tre volte 10 alla potenza di\notto metri al secondo. Spesso la chiamiamo C, velocità della luce, velocità della luce nel vuoto, ok? È indipendente dalla\nfrequenza dell'onda. È indipendente dalla\nlunghezza d'onda dell'onda, il che significa che per le\nonde elettromagnetiche che si trovano nel vuoto, poiché questa è una costante, notiamo che ciò significa che se\nhai un'onda ad alta frequenza, dovrebbe avere una lunghezza d'onda inferiore. Se ha una lunghezza d'onda elevata, dovrebbe avere una frequenza più bassa. Quindi, per le onde elettromagnetiche nel vuoto, puoi vedere che la frequenza e la lunghezza d'onda sono\ninversamente correlate tra loro. E ora possiamo tornare\nalla nostra domanda iniziale. Perché queste cose emettono diversi tipi di onde elettromagnetiche? Beh, perché le cariche qui oscillano a frequenze diverse. Nel tuo Wi-Fi, le tariffe oscillano a frequenze più basse. Quindi ottieni\nonde elettromagnetiche a bassa frequenza, che chiamiamo onde radio. All'interno dei nostri corpi, le cariche vibrano a\nfrequenze leggermente più alte. E così ora ottieni\nonde a frequenza leggermente più alta, che chiami onde infrarosse. All'interno della lampadina\nc'è una frequenza ancora più alta, che otteniamo, chiamata\nluce visibile perché possiamo vederla. E giusto per darti\nun'idea dei numeri, ok? Quindi l'onda radio che\narriva dal Wi-Fi è nell'ordine di circa un miliardo di hertz, il che significa che gli elettroni qui oscillano circa un miliardo di\nvolte al secondo, ok? E quando si tratta degli infrarossi, diventa 10 su 13. Per la luce visibile,\ndiventa 10 su 14. Si possono anche avere onde a frequenza più alta, che vanno nei raggi ultravioletti. Hai i raggi X, hai i\nraggi gamma e così via. E puoi anche vedere che man mano che la frequenza aumenta,\nla lunghezza d'onda diminuisce perché abbiamo visto che la frequenza e la lunghezza d'onda sono inversamente correlate per le onde elettromagnetiche. Ma questo fa sorgere l’ultima domanda. Cosa succede realmente a\nqueste onde elettromagnetiche quando vanno a colpire qualcosa? Ad esempio, cosa succede\na queste onde radio quando, ad esempio, dal wifi arrivano ai nostri telefoni? Bene, i nostri telefoni hanno anche una\npiccola antenna al loro interno. Ora, in questa antenna trasmittente, l' elettrone vibra\ndandovi onde elettromagnetiche. Nell'antenna ricevente di un telefono accade esattamente il contrario. Le onde elettromagnetiche cadranno su di esso e faranno andare su e giù gli elettroni. Ed è così che l'energia\ndi questo elettrone oscillante viene trasferita agli elettroni qui. Abbastanza bello, eh? Ma ora potremmo chiederci, beh, come si trasmettono le\ninformazioni? Ad esempio, le onde radio che utilizzeremmo nel Wi-Fi potrebbero essere di circa cinque gigahertz, ovvero cinque volte, 5 miliardi di hertz. Ciò significa che gli elettroni qui oscillano circa 5\nmiliardi di volte al secondo, e poi le onde vanno a colpire qui.  Anche gli elettroni all’interno\ndell’antenna dei nostri telefoni oscilleranno 5\nmiliardi di volte al secondo. Ma cosa, dove\nvengono trasferite le informazioni qui? Come ti trasformi? Come trasferisci le informazioni? Questa è una bella domanda. Per trasferire informazioni, dobbiamo modulare questo segnale. Che cosa vuoi dire con questo? Supponiamo ad esempio che questo sia un segnale che vogliamo inviare dal\ntrasmettitore al ricevitore. Immaginiamo trasmettitori radio\ne ricevitori radio. Puoi immaginare che questo sia, non so, un segnale che rappresenta\nuna canzone, per esempio. Come lo trasmetti? Bene, quello che facciamo è prendere la nostra onda radio e modularla. Un esempio di ciò potrebbe essere che puoi modificare l'\nampiezza di questa onda radio in base al segnale del messaggio, e sarà simile a questo. So che\nsembra molto complicato, ma ciò che è importante è\nguardare l'ampiezza. L'ampiezza si adatta bene, scusate, corrisponde perfettamente al segnale del messaggio. Questa si chiama modulazione. In realtà, questa è chiamata\nmodulazione di ampiezza perché l'ampiezza di questa onda radio varia, cambia e si\nadatta al messaggio. Questo è il messaggio che viene inviato dal trasmettitore radio. E quando le vostre radio lo ricevono, gli elettroni sembrano, anche\nse vibrano con la stessa frequenza, l'ampiezza della\nvibrazione continuerà a cambiare a seconda del messaggio. Ed è così che i vostri\nricevitori radio rileveranno qual era il messaggio. Questo è ciò che significa AM\n, modulazione di ampiezza. Esistono anche altri tipi\ndi modulazione. C'è qualcosa chiamato\nmodulazione di frequenza, modulazione di fase e così via. L'idea è di modificare alcune\nproprietà della tua onda radio in base al messaggio\nche desideri inviare. In ogni caso, poiché si tratta di\nun'onda continua che viene modulata, la\nchiamiamo modulazione analogica. Il tuo wifi non lo fa. Il tuo Wi-Fi fa quella che\nchiamiamo modulazione digitale perché non invia\nsegnali analogici come questo. Il tuo wifi invia messaggi in\nbit, zeri e mesi. Questo è un messaggio digitale. Sono discreti. Vedi, a differenza del segnale analogico,\nhai solo due valori.  O ottieni zero o\nuno, niente in mezzo. Quindi qui facciamo la modulazione digitale. Come sarebbe? Bene, ancora una volta, se dovessimo modulare il segnale usando questo messaggio, potremmo ottenere un segnale modulato che assomiglierebbe a questo.  Ancora una volta, nota che l'ampiezza è massima o zero, ok? Rappresenta i\nbit zero o uno che ottieni. E ancora, quando questo va a\ncolpire il ricevitore e l'antenna ricevente del\ntuo telefono, ad esempio, in base agli elettroni,\nvibrerà di conseguenza e saremo in grado di rilevare\nquale fosse questo messaggio. Questa si chiama modulazione digitale, e tutto ciò è una semplificazione eccessiva, e c'è molto di più. In poche parole, ecco come\nfunziona la nostra comunicazione oggi, comunicazione wireless a lunga distanza, comunicazione satellitare,\nqualunque cosa tu voglia parlare. Tutto ciò avviene\nsfruttando la potenza delle onde elettromagnetiche. È roba semplicemente affascinante."
}