{
    "source": "KngFdAAgKCY",
    "youtubelink": "https://www.youtube.com/watch?v=KngFdAAgKCY",
    "t_english": "- Hi, everyone. Sal here from Khan Academy. And as some of y'all know, I have released my second book, \"Brave New Words,\" about the future of AI in education and work. It's available wherever you might buy your books, but as part of the research for that book, I did some interviews with some fascinating people, which you are about to watch. I'm excited to introduce Professor Ethan Mollick, who's a professor at Wharton School at the University of Pennsylvania, who have also done a lot of work on simulations in business school, but I think even more relevant to what we're doing, you've kind of made a name for yourself over the last several months as someone who has been using AI for good in education. So welcome, Ethan. - Thank you for having me. I'm thrilled to be here. - So let's just start at the beginning. What was your first indoctrination or exposure to, especially things like large language models, what were some of your initial reactions and then what were some of the ways that you started to actually realize that it could be valuable? - So as you said, I've been building, like, thinking about how we democratized education for a really long time. Like, I come from a business school perspective and there's all this research that like, small amounts of business education transform lives and controlled studies around the world. So I've been thinking about this for a while and I've also been playing with tools that do this, so building simulations, but also kind of was aware of GPT 3, which was the pre-Chat GPT version of the software, which sort of did a good high-level fifth grade kind of essay at that point. And I thought I should get my students aware of this stuff. So I started assigning them assignments to cheat with it. So write as best an essay as you could using this and using Dall-E to generate an image and then talk about where the state of the world was. And what was very funny is halfway through the cheating assignment, when half of my students had turned it in but the other half didn't, Chat GPT came out. So there was a sudden change in the quality level that was quite dramatic during that period. - And what did you notice? Actually, I'm curious. I mean, you said, \"All right, you, in theory, you could cheat with this stuff.\" So students go cheat with this stuff, and by definition it's not cheating if you're told to cheat, but did you see a difference? I mean, you obviously had difference between Chat GPT, which is using GPT 3.5 and regular GPT 3. You already saw a difference there, but did you see a difference relative to what you saw in previous years from student work? - Yeah, I mean, well, what's interesting is like, we judge writing and intelligence as being very close to each other, right? And you know, in ways that are hard to sort of separate, we consider essay writing to be how we learn how to think as we write essays. Maybe that's true, maybe it's not. We really haven't tested those things. It's like a lot of education stuff, we don't actually know the answers. And so I've had students in my class who are brilliant people but not good writers. English is their third language or, you know, they came from a background where they never learned to write really well. So even just having that little bit of a hint, it's sort of like Grammarly, right? Like, made a difference of making they're writing better. And after I introduced some of my students to Chat GPT, they're like, you know, I'm now getting job callbacks I didn't before and I'm getting the job where I have an interview, but because I can write well now, right? So it's part of why I've made AI uses mandatory in all my classes. So I no longer accept anything that isn't perfectly written at this stage. Why bother? - And what's your sense, you know, think about it from an employer's point of view where I guess they were using a signal, someone who writes a really eloquent cover letter versus someone who doesn't, and they were using this little signal. Now it's all eloquent, but maybe that person comes to work and they're like, \"Oh, maybe their language skills aren't as strong as I thought they were based on...\" What's your point of view? Are they cheating or is that okay? Because I can use Chat GPT or whatever to continue to write well. - It's actually two really interesting questions. The first is, you know, this question of cheating overall is sort of a big question, right? What does it mean to cheat nowadays, right? If I ask the AI for advice, but don't use it. If I ask you to punch up a paragraph, if I ask it for all, is that cheating? It's a much different question than plagiarizing, right? And then the second question is like, you know, a lot of stuff that is good is gonna be hurt by AI, but a lot of stuff that's bad, right? Turns out like, judging people based on cover letters has never been a particularly great method, or a college essay has never been a particularly great method of deciding admissions. The best method we have for large scale, you know, meta-analyses is actually doing a detailed interview that's based around what people actually accomplish in their life, right? If writing skills are important, you're gonna have to give people a writing test that's separate. But for a lot of jobs, that isn't the main skill or it's gonna be done by AI now. So in some ways, it's cheating, but it's also kind of forcing us to reconsider what's actually valuable in terms of signaling. A lot of stuff that we do, especially as instructors in the room, is about sort of setting your time on fire to show that you care, right? Like, if someone asked me to write a letter of recommendation for them, it takes an hour to write a really good letter of recommendation. I could paste the resume of the person and the job they're applying for and what it says in GPT 4 and get a better letter than it would take me an hour to write. And I'm always struggling like, do I use the generated letter because it indicates my thoughts, but I'm not spending the time anymore that I was gonna spend to make this work. And I think that's the really interesting challenge. - I love your phrase of setting my time on fire to show that I care. My mom always wants me to pick her up from the airport. (laughs) - My parents too. My parents too. (laughs) Same thing. - I do. I do. I set that part of my day on fire so that I can show her that I care. But I think you're right, we are full of traditions, including maybe the cover letter and all of this that are almost just rituals just to light your time on fire to show that you care. But do they actually add value? And even for folks who... Some people have other people coaching them, helping them for things like college essays or resumes, and that's kind of a resource-intensive version of Chat GPT or GPT 4. - Exactly. And I mean, the exciting thing, and this is why I love what you guys are doing, is like, we suddenly have billions of people who have access to the single best AI ever released in public. Like, if you're rich, you don't get access to a better AI and you get free access to through Bing or through the kinds of things that you guys are doing, right? It's available everywhere. And that's like, the most profoundly interesting thing in education because we used to have all of these barriers. All the previous attempts to do this were hard and difficult, right? So I think part of that question is, you know, it democratizes stuff we didn't get to democratize before. It used to be like, you can hire a tutor, you'll do better. Now what happens when we have a tutor that everybody could use that's actually better than human tutors? That's a really exciting and a little bit scary prospect. - Yeah, you're right. It is both exciting and scary and all of us, as you know, we're working on Khanmigo inside of Khan Academy and rolling it out pretty increasingly widely now. And you and I are bumping into each other a lot because we seem to be on the speaking docket together a lot. Like, this is what Khan Academy's doing, and look at this professor who's not afraid to use AI. So let's continue on your journey 'cause you talked about those early days, you encouraged the kids to quote \"cheat\" using artificial intelligence, but it was kind of leading to better outcomes. But have you changed what the assignments are? Have you changed your threshold of what makes a good assignment? - Yeah, so I mean, there's basically three things I've had to do as a result of AI. So level one, and I think everyone's gonna have to face these problems, right? Level one is just expecting more from students, right? So the first thing we all have to do is like, so you know, I teach an entrepreneurship class and you know, again, I know there's people listening who teach, you know, basic writing skills. You're gonna have to adjust in different ways. This is gonna be different for every person. Some people, it's gonna be all about having writing assignments in class so people learn how to write because they'll be cheating outside of class. I get that, so this is not a universal thing, but it's certainly my case. I expect more. So people used to have to turn in like, a business plan. Now they have to turn in a business plan, working code, even if they could never code before. I now code. I can't code, but I've written 12 Python programs the last couple weeks, right? You have to turn in, you know, a fully working webpage. You have to have interviewed both real and fake people with the AI and there's some data that you could survey the AI and it's actually accurate. So my expectations for work is now much higher than it was before. So that's the sort of first adjustment, right? The second set of adjustments is that now I have AI integrated into assignments. So AI is a teammate for my students. So they now end up actually having to bring AI, you know, there's assignments. For example, every assignment they turn in has to be critiqued by at least three famous other entrepreneurs, which they have to generate. So they get feedback along the way. And then the third thing, which is the really big thing is changing how we do classrooms. Lectures don't make as much sense when I've got tools like Khanmigo that could do truly amazing training, you know, remotely. So think about how we can flip the classroom in that way. - Yeah, no, well, I mean, there's so much in there. I mean, I found fascinating, your... So students will write like, an executive summary for like a business plan or something, and then ask like, Steve Jobs or some famous entrepreneur to, you know, Ford or somebody, or Tesla, somebody to... Or I guess Elon Musk, to weigh in on their business plan and that's part of the assignment now? - Yep. They're required to have... So for just turning their outline alone, which used to be something I would just comment on, they have to have three famous entrepreneurs comment on their plan, right? And that also teaches a little about writing prompts, but the limits of these things, they're not actually invoking the spirit of, you know, of Steve Jobs, right? Instead, they have to realize, you know, it helps them think about this new world we're in. And then they also have to do pre-mortem. So projects succeed better when you actually imagine how they could fail. So they have to generate a whole bunch of failure opportunities as a result of this too. Work backwards on how to solve them. So it lets me do different things that we know from the research make teams work better, make people work better. But we couldn't do before 'cause it was just too much work. - And this is so powerful. And you know, what you're also doing, it sounds like either explicitly or implicitly, is you're just making them intimately familiar with these tools and the power that they have. 'Cause the worst thing you could do is these students are in a bubble and then they come out into the workforce in a year or two and they're like, \"Wait, what just happened? Everyone's using GPT 5 now,\" or whatever. But they're gonna be able to lead in that. And your point about a flipped classroom, you know, as you know, I've been talking about even pre-AI in a world of on-demand video, honestly, even pre-on-demand video, humanities classes, even business school classes read the case, come to school, and we're gonna discuss it. That's always, I think, been a best practice. Even more so in an AI world. Where is this going? You know, are you continuing to evolve your courses? I'm sure all sorts of faculty members are coming to you and saying, \"What do I do?\" What are you telling them? - I mean, so one thing we're doing is, you know, we're sharing prompts, right? Like, to me, this the most important thing to do. So I've got a couple papers, and I'm sure we can put links somewhere for people, but where we're trying to kind of take pedagogical approaches, right? Prompting is that magical, but it helps you have expertise. So we've written some prompts that do various things like explanation analogies, some of the stuff you do in Khanmigo, but that can kind of be applicable to many classrooms. There's tools to help, you know, teachers. So I'm trying to figure out how the democratization mission that you guys have is the same one I'm thinking about. How do we give teachers tools? How do we give students tools? You know, the promise of AI is that suddenly, you know, the thing we thought that the internet would do, which is if we give everyone access to information. Everyone will learn everything. Turns out a very small set of people are really kind of constructivist learners who don't need support and could just learn on their own. But now we have a tool that actually can provide the support, the tutoring, some of the other material that we know works and do it at scale. And I've heard you talk about, you know, Bloom's 2 sigma. I mean, we don't even know how well this works at this point, but we couldn't do it before. And just like you, I've done massive, you know, not anywhere near your scale, but I've had like, you know, a few hundred thousand people take my online video courses. You know, there's a big difference between that and actually having an exercise and getting feedback. So we're trying to think about all of those kind of pieces. - And what are you telling faculty? Because I have no doubt, I mean, you already are not only navigating this successfully, you're thriving in a generative AI world. You're making it work for education. I feel similar optimism to what you do, but I would guess, and you know, 90-something percent of teachers right now are not in the same frame of mind. They're kind of freaking out. You know, let's say you were writing freshman composition, that's all you had to do. Like, your whole job is to make sure that the students are learning to write and that you're evaluating them. What would you tell teachers like that who are a little bit more afraid that things like Chat GPT just set off like a bomb in their pedagogical style? - I mean, I think we need to start with the bad news. It absolutely did, right? I mean, a lot of stuff just got blown up and some of that was good stuff, right? I mean, there's ways we've been teaching for 2000 years that made a lot of sense. Maybe they weren't really research-backed, but we got very good at them, right? We've gotten good at lectures, we've gotten good at doing essay assignments at home and evaluating them. We were good at that stuff. That's blown up, right? I mean, even for your best students, your students who wouldn't cheat. By the way, students have been cheating forever, right? But cheating just got much easier and cheaper. But even now, your best students are at a disadvantaged 'cause they're not cheating, right? Because, you know, they're not writing the same way. So it does blow up a lot, but if you are teaching a freshman composition class, you have to change how you teach. This AI is undetectable. Anyone who's telling you otherwise is not actually telling you the truth. It's essentially undetectable. One of the things I learned from my students who cheat is after a couple rounds of doing, you know, back and forth with the AI, which is the best way to interact with it, you know, just put a prompt in, you sort of engage with it. The essays are undetectable by both humans and any AI tutor. It blew up what you did. So you have to think as an opportunity, but also, it's scary, and we can admit that as educators. What we should realize is that education's gonna be okay. We will adapt to this change, right? It's bigger than calculators, but not that different than the narrow damage calculators did in math classes. As an instructor, you're probably gonna wanna have more instruction at the outside of class with videos and other stuff, more active writing assignments in class with critiquing each other and writing short essays and you could make this work. But it absolutely is a big change. But it's an opportunity to do things new and to figure out what works for you. And also, the thing I like to stress to the instructors is this also makes your life easier in a lot of ways. Like, there's a lot of stuff we wish we could do that we didn't have time to do. And again, we've got prompts for all this. It writes great quizzes for you. I know you guys have guides also to do this stuff. It helps you as an instructor. So it's not just increasing your workload and make your life difficult, it's also lowering your workload and giving you a little more time to think more about education and how to transform students' lives, which is why we're all in this in the first place. - No, I can imagine. You threw out, I think, some very good tips in your answer, which is, if I'm teaching freshman English comp at a university or if I'm teaching a English comp class at a high school, the world we're going into could very reasonably be, okay, I have you for an hour, hour and a half at a time. Write, and maybe you're writing with the AI, it's not writing for you, but it's acting so it can help answer some questions, et cetera. But then it can evaluate, it can do a first pass of grading for me. And so your students are actually gonna get more writing time and more feedback in this world. And yeah, maybe they have less to do at home. That's good. Everyone has less to do at home. You have less to do at home. You're not grading, you know, like your 80th essay on, you know, something that's, you know, probably mind-numbing at that point and the students don't either. Everything can happen in that night and it's just efficient for everyone. So yeah, that makes a ton of sense. - Yeah, and I think that, you know, that embracing this is gonna be important and it is okay for to be scared as you listen to this and be like, \"Oh no, I don't wanna change what I've been doing.\" But we also recognize a lot of the ways we are having people write essays didn't make sense. Like, the people who weren't very good in class, right? They wrote at bad essays outside of class. How much time do we have to tutor them to make them better? Well, in a sort of flipped classroom, active learning environment, and the active learning is more important than the flipped classroom, the idea that we're doing things in class, maybe there's more time for this tutor. Maybe the AI can help them catch up or give them an explanation where they were as opposed to being an instructor who's grading 80 essays like you said, maybe you have the AI will help you flag the couple that need the most help or a couple that are great examples. You know, and give feedback that way. We don't have all the answers yet, right? So we are in an exploratory environment, but we can't pretend the world didn't change. This isn't one of those things, like one day video classes, what are you gonna do about massive online courses? It's too late for that. Like, this is here now and whether we like it or not, we have to adjust as instructors. - And and where do you think this is? Because as you know, we've been talking about large language models, you mentioned Dall-E, which is about generative images. There's technologies around video, degenerative video, speech-to-text, text-to-speech. I've seen some demos, you know, things like speech-to-text and text-to-speech have been around for a while, but I've seen some demos lately of some text-to-speech that really is not discernible from the original, you know, the human being so to speak, which is gonna create issues with deep fakes and all of that in the broader world. But where do you think this is going? I think even for folks like us, every week, there's new things going on. What do you think this is all gonna look like in two or three years? And how are you keeping tabs on everything? - So a couple things there, right? One is, everyone has to recognize that AI, generative AI is what's called a general purpose technology. And, you know, I teach entrepreneurship innovation. In innovation studies, general purpose technologies come along very rarely. They come around once in, you know, every generation or two, think steam power, maybe the internet, maybe computers, but they affect every aspect of life. And this is the fastest one we've ever seen. Fastest adoption. It's the most personal. People could do things. It's gonna affect every industry differently, every person differently, every job differently. But it's gonna affect everything, right? The job that's least affected by AI according to the early studies we have is roofing. And I've talked to a couple of roofers like, \"Oh no, actually roofing's gonna change too because we can now do all of our proposals and stuff with AI help.\" So it's gonna change roofing also. So we should recognize that the world's changing in ways we don't always know. So what you should think about as a instructor is preparing people to live in a world with fast adaptation. So the more we start to use AI and get familiar with using it, the easier it'll be for people to adapt to whatever's coming next. Because I think just like, you know, you and I both, there's this moment of GPT 4 where it's like, \"Oh my gosh, it really does a lot of what people does.\" It thinks like people. Like, this isn't really software. It's worth thinking about it like it's a person. It's not a person, but you can think of it like a person. That could be helpful. And then the question is: What's next? We don't know. Does this keep getting better? Does it stay roughly where it is? I don't have answers to that, but we have to be ready and the best way to do it is start using it. - Well, you know, as a business school professor, and I mean, you just touched on it, the world is moving faster and faster and faster. What advice, I'm sure our students are asking you or parents are. Like, what should my kids be working? Like, what skills should they be developing and which ones are not, maybe, as important as they were before? - So I think thinking still matters, right? So a lot of why people taught said writing was important, writing essays was thinking, I think that's still very true. We need to teach people how to think. I think that for right now and hopefully for the foreseeable future, AI is great. If you were in the bottom 50% of a lot of different categories, you're now at the 50th or 60th or 70th percentile. That's exciting. It expands opportunities for people who did before, right? You couldn't write before, you could do that now. You weren't good at programming, you're now an okay programmer. Like, that's exciting. I think the question is, what are you good at, what do you love that you might be in the top 10% of people in? And I think that's something where you can add a lot of value to an AI world. So I think part of this is about thinking about what you wanna do, that you know, you have talent in and how do you develop that talent and that expertise and that requires you to still learn the basic knowledge of school. You build expertise by building basic knowledge, right? By, you know, seeing lots of examples, working with the AI to get there, and I think that can get you to a really exciting place. - I'll just make it some tangible examples. Like if someone says, \"My dream is to be a roofer,\" you'll be like, \"Great, that's gonna be a great job in the future because you're gonna be able to do more roofing and AI's gonna write your proposals for you.\" But if someone came to you and said, \"I wanna be a copyright editor,\" or, \"I wanna...\" Would you say the same answer? Just, you know, get really good at it even though GTP 4 is already pretty good at it? - So that's the bet, right? We don't know how much better these systems are gonna get, right? And I do think there's disruption. We are seeing, in early controlled studies, 30 to 80% performance improvement on many high-powered white collar analytical tasks, right? Writing based tasks, analysis tasks, consulting tasks, programming tasks. So if you wanna be in these fields, AI is gonna be part of your life. So you need to figure out if you can use AI to be 10 times more productive, there'll be huge value in you. There's still a need for a human in the loop. If you can't figure out how to use AI to get more productive, I'd be more nervous in those spaces. You know, I think what industries to go into, I mean, to be fair, people have been predicting that radiologists would be obsoleted by AI for the last 15 years, been saying don't become a radiologist. There's still lots of jobs for radiologists. So it's hard to make a bet. I wouldn't be making huge career bets. But I would say the more writing-based your job is and the more routine it is, if you're being a fiction writer, AI still can't, or a comedy writer, AI still can't write a good joke. Those are tough jobs anyway. But you know, those are places. But if you're trying to do copywriting, I think, unless you figure out a way to use the AI, I would be nervous, right? So the more exposed to AI the field is, the better AI is at it, the more you need to be a centaur in the model. Garry Kasparov said half man, half horse, half person, half horse. You need to be able to work with the AI as your horse and be the human integrated with it and then you could write better. I don't know, I found my writing has improved tremendously with using the AI to throw back a paragraph I'm not interested in working on it anymore because I'm stuck. Give me 20 versions of this, and it does, right? So I think there's hope in these fields, but we don't know how good this is gonna get and that's also a little bit scary. - And you mentioned scary. I mean, 'cause you seem like someone very not scared right now, but when you say scary, what are the scary thoughts in your head? - I mean, so there's a couple levels of scary, right? I mean, there's stuff that's definitely going to happen. We have disruption that's definitely going to occur, right? As you said, it is now trivial to create fake videos, fake videos of myself talking with a minute of my speech. I've done that before. Fake photos are easy, right? Content and mass is easy. So there's a bunch of social issues we're gonna have to deal with as a result of that. Then there's also the fact that this is going to disrupt jobs. We don't know which jobs yet and in what way. We don't know how much disruption's going to involve. You know, usually in economic terms, when jobs get disrupted, it's not about jobs, it's about tasks. So it's not your jobs that change, it's the tasks you do. And usually that ends up with getting a better bundle of tasks. You put off your boring stuff, but that can be a disruptive period. People get fired. People who are gonna get hired don't get hired. We don't know how this is gonna turn out. So there is some scariness that's gonna happen with job disruption, even if it does grow the economy. And then the question is, does it keep getting better? Right now, if you're the top 10, 20% of a field, I think, you know, AI is a tool for you. Now the question is: How do we train up interns when AI works as a better intern than a lot of our interns that we would have? How are we training people in the future? And if AI keeps getting better, what if it's better than everyone but the top 1%, what do we all do with our jobs then? And then of course, there's the sort of really scary thought that a lot of people spend too much time worrying about relative to these other concerns, which I think are much bigger. Which is, you know, what happens if this thing actually becomes super intelligent? This AGI idea and like, what happens then? But I think you don't need to worry about that. You know, people are worrying about it, you should worry about it, but I think that this other stuff about what happens to jobs and how do we survive in this world of disruption, I think is more important. And I mean, you know, both of our bread is buttered by this, but I do think education is part of the key here. To being able to think and adapt is gonna be important. Not being trained for one thing, but being trained for many things. - Yeah, I mean, you mentioned that you're already making your business school students write code and the business plan and you know. And once again, they're able to almost be a small-scale manager of an AI team, so to speak. - That's exactly right. I mean, I think you have to think about it. Everyone on earth just got a free intern. What are you gonna do with it? Is sort of be asking everybody. - Or like, 5. - Or 10. And and they do different things and it's not magical. People bounce off it and get scared of the AI. And I get all the reasons to be nervous. We've been talking about them here, but the fact is it's here. And my feeling with teaching students how to use this is you kind of need five to 10 hours of using this in your job to see what it does for you. If you don't spend five or 10 hours, you're not gonna get there. So that's sort of my advice is like, you have to use this. If you're a teacher, you're a student, use it for stuff and see what happens. And that's the only way to kind of go forward. It's not a magic of copying of a prompt off the internet. It really is just experimenting and being in dialogue with this thing like you're with a person. - I 100% agree with that and someone who's probably personally spent, at this point, about 300 hours. If I were to add one skill to creativity, 'cause I've seen so many people go to like, Chat GPT or use GPT 4 and they're just like, \"What do I do?\" (laughs) You know, the sky's the limit. Like, try interesting things and you're gonna realize that it's able to do things that, you know, would've been science fiction. I am curious, you know, what advice do you have for us? We're obviously working on Khanmigo. We're trying to make it a tutor for every student, a teaching assistant, you know, maybe more than that. We are trying to add things like memory and different types of activities, expand our horizons. What are the types of things that you would like to see it do to make students' or teachers' or parents' lives easier or anyone's lives easier. - So I think part of the interesting thing is once the interface with the human becomes an interesting question, right? How do we build these tools so that they fit into the human system that we have? Like what's the advice for how students use them? How do they give feedback to teachers in the right kind of way? You know, you guys are thinking of a lot about that, but I think how we fit those with the human systems matter. And then I think the other thing is like, trying to be even more creative, right? What you're doing is replicating this human at a very high level. What if I had a one-on-one tutor? But, you know, that was the best we could think of, right? - Yeah. - So the question is: What can we do beyond that? Like, what does education look like? Like, can we give different kinds of puzzles and tasks? Can we do more game-based instruction and teaching than we did before, right? Those are a very powerful set of tools. Another big question for me is: How do we start doing multiplayer version of this? How do we include many people in a classroom interacting with the AI? How do we create persistent personalities for the AI that you interact with and you selected personality to keep working with it. We get very constrained by this idea of like, now we can finally build Bloom's tutor, right? And like, that's wonderful, but that was also human constrained. We have a new system now, it's gonna change how we work, how we organize work. I would be thinking internally like, do we still wanna do Sprints? Do we still wanna do Agile? Those were built around human systems. What's the new model look like? So I think that's the view. And like, how do you take a companion to, you know, how does it force you to go beyond the classroom also and actually solve problems? Maybe it could push you to actually create something, right? So rather than just doing a project that's like, a single class project, how we integrate them together. And then the other thing I would just say is I think STEM just became much less interesting relative to humanities than it has been in the past. And humanities really help and social science really helps here because it kind of works like a person. And the more human history you can dive into, the more you can force the AI to think in interesting ways. So I also think trying to weave some of that, you know? A lot of stuff that wasn't practical before just became practical. A lot of stuff that was very practically oriented just became a lot more theoretical. So taking that lead and rethinking agendas and syllabi is also really interesting. - You are absolutely right. As you know, someone who's kind of straddled both worlds, you know, with a more technical background, computer science, you know, I saw back in school that a lot of the students who struggled with things like engineering and coding, they had trouble reducing problems to something that you could kind of linearize in an algorithm and think about all the edge cases and how do you create variables and how do you really reduce it down to that. But now with AI, even though it still is software, you're seeing the other way. I've actively told even members of the team, \"You've written this prompt like it's an algorithm. Do not do that.\" People say, \"First ask the user this, then do this.\" I was like, \"No, don't do that. Tell the AI what your goal is.\" 'Cause you want the AI to be more robust and flexible. You don't want it to always do that first and always do that second. You want it to give it your goal here. Don't micromanage how it gets to the goal and it's gonna do it in a more dynamic way. Or give it a sense of tone or you know, these things are not... - Yeah, tell it who it is. It's bad software, it's good people, right? Like it doesn't work well as software because it doesn't do the same thing every time. It gets stuck in loops. Like, you have to learn to work with it. It lies to you. You have to learn to work with it. No matter what we do, it does these things, right? Like, you do your absolute best, that's dropping, hallucinations are dropping, but like, they're real. It's a real problem. So if you think of this like a person, it does better. Like, I've given it tests, you know, it does better on education myth than than teachers do. It doesn't believe anymore in, you know, learning styles for example, which is great, but it still makes mistakes. And I think you're right, you have to give it a person, but you also have to teach people who are using it. It's a person, if it starts going off on a tangent, you have to redirect it. It's not a super intelligent entity that knows what the future is. And people use it that way, as an oracle all the time. What does the future of AI look like? It doesn't know. Even if it was intelligent as a person, it doesn't have answers for you. Treat it like a person and program it like a person and it's a very different kind of beast to play with then. - No, that's right. And you do a lot of work, you know, just on the other dimension. You do a lot of work on simulations, business simulations, things like that. I could imagine you're going to town. And we should think about collaborating. I would love to get some of even your pre-AI simulations out to kids in K-12 or in other context, but I'm curious how you're thinking about it in the AI world. - Yeah, we'd love that. I mean, I've been spending, you know, I wrote a book on games in education like 12 years ago. I've been building games ever since. Managed to get Wharton to you know, invest in this thing. I had a team of 14 people, we've had people who won the Hugo Award for best science fiction novels. I see some science fiction behind you. So, you know, as one of our writers who helped us out with some of the storyline and they're amazing, right? I've spent years building these games where you run a fake startup company in real time or you're on a doomed space mission to Saturn and it teaches you about leadership skills. And then of course, the disturbing thing was I typed in a well-directed prompt into AI and it started roleplaying all the characters in my game very well, right? 70% of a year's worth of effort could be accomplished with a paragraph. So I think this idea of playing with simulations is another thing. We're used to very didactic learning and even the tutor model sort of interactive didactic learning. We can start doing other things, right? I mean, a lot of educators will be familiar with like the diamond age model, right? Of like this universal tutor that turns teaching it to a game. What I've learned is you can't make games that teach as compelling enough to place take place of real games. Like at their very best, they're 80% as much fun as a real life game. But they can be a really interesting way to teach and combining simulations and games and actual didactic learning and quizzing and write a book to do this and project-based work. Suddenly all of this is cheap to do. It's easy to do at scale. It is so exciting. 'Cause I can tell you the simulation-based stuff makes such a difference in people's lives. And it's just something that normally we would have to spend millions of dollars building a sim and now it's something we could do much more easily. And I think that's really, really exciting too. - I mean, I'm serious about this. After this, we'll connect because I'm wanna, you know, obviously there's two schools that I helped start, Khan Lab School, including it has a high school as well and we have this other online high school. I think all your business school simulations. I would love to have it, you know, middle, high school, maybe even elementary school students doing all of them. I think it'd be transformational. - Actually, it's pretty funny. We built this for college students. Our best players are often actually high school students who've playing these games because they don't get a chance to actually do business stuff and they take it very seriously, and as a result, they get a lot out of it. While as somebody who's in a business school class, it's like, you know, they get into it, but it's a different kind of experience. The high school students, the goal before this was actually to create a class at a box in the same sort of way I've done massive online courses like you have, and just like you, have recognized the limits of these things, right? And the same way we've recognized the limits to these. So how do we get people to experience the game and learn on-demand became our big goal here and I think we've accomplished it. So I'd love to talk about those things and get you to try them out. They're, you know, all the education. We've got talked to various billionaire founders and, you know, we fictionalize their experience in the game and you know, there's hundreds of branching paths and we've actually filled Google and Wikipedia with fake information about the world of the game. So you can actually just Google stuff and get useful information out of it. So had a lot of fun building that too. - You've made the reality part of your simulation. - Alternate reality games. Yeah, exactly. - Awesome. Well, Ethan, I could talk to you for hours about this. I think, you know, you're one of the few people who are really leaning into this, and especially in education. So I expect this will not be our last conversation. It's actually not our first either. (laughs) - I love it. I love what you're doing with your mission and it's just exciting to see, you know? I was perfectly involved with everything for like, one laptop per child down through all these educational efforts and we're now actually close to that dream of like, how do we make technology actually make education better? What you guys are doing is so important and it's so exciting, but it's also really scary to a lot of people. But I think with embracing it, you start to see the real value of what's happening here. So thank you for having me. - Thank you.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- سب کو سلام۔  سال\nیہاں خان اکیڈمی سے۔ اور جیسا کہ آپ سب جانتے ہیں، میں نے تعلیم اور کام میں\n AI کے مستقبل کے بارے میں اپنی دوسری کتاب \"Brave New Words\" جاری کی ہے۔ یہ دستیاب ہے جہاں سے\nآپ اپنی کتابیں خرید سکتے ہیں، لیکن اس کتاب کی تحقیق کے حصے کے طور پر، میں نے کچھ دلچسپ لوگوں کے ساتھ کچھ انٹرویو کیے\n، جنہیں آپ دیکھنے والے ہیں۔ میں پروفیسر ایتھن مولک سے تعارف کروانے کے لیے پرجوش ہوں،\n جو یونیورسٹی آف\nپنسلوانیا کے وارٹن اسکول کے پروفیسر ہیں، جنہوں نے بزنس اسکول میں سمیولیشنز پر بھی کافی کام کیا ہے،\n لیکن میں اس سے بھی زیادہ\nمتعلقہ سمجھتا ہوں جو ہم کر رہے ہیں، آپ  پچھلے کئی مہینوں میں ایک ایسے شخص کے طور پر اپنے لیے نام پیدا کیا ہے جو\nتعلیم میں اچھے کے لیے AI کا استعمال کر رہا ہے۔ تو خوش آمدید، ایتھن۔\n- مجھے رکھنے کے لئے آپ کا شکریہ. میں یہاں آکر بہت خوش ہوں۔ - تو چلو شروع میں شروع کرتے ہیں. آپ کی پہلی\nتوجہ یا نمائش کیا تھی، خاص طور پر\nبڑے لینگویج ماڈلز جیسی چیزیں، آپ کے کچھ ابتدائی رد عمل کیا تھے اور پھر وہ کون سے\nطریقے تھے جن سے آپ نے حقیقت میں یہ محسوس کرنا شروع کیا کہ\nیہ قیمتی ہو سکتا ہے؟ - تو جیسا کہ آپ نے کہا، میں\nتعمیر کر رہا ہوں، جیسے، سوچ رہا ہوں کہ ہم نے تعلیم کو\nایک طویل عرصے سے کیسے جمہوری بنایا۔ جیسا کہ، میں\nبزنس اسکول کے نقطہ نظر سے آیا ہوں اور یہ تمام تحقیق ہے جس کی طرح، چھوٹی مقدار میں کاروباری\nتعلیم زندگیوں کو بدل دیتی ہے اور دنیا بھر میں کنٹرول شدہ مطالعات۔ اس لیے میں تھوڑی دیر\nسے اس کے بارے میں سوچ رہا ہوں اور میں ایسے\nٹولز کے ساتھ بھی کھیل رہا ہوں جو ایسا کرتے ہیں، اس لیے سیمولیشنز بنا رہے ہیں،\nبلکہ جی پی ٹی 3 سے بھی واقف تھا، جو سافٹ ویئر کا\nپری چیٹ جی پی ٹی ورژن تھا،  اس وقت کس قسم کا ایک اچھا اعلیٰ درجے کا پانچویں جماعت کا\nمضمون تھا۔ اور میں نے سوچا کہ مجھے اپنے\nطالب علموں کو اس چیز سے آگاہ کرنا چاہیے۔ اس لیے میں نے\nاس کے ساتھ دھوکہ دہی کے لیے انہیں اسائنمنٹ دینا شروع کر دیے۔ اس لیے جتنا بہترین مضمون لکھ\nسکتے ہو اسے استعمال کرتے ہوئے اور Dall-E کا استعمال کرتے ہوئے ایک تصویر بنائیں اور پھر بات کریں کہ\nدنیا کی حالت کہاں تھی۔ اور جو بات بہت ہی مضحکہ خیز تھی وہ دھوکہ دہی کے اسائنمنٹ کے آدھے راستے پر ہے،\nجب میرے آدھے طلباء نے اسے تبدیل کر دیا تھا لیکن\nباقی آدھے نے نہیں کیا، چیٹ جی پی ٹی سامنے آیا۔ لہذا\nمعیار کی سطح میں اچانک تبدیلی آئی جو\nاس عرصے کے دوران کافی ڈرامائی تھی۔ - اور تم نے کیا محسوس کیا؟\nدراصل، میں متجسس ہوں۔ میرا مطلب ہے، آپ نے کہا، \"ٹھیک ہے، آپ، تھیوری میں، آپ\nاس چیز کے ساتھ دھوکہ دے سکتے ہیں۔\" لہذا طلباء اس چیز کے ساتھ دھوکہ دیتے ہیں، اور تعریف کے مطابق یہ\nدھوکہ نہیں ہے اگر آپ کو دھوکہ دینے کو کہا جائے، لیکن کیا آپ نے کوئی فرق دیکھا؟ میرا مطلب ہے، آپ کے پاس واضح طور پر\nChat GPT، جو GPT 3.5 اور باقاعدہ GPT 3 استعمال کر رہا ہے، کے درمیان فرق تھا۔ آپ نے پہلے ہی وہاں ایک فرق دیکھا، لیکن کیا آپ نے پچھلے\nسالوں میں طالب علم کے کام سے جو کچھ دیکھا تھا اس سے کوئی فرق دیکھا؟ - ہاں، میرا مطلب ہے، ٹھیک ہے، کیا دلچسپ ہے، ہم لکھنے اور ذہانت کو ایک دوسرے کے بہت قریب ہونے کے طور پر دیکھتے ہیں، ٹھیک ہے؟ اور آپ جانتے ہیں، ان طریقوں سے جن کو\nالگ الگ کرنا مشکل ہے، ہم مضمون لکھنے کو یہ سمجھتے ہیں کہ ہم \nمضمون لکھتے وقت سوچنا سیکھتے ہیں۔ شاید یہ سچ ہے، شاید یہ نہیں ہے. ہم نے واقعی ان چیزوں کا تجربہ نہیں کیا ہے۔ یہ بہت ساری تعلیمی چیزوں کی طرح ہے، ہم اصل میں جوابات نہیں جانتے ہیں۔ اور اس طرح میں نے اپنی کلاس میں ایسے طلباء حاصل کیے ہیں جو شاندار لوگ ہیں\nلیکن اچھے مصنف نہیں ہیں۔ انگریزی ان کی تیسری\nزبان ہے یا، آپ جانتے ہیں، وہ ایک ایسے پس منظر سے آئے ہیں\nجہاں انہوں نے کبھی بھی واقعی اچھا لکھنا نہیں سیکھا۔ تو یہاں تک کہ صرف\nایک اشارہ کا تھوڑا سا ہونا، یہ گرامر کی طرح ہے، ٹھیک ہے؟ جیسے،\nان کو بہتر لکھنے میں فرق پڑا۔ اور جب میں نے\nاپنے کچھ طالب علموں کو چیٹ جی پی ٹی سے متعارف کرایا، تو وہ اس طرح ہیں، آپ جانتے ہیں، مجھے\nاب نوکری کی کال بیکس مل رہی ہیں جو میں نے پہلے نہیں کی تھیں اور مجھے وہ\nنوکری مل رہی ہے جہاں میرا انٹرویو ہے، لیکن اس لیے کہ میں\nلکھ سکتا ہوں۔  اب ٹھیک ہے، ٹھیک ہے؟ تو یہ اس بات کا حصہ ہے کہ میں نے اپنی تمام کلاسوں میں\nAI کے استعمال کو لازمی کیوں بنایا ہے۔ اس لیے میں اب ایسی کوئی بھی چیز قبول نہیں کرتا جو\nاس مرحلے پر مکمل طور پر نہیں لکھی گئی ہے۔ زحمت کیوں؟ - اور آپ کا احساس کیا ہے،\nآپ جانتے ہیں، اس کے بارے میں کسی آجر کے نقطہ\nنظر سے سوچیں جہاں میرا اندازہ ہے کہ وہ ایک سگنل استعمال کر رہے تھے، کوئی ایسا\nشخص جو واقعی فصیح کور لیٹر لکھتا ہے\nبمقابلہ جو ایسا نہیں کرتا، اور وہ اس چھوٹے سگنل کو استعمال کر رہے تھے۔ اب یہ سب فصیح ہے، لیکن ہوسکتا ہے کہ وہ شخص\nکام پر آئے اور وہ اس طرح ہوں، \"اوہ، شاید ان کی زبان کی\nمہارت اتنی مضبوط نہیں ہے جیسا کہ میں نے سوچا تھا کہ وہ اس پر مبنی ہیں...\" آپ کا نقطہ نظر کیا ہے؟ کیا وہ دھوکہ دے رہے ہیں یا یہ ٹھیک ہے؟ کیونکہ میں اچھی طرح سے لکھنا جاری رکھنے کے لیے چیٹ GPT یا جو کچھ بھی استعمال کر سکتا ہوں۔ - یہ دراصل دو واقعی\nدلچسپ سوالات ہیں۔ سب سے پہلے، آپ جانتے ہیں، مجموعی طور پر دھوکہ دہی کا یہ سوال\nایک بڑا سوال ہے، ٹھیک ہے؟ \nآج کل دھوکہ دینے کا کیا مطلب ہے، ٹھیک ہے؟ اگر میں AI سے\nمشورہ مانگتا ہوں، لیکن اسے استعمال نہ کریں۔ اگر میں آپ سے ایک پیراگراف کو پنچ کرنے کو کہوں، اگر میں اسے سب کے لیے پوچھوں، تو کیا یہ دھوکہ ہے؟ یہ سرقہ کرنے سے بہت مختلف سوال ہے،\nٹھیک ہے؟ اور پھر دوسرا\nسوال یہ ہے کہ، آپ جانتے ہیں، بہت ساری چیزیں جو اچھی ہیں کو\nAI سے نقصان پہنچے گا، لیکن بہت ساری چیزیں جو بری ہیں، ٹھیک ہے؟ پتہ چلتا ہے کہ\nکور لیٹر کی بنیاد پر لوگوں کا فیصلہ کرنا کبھی بھی\nخاص طور پر بہترین طریقہ نہیں رہا ہے، یا کالج کا مضمون داخلہ کا فیصلہ کرنے کا خاص طور پر بہترین طریقہ کبھی نہیں رہا ہے۔\n ہمارے پاس\nبڑے پیمانے پر سب سے بہترین طریقہ ہے، آپ جانتے ہیں، میٹا تجزیہ دراصل\nایک تفصیلی انٹرویو کرنا ہے جو اس بات پر مبنی ہے کہ لوگ اپنی زندگی میں اصل میں کیا حاصل کرتے ہیں، ٹھیک ہے؟ اگر تحریری مہارتیں\nاہم ہیں، تو آپ کو لوگوں کو تحریری\nامتحان دینا ہوگا جو الگ ہے۔ لیکن بہت ساری ملازمتوں کے لئے،\nیہ بنیادی مہارت نہیں ہے یا یہ اب AI کے ذریعہ کیا جائے گا۔ تو کچھ طریقوں سے، یہ دھوکہ دہی ہے، لیکن یہ\nہمیں اس بات پر دوبارہ غور کرنے پر مجبور کر رہا ہے کہ سگنلنگ کے معاملے میں اصل میں کیا قیمتی ہے۔\n بہت ساری چیزیں جو ہم کرتے ہیں، خاص طور پر\nکمرے میں انسٹرکٹر کے طور پر، یہ ظاہر کرنے کے لیے آپ کے وقت کو آگ لگانا ہے،\nٹھیک ہے؟ جیسے، اگر کسی نے مجھ سے ان کے لیے سفارشی خط لکھنے کو کہا، تو \n واقعی ایک اچھا خط لکھنے میں ایک گھنٹہ لگتا ہے۔\n میں\nاس شخص کے ریزیومے اور اس کام کو پیسٹ کر سکتا ہوں جس کے لیے وہ درخواست دے رہے ہیں اور یہ\nGPT 4 میں کیا کہتا ہے اور اس سے بہتر خط حاصل کر سکتا ہوں کہ\nمجھے لکھنے میں ایک گھنٹہ لگے گا۔ اور میں ہمیشہ اس طرح جدوجہد کر رہا ہوں کہ کیا میں تیار کردہ خط کا استعمال کرتا ہوں کیونکہ یہ میرے خیالات کی نشاندہی کرتا ہے،\nلیکن میں اب وہ وقت نہیں گزار رہا ہوں جو میں\nاس کام کو کرنے کے لیے خرچ کرنے والا تھا۔ اور مجھے لگتا ہے کہ یہ\nواقعی ایک دلچسپ چیلنج ہے۔ - مجھے آپ کا یہ جملہ پسند ہے کہ میں\nاپنے وقت کو آگ لگاتا ہوں تاکہ یہ ظاہر کیا جا سکے کہ مجھے پرواہ ہے۔ میری ماں ہمیشہ چاہتی ہے کہ میں\nاسے ہوائی اڈے سے اٹھا لوں۔ (ہنستے ہوئے) - میرے والدین بھی۔  میرے والدین\nبھی۔  (ہنستا ہے) ایک ہی چیز۔ - میں کروں گا۔  میں کروں گا۔ میں نے اپنے دن کے اس حصے کو آگ لگا دی تاکہ میں اسے دکھا سکوں کہ مجھے پرواہ ہے۔ لیکن مجھے لگتا ہے کہ آپ ٹھیک کہہ رہے ہیں،\nہم روایات سے بھرے ہوئے ہیں، جس میں شاید کور\nلیٹر اور یہ سب کچھ تقریباً محض رسمیں ہیں صرف یہ \nظاہر کرنے کے لیے کہ آپ کی پرواہ ہے۔ لیکن کیا وہ واقعی قدر میں اضافہ کرتے ہیں؟ اور یہاں تک کہ ان لوگوں کے لیے بھی جو... کچھ لوگوں کے پاس دوسرے\nلوگ ہیں جو ان کی کوچنگ کرتے ہیں، کالج کے مضامین یا ریزیومز جیسی چیزوں کے لیے ان کی مدد کرتے ہیں،\n اور یہ\n چیٹ GPT یا GPT 4 کے وسائل پر مبنی ورژن کی طرح ہے۔\n- بالکل۔ اور میرا مطلب ہے، دلچسپ چیز، اور یہی وجہ ہے کہ مجھے وہ پسند ہے جو\nآپ لوگ کر رہے ہیں، ایسا ہی ہے، ہمارے پاس اچانک اربوں ایسے\nلوگ ہیں جن کی رسائی \nاب تک عوام میں ریلیز ہونے والی واحد بہترین AI تک ہے۔ جیسے، اگر آپ امیر ہیں، تو آپ کو\nبہتر AI تک رسائی حاصل نہیں ہے اور آپ کو\nBing کے ذریعے یا ان چیزوں کے ذریعے مفت رسائی حاصل ہوتی ہے جو\nآپ لوگ کر رہے ہیں، ٹھیک ہے؟ یہ ہر جگہ دستیاب ہے۔ اور یہ تعلیم میں سب سے\nزیادہ دلچسپ چیز ہے کیونکہ ہمارے پاس\nیہ تمام رکاوٹیں تھیں۔ ایسا کرنے کی تمام پچھلی کوششیں سخت اور مشکل تھیں، ٹھیک ہے؟ تو میرے خیال میں اس\nسوال کا ایک حصہ یہ ہے کہ، آپ جانتے ہیں، یہ ایسی چیزوں کو جمہوری بناتا ہے جو ہمیں\nپہلے جمہوریت نہیں ملتی تھی۔  ایسا ہوتا تھا، آپ\nایک ٹیوٹر کی خدمات حاصل کر سکتے ہیں، آپ بہتر کریں گے۔ اب کیا ہوتا ہے جب ہمارے\nپاس ایک ٹیوٹر ہوتا ہے جسے ہر کوئی استعمال کرسکتا ہے جو دراصل\nانسانی ٹیوٹرز سے بہتر ہے؟ یہ واقعی ایک دلچسپ اور\nتھوڑا سا خوفناک امکان ہے۔ - جی آپ درست ہیں۔ یہ دلچسپ اور خوفناک دونوں ہے\nاور ہم سب کے لیے، جیسا کہ آپ جانتے ہیں، ہم خان اکیڈمی کے اندر Khanmigo پر کام کر رہے ہیں\n اور اب اسے بہت تیزی سے پھیلا رہے ہیں۔\n اور آپ اور میں\nایک دوسرے سے بہت ٹکرا رہے ہیں کیونکہ ایسا لگتا ہے کہ ہم ایک\nساتھ بہت زیادہ بولنے والے ڈاکیٹ پر ہیں۔ جیسے، خان اکیڈمی یہی کر رہی ہے، اور اس پروفیسر کو دیکھو\nجو AI استعمال کرنے سے نہیں ڈرتا۔ تو آئیے اپنا سفر جاری رکھیں کیونکہ آپ نے ان ابتدائی دنوں کے بارے میں بات کی تھی، آپ نے بچوں کو مصنوعی ذہانت کا استعمال کرتے ہوئے \"دھوکہ\" کا حوالہ دینے کی ترغیب دی تھی، لیکن یہ ایک طرح سے بہتر نتائج کی طرف لے جانے والا تھا۔\n لیکن کیا آپ نے\nاسائنمنٹس کو تبدیل کیا ہے؟  کیا آپ نے اپنی حد کو تبدیل کیا ہے جو ایک اچھی اسائنمنٹ بناتی ہے؟ - ہاں، تو میرا مطلب ہے،\nبنیادی طور پر تین چیزیں ہیں جو مجھے AI کے نتیجے میں کرنی پڑی ہیں۔ تو لیول ون، اور مجھے لگتا ہے کہ سب کو ان مسائل کا سامنا کرنا پڑے گا، ٹھیک ہے؟ لیول ون صرف\nطلباء سے زیادہ کی توقع کر رہا ہے، ٹھیک ہے؟ تو سب سے پہلی چیز جو ہم سب کو\nکرنی ہے وہ ہے، تو آپ جانتے ہیں، میں ایک انٹرپرینیورشپ\nکلاس پڑھاتا ہوں اور آپ جانتے ہیں، دوبارہ، میں جانتا ہوں کہ سننے والے لوگ ہیں جو سکھاتے ہیں، آپ جانتے ہیں، بنیادی تحریری مہارتیں۔ آپ کو\nمختلف طریقوں سے ایڈجسٹ کرنا پڑے گا۔ یہ\nہر شخص کے لیے مختلف ہوگا۔ کچھ لوگ، یہ\nسب کچھ کلاس میں لکھنے کے اسائنمنٹس کے بارے میں ہوگا\nتاکہ لوگ لکھنا سیکھیں کیونکہ وہ\nکلاس کے باہر دھوکہ دہی کریں گے۔ میں سمجھتا ہوں، تو یہ کوئی\nآفاقی چیز نہیں ہے، لیکن یہ یقینی طور پر میرا معاملہ ہے۔ مجھے مزید توقع ہے۔ لہذا لوگوں کو\nایک کاروباری منصوبہ کی طرح تبدیل کرنا پڑتا تھا۔ اب انہیں ایک\nکاروباری منصوبہ، ورکنگ کوڈ میں تبدیل کرنا ہوگا، چاہے وہ پہلے کبھی کوڈ نہ کرسکیں۔ میں اب کوڈ کرتا ہوں۔ میں کوڈ نہیں کر سکتا، لیکن میں نے پچھلے دو ہفتوں میں\n12 ازگر کے پروگرام لکھے ہیں ، ٹھیک ہے؟ آپ کو\nمعلوم ہے کہ ایک مکمل طور پر کام کرنے والا ویب صفحہ داخل کرنا ہوگا۔ آپ کو AI کے ساتھ اصلی اور جعلی دونوں لوگوں کا انٹرویو کرنا ہوگا \nاور کچھ ڈیٹا ہے جس سے آپ AI کا سروے کر سکتے ہیں\nاور یہ حقیقت میں درست ہے۔ اس لیے کام سے میری توقعات اب پہلے سے کہیں زیادہ ہیں۔ تو یہ\nپہلی ایڈجسٹمنٹ کی طرح ہے، ٹھیک ہے؟ ایڈجسٹمنٹ کا دوسرا سیٹ یہ ہے کہ اب میں نے AI کو\nاسائنمنٹس میں ضم کر دیا ہے۔ لہذا AI میرے طلباء کے لئے ایک ساتھی ہے۔ لہذا اب انہیں اصل میں\nAI لانا پڑے گا، آپ جانتے ہیں، اسائنمنٹس ہیں۔ مثال کے طور پر، ان کی ہر اسائنمنٹ پر کم \nاز کم تین مشہور دیگر کاروباریوں کے ذریعہ تنقید کی جانی چاہئے، جو\nانہیں پیدا کرنا ہے۔ لہذا وہ راستے میں رائے حاصل کرتے ہیں. اور پھر تیسری چیز،\nجو کہ واقعی بڑی چیز ہے یہ تبدیل کر رہی ہے کہ ہم کلاس روم کیسے کرتے ہیں۔ لیکچرز اس وقت زیادہ\nمعنی نہیں رکھتے جب میرے پاس خانمیگو جیسے ٹولز ہوں جو\nواقعی حیرت انگیز تربیت کر سکتے ہیں، آپ جانتے ہیں، دور سے۔ تو سوچیں کہ ہم\nکلاس روم کو اس طرح کیسے پلٹ سکتے ہیں۔ - ہاں، نہیں، ٹھیک ہے، میرا مطلب ہے، وہاں بہت کچھ ہے۔\n میرا مطلب ہے، مجھے دلچسپ معلوم ہوا، آپ کا... تو طلباء اس\nطرح لکھیں گے، جیسا کہ بزنس پلان یا کسی اور چیز کے لیے ایک ایگزیکٹو سمری، اور پھر اس طرح پوچھیں گے جیسے، اسٹیو جابز\nیا کسی مشہور کاروباری سے، آپ جانتے ہیں، فورڈ یا کوئی،\nیا ٹیسلا  کسی کو... یا میرا اندازہ ہے کہ ایلون مسک\nاپنے کاروباری منصوبے پر غور کریں گے اور یہ اب اسائنمنٹ کا حصہ ہے؟ - جی ہاں.  ان کے پاس ہونا ضروری ہے... تو صرف اپنے\nخاکہ کو اکیلے تبدیل کرنے کے لیے، جو کچھ ایسا ہوا کرتا تھا جس پر میں صرف تبصرہ کروں گا، انہیں\n اپنے منصوبے پر تین مشہور کاروباریوں کا تبصرہ کرنا ہوگا، ٹھیک ہے؟ اور یہ\nاشارے لکھنے کے بارے میں بھی تھوڑا سا سکھاتا ہے، لیکن ان چیزوں کی حدود،\nوہ حقیقت میں \nاسٹیو جابس کے جذبے کی دعوت نہیں دے رہے ہیں، ٹھیک ہے؟  اس کے بجائے، انہیں احساس کرنا ہوگا، آپ جانتے ہیں، اس سے انہیں اس نئی دنیا کے بارے میں سوچنے میں مدد ملتی ہے جس\nمیں ہم ہیں۔ اور پھر انہیں پری مارٹم بھی کرنا ہوگا۔ لہذا منصوبے\nبہتر طور پر کامیاب ہوتے ہیں جب آپ حقیقت میں تصور کرتے ہیں کہ وہ کیسے ناکام ہو سکتے ہیں۔ لہذا انہیں اس کے نتیجے میں ناکامی کے مواقع کا ایک پورا گروپ پیدا کرنا ہوگا۔ \n ان کو حل کرنے کے طریقے پر پیچھے کی طرف کام کریں۔ لہذا یہ مجھے مختلف چیزیں کرنے دیتا ہے\nجو ہم تحقیق سے جانتے ہیں کہ ٹیمیں بہتر کام کرتی ہیں، لوگوں کو بہتر کام کرتی ہیں۔ لیکن ہم اس سے پہلے نہیں کر سکے کیونکہ\nیہ بہت زیادہ کام تھا۔ - اور یہ بہت طاقتور ہے. اور آپ جانتے ہیں، جو آپ بھی کر رہے ہیں، ایسا لگتا ہے کہ\nواضح طور پر یا واضح طور پر، کیا آپ انہیں صرف\n ان ٹولز اور\nان کے پاس موجود طاقت سے قریب سے واقف کر رہے ہیں۔ 'اس کی وجہ یہ ہے کہ آپ جو سب سے برا کام کر سکتے ہیں وہ یہ ہے کہ یہ طلباء ایک بلبلے میں ہیں\nاور پھر وہ ایک یا دو سال میں افرادی قوت میں آتے ہیں اور وہ اس طرح ہیں، \"رکو، ابھی کیا\nہوا؟ اب ہر کوئی GPT 5 استعمال کر رہا ہے،\" یا کچھ بھی۔  . لیکن وہ اس میں رہنمائی کرنے کے قابل ہوں گے۔ اور ایک\nپلٹائے گئے کلاس روم کے بارے میں آپ کی بات، آپ جانتے ہیں، جیسا کہ آپ جانتے ہیں، میں آن ڈیمانڈ ویڈیو کی\nدنیا میں بھی پری AI کے بارے میں بات کر رہا ہوں، ایمانداری سے، یہاں تک کہ ڈیمانڈ سے پہلے کی\nویڈیو، ہیومینٹیز کی کلاسز، یہاں تک کہ\nبزنس اسکول۔  کلاسز کیس پڑھتے ہیں، اسکول آتے ہیں،\nاور ہم اس پر بات کرنے والے ہیں۔ میرے خیال میں یہ ہمیشہ سے\nایک بہترین عمل رہا ہے۔  اس سے بھی زیادہ ایک AI دنیا میں۔ یہ کہاں جا رہا ہے؟ آپ جانتے ہیں، کیا آپ\nاپنے کورسز کو تیار کرنا جاری رکھے ہوئے ہیں؟ مجھے یقین ہے کہ ہر قسم کے\nفیکلٹی ممبران آپ کے پاس آ رہے ہیں اور کہہ رہے ہیں، \"میں کیا کروں؟\" آپ انہیں کیا کہہ رہے ہیں؟ - میرا مطلب ہے، تو ایک چیز\nہم کر رہے ہیں، آپ جانتے ہیں، ہم اشارے بانٹ رہے ہیں، ٹھیک ہے؟ جیسے، میرے نزدیک، یہ سب سے\nاہم چیز ہے۔ تو میرے پاس ایک دو کاغذات ہیں، اور مجھے یقین ہے کہ ہم\nلوگوں کے لیے کہیں لنکس رکھ سکتے ہیں، لیکن جہاں ہم کسی قسم کے تدریسی طریقہ اختیار کرنے کی کوشش کر رہے ہیں، ٹھیک ہے؟ اشارہ کرنا جادوئی ہے، لیکن\nاس سے آپ کو مہارت حاصل کرنے میں مدد ملتی ہے۔ لہذا ہم نے کچھ اشارے لکھے ہیں جو مختلف چیزیں کرتے ہیں\nجیسے وضاحتی تشبیہات، کچھ چیزیں جو آپ خانمیگو میں کرتے ہیں، لیکن یہ\nبہت سے کلاس رومز پر لاگو ہو سکتا ہے۔ آپ جانتے ہیں، اساتذہ کی مدد کے لیے ٹولز موجود ہیں۔ تو میں یہ جاننے کی کوشش کر رہا ہوں کہ\nڈیموکریٹائزیشن کا مشن جو آپ لوگوں کے پاس ہے\nوہی ہے جس کے بارے میں میں سوچ رہا ہوں۔ ہم اساتذہ کو اوزار کیسے دیتے ہیں؟ ہم طلباء کو اوزار کیسے دیتے ہیں؟ آپ جانتے ہیں،\nAI کا وعدہ یہ ہے کہ اچانک، آپ جانتے ہیں، وہ چیز جو ہم نے سوچی تھی\nکہ انٹرنیٹ کرے گا، اگر ہم سب کو\nمعلومات تک رسائی دیں گے۔ ہر کوئی سب کچھ سیکھے گا۔ پتہ چلتا ہے کہ لوگوں کا ایک بہت ہی چھوٹا مجموعہ\nواقعی تعمیری سیکھنے والے ہیں\nجنہیں مدد کی ضرورت نہیں ہے اور وہ خود ہی سیکھ سکتے ہیں۔ لیکن اب ہمارے پاس ایک ایسا ٹول ہے\nجو درحقیقت سپورٹ فراہم کر سکتا ہے، ٹیوشن،\nکچھ دیگر مواد جو ہم جانتے ہیں کہ کام کرتا ہے اور اسے پیمانے پر کرتا ہے۔ اور میں نے آپ کو بلوم کے 2 سگما کے بارے میں بات کرتے ہوئے سنا ہے۔ میرا مطلب ہے، ہم یہ بھی نہیں\nجانتے کہ یہ اس وقت کتنا اچھا کام کرتا ہے، لیکن ہم\nاس سے پہلے نہیں کر سکتے تھے۔ اور بالکل آپ کی طرح، میں نے\nبڑے پیمانے پر کام کیا ہے، آپ جانتے ہیں، آپ کے پیمانے کے قریب کہیں بھی نہیں، لیکن میں نے پسند کیا ہے، آپ جانتے ہیں،\nچند لاکھ لوگ میرے آن لائن ویڈیو کورسز کرتے ہیں۔ آپ جانتے ہیں،\nاس میں اور درحقیقت\nورزش کرنے اور رائے حاصل کرنے میں بڑا فرق ہے۔ لہذا ہم ان تمام ٹکڑوں کے بارے میں سوچنے کی کوشش کر رہے ہیں۔\n - اور آپ فیکلٹی کو کیا کہہ رہے ہیں؟ کیونکہ مجھے کوئی شک نہیں ہے، میرا مطلب ہے، آپ پہلے ہی نہ صرف\nاس پر کامیابی سے تشریف لے رہے ہیں، بلکہ آپ ایک تخلیقی AI دنیا میں ترقی کر رہے ہیں۔ آپ اسے تعلیم کے لیے کام کر رہے ہیں۔ میں آپ کے کاموں سے ملتی جلتی پر امید محسوس کرتا ہوں، لیکن میرا اندازہ ہے، اور آپ\nجانتے ہیں، ابھی 90 فیصد اساتذہ\nایک جیسے دماغ میں نہیں ہیں۔ وہ ایک طرح سے گھبرا رہے ہیں۔ آپ جانتے ہیں، مان لیں کہ آپ\nفریش مین کمپوزیشن لکھ رہے تھے، آپ کو بس اتنا ہی کرنا تھا۔ جیسے، آپ کا پورا کام اس بات کو\nیقینی بنانا ہے کہ طلباء لکھنا سیکھ رہے ہیں اور\nآپ ان کا جائزہ لے رہے ہیں۔ آپ اس طرح کے اساتذہ کو کیا کہیں گے جو کچھ زیادہ ہی\nخوفزدہ ہیں کہ چیٹ جی پی ٹی جیسی چیزیں \nان کے تدریسی انداز میں بم کی طرح چل پڑیں؟ - میرا مطلب ہے، مجھے لگتا ہے کہ ہمیں\nبری خبر کے ساتھ شروع کرنے کی ضرورت ہے۔ یہ بالکل کیا، ٹھیک ہے؟ میرا مطلب ہے، ابھی بہت ساری چیزیں اڑا دی گئیں اور اس میں سے کچھ اچھی چیزیں تھیں، ٹھیک ہے؟ میرا مطلب ہے، ایسے طریقے ہیں جن کو ہم\n2000 سالوں سے سکھا رہے ہیں جس نے بہت معنی خیز بنا دیا۔ ہوسکتا ہے کہ وہ واقعی تحقیقی حمایت یافتہ نہیں تھے، لیکن ہم ان میں بہت اچھے ہیں، ٹھیک ہے؟ ہم نے لیکچرز میں اچھی کارکردگی کا مظاہرہ کیا ہے، ہم نے گھر پر\nمضمون کے اسائنمنٹس کرنے اور ان کا جائزہ لینے میں اچھی کارکردگی کا مظاہرہ کیا ہے۔ ہم اس چیز میں اچھے تھے۔\nیہ اڑا دیا گیا ہے، ٹھیک ہے؟ میرا مطلب ہے، یہاں تک کہ آپ کے بہترین\nطلبہ کے لیے، آپ کے طلبہ جو دھوکہ نہیں دیں گے۔ ویسے تو طالب علم\nہمیشہ سے دھوکہ دیتے رہے ہیں نا؟ لیکن دھوکہ دہی\nبہت آسان اور سستی ہوگئی۔ لیکن اس وقت بھی، آپ کے بہترین طلباء پسماندہ ہیں 'کیونکہ\nوہ دھوکہ نہیں دے رہے ہیں، ٹھیک ہے؟ کیونکہ، آپ جانتے ہیں، وہ\nاسی طرح نہیں لکھ رہے ہیں۔ تو یہ بہت اڑا دیتا ہے، لیکن اگر آپ ایک\nتازہ ترین کمپوزیشن کلاس پڑھا رہے ہیں، تو آپ کو اپنے پڑھانے کا طریقہ بدلنا ہوگا۔ یہ AI ناقابل شناخت ہے۔ جو بھی آپ کو دوسری صورت میں بتا رہا ہے وہ درحقیقت آپ کو سچ نہیں کہہ رہا ہے۔ یہ بنیادی طور پر ناقابل شناخت ہے۔ \nدھوکہ دہی کرنے والے اپنے طالب علموں سے جو چیزیں میں نے سیکھی ہیں ان میں سے ایک یہ ہے کہ کچھ چکر لگانے کے بعد، آپ جانتے ہیں، AI کے ساتھ آگے پیچھے،\nجو اس کے ساتھ تعامل کرنے کا بہترین طریقہ ہے، آپ\nجانتے ہیں، بس ایک پرامپٹ ڈالیں، آپ ترتیب دیں  اس کے ساتھ مشغول ہونا. مضامین\nانسانوں اور کسی بھی AI ٹیوٹر دونوں کے ذریعہ ناقابل شناخت ہیں۔ اس نے اڑا دیا جو تم نے کیا۔ لہذا آپ کو ایک موقع کے طور پر سوچنا ہوگا، لیکن ساتھ ہی، یہ خوفناک بھی ہے، اور ہم\nبطور معلمین اسے تسلیم کر سکتے ہیں۔ ہمیں یہ سمجھنا چاہیے کہ\nتعلیم ٹھیک ہو جائے گی۔ ہم اس تبدیلی کو اپنا لیں گے، ٹھیک ہے؟ یہ کیلکولیٹروں سے بڑا ہے،\nلیکن \nریاضی کی کلاسوں میں کیلکولیٹروں کو ہونے والے تنگ نقصان سے مختلف نہیں۔ ایک انسٹرکٹر کے طور پر، آپ\nشاید \nکلاس کے باہر ویڈیوز اور دیگر چیزوں کے ساتھ مزید ہدایات حاصل کرنا چاہتے ہیں،\nکلاس میں ایک دوسرے پر تنقید کرنے\nاور مختصر مضامین لکھنے کے ساتھ زیادہ فعال تحریری اسائنمنٹس اور آپ یہ کام کر سکتے ہیں۔ لیکن یہ بالکل ایک بڑی تبدیلی ہے۔ لیکن یہ نئی چیزیں کرنے اور یہ جاننے کا موقع ہے کہ آپ کے لیے کیا کام کرتا ہے۔ اور اس کے علاوہ، جس چیز پر میں\nانسٹرکٹرز پر زور دینا چاہتا ہوں وہ یہ ہے کہ یہ آپ کی زندگی کو بھی\nبہت سے طریقوں سے آسان بناتا ہے۔ جیسے، بہت ساری\nچیزیں ہیں جو ہماری خواہش ہے کہ ہم وہ کر سکتے جو ہمارے پاس کرنے کا وقت نہیں تھا۔ اور ایک بار پھر، ہمیں اس سب کے لیے اشارے ملے ہیں۔ یہ آپ کے لیے زبردست کوئز لکھتا ہے۔ میں جانتا ہوں کہ آپ لوگوں کے پاس\nیہ کام کرنے کے لیے رہنما بھی ہیں۔ یہ بطور انسٹرکٹر آپ کی مدد کرتا ہے۔ لہذا یہ صرف آپ کے کام کا بوجھ بڑھانا اور آپ کی زندگی کو مشکل نہیں بنا رہا ہے، بلکہ یہ\nآپ کے کام کا بوجھ بھی کم کر رہا ہے اور آپ کو\n تعلیم کے بارے میں مزید سوچنے کے لیے اور\nطلبہ کی زندگیوں کو کیسے بدلنا ہے، اسی لیے ہم سب\nاس میں سب سے پہلے ہیں۔  جگہ - نہیں، میں تصور کر سکتا ہوں. میرے خیال میں، آپ نے\nاپنے جواب میں کچھ بہت اچھے نکات پھینک دیے ہیں، جو یہ ہے کہ، اگر میں\nکسی یونیورسٹی میں تازہ ترین انگلش کمپ کو پڑھا رہا ہوں یا اگر میں\n کسی ہائی اسکول میں انگلش کمپ کی کلاس پڑھا رہا ہوں، جس دنیا میں\nہم جا رہے ہیں۔  میں بہت معقول ہو سکتا ہے، ٹھیک ہے، میرے\nپاس آپ کو ایک وقت میں ایک گھنٹہ، ڈیڑھ گھنٹے کے لیے ہے۔ لکھیں، اور ہو سکتا ہے کہ آپ\nAI کے ساتھ لکھ رہے ہوں، یہ آپ کے لیے نہیں لکھ رہا ہے، لیکن\nیہ کام کر رہا ہے تاکہ یہ کچھ سوالات کے جوابات دینے میں مدد کر سکے، وغیرہ۔ لیکن پھر یہ اندازہ کر سکتا ہے، یہ میرے لیے گریڈنگ کا پہلا پاس کر سکتا ہے۔ اور اس طرح آپ کے طلباء کو\nحقیقت میں اس دنیا میں لکھنے کا زیادہ وقت اور زیادہ\nفیڈ بیک ملے گا۔ اور ہاں، شاید ان کے پاس\nگھر میں کام کرنے کو کم ہے۔  یہ اچھی بات ہے۔ سب کے پاس گھر میں کام کم ہے۔ آپ کو گھر میں کم کرنا ہے۔\nآپ گریڈنگ نہیں کر رہے ہیں، آپ کو معلوم ہے، آپ کے 80ویں مضمون کی طرح،\nآپ کو معلوم ہے، کچھ ایسی چیز ہے جو آپ کو معلوم ہے، شاید\nاس وقت آپ کا دماغ بے حس ہو جائے گا اور طالب علم بھی ایسا نہیں کرتے ہیں۔ اس رات میں سب کچھ ہو سکتا ہے اور یہ سب کے لیے کارآمد ہے۔ تو ہاں، یہ ایک ٹن معنی رکھتا ہے۔ - ہاں، اور مجھے لگتا ہے کہ، آپ جانتے ہیں، کہ اس کو قبول کرنا\nضروری ہے اور یہ ٹھیک ہے کہ\nجب آپ یہ سنتے ہیں تو ڈرنا اور اس طرح ہونا، \"اوہ نہیں، میں اسے تبدیل نہیں کرنا چاہتا جو میں رہا ہوں۔  کر رہے ہیں۔\" لیکن ہم بہت سارے طریقوں کو بھی پہچانتے ہیں جن سے\nہم لوگوں کو مضامین لکھنے کا مطلب نہیں رکھتے تھے۔ جیسے، وہ لوگ جو\nکلاس میں بہت اچھے نہیں تھے، ٹھیک ہے؟ انہوں نے کلاس کے باہر خراب مضامین لکھے۔ \nان کو بہتر بنانے کے لیے ہمیں ان کو ٹیوٹر کرنے میں کتنا وقت ہے؟ ٹھیک ہے، ایک طرح سے پلٹائے گئے کلاس روم میں، فعال سیکھنے کے ماحول میں،\nاور فعال سیکھنا پلٹائے ہوئے کلاس روم سے زیادہ اہم ہے، یہ\n خیال کہ ہم کلاس میں کام کر رہے ہیں، شاید اس ٹیوٹر کے لیے زیادہ وقت ہو۔ ہو سکتا ہے کہ AI ان کو پکڑنے میں مدد کر سکے یا انہیں ایک\nوضاحت دے سکے جہاں وہ ایک ایسے انسٹرکٹر ہونے کے مخالف تھے\nجو 80 مضامین کی درجہ بندی کر رہا ہے جیسا کہ آپ نے کہا، ہو سکتا ہے کہ آپ کے پاس\nAI آپ کو اس جوڑے کو جھنڈا لگانے میں مدد کرے گا جسے سب سے زیادہ مدد کی ضرورت ہے یا جوڑے کو  عظیم مثالیں ہیں. آپ جانتے ہیں، اور اس طرح رائے دیں۔ ہمارے پاس ابھی تک تمام جوابات نہیں ہیں، ٹھیک ہے؟ لہذا ہم ایک تحقیقی ماحول میں ہیں، لیکن ہم یہ دکھاوا نہیں کر سکتے کہ\nدنیا تبدیل نہیں ہوئی۔ یہ ان چیزوں میں سے ایک نہیں ہے،\nجیسے ایک دن کی ویڈیو کلاسز، آپ\nبڑے آن لائن کورسز کے بارے میں کیا کرنے والے ہیں؟ اس کے لیے بہت دیر ہو چکی ہے۔ جیسے، یہ اب یہاں ہے اور\nچاہے ہم اسے پسند کریں یا نہ کریں، ہمیں بطور انسٹرکٹر ایڈجسٹ کرنا ہوگا۔ - اور آپ کے خیال میں یہ کہاں ہے؟ کیونکہ جیسا کہ آپ جانتے ہیں، ہم\nبڑے زبان کے ماڈلز کے بارے میں بات کر رہے ہیں، آپ نے Dall-E کا ذکر کیا، جو کہ\nتخلیقی تصاویر کے بارے میں ہے۔ \nویڈیو، ڈیجنریٹیو ویڈیو، اسپیچ ٹو ٹیکسٹ، ٹیکسٹ ٹو اسپیچ کے ارد گرد ٹیکنالوجیز موجود ہیں۔ میں نے کچھ ڈیمو دیکھے ہیں، آپ جانتے ہیں کہ،\nتقریر سے متن اور متن سے تقریر جیسی چیزیں\nکچھ عرصے سے موجود ہیں، لیکن میں نے\nحال ہی میں کچھ متن سے تقریر کے کچھ ڈیمو دیکھے ہیں جو واقعی\nقابل فہم نہیں ہیں۔  اصل سے، آپ جانتے ہیں، کہ انسان اتنا بولتا ہے، جو\n وسیع تر دنیا میں گہری جعلی اور ان سب کے ساتھ مسائل پیدا کرنے والا ہے۔ لیکن آپ کے خیال میں یہ کہاں جا رہا ہے؟ میرے خیال میں ہم جیسے لوگوں کے لیے بھی، ہر ہفتے نئی چیزیں ہو رہی ہیں۔ آپ کے خیال میں یہ سب کچھ دو تین سالوں میں کیا نظر آئے گا؟ اور آپ\nہر چیز پر کیسے نظر رکھے ہوئے ہیں؟ - تو وہاں ایک دو چیزیں، ٹھیک ہے؟ ایک، ہر ایک کو یہ تسلیم کرنا ہوگا کہ AI، جنریٹو AI وہ ہے جسے\nعام مقصد کی ٹیکنالوجی کہا جاتا ہے۔ اور، آپ جانتے ہیں، میں\nکاروباری جدت طرازی سکھاتا ہوں۔ جدت طرازی کے مطالعے میں،\nعام مقصد کی ٹیکنالوجیز بہت کم ہی آتی ہیں۔ وہ ایک بار آتے ہیں،\nآپ جانتے ہیں، ہر ایک یا دو نسل، سوچتے ہیں کہ بھاپ کی\nطاقت، شاید انٹرنیٹ، شاید کمپیوٹر، لیکن وہ\nزندگی کے ہر پہلو کو متاثر کرتے ہیں۔ اور یہ سب سے تیز رفتار ہے جو\nہم نے کبھی دیکھا ہے۔  سب سے تیز گود لینا۔ یہ سب سے زیادہ ذاتی ہے۔\nلوگ کام کر سکتے تھے۔ یہ ہر\nصنعت کو مختلف طریقے سے، ہر شخص کو مختلف،\nہر کام کو مختلف طریقے سے متاثر کرے گا۔ لیکن یہ ہر چیز کو متاثر کرے گا، ٹھیک ہے؟  ہمارے پاس ابتدائی مطالعات کے \nمطابق AI سے کم سے کم متاثر ہونے والا کام چھت بنانا ہے۔ اور میں نے\nچھت والوں کے ایک جوڑے سے بات کی ہے جیسے، \"اوہ نہیں، اصل میں\nچھت بھی بدلنے والی ہے کیونکہ اب ہم اپنی تمام تجاویز اور چیزیں AI کی مدد سے کر سکتے ہیں۔\" تو یہ چھت کو بھی بدلنے والا ہے۔ لہذا ہمیں یہ تسلیم کرنا چاہئے\nکہ دنیا ان طریقوں سے بدل رہی ہے جو ہم ہمیشہ نہیں جانتے ہیں۔ لہذا آپ کو\nبطور انسٹرکٹر جس چیز کے بارے میں سوچنا چاہئے وہ لوگوں کو\nتیز رفتار موافقت کے ساتھ دنیا میں رہنے کے لئے تیار کر رہا ہے۔ لہذا ہم جتنا زیادہ AI کا استعمال شروع کریں گے اور اس کے استعمال سے واقف ہوں گے،\n لوگوں کے لیے\nآگے آنے والی چیزوں کے مطابق ڈھالنا اتنا ہی آسان ہوگا۔ کیونکہ مجھے لگتا ہے جیسے آپ جانتے ہیں، آپ اور میں دونوں،\nجی پی ٹی 4 کا یہ لمحہ ہے جہاں ایسا ہے، \"اوہ میرے خدا، یہ واقعی\nبہت کچھ کرتا ہے جو لوگ کرتے ہیں۔\" یہ لوگوں کی طرح سوچتا ہے۔  جیسے،\nیہ واقعی سافٹ ویئر نہیں ہے۔ یہ اس کے بارے میں سوچنے کے قابل ہے\nجیسے یہ ایک شخص ہے۔ یہ ایک شخص نہیں ہے، لیکن آپ\nاسے ایک شخص کی طرح سوچ سکتے ہیں۔ یہ مددگار ہو سکتا ہے۔ اور پھر سوال یہ ہے:\nآگے کیا ہے؟  ہم نہیں جانتے۔  کیا یہ بہتر ہوتا رہتا ہے؟  کیا یہ جہاں ہے وہیں رہتا ہے؟ میرے پاس اس کا جواب نہیں ہے،\nلیکن ہمیں تیار رہنا ہوگا اور ایسا کرنے کا بہترین طریقہ یہ ہے کہ\nاس کا استعمال شروع کریں۔ - ٹھیک ہے، آپ جانتے ہیں، ایک\nبزنس اسکول کے پروفیسر کے طور پر، اور میرا مطلب ہے، آپ نے ابھی اس پر ہاتھ ڈالا، دنیا تیزی سے آگے بڑھ رہی ہے\nاور تیز تر اور تیز تر۔ کیا مشورہ ہے، مجھے یقین ہے کہ ہمارے\nطلباء آپ سے پوچھ رہے ہیں یا والدین۔ جیسے، میرے بچوں کو کیا کام کرنا چاہیے؟ جیسے، انہیں کون سی مہارتیں\nتیار کرنی چاہئیں اور کون سی نہیں، شاید، اتنی اہم ہیں\nجتنی کہ وہ پہلے تھیں۔ - تو مجھے لگتا ہے کہ سوچنا\nاب بھی اہمیت رکھتا ہے، ٹھیک ہے؟ لہذا بہت سارے لوگوں نے کیوں سکھایا\nکہ لکھنا ضروری ہے، مضامین لکھنا سوچ رہا تھا، مجھے\nلگتا ہے کہ یہ اب بھی بہت سچ ہے۔ ہمیں لوگوں کو سوچنے کا طریقہ سکھانے کی ضرورت ہے۔ مجھے لگتا ہے کہ ابھی اور امید ہے کہ\nمستقبل قریب کے لیے، AI بہت اچھا ہے۔ اگر آپ بہت ساری مختلف کیٹیگریز کے نچلے 50% میں تھے، تو \nآپ اب 50ویں یا 60ویں یا 70ویں پرسنٹائل پر ہیں۔ یہ دلچسپ ہے۔ یہ ان لوگوں کے لئے مواقع کو بڑھاتا ہے\nجنہوں نے پہلے کیا تھا، ٹھیک ہے؟ آپ پہلے نہیں لکھ سکتے تھے،\nاب کر سکتے ہیں۔ آپ پروگرامنگ میں اچھے نہیں تھے، اب آپ ایک ٹھیک پروگرامر ہیں۔ جیسے، یہ دلچسپ ہے۔ میرے خیال میں سوال یہ ہے کہ\nآپ کس چیز میں اچھے ہیں، آپ کو کیا پسند ہے کہ\nآپ سب سے اوپر کے 10% لوگوں میں شامل ہو سکتے ہیں؟ اور مجھے لگتا ہے کہ یہ وہ\nچیز ہے جہاں آپ AI کی دنیا میں بہت زیادہ قدر کا اضافہ کر سکتے ہیں۔ تو میرے خیال میں اس کا ایک حصہ اس\nبارے میں سوچنے کے بارے میں ہے کہ آپ کیا کرنا چاہتے ہیں، یہ کہ آپ\nجانتے ہیں، آپ میں ٹیلنٹ ہے اور آپ اس ٹیلنٹ اور اس مہارت کو کیسے فروغ دیتے ہیں اور اس کے لیے آپ کو \nاسکول کا بنیادی علم سیکھنے کی ضرورت ہے۔ آپ بنیادی علم کی تعمیر سے مہارت پیدا کرتے ہیں،\nٹھیک ہے؟ آپ جانتے ہیں کہ بہت ساری مثالیں دیکھ کر، وہاں جانے کے لیے AI کے ساتھ کام کرنا، اور مجھے لگتا ہے کہ یہ آپ کو\nواقعی ایک دلچسپ مقام تک پہنچا سکتا ہے۔ - میں اسے صرف\nکچھ ٹھوس مثالیں بناؤں گا۔ جیسے کہ اگر کوئی کہے، \"میرا\nخواب چھت بننا ہے،\" تو آپ اس طرح ہوں گے، \"بہت اچھا، یہ مستقبل\nمیں بہت اچھا کام ہو گا کیونکہ آپ\nمزید چھت سازی کرنے کے قابل ہو جائیں گے اور AI\nآپ کی تجاویز لکھنے والا ہے۔  آپ کے لیے۔\" لیکن اگر کوئی آپ کے پاس آیا اور کہے، \"میں کاپی رائٹ ایڈیٹر بننا چاہتا ہوں،\" یا، \"میں چاہتا ہوں...\" کیا آپ بھی یہی جواب دیں گے؟ بس، آپ جانتے ہیں،\nاس میں واقعی اچھا ہو جاؤ حالانکہ GTP 4 پہلے ہی اس میں کافی اچھا ہے؟ - تو یہ شرط ہے، ٹھیک ہے؟ ہم نہیں جانتے کہ\nیہ نظام کتنا بہتر ہونے والا ہے ، ٹھیک ہے؟ اور مجھے لگتا ہے کہ رکاوٹ ہے۔ ہم، ابتدائی\nکنٹرول شدہ مطالعات میں، بہت سے اعلیٰ طاقت والے وائٹ\nکالر تجزیاتی کاموں میں 30 سے ​​80 فیصد کارکردگی میں بہتری دیکھ رہے ہیں، ٹھیک ہے؟ تحریر پر مبنی کام، تجزیہ کے کام، مشاورتی کام، پروگرامنگ کے کام۔ لہذا اگر آپ ان شعبوں میں رہنا چاہتے ہیں تو، AI آپ کی زندگی کا حصہ بننے والا ہے۔ لہذا آپ کو یہ معلوم کرنے کی ضرورت ہے کہ\nاگر آپ 10 گنا زیادہ پیداواری ہونے کے لیے AI کا استعمال کر سکتے ہیں، تو \nآپ میں بہت بڑی قدر ہوگی۔ \nلوپ میں اب بھی ایک انسان کی ضرورت ہے۔ اگر آپ یہ نہیں جان سکتے کہ زیادہ پیداواری حاصل کرنے کے لیے AI کا استعمال کیسے کیا جائے، تو میں\nان جگہوں پر زیادہ گھبرا جاؤں گا۔ آپ جانتے ہیں، میں سوچتا ہوں کہ کن\nصنعتوں میں جانا ہے، میرا مطلب ہے، منصفانہ ہونے کے لیے، لوگ یہ\nپیشین گوئی کر رہے ہیں کہ ریڈیولوجسٹ \nپچھلے 15 سالوں سے AI کے ذریعے متروک ہو جائیں گے، کہہ رہے ہیں کہ ریڈیولوجسٹ مت بنو۔ \nریڈیولوجسٹ کے لیے ابھی بھی بہت ساری نوکریاں باقی ہیں۔ تو شرط لگانا مشکل ہے۔ میں کیریئر کی بڑی شرطیں نہیں لگاؤں گا۔ لیکن میں یہ کہوں گا کہ\nآپ کا کام جتنا زیادہ لکھنے پر مبنی ہے اور یہ اتنا ہی معمول ہے، اگر آپ افسانہ\nنگار ہیں، AI اب بھی نہیں کر سکتا، یا مزاح نگار، AI اب بھی\nاچھا لطیفہ نہیں لکھ سکتا۔ یہ ویسے بھی مشکل کام ہیں۔\nلیکن آپ جانتے ہیں، وہ جگہیں ہیں۔ لیکن اگر آپ کاپی رائٹنگ کرنے کی کوشش کر رہے ہیں، میرے خیال میں، جب تک آپ\nAI کو استعمال کرنے کا کوئی طریقہ نہیں نکال لیتے، میں گھبرا جاؤں گا، ٹھیک ہے؟ لہذا فیلڈ جتنا زیادہ AI کے سامنے\nہے، اتنا ہی بہتر AI اس میں ہے، آپ کو\nماڈل میں سینٹور بننے کی ضرورت ہے۔ گیری کاسپاروف نے کہا آدھا آدمی، آدھا گھوڑا، آدھا آدمی، آدھا گھوڑا۔ آپ کو\nAI کے ساتھ اپنے گھوڑے کی طرح کام کرنے اور اس کے ساتھ مربوط انسان بننے کے قابل ہونے کی ضرورت ہے اور پھر آپ بہتر لکھ سکتے ہیں۔ مجھے نہیں معلوم، میں نے محسوس کیا کہ ایک پیراگراف کو واپس پھینکنے کے لیے AI کا استعمال کرتے ہوئے میری تحریر میں\nبہت بہتری آئی ہے، \nمیں اس پر مزید کام کرنے میں دلچسپی نہیں رکھتا\nکیونکہ میں پھنس گیا ہوں۔ مجھے اس کے 20 ورژن دیں\n، اور ایسا ہوتا ہے، ٹھیک ہے؟ تو مجھے لگتا ہے کہ ان شعبوں میں امید ہے، لیکن ہم نہیں جانتے کہ\nیہ کتنا اچھا ہونے والا ہے اور یہ تھوڑا سا خوفناک بھی ہے۔ - اور تم نے ڈراونا ذکر کیا۔ میرا مطلب ہے، 'کیونکہ آپ کو لگتا ہے\nکہ ابھی کوئی بہت خوفزدہ نہیں ہے، لیکن جب آپ خوفناک کہتے ہیں، تو آپ کے دماغ میں کیا خوفناک خیالات آتے ہیں؟ - میرا مطلب ہے، تو\nڈراؤنے کے کچھ درجے ہیں، ٹھیک ہے؟ میرا مطلب ہے، ایسی چیزیں ہیں جو\nیقینی طور پر ہونے والی ہیں۔ ہمارے پاس رکاوٹ ہے جو\nیقینی طور پر واقع ہونے والی ہے، ٹھیک ہے؟ جیسا کہ آپ نے کہا، اب میری تقریر کے ایک منٹ کے ساتھ اپنی بات کرنے کی\nجعلی ویڈیوز، جعلی ویڈیوز بنانا معمولی بات ہے۔ \n میں پہلے بھی ایسا کر چکا ہوں۔  جعلی\nتصاویر آسان ہیں، ٹھیک ہے؟ مواد اور بڑے پیمانے پر آسان ہے. لہذا سماجی مسائل کا ایک گروپ ہے جس کے نتیجے میں ہمیں نمٹنا پڑے گا۔\n پھر یہ حقیقت بھی ہے کہ یہ ملازمتوں میں خلل ڈالنے والا ہے۔ ہم ابھی تک نہیں جانتے کہ کون سی ملازمتیں\nاور کس طرح۔ ہم نہیں جانتے کہ اس میں کتنا\nخلل پڑے گا۔ آپ جانتے ہیں، عام طور پر\nمعاشی لحاظ سے، جب ملازمتوں میں خلل پڑتا ہے، یہ\nنوکریوں کے بارے میں نہیں ہے، یہ کاموں کے بارے میں ہے۔ لہذا یہ آپ کے کام نہیں ہیں جو\nبدلتے ہیں، یہ وہ کام ہیں جو آپ کرتے ہیں۔ اور عام طور پر یہ کاموں کا ایک بہتر بنڈل حاصل کرنے کے ساتھ ختم ہوتا ہے۔ آپ نے اپنی بورنگ چیزیں بند کردی ہیں، لیکن یہ ایک خلل ڈالنے والا دور ہوسکتا ہے۔ لوگوں کو نوکری سے نکال دیا جاتا ہے۔  جن لوگوں کو\nملازمت پر رکھا جائے گا وہ ملازمت پر نہیں ہیں۔ ہم نہیں جانتے کہ یہ کیسے نکلے گا۔ لہذا کچھ خوف ہے\nجو ملازمت میں رکاوٹ کے ساتھ ہونے والا ہے،\nچاہے اس سے معیشت میں اضافہ ہو۔ اور پھر سوال یہ ہے کہ کیا\nیہ بہتر ہوتا رہتا ہے؟ ابھی، اگر آپ\nکسی فیلڈ کے ٹاپ 10، 20% ہیں، تو میرے خیال میں، آپ جانتے ہیں، AI آپ کے لیے ایک ٹول ہے۔ اب سوال یہ ہے کہ:\n جب AI ہمارے بہت سے انٹرن کے مقابلے میں بہتر انٹرن کے طور پر کام کرتا ہے تو ہم انٹرنز کو کیسے تربیت دیں گے ؟ ہم مستقبل میں لوگوں کی تربیت کیسے کر رہے ہیں؟ اور اگر AI بہتر ہوتا رہتا ہے، تو کیا ہوگا اگر یہ سب سے بہتر ہے لیکن سب سے اوپر 1%، تو\nپھر ہم سب اپنی ملازمتوں کے ساتھ کیا کریں گے؟ اور پھر یقیناً، اس\nقسم کی واقعی خوفناک سوچ ہے کہ بہت سے لوگ ان دیگر خدشات کی نسبت\nفکر کرنے میں بہت زیادہ وقت صرف کرتے ہیں، جو میرے خیال میں بہت بڑے ہیں۔ کون سا ہے، آپ جانتے ہیں،\nاگر یہ چیز واقعی سپر ذہین ہو جائے تو کیا ہوتا ہے؟ یہ AGI خیال اور اس طرح، پھر کیا ہوتا ہے؟ لیکن مجھے لگتا ہے کہ آپ کو\nاس کے بارے میں فکر کرنے کی ضرورت نہیں ہے۔ آپ جانتے ہیں، لوگ اس کے بارے میں فکر مند ہیں، آپ کو اس کی فکر کرنی چاہیے، لیکن\nمیں سمجھتا ہوں کہ یہ دوسری چیزیں اس بارے میں کہ\nملازمتوں کا کیا ہوتا ہے اور ہم اس خلل کی دنیا میں کیسے زندہ رہتے ہیں،\nمیرے خیال میں یہ زیادہ اہم ہے۔ اور میرا مطلب ہے، آپ جانتے ہیں،\nہماری دونوں روٹیوں میں اس سے مکھن ہے، لیکن مجھے لگتا ہے کہ تعلیم\nیہاں کی کلید کا حصہ ہے۔ سوچنے اور اپنانے کے قابل ہونا\nضروری ہے۔ ایک چیز کے لیے تربیت نہیں دی جاتی بلکہ بہت سی چیزوں کے لیے تربیت دی جاتی ہے۔ - ہاں، میرا مطلب ہے، آپ نے\nبتایا کہ آپ پہلے ہی اپنے بزنس\nاسکول کے طلباء کو کوڈ اور بزنس پلان لکھنے پر مجبور کر رہے ہیں اور آپ جانتے ہیں۔ اور ایک بار پھر، وہ تقریباً ایک AI ٹیم کے چھوٹے پیمانے کے مینیجر بننے کے قابل ہیں\n، تو بات کرنے کے لیے۔  ’ ’یہ بالکل درست ہے۔ میرا مطلب ہے، مجھے لگتا ہے کہ آپ کو\nاس کے بارے میں سوچنا ہوگا۔ زمین پر ہر ایک کو صرف ایک مفت انٹرن ملا ہے۔ تم اس کے ساتھ کیا کرنے والے ہو؟ ہر ایک سے پوچھنا ہے۔ - یا پسند کریں، 5.\n- یا 10. اور اور وہ مختلف\nچیزیں کرتے ہیں اور یہ جادوئی نہیں ہے۔ لوگ اسے اچھالتے ہیں اور\nAI سے خوفزدہ ہوجاتے ہیں۔ اور مجھے گھبرانے کی تمام وجوہات مل جاتی ہیں۔ ہم یہاں ان کے بارے میں بات کر رہے ہیں، لیکن حقیقت یہ ہے کہ یہ یہاں ہے۔ اور\nطالب علموں کو اس کا استعمال کرنے کا طریقہ سکھانے کے ساتھ میرا احساس یہ ہے کہ آپ کو\nیہ دیکھنے کے لیے اپنے کام میں پانچ سے 10 گھنٹے کی ضرورت ہے کہ یہ آپ کے لیے کیا کرتا ہے۔ اگر آپ پانچ یا 10 گھنٹے نہیں گزارتے ہیں، تو آپ وہاں نہیں پہنچ پائیں گے۔ تو اس طرح کا میرا مشورہ\nہے، آپ کو اسے استعمال کرنا ہوگا۔ اگر آپ ایک استاد ہیں، آپ ایک طالب علم ہیں، اسے چیزوں کے لیے استعمال کریں اور دیکھیں کہ کیا ہوتا ہے۔ اور آگے بڑھنے کا یہی واحد راستہ ہے۔\n یہ انٹرنیٹ سے دور پرامپٹ کی کاپی کرنے کا جادو نہیں ہے۔\n یہ واقعی صرف تجربہ کر رہا ہے\nاور اس چیز کے ساتھ بات چیت میں ہے جیسے آپ کسی شخص کے ساتھ ہو۔ - میں اس سے 100% متفق ہوں\nاور جس نے شاید ذاتی طور پر اس\nوقت تقریباً 300 گھنٹے گزارے ہوں۔ اگر میں تخلیقی صلاحیتوں میں ایک مہارت کا اضافہ کروں، 'کیونکہ میں نے بہت سے\nلوگوں کو جی پی ٹی کو پسند کرنے، چیٹ کرنے یا GPT 4 کا استعمال کرتے ہوئے دیکھا ہے اور وہ\nبالکل ایسے ہی ہیں، \"میں کیا کروں؟\" (ہنستا ہے) تم جانتے ہو، آسمان کی حد ہے۔ جیسے، دلچسپ چیزیں آزمائیں\nاور آپ کو احساس ہو جائے گا کہ یہ ایسی چیزیں کرنے کے قابل ہے جو، آپ جانتے ہیں، سائنس فکشن ہوتا۔ میں متجسس ہوں، آپ جانتے ہیں،\nآپ ہمارے لیے کیا مشورہ دیتے ہیں؟ ہم واضح طور پر Khanmigo پر کام کر رہے ہیں۔ ہم اسے\nہر طالب علم کے لیے ٹیوٹر بنانے کی کوشش کر رہے ہیں، ایک تدریسی معاون، آپ\nجانتے ہیں، شاید اس سے بھی زیادہ۔ ہم میموری اور مختلف قسم کی\nسرگرمیوں جیسی چیزوں کو شامل کرنے، اپنے افق کو وسیع کرنے کی کوشش کر رہے ہیں۔  ایسی کون سی\nچیزیں ہیں جو آپ اسے \nطلباء یا اساتذہ یا والدین کی زندگیوں کو آسان بنانے\nیا کسی کی زندگی کو آسان بنانے کے لیے کرنا چاہیں گے۔ - تو مجھے لگتا ہے کہ\nدلچسپ چیز کا ایک حصہ یہ ہے کہ ایک بار جب انسان کے ساتھ انٹرفیس ایک دلچسپ سوال بن جاتا ہے، ٹھیک ہے؟ ہم ان آلات کو کیسے بناتے ہیں تاکہ وہ\nہمارے پاس موجود انسانی نظام میں فٹ ہو جائیں؟ جیسے\nطالب علموں کو ان کے استعمال کے بارے میں کیا مشورہ ہے؟ وہ اساتذہ کو صحیح طریقے سے فیڈ بیک کیسے دیتے ہیں ؟ آپ جانتے ہیں، آپ لوگ\nاس کے بارے میں بہت کچھ سوچ رہے ہیں، لیکن میں سوچتا ہوں کہ ہم ان لوگوں کو\nانسانی نظام کے ساتھ کس طرح فٹ کرتے ہیں جو اہم ہے۔ اور پھر مجھے لگتا ہے کہ دوسری چیز اس طرح ہے، اس سے بھی زیادہ تخلیقی بننے کی کوشش کرنا، ٹھیک ہے؟ آپ جو کر رہے ہیں وہ اس انسان کو بہت اعلیٰ سطح پر نقل کر رہا ہے۔ اگر میرے پاس ون آن ون ٹیوٹر ہوتا؟ لیکن، آپ جانتے ہیں، یہ سب سے\nبہتر تھا جس کے بارے میں ہم سوچ سکتے ہیں، ٹھیک ہے؟ - ہاں.\n- تو سوال یہ ہے کہ ہم اس سے آگے کیا کر سکتے ہیں؟ جیسے، تعلیم کیسی نظر آتی ہے؟ جیسے، کیا ہم مختلف\nقسم کے پہیلیاں اور کام دے سکتے ہیں؟ کیا ہم پہلے سے زیادہ گیم پر مبنی ہدایات اور تعلیم دے سکتے ہیں، ٹھیک ہے؟ یہ ٹولز کا ایک بہت ہی طاقتور سیٹ ہے۔ میرے لیے ایک اور بڑا سوال یہ ہے کہ: ہم\nاس کا ملٹی پلیئر ورژن کیسے شروع کریں؟ ہم\n AI کے ساتھ تعامل کرنے والے کلاس روم میں بہت سے لوگوں کو کیسے شامل کرتے ہیں؟ ہم\nAI کے لیے مستقل شخصیات کیسے تخلیق کرتے ہیں جن کے ساتھ آپ بات چیت کرتے ہیں اور آپ نے اس کے ساتھ کام کرتے رہنے کے لیے شخصیت کا انتخاب کیا ہے۔ ہم\nاس طرح کے خیال سے بہت مجبور ہو جاتے ہیں، اب ہم آخرکار\nبلوم کا ٹیوٹر بنا سکتے ہیں، ٹھیک ہے؟ اور جیسے، یہ بہت اچھا ہے، لیکن یہ بھی انسانی مجبوری تھی۔ ہمارے پاس اب ایک نیا نظام ہے،\nیہ بدل جائے گا کہ ہم کیسے کام کرتے ہیں، ہم کس طرح کام کو منظم کرتے ہیں۔ میں اندرونی طور پر سوچ رہا ہوں گا، کیا ہم اب بھی سپرنٹ کرنا چاہتے ہیں؟ کیا ہم اب بھی چست کرنا چاہتے ہیں؟ وہ انسانی نظام کے ارد گرد بنائے گئے تھے. نیا ماڈل کیسا ہے؟ تو مجھے لگتا ہے کہ یہ نقطہ نظر ہے. اور جیسے، آپ کسی ساتھی کو کیسے لے جاتے ہیں،\nآپ جانتے ہیں، یہ آپ کو\nکلاس روم سے باہر جانے اور درحقیقت مسائل کو حل کرنے پر کیسے مجبور کرتا ہے؟ ہوسکتا ہے کہ یہ آپ کو\nحقیقت میں کچھ بنانے پر مجبور کردے، ٹھیک ہے؟ اس لیے صرف ایک پروجیکٹ کرنے کے بجائے، جیسا کہ ایک سنگل کلاس پروجیکٹ، ہم ان کو ایک ساتھ کیسے مربوط کرتے ہیں۔ اور پھر دوسری چیز جو میں\nصرف یہ کہوں گا وہ یہ ہے کہ مجھے لگتا ہے کہ STEM ماضی کی نسبت ہیومینٹیز کے حوالے سے بہت کم دلچسپ ہو گیا ہے۔\n اور ہیومینٹیز واقعی\nمدد کرتی ہے اور سماجی سائنس واقعی یہاں مدد کرتی ہے کیونکہ یہ\nایک شخص کی طرح کام کرتا ہے۔ اور آپ جتنا زیادہ انسانی\nتاریخ میں غوطہ لگا سکتے ہیں، اتنا ہی زیادہ آپ AI کو\nدلچسپ طریقوں سے سوچنے پر مجبور کر سکتے ہیں۔ تو میں بھی سوچتا ہوں کہ اس میں سے\nکچھ بنانے کی کوشش کر رہا ہوں، آپ جانتے ہیں؟ بہت ساری چیزیں جو\nعملی ہونے سے پہلے عملی نہیں تھیں۔ بہت ساری چیزیں جو\nبہت عملی طور پر مبنی تھیں صرف بہت زیادہ نظریاتی بن گئیں۔ لہذا اس قیادت کو لے کر ایجنڈوں اور نصاب پر دوبارہ غور کرنا بھی واقعی دلچسپ ہے۔  ’ ’تم بالکل ٹھیک کہہ رہے ہو۔ جیسا کہ آپ جانتے ہیں، کوئی ایسا شخص جس نے\nدونوں جہانوں کو گھیر لیا ہو، آپ جانتے ہیں، زیادہ\nتکنیکی پس منظر کے ساتھ، کمپیوٹر سائنس، آپ جانتے ہیں، میں نے\nاسکول میں واپس دیکھا کہ بہت سارے طلباء جو\nانجینئرنگ اور کوڈنگ جیسی چیزوں کے ساتھ جدوجہد کرتے تھے، انہیں پریشانی کا سامنا کرنا پڑتا تھا۔\nمسائل کو کسی ایسی چیز میں کم کرنا جسے آپ\nالگورتھم میں لکیریائز کر سکتے ہیں اور تمام کنارے کے معاملات کے بارے میں سوچ سکتے ہیں اور آپ متغیرات کیسے بناتے ہیں اور آپ\nاسے واقعی اس تک کیسے کم کرتے ہیں۔ لیکن اب AI کے ساتھ،\nاگرچہ یہ اب بھی سافٹ ویئر ہے، آپ دوسرے طریقے سے دیکھ رہے ہیں۔ میں نے فعال طور پر\nٹیم کے اراکین کو بھی کہا ہے، \"آپ نے یہ پرامپٹ اس طرح لکھا ہے\nجیسے یہ ایک الگورتھم ہے۔ ایسا نہ کریں۔\" لوگ کہتے ہیں، \"پہلے\nصارف سے یہ پوچھو، پھر یہ کرو۔\" میں اس طرح تھا، \"نہیں، ایسا مت کرو۔ اے آئی کو بتاؤ کہ تمہارا مقصد کیا ہے۔\" 'کیونکہ آپ چاہتے ہیں کہ AI\nزیادہ مضبوط اور لچکدار ہو۔ آپ یہ نہیں چاہتے کہ یہ ہمیشہ پہلے کرے اور ہمیشہ وہ دوسرا کرے۔ آپ چاہتے ہیں کہ وہ اسے اپنا مقصد یہاں دے. مائیکرو مینیج نہ کریں کہ یہ مقصد تک کیسے پہنچتا ہے اور یہ اسے\nزیادہ متحرک انداز میں کرنے والا ہے۔ یا اسے لہجے کا احساس دو یا آپ جانتے ہیں، یہ چیزیں نہیں ہیں... - ہاں، یہ بتائیں کہ یہ کون ہے۔ یہ برا سافٹ ویئر ہے، یہ\nاچھے لوگ ہیں، ٹھیک ہے؟ جیسا کہ یہ سافٹ ویئر کے طور پر اچھی طرح سے کام نہیں کرتا ہے کیونکہ یہ\nہر بار ایک ہی کام نہیں کرتا ہے۔ یہ لوپس میں پھنس جاتا ہے۔ جیسے، آپ کو\nاس کے ساتھ کام کرنا سیکھنا ہوگا۔  یہ آپ سے جھوٹ بولتا ہے۔ آپ کو اس کے ساتھ کام کرنا سیکھنا ہوگا۔  اس سے کوئی فرق نہیں پڑتا ہے کہ ہم کیا کرتے ہیں، یہ\nیہ چیزیں کرتا ہے، ٹھیک ہے؟ جیسے، آپ اپنی پوری\nکوشش کرتے ہیں، یہ گر رہا ہے، فریب نظر آ رہا ہے،\nلیکن جیسے، وہ حقیقی ہیں۔ یہ ایک حقیقی مسئلہ ہے۔ لہذا اگر آپ اس کے بارے میں\nکسی شخص کی طرح سوچتے ہیں تو یہ بہتر ہوتا ہے۔ جیسا کہ، میں نے اسے ٹیسٹ دیا ہے، آپ جانتے ہیں، یہ اساتذہ کے مقابلے میں تعلیمی افسانے پر بہتر کام کرتا ہے۔\n یہ اب یقین نہیں کرتا،\nآپ جانتے ہیں، مثال کے طور پر سیکھنے کے انداز، جو کہ بہت اچھا ہے،\nلیکن یہ پھر بھی غلطیاں کرتا ہے۔ اور مجھے لگتا ہے کہ آپ صحیح ہیں،\nآپ کو اسے ایک شخص دینا ہوگا، لیکن آپ کو ان لوگوں کو بھی سکھانا ہوگا\nجو اسے استعمال کررہے ہیں۔ یہ ایک شخص ہے، اگر یہ\nٹینجنٹ پر بند ہونے لگتا ہے، تو آپ کو اسے ری ڈائریکٹ کرنا ہوگا۔ یہ کوئی سپر ذہین ادارہ نہیں ہے جو جانتا ہو کہ مستقبل کیا ہے۔ اور لوگ اسے\nہر وقت اوریکل کے طور پر استعمال کرتے ہیں۔ AI کا مستقبل کیسا لگتا ہے؟ یہ نہیں جانتا۔ یہاں تک کہ اگر یہ ایک شخص کے طور پر ذہین تھا، اس کے پاس آپ کے لیے جوابات نہیں ہیں۔ اس کے ساتھ ایک شخص کی طرح سلوک کریں اور\nاسے ایک شخص کی طرح پروگرام کریں اور اس کے ساتھ کھیلنے کے لئے یہ ایک بہت ہی مختلف قسم\nکا جانور ہے۔  ’ ’نہیں، یہ ٹھیک ہے۔ اور آپ بہت زیادہ کام کرتے ہیں، آپ جانتے ہیں، صرف دوسری جہت پر۔ آپ سمیلیشنز، بزنس سمیلیشنز، اس جیسی چیزوں پر بہت زیادہ کام کرتے ہیں۔ میں تصور کر سکتا ہوں کہ آپ شہر جا رہے ہیں۔ اور ہمیں تعاون کے بارے میں سوچنا چاہئے۔  میں \n K-12 یا\nدوسرے سیاق و سباق میں آپ کے پری AI سمیلیشنز میں سے کچھ بچوں تک پہنچانا پسند کروں گا، لیکن مجھے تجسس ہے کہ آپ\nAI دنیا میں اس کے بارے میں کیسے سوچ رہے ہیں۔ - ہاں، ہم اسے پسند کریں گے۔ میرا مطلب ہے، میں خرچ کر رہا ہوں، آپ جانتے ہیں، میں نے 12 سال پہلے کی طرح تعلیم میں کھیلوں پر ایک کتاب لکھی تھی۔\n میں تب سے گیمز بنا رہا ہوں۔ وارٹن کو آپ تک پہنچانے میں کامیاب\n، اس چیز میں سرمایہ کاری کریں۔ میرے پاس 14 لوگوں کی ٹیم تھی،\nہمارے پاس ایسے لوگ تھے جنہوں نے بہترین سائنس فکشن ناولوں کے لیے ہیوگو ایوارڈ جیتا تھا۔\n میں آپ کے پیچھے کچھ سائنس فکشن دیکھ رہا ہوں۔ تو، آپ جانتے ہیں، ہمارے مصنفین میں سے ایک کے طور پر\nجنہوں نے کچھ کہانی کے ساتھ ہماری مدد کی\nاور وہ حیرت انگیز ہیں، ٹھیک ہے؟ میں نے ان گیمز کو بنانے میں برسوں گزارے ہیں جہاں آپ\nحقیقی وقت میں ایک جعلی اسٹارٹ اپ کمپنی چلاتے ہیں یا آپ زحل کے لیے تباہ شدہ\nخلائی مشن پر ہیں اور یہ آپ کو\nقائدانہ صلاحیتوں کے بارے میں سکھاتا ہے۔ اور پھر یقیناً،\nپریشان کن بات یہ تھی کہ میں نے AI میں ایک اچھی طرح سے ہدایت شدہ پرامپٹ میں ٹائپ کیا اور اس نے\n میرے گیم کے تمام کرداروں کو بہت اچھی طرح سے ادا کرنا شروع کر دیا، ٹھیک ہے؟ ایک سال کی 70%\nکوشش ایک پیراگراف کے ساتھ مکمل کی جا سکتی ہے۔ تو میں سمجھتا ہوں کہ نقالی کے ساتھ کھیلنے کا یہ خیال ایک اور چیز ہے۔ ہم بہت ہی\nڈڈیکٹک سیکھنے کے عادی ہیں اور یہاں تک کہ ٹیوٹر ماڈل قسم کے\nانٹرایکٹو ڈڈیکٹک سیکھنے کے۔ ہم دوسری چیزیں کرنا شروع کر سکتے ہیں، ٹھیک ہے؟ میرا مطلب ہے، بہت سارے\nاساتذہ ہیرے کے زمانے کے ماڈل سے واقف ہوں گے، ٹھیک ہے؟ اس یونیورسل ٹیوٹر کی طرح جو اسے پڑھانے کو کھیل میں بدل دیتا ہے۔ میں نے جو سیکھا ہے وہ یہ ہے کہ آپ ایسے\nگیمز نہیں بنا سکتے جو \nحقیقی گیمز کی جگہ لینے کے لیے کافی مجبور ہوں۔ ان کی بہترین کی طرح، وہ حقیقی زندگی کے کھیل کی طرح 80% مزے دار ہیں۔ لیکن وہ\n نقلی اور کھیلوں کو سکھانے اور یکجا کرنے اور حقیقی تدریسی سیکھنے اور کوئز کرنے اور اس\nاور پروجیکٹ پر مبنی کام کرنے کے لیے ایک کتاب لکھنے کا واقعی ایک دلچسپ طریقہ ہو سکتا ہے۔ اچانک یہ سب کرنا سستا ہے۔  پیمانے پر کرنا آسان ہے۔\nیہ بہت پرجوش ہے۔ 'کیونکہ میں آپ کو بتا سکتا ہوں کہ\nتخروپن پر مبنی چیزیں لوگوں کی زندگیوں میں اتنا فرق ڈالتی ہیں۔ اور یہ صرف ایک ایسی چیز ہے\nجو عام طور پر ہمیں \nایک سم بنانے میں لاکھوں ڈالر خرچ کرنے پڑتے ہیں اور اب یہ ایسی چیز ہے جسے ہم\nبہت آسانی سے کر سکتے ہیں۔ اور مجھے لگتا ہے کہ یہ واقعی،\nواقعی دلچسپ بھی ہے۔ - میرا مطلب ہے، میں اس کے بارے میں سنجیدہ ہوں. اس کے بعد، ہم رابطہ کریں گے\nکیونکہ میں چاہتا ہوں، آپ جانتے ہیں، ظاہر ہے کہ دو\nاسکول ہیں جن کو شروع کرنے میں میں نے مدد کی، خان لیب اسکول، بشمول\nاس میں ایک ہائی اسکول بھی ہے اور ہمارے پاس یہ دوسرا آن لائن ہائی اسکول ہے۔ مجھے لگتا ہے کہ آپ کے تمام بزنس\nاسکول کی نقلیں ہیں۔ میں اسے حاصل کرنا پسند کروں گا، آپ\nجانتے ہیں، مڈل، ہائی اسکول، یہاں تک کہ ابتدائی اسکول کے\nطلباء بھی یہ سب کرتے ہیں۔ مجھے لگتا ہے کہ یہ تبدیلی والا ہوگا۔ - اصل میں، یہ بہت مضحکہ خیز ہے. ہم نے اسے کالج کے طلباء کے لیے بنایا ہے۔ ہمارے بہترین کھلاڑی اکثر\nدراصل ہائی اسکول کے طلباء ہوتے ہیں جو یہ گیمز کھیلتے ہیں\nکیونکہ انہیں اصل میں\nکاروباری چیزیں کرنے کا موقع نہیں ملتا اور وہ اسے بہت سنجیدگی سے لیتے ہیں، اور اس کے نتیجے میں،\nوہ اس سے بہت کچھ حاصل کرتے ہیں۔ جب کہ کسی ایسے شخص کے طور پر جو\nبزنس اسکول کی کلاس میں ہے، ایسا ہے، آپ جانتے ہیں، وہ اس میں داخل ہوتے ہیں، لیکن یہ ایک مختلف قسم کا تجربہ ہے۔ ہائی اسکول کے طلباء،\nاس سے پہلے کا مقصد دراصل\nایک باکس میں کلاس بنانا تھا جس طرح میں نے\nآپ جیسے بڑے آن لائن کورسز کیے ہیں، اور بالکل آپ کی طرح، \nان چیزوں کی حدود کو تسلیم کیا ہے، ٹھیک ہے؟ اور اسی طرح ہم نے\nان کی حدود کو تسلیم کیا ہے۔ تو ہم لوگوں کو\nگیم کا تجربہ کیسے کریں اور آن ڈیمانڈ سیکھنا\nیہاں ہمارا بڑا مقصد بن گیا اور مجھے لگتا ہے کہ ہم نے اسے پورا کر لیا ہے۔ لہذا میں ان چیزوں کے بارے میں بات کرنا پسند کروں گا اور آپ کو ان کو آزمانے کے لئے کہوں گا۔ وہ ہیں، آپ جانتے ہیں، تمام تعلیم۔ ہم نے مختلف\nارب پتی بانیوں سے بات کی ہے اور، آپ جانتے ہیں، ہم گیم\nمیں ان کے تجربے کو فرضی بنا دیتے ہیں اور آپ جانتے ہیں کہ\nبرانچنگ کے سینکڑوں راستے ہیں اور ہم نے حقیقت میں\nGoogle اور Wikipedia کو گیم کی دنیا کے بارے میں جعلی معلومات سے بھر دیا ہے۔\n لہذا آپ اصل میں صرف گوگل کا سامان کر سکتے ہیں اور اس سے مفید معلومات حاصل کر سکتے ہیں۔ تو اس کی تعمیر میں بھی بہت مزہ آیا۔ - آپ نے حقیقت کو\nاپنے تخروپن کا حصہ بنایا ہے۔ - متبادل حقیقت والے کھیل۔  ہاں، بالکل۔ - خوفناک۔ ٹھیک ہے، ایتھن، میں\nاس بارے میں آپ سے گھنٹوں بات کر سکتا ہوں۔ میرے خیال میں، آپ جانتے ہیں، آپ ان\nچند لوگوں میں سے ایک ہیں جو واقعی اس طرف جھکاؤ رکھتے ہیں، اور خاص طور پر تعلیم میں۔ لہذا میں امید کرتا ہوں کہ یہ\nہماری آخری گفتگو نہیں ہوگی۔ یہ اصل میں ہماری\nپہلی بھی نہیں ہے۔  (ہنستا ہے) - مجھے یہ پسند ہے۔ مجھے پسند ہے کہ آپ اپنے مشن کے ساتھ کیا کر رہے ہیں اور یہ دیکھنا صرف دلچسپ ہے، آپ جانتے ہیں؟ میں ان\n تمام تعلیمی کوششوں کے ذریعے ہر بچے کے لیے ایک لیپ ٹاپ کے ساتھ بالکل شامل تھا \nاور اب ہم حقیقت میں اس طرح کے خواب کے قریب ہیں،\nہم ٹیکنالوجی کو حقیقت میں تعلیم کو کیسے بہتر بنا سکتے ہیں؟ آپ لوگ جو کر رہے ہیں وہ بہت اہم ہے اور یہ بہت پرجوش ہے، لیکن یہ بہت سارے لوگوں کے لیے واقعی خوفناک بھی ہے۔ لیکن مجھے لگتا ہے کہ اسے گلے لگانے کے ساتھ، آپ کو\nیہاں کیا ہو رہا ہے اس کی اصل قدر نظر آنا شروع ہو جائے گی۔ تو مجھے رکھنے کے لیے آپ کا شکریہ۔ - آپ کا شکریہ.",
    "t_spanish": "- Hola a todos.\nAquí Sal de Khan Academy. Y como algunos de ustedes saben,\npubliqué mi segundo libro, \"Brave New Words\", sobre el futuro de la IA en la educación y el trabajo. Está disponible en cualquier lugar donde\npuedas comprar tus libros, pero como parte de la investigación para ese libro, hice algunas entrevistas con\npersonas fascinantes, que estás a punto de ver. Me complace presentarles al\nprofesor Ethan Mollick, profesor de la Wharton School de la Universidad de\nPensilvania, que también ha trabajado mucho en simulaciones\nen la escuela de negocios, pero creo que lo que es aún más\nrelevante para lo que estamos haciendo es que ustedes En los últimos meses me he hecho un nombre como alguien que ha estado utilizando la IA\npara el bien en la educación. Bienvenido, Ethan.\n- Gracias por tenerme. Estoy emocionado de estar aquí. - Así que empecemos por el principio.  ¿ Cuál fue su primer\nadoctrinamiento o exposición, especialmente cosas como\nmodelos de lenguaje grandes, cuáles fueron algunas de sus reacciones iniciales y luego cuáles fueron algunas de\nlas formas en que comenzó a darse cuenta de que\npodría ser valioso? - Entonces, como dijiste, he estado\nconstruyendo, pensando en cómo democratizamos la educación\ndurante mucho tiempo. Vengo de la\nperspectiva de una escuela de negocios y hay toda esta investigación que dice que pequeñas cantidades de\neducación empresarial transforman vidas y estudios controlados en todo el mundo. Así que he estado pensando\nen esto por un tiempo y también he estado jugando\ncon herramientas que hacen esto, creando simulaciones,\npero también conocía GPT 3, que era la\nversión GPT del software anterior al Chat.  lo cual hizo un buen ensayo de alto nivel de quinto grado\nen ese momento. Y pensé que debería\nconcienciar a mis alumnos sobre estas cosas. Entonces comencé a asignarles\ntareas para hacer trampa. Así que escribe el mejor ensayo\nque puedas usando esto y usando Dall-E para generar una imagen y luego habla sobre dónde\nestaba el estado del mundo. Y lo que fue muy divertido es que a mitad de la tarea de trampa,\ncuando la mitad de mis alumnos la habían entregado pero\nla otra mitad no, apareció Chat GPT. Entonces hubo un\ncambio repentino en el nivel de calidad que fue bastante dramático\ndurante ese período. - ¿Y qué notaste?\nEn realidad, tengo curiosidad. Quiero decir, dijiste: \"Está bien, en teoría, podrías hacer\ntrampa con esto\". Entonces los estudiantes hacen trampa con estas cosas y, por definición, no es\nhacer trampa si te dicen que hagas trampa, pero ¿viste alguna diferencia? Quiero decir, obviamente había una\ndiferencia entre Chat GPT, que usa GPT 3.5 y GPT 3 normal. Ya viste una diferencia allí, pero ¿viste una diferencia en relación con lo que viste en\naños anteriores en el trabajo de los estudiantes? - Sí, quiero decir, bueno, lo interesante es que consideramos que la escritura y la inteligencia están muy cerca una de la otra, ¿verdad? Y ya sabes, de maneras que\nson difíciles de separar, consideramos que escribir ensayos es la forma en que aprendemos a\npensar mientras escribimos ensayos. Tal vez eso sea cierto, tal vez no lo sea. Realmente no hemos probado esas cosas. Es como muchas cosas relacionadas con la educación, en realidad no sabemos las respuestas.  Por eso he tenido estudiantes en mi clase que son personas brillantes\npero no buenos escritores. El inglés es su tercer\nidioma o, ya sabes, provienen de un entorno\nen el que nunca aprendieron a escribir muy bien. Entonces, incluso con esa\npequeña pista, es algo así como Grammarly, ¿verdad? Como que marcó la diferencia al\nhacer que escribieran mejor. Y después de presentar\nChat GPT a algunos de mis estudiantes, dijeron, ya sabes,\nahora recibo devoluciones de llamadas de trabajo que no recibía antes y\nobtengo el trabajo en el que tengo una entrevista, pero porque\npuedo escribir.  bueno ahora ¿no? Entonces, es parte de por qué he\nhecho que el uso de la IA sea obligatorio en todas mis clases. Así que ya no acepto nada que no esté perfectamente\nescrito en este momento.  ¿ Por qué molestarse? - ¿Y cuál es su opinión?\nPiénselo desde el punto de vista de un empleador,\ndonde supongo que estaban usando una señal,\nalguien que escribe una carta de presentación realmente elocuente\nversus alguien que no lo hace, y estaban usando esta pequeña señal. Ahora todo es elocuente, pero tal vez esa persona viene\na trabajar y dice: \"Oh, tal vez sus\nhabilidades lingüísticas no son tan fuertes como pensé que eran...\" ¿ Cuál es su punto de vista?  ¿ Están haciendo trampa o está bien? Porque puedo usar Chat GPT o lo que sea para seguir escribiendo bien. - En realidad son dos\npreguntas realmente interesantes. La primera es, ya sabes, esta cuestión de las trampas en general es\nuna gran pregunta, ¿verdad?  ¿ Qué significa hacer\ntrampa hoy en día, verdad? Si le pido consejo a la IA\n, pero no lo uso. Si te pido que subas un párrafo, si te lo pido todo, ¿es trampa? Es una cuestión muy diferente\na plagiar, ¿verdad? Y luego la segunda\npregunta es, ya sabes, muchas cosas buenas se\nverán perjudicadas por la IA, pero muchas cosas malas, ¿verdad? Resulta que juzgar a\nlas personas basándose en cartas de presentación nunca ha sido un\nmétodo particularmente bueno, o un ensayo universitario nunca ha sido un método particularmente bueno\npara decidir las admisiones. El mejor método que tenemos\npara los metanálisis a gran escala es en realidad\nhacer una entrevista detallada que se base en lo que las personas realmente logran en su vida, ¿verdad? Si las habilidades de escritura son\nimportantes, tendrás que darle a la gente una\nprueba de escritura separada. Pero para muchos trabajos,\nesa no es la habilidad principal o ahora la realizará la IA. Entonces, de alguna manera, es hacer trampa, pero también\nnos obliga a reconsiderar lo que es realmente valioso\nen términos de señalización. Muchas de las cosas que hacemos, especialmente como instructores\nen la sala, consisten en prender fuego a tu tiempo\npara demostrar que te preocupas, ¿verdad? Por ejemplo, si alguien me pidiera que le escribiera una carta de recomendación\n, me llevaría una hora escribir una\ncarta de recomendación realmente buena. Podría pegar el currículum\nde la persona y el trabajo que está solicitando y\nlo que dice en GPT 4 y obtener una carta mejor\nde la que me tomaría una hora escribir. Y siempre estoy luchando por saber si uso la carta generada porque indica mis pensamientos,\npero ya no perderé el tiempo que iba a\ndedicar a hacer que esto funcione. Y creo que ese es el\ndesafío realmente interesante. - Me encanta tu frase de\nprender fuego a mi tiempo para demostrar que me importas. Mi mamá siempre quiere que\nla recoja en el aeropuerto. (risas) - Mis padres también.  Mis padres\ntambién.  (risas) Lo mismo. - Sí.  Sí. Prendí fuego a esa parte de mi día para poder demostrarle que me importa. Pero creo que tienes razón,\nestamos llenos de tradiciones, incluida tal vez la\ncarta de presentación y todo esto, que son casi solo rituales solo para encender tu tiempo y\ndemostrar que te preocupas.  ¿ Pero realmente añaden valor? E incluso para las personas que... Algunas personas tienen a otras\npersonas entrenándolas, ayudándolas con cosas como\nensayos universitarios o currículums, y esa es una\nversión de Chat GPT o GPT 4 que requiere muchos recursos.\n- Exactamente. Y quiero decir, lo emocionante, y es por eso que me encanta lo que\nustedes están haciendo, es que de repente tenemos miles de millones\nde personas que tienen acceso a la mejor IA\njamás lanzada al público. Por ejemplo, si eres rico, no\ntienes acceso a una mejor IA y obtienes acceso gratuito a\ntravés de Bing o mediante el tipo de cosas que\nustedes están haciendo, ¿verdad? Está disponible en todas partes. Y eso es lo más\nprofundamente interesante en la educación porque solíamos\ntener todas estas barreras. Todos los intentos anteriores para hacer esto fueron duros y difíciles, ¿verdad? Así que creo que parte de esa\npregunta es que democratiza cosas que no\npudimos democratizar antes. Solía ​​decir: \"Si\ncontratas a un tutor, te irá mejor\". Ahora, ¿qué sucede cuando\ntenemos un tutor que todos pueden usar y que en realidad es\nmejor que los tutores humanos? Esa es una perspectiva realmente emocionante y\nun poco aterradora. - Si, tienes razón. Es a la vez emocionante y aterrador\ny todos nosotros, como saben, estamos trabajando en Khanmigo\ndentro de Khan Academy y ahora lo estamos implementando de manera cada\nvez más amplia. Y tú y yo nos\ntopamos mucho porque parece que\nhablamos mucho juntos. Esto es lo que está haciendo Khan Academy, y miren a este profesor\nque no tiene miedo de usar IA. Entonces, continuemos con su viaje porque habló de esos primeros días, animó a los niños a citar \"hacer trampa\" usando inteligencia artificial, pero en cierto modo eso conducía\na mejores resultados.  ¿ Pero has cambiado\ncuáles son las asignaciones?  ¿ Ha cambiado su umbral de lo que constituye una buena tarea? - Sí, quiero decir,\nbásicamente hay tres cosas que he tenido que hacer como resultado de la IA. Entonces, nivel uno, creo que todos tendrán que enfrentar estos problemas, ¿verdad? El nivel uno simplemente espera\nmás de los estudiantes, ¿verdad? Entonces, lo primero que todos tenemos que\nhacer es, ya sabes, dar una\nclase de emprendimiento y, de nuevo, sé que hay personas escuchando que enseñan, ya sabes, habilidades básicas de escritura. Tendrás que\nadaptarte de diferentes maneras. Esto será diferente\npara cada persona.  Para algunas personas,\ntodo se tratará de tener tareas de escritura en clase\npara que aprendan a escribir porque harán\ntrampa fuera de clase. Lo entiendo, así que esto\nno es algo universal, pero ciertamente es mi caso. Espero más. Entonces la gente solía tener que\nentregar un plan de negocios. Ahora tienen que entregar un\nplan de negocios y un código funcional, incluso si antes nunca sabían codificar. Ahora codifico. No puedo codificar, pero he\nescrito 12 programas Python en las últimas semanas, ¿verdad? Tienes que entregar, ya\nsabes, una página web completamente funcional. Tienes que haber entrevistado a personas reales y falsas con la\nIA y hay algunos datos que puedes examinar con la IA\ny que son realmente precisos. Así que mis expectativas de trabajo son ahora mucho más altas que antes. Entonces ese es el tipo de\nprimer ajuste, ¿verdad? El segundo conjunto de ajustes es que ahora tengo IA\nintegrada en las tareas. Entonces la IA es una compañera de equipo para mis alumnos. Entonces ahora terminan teniendo que\ntraer IA, ya sabes, hay asignaciones. Por ejemplo, cada tarea que entreguen debe ser criticada por\nal menos otros tres empresarios famosos, que\nellos deben generar. Entonces reciben retroalimentación a lo largo del camino. Y luego, la tercera cosa,\nque es realmente importante, es cambiar la forma en que trabajamos en las aulas. Las conferencias no tienen tanto\nsentido cuando tengo herramientas como Khanmigo que podrían\nbrindar una capacitación realmente sorprendente, ya sabes, de forma remota. Así que pensemos en cómo podemos darle la vuelta\nal aula de esa manera. - Sí, no, bueno, quiero decir,\nhay mucho ahí dentro. Quiero decir, encontré fascinante tu... Entonces los estudiantes escribirán\nun resumen ejecutivo de un plan de negocios o algo así, y luego le preguntarán a Steve Jobs\no algún empresario famoso , ya sabes, Ford o alguien más,\no Tesla.  , alguien que... ¿ O supongo que Elon Musk, para opinar\nsobre su plan de negocios y eso es parte de la tarea ahora? - Sí.  Se les exige que tengan... Entonces, para simplemente desarrollar su\nesquema, que solía ser algo que simplemente comentaría, tienen que tener tres\nempresarios famosos que comenten sobre su plan, ¿verdad? Y eso también enseña un\npoco sobre las indicaciones de escritura, pero los límites de estas\ncosas, en realidad no invocan el espíritu de, ya\nsabes, Steve Jobs, ¿verdad? En cambio, tienen que darse cuenta de que les ayuda a pensar en\neste nuevo mundo en el que estamos. Y luego también tienen que hacer una autopsia. Por eso, los proyectos tienen\nmás éxito cuando realmente imaginas cómo podrían fracasar.  Por lo tanto, también tienen que generar un montón de oportunidades de fracaso\ncomo resultado de esto. Trabaja hacia atrás sobre cómo resolverlos. Entonces me permite hacer diferentes\ncosas que sabemos por la investigación que hacen que los equipos funcionen mejor y que las personas trabajen mejor. Pero no pudimos hacerlo antes porque\nera demasiado trabajo. - Y esto es tan poderoso. Y ya sabes, lo que también estás haciendo, que suena\nexplícita o implícitamente, es simplemente\nfamiliarizarlos íntimamente con estas herramientas y el\npoder que tienen. Porque lo peor que podrías hacer es que estos estudiantes estén en una\nburbuja y luego se incorporen a la fuerza laboral en uno o dos años y digan: \"Espera, ¿\nqué acaba de pasar? Ahora todos están usando GPT 5\", o lo que sea.  . Pero podrán liderar en eso. Y tu punto sobre un\naula invertida, ya sabes, como sabes, he estado hablando\nincluso de pre-IA en un mundo de video bajo demanda, honestamente,\nincluso video pre-bajo demanda, clases de humanidades e incluso\nescuelas de negocios.  Las clases leen el caso, vienen a la escuela\ny lo discutiremos. Creo que siempre\nha sido una buena práctica.  Más aún en un mundo de IA.  ¿A dónde va esto? Ya sabes, ¿sigues\nevolucionando tus cursos? Estoy seguro de que todo tipo de\nprofesores se acercarán a usted y le preguntarán: \"¿Qué hago?\".  ¿ Qué les estás diciendo? - Quiero decir, una cosa que\nestamos haciendo es, ya sabes, compartir indicaciones, ¿verdad? Para mí, esto es lo más\nimportante que hay que hacer. Tengo un par de artículos y estoy seguro de que podemos poner\nenlaces en algún lugar para la gente, pero estamos tratando de adoptar enfoques pedagógicos, ¿verdad? Las indicaciones son así de mágicas, pero\nte ayudan a tener experiencia. Así que hemos escrito algunas indicaciones que hacen varias cosas,\ncomo analogías explicativas, algunas de las cosas que se hacen en Khanmigo, pero que pueden ser\naplicables a muchas aulas. Hay herramientas para ayudar, ya saben, profesores. Así que estoy tratando de descubrir\ncómo la misión de democratización que ustedes tienen es la\nmisma en la que estoy pensando.  ¿ Cómo damos herramientas a los docentes?  ¿ Cómo damos herramientas a los estudiantes?  Ya sabes, la promesa\nde la IA es que, de repente, ya sabes, lo que pensábamos\nque haría Internet, es decir, si le damos a todos\nacceso a la información. Todos aprenderán todo. Resulta que un grupo muy pequeño\nde personas son realmente estudiantes constructivistas\nque no necesitan apoyo y podrían aprender por sí solos. Pero ahora tenemos una herramienta\nque realmente puede brindar apoyo, tutoría y\nalgunos otros materiales que sabemos que funcionan y hacerlo a escala. Y te he oído hablar sobre, ya sabes, el 2 sigma de Bloom. Quiero decir, ni siquiera\nsabemos qué tan bien funciona esto en este momento, pero\nno podíamos hacerlo antes. Y al igual que tú, lo he\nhecho a gran escala, ya sabes, ni cerca de tu escala, pero he tenido como, ya sabes,\nunos cientos de miles de personas que han tomado mis cursos de video en línea. Sabes, hay una gran\ndiferencia entre eso y hacer un\nejercicio y recibir retroalimentación. Así que estamos tratando de pensar en\ntodo ese tipo de piezas. - ¿Y qué le estás diciendo a la facultad? Porque no tengo ninguna duda, quiero decir, no sólo estás\nnavegando por esto con éxito, sino que estás prosperando en un mundo de IA generativa.  Lo estás haciendo funcionar para la educación. Siento un optimismo similar al que usted hace, pero supongo, y ya\nsabe, que el 90 por ciento de los profesores en este momento no están\nen el mismo estado de ánimo. Están como enloqueciendo.  Ya sabes, digamos que estás\nescribiendo una composición de primer año, eso es todo lo que tienes que hacer. Todo su trabajo es\nasegurarse de que los estudiantes aprendan a escribir y\nque usted los esté evaluando.  ¿ Qué les diría a profesores así que tienen un poco más de\nmiedo de que cosas como Chat GPT estallen como una bomba\nen su estilo pedagógico? - Quiero decir, creo que debemos\nempezar con las malas noticias. Absolutamente lo hizo, ¿verdad? Quiero decir, muchas cosas simplemente explotaron y algunas de ellas eran buenas, ¿verdad? Quiero decir, hay formas en las que hemos\nestado enseñando durante 2000 años que tenían mucho sentido. Tal vez no estuvieran realmente respaldados por investigaciones, pero se nos dieron muy bien, ¿verdad? Hemos mejorado en las conferencias, hemos mejorado en\nhacer trabajos de ensayo en casa y evaluarlos. Éramos buenos en esas cosas.\nEso estalló, ¿verdad? Quiero decir, incluso para tus mejores\nestudiantes, tus estudiantes que no harían trampa. Por cierto, los estudiantes han\nestado haciendo trampa desde siempre, ¿verdad? Pero hacer trampa ahora es\nmucho más fácil y barato. Pero incluso ahora, tus mejores estudiantes están en desventaja porque\nno hacen trampa, ¿verdad? Porque, ya sabes,\nno escriben de la misma manera. Entonces, explota mucho, pero si estás dando una\nclase de composición a un estudiante de primer año, tienes que cambiar la forma en que enseñas. Esta IA es indetectable. Cualquiera que le diga lo contrario no le está diciendo la verdad. Es esencialmente indetectable. Una de las cosas que aprendí\nde mis estudiantes que hacen trampa es que después de un par de rondas de hacer, ya sabes, ida y vuelta con la\nIA, cuál es la mejor manera de interactuar con ella, ya\nsabes, simplemente coloca un mensaje y ordenas.  de comprometerse con él. Los ensayos son indetectables\ntanto para los humanos como para cualquier tutor de IA. Explotó lo que hiciste. Así que hay que pensar como una oportunidad, pero también da miedo, y\npodemos admitirlo como educadores. Lo que debemos darnos cuenta es que la\neducación estará bien. Nos adaptaremos a este cambio, ¿verdad? Es más grande que las calculadoras,\npero no tan diferente de las calculadoras de daños estrechas que\nhacían en las clases de matemáticas. Como instructor,\nprobablemente querrás recibir más instrucción\nfuera de la clase con videos y otras cosas,\ntareas de escritura más activas en clase con críticas mutuas\ny redacción de ensayos cortos, y podrías hacer que esto funcione. Pero es absolutamente un gran cambio. Pero es una oportunidad para hacer cosas nuevas y descubrir qué funciona para usted. Y además, lo que me gusta\nrecalcar a los instructores es que esto también les hace la vida\nmás fácil en muchos sentidos. Hay muchas\ncosas que desearíamos poder hacer y no tuvimos tiempo de hacer. Y nuevamente, tenemos indicaciones para todo esto. Escribe excelentes cuestionarios para ti. Sé que ustedes también tienen guías\npara hacer estas cosas. Te ayuda como instructor. Así que no se trata sólo de aumentar tu carga de trabajo y hacerte la vida más difícil, sino que\ntambién es reducir tu carga de trabajo y darte un\npoco más de tiempo para pensar más en la educación y en cómo\ntransformar la vida de los estudiantes, razón por la cual todos estamos en\nesto en el primer  lugar. - No, me lo puedo imaginar. Creo que usted descartó algunos\nconsejos muy buenos en su respuesta, que es, si estoy enseñando una\nclase de inglés de primer año en una universidad o si estoy\nenseñando una clase de inglés en una escuela secundaria, el mundo al que\nvamos  muy razonablemente podría ser, está bien,\nte tengo durante una hora, hora y media a la vez. Escribe, y tal vez estés\nescribiendo con la IA, que no escribe para ti, sino que\nactúa para ayudar a responder algunas preguntas, etc. Pero luego puede evaluar, puede hacer una primera pasada de calificación por mí. Y así, sus estudiantes\ntendrán más tiempo para escribir y más\ncomentarios en este mundo. Y sí, tal vez tengan menos que\nhacer en casa.  Eso es bueno. Todo el mundo tiene menos que hacer en casa. Tienes menos que hacer en casa.\nNo estás calificando, ya sabes, como tu ensayo número 80 sobre, ya\nsabes, algo que, ya sabes, probablemente sea\nadormecedor en ese momento y los estudiantes tampoco lo hacen. Todo puede suceder en esa noche y es eficiente para todos. Así que sí, eso tiene mucho sentido. - Sí, y creo que, ya sabes, aceptar esto\nserá importante y está bien tener miedo\nal escuchar esto y decir: \"Oh, no, no quiero cambiar lo que he sido\".  haciendo.\" Pero también reconocemos que muchas\nde las formas en que hacemos que la gente escriba ensayos no tenían sentido. Como la gente que no era\nmuy buena en clase, ¿verdad? Escribieron malos ensayos fuera de clase.  ¿ Cuánto tiempo tenemos para darles\ntutoría para mejorarlos? Bueno, en una especie de aula invertida, un entorno de aprendizaje activo,\ny el aprendizaje activo es más importante que\nel aula invertida, la idea de que estamos haciendo cosas en clase, tal vez haya más tiempo para este tutor. Tal vez la IA pueda ayudarlos a ponerse al día o darles una\nexplicación de dónde estaban, en lugar de ser un instructor\nque califica 80 ensayos como usted dijo, tal vez\nla IA le ayude a marcar la pareja que necesita más ayuda o una pareja que  son grandes ejemplos. Ya sabes, y da tu opinión de esa manera. Aún no tenemos todas las respuestas, ¿verdad? Estamos en un entorno exploratorio, pero no podemos fingir que\nel mundo no cambió. Esta no es una de esas cosas,\ncomo clases de video de un día, ¿ qué vas a hacer con\nlos cursos masivos en línea? Es demasiado tarde para eso. Esto está aquí ahora y, nos\nguste o no, tenemos que adaptarnos como instructores. - ¿Y dónde crees que está esto? Porque como sabes, hemos estado hablando de\nmodelos de lenguaje grandes, mencionaste Dall-E, que trata\nsobre imágenes generativas. Existen tecnologías en torno al\nvideo, video degenerativo, voz a texto, texto a voz. He visto algunas demostraciones, ya sabes,\ncosas como voz a texto y texto a voz han\nexistido por un tiempo, pero últimamente he visto algunas demostraciones\nde texto a voz que realmente no son\ndiscernibles.  del original, ya sabes, el ser humano por así decirlo, lo que creará\nproblemas con falsificaciones profundas y todo eso en el mundo en general.  ¿ Pero hacia dónde crees que va esto? Creo que incluso para gente como nosotros, cada semana suceden cosas nuevas.  ¿ Cómo crees que será todo esto en dos o tres años?  ¿ Y cómo estás\ncontrolando todo? - Entonces hay un par de cosas ahí, ¿verdad? Una es que todo el mundo tiene que reconocer que la IA, la IA generativa, es lo que se llama\nuna tecnología de propósito general. Y, ya sabes, enseño\ninnovación empresarial. En los estudios de innovación, las\ntecnologías de propósito general aparecen muy raramente. Aparecen una vez cada, ya\nsabes, cada generación o dos, piense en la\nenergía de vapor, tal vez Internet, tal vez las computadoras, pero\nafectan todos los aspectos de la vida. Y este es el más rápido que\njamás hayamos visto. Adopción más rápida. Es lo más personal.\nLa gente podía hacer cosas. Afectará a cada\nindustria de manera diferente, a cada persona de manera diferente, a\ncada trabajo de manera diferente. Pero va a afectar a todo, ¿verdad? El trabajo que se ve menos\nafectado por la IA según los primeros estudios que tenemos es el de techado. Y hablé con un\npar de techadores y les dije: \"Oh, no, en realidad el\ntechado también cambiará porque ahora podemos hacer todas nuestras propuestas y demás con la ayuda de la IA\". Entonces también cambiará el techo.  Por eso debemos reconocer\nque el mundo está cambiando de maneras que no siempre sabemos. Entonces, lo que deberías pensar\ncomo instructor es preparar a las personas para vivir en\nun mundo con una rápida adaptación. Entonces, cuanto más comencemos a usar la IA y nos familiaricemos con\nsu uso, más fácil será para las personas adaptarse a\nlo que viene a continuación. Porque creo que, ya sabes, tú y yo, hay un momento\nen GPT 4 en el que es como: \"Dios mío, realmente hace\nmucho de lo que hace la gente\". Piensa como la gente.\nEsto no es realmente software. Vale la pena pensar en\nello como si fuera una persona. No es una persona, pero\npuedes pensar en ello como una persona. Eso podría ser útil. Y entonces la pregunta es: ¿\nQué sigue?  No lo sabemos.  ¿ Esto sigue mejorando?  ¿Se queda más o menos donde está? No tengo respuestas para\neso, pero tenemos que estar preparados y la mejor manera de hacerlo\nes empezar a usarlo. - Bueno, ya sabes, como\nprofesor de una escuela de negocios, y quiero decir, acabas de mencionarlo, el mundo se mueve cada vez más rápido\n. Qué consejo, estoy seguro de que nuestros\nestudiantes te lo están pidiendo a ti o a tus padres.  ¿ En qué deberían trabajar mis hijos? Por ejemplo, ¿qué habilidades deberían\ndesarrollar y cuáles tal vez no sean tan importantes\ncomo lo eran antes? - Entonces creo que pensar\ntodavía importa, ¿verdad? Entonces, muchas de las razones por las que la gente enseñaba\ndecían que escribir era importante, escribir ensayos era pensar,\ncreo que eso sigue siendo muy cierto. Necesitamos enseñar a la gente a pensar. Creo que por ahora y, con suerte, en el\nfuturo previsible, la IA es excelente. Si estabas en el 50% inferior de muchas\ncategorías diferentes, ahora estás en el percentil 50, 60 o 70. Eso es emocionante. Amplía las oportunidades para las\npersonas que lo hacían antes, ¿verdad? No podías escribir antes,\npuedes hacerlo ahora. No eras bueno programando, ahora eres un buen programador. Eso es emocionante. Creo que la pregunta es, ¿en\nqué eres bueno, qué te encanta para\npoder estar entre el 10% de las personas con mejores resultados? Y creo que eso es\nalgo en lo que se puede agregar mucho valor al mundo de la IA. Así que creo que parte de esto\nes pensar en lo que quieres hacer, en lo que\nsabes, en lo que tienes talento y en cómo desarrollar ese talento y esa experiencia, y eso requiere que aún aprendas los\nconocimientos básicos de la escuela. Se construye experiencia construyendo\nconocimientos básicos, ¿verdad?  Ya sabes, viendo muchos ejemplos, trabajando con la IA para llegar allí, y creo que eso puede llevarte\na un lugar realmente emocionante. - Sólo daré\nalgunos ejemplos tangibles. Por ejemplo, si alguien dice: \"Mi\nsueño es ser techador\", dirás: \"Genial,\nserá un gran trabajo en el futuro porque\npodrás hacer más techados y la IA escribirá\ntus propuestas\".  para ti.\" Pero si alguien se acercara a usted y le dijera: \"Quiero ser editor de derechos de autor\" o \"Quiero...\" ¿ Diría la misma respuesta? Simplemente, ya sabes, ¿ser realmente\nbueno en eso a pesar de que GTP 4 ya es bastante bueno en eso? - Entonces esa es la apuesta, ¿no? No sabemos cuánto\nmejorarán estos sistemas , ¿verdad? Y creo que hay interrupciones. Estamos viendo, en los primeros\nestudios controlados, una mejora del rendimiento del 30 al 80% en muchas\ntareas analíticas de cuello blanco de alta potencia, ¿verdad? Tareas basadas en escritura, tareas de análisis, tareas de consultoría, tareas de programación. Entonces, si quieres estar en estos campos, la IA será parte de tu vida. Por lo tanto, debes descubrir que\nsi puedes usar la IA para ser 10 veces más productivo,\nhabrá un gran valor en ti. Todavía se necesita\nun ser humano al tanto. Si no puedes descubrir cómo usar la IA para ser más productivo, estaría\nmás nervioso en esos espacios. Sabes, creo que en qué\nindustrias entrar, quiero decir, para ser justos, la gente ha estado\nprediciendo que los radiólogos quedarían obsoletos por la IA\ndurante los últimos 15 años, diciendo que no te conviertas en radiólogo. Todavía hay muchos\npuestos de trabajo para los radiólogos. Entonces es difícil hacer una apuesta. No estaría haciendo grandes apuestas profesionales. Pero yo diría que cuanto más se\nbase tu trabajo en la escritura y más rutinario sea, si eres un escritor de ficción\n, la IA todavía no puede, o un escritor de comedia, la IA todavía\nno puede escribir un buen chiste. De todos modos, esos son trabajos difíciles.\nPero ya sabes, esos son lugares. Pero si intentas escribir textos publicitarios, creo que, a menos que\nencuentres una manera de usar la IA, me pondría nervioso, ¿verdad? Entonces, cuanto más expuesto\nesté el campo a la IA, mejor será la IA y más necesitarás\nser un centauro en el modelo. Garry Kasparov dijo: mitad hombre, mitad caballo, mitad persona, mitad caballo. Necesitas poder trabajar\ncon la IA como tu caballo y ser el humano integrado con ella y entonces podrás escribir mejor. No lo sé, descubrí que mi escritura\nha mejorado enormemente al usar la IA para\nretroceder un párrafo. Ya no estoy interesado en trabajar en él\nporque estoy estancado. Dame 20 versiones de\nesto y funciona, ¿verdad? Así que creo que hay esperanza en estos campos, pero no sabemos qué tan\nbueno será y eso también da un poco de miedo. - Y mencionaste miedo. Quiero decir, porque pareces\nalguien que no tiene mucho miedo en este momento, pero cuando dices miedo, ¿ cuáles son los pensamientos de miedo en tu cabeza? - Quiero decir, entonces hay un par de\nniveles de miedo, ¿verdad? Quiero decir, hay cosas que\ndefinitivamente van a suceder. Tenemos una disrupción que\ndefinitivamente va a ocurrir, ¿verdad? Como dijiste, ahora es\ntrivial crear videos falsos, videos falsos de mí mismo hablando\ncon un minuto de mi discurso. Lo he hecho antes.\nLas fotos falsas son fáciles, ¿verdad? El contenido y la masa es fácil. Entonces, como resultado de eso, tendremos que lidiar con un montón de problemas sociales \n. Luego está también el hecho de que esto va a perturbar el empleo.  Aún no sabemos qué trabajos\ny de qué manera. No sabemos cuántas\nperturbaciones implicará.  Ya sabes, normalmente en\ntérminos económicos, cuando los empleos se alteran, no se trata de\nempleos, sino de tareas. Así que no son tus trabajos los que\ncambian, sino las tareas que realizas. Y normalmente eso termina con la obtención de un mejor conjunto de tareas. Dejas a un lado tus cosas aburridas, pero ese puede ser un período perturbador. La gente es despedida. La gente que va a ser\ncontratada no es contratada. No sabemos cómo resultará esto. Así que hay algo de miedo\nque va a suceder con la interrupción del empleo, incluso\nsi hace crecer la economía. Y entonces la pregunta es: ¿\nsigue mejorando? En este momento, si estás entre los\n10 primeros, el 20% de un campo, creo que la IA es una herramienta para ti. Ahora la pregunta es: ¿Cómo\ncapacitamos a los pasantes cuando la IA funciona como un mejor pasante que muchos de nuestros pasantes que tendríamos?  ¿ Cómo formaremos a las personas en el futuro? Y si la IA sigue mejorando, ¿ qué pasa si es mejor que todos menos el 1% superior? ¿Qué\nhacemos entonces con nuestros trabajos? Y luego, por supuesto, está ese\ntipo de pensamiento realmente aterrador por el que mucha gente pasa\ndemasiado tiempo preocupándose en comparación con otras preocupaciones, que creo que son mucho más importantes. Que es, ya sabes, ¿qué\nsucede si esta cosa realmente se vuelve súper inteligente? Esta idea de AGI y ¿qué pasa entonces? Pero creo que no\nnecesitas preocuparte por eso. Ya sabes, la gente está preocupada por eso, tú deberías preocuparte por eso, pero\ncreo que otras cosas sobre lo que sucede con los\nempleos y cómo sobrevivimos en este mundo de disrupción,\ncreo que son más importantes. Y quiero decir, ya sabes, esto nos\nunta el pan a ambos , pero creo que la educación\nes parte de la clave aquí. Ser capaz de pensar y\nadaptarse será importante. No estar formado para una cosa, sino estar formado para muchas cosas. - Sí, quiero decir,\nmencionaste que ya estás haciendo que los\nestudiantes de tu escuela de negocios escriban el código y el plan de negocios y ya lo sabes. Y una vez más, son casi capaces de ser casi un administrador a pequeña escala de\nun equipo de IA, por así decirlo. - Eso es exactamente correcto. Quiero decir, creo que\ntienes que pensar en ello. Todos en la Tierra acaban de conseguir un pasante gratuito.  ¿ Qué vas a hacer con él? Es como preguntarle a todo el mundo. - O como, 5.\n- O 10. Y hacen\ncosas diferentes y no es mágico. La gente rebota y\nse asusta con la IA. Y tengo todas las razones para estar nervioso. Hemos estado hablando de ellos aquí, pero el hecho es que está aquí. Y mi sensación al enseñar a los\nestudiantes cómo usar esto es que necesitas de cinco a 10\nhoras de uso en tu trabajo para ver qué hace por ti. Si no dedicas cinco o diez horas, no llegarás allí. Así que ese es mi consejo\n: tienes que usar esto. Si eres profesor, eres estudiante, úsalo para cosas y mira qué pasa. Y esa es la única manera\nde seguir adelante. No es una magia copiar\nun mensaje de Internet. Realmente es simplemente experimentar\ny dialogar con esto como si estuvieras con una persona. - Estoy 100% de acuerdo con eso\ny con alguien que probablemente haya pasado personalmente, a estas\nalturas, unas 300 horas. Si tuviera que agregar una habilidad a la creatividad, porque he visto a muchas\npersonas ir a Me gusta, Chatear GPT o usar GPT 4 y\nsimplemente dicen: \"¿Qué hago?\" (risas) Ya sabes, el cielo es el límite. Prueba cosas interesantes\ny te darás cuenta de que es capaz de hacer cosas que, ya sabes, habrían sido ciencia ficción. Tengo curiosidad, ¿sabes qué\nconsejo tienes para nosotros? Obviamente estamos trabajando en Khanmigo. Estamos tratando de convertirlo en un\ntutor para cada estudiante, un asistente de enseñanza, ya\nsabes, tal vez más que eso. Estamos tratando de agregar cosas como memoria y diferentes tipos de\nactividades, ampliar nuestros horizontes.  ¿ Cuáles son los tipos de\ncosas que le gustaría que hiciera para\n facilitar la vida de los estudiantes, los maestros o los padres\no la vida de cualquier persona? - Entonces creo que parte de\nlo interesante es que una vez que la interfaz con el ser humano se convierte en una pregunta interesante, ¿verdad?  ¿ Cómo construimos estas herramientas para que encajen en el\nsistema humano que tenemos?  ¿ Cuál es el consejo\nsobre cómo los usan los estudiantes?  ¿ Cómo dan retroalimentación a los profesores de la manera correcta? Saben, ustedes están\npensando mucho en eso, pero creo que es importante cómo los adaptamos\na los sistemas humanos. Y luego creo que la otra cosa es tratar de ser aún más creativo, ¿verdad? Lo que estás haciendo es replicar a este humano a un nivel muy alto.  ¿ Qué pasaría si tuviera un tutor individual? Pero ya sabes, eso fue lo\nmejor que se nos ocurrió, ¿verdad? - Sí.\n- Entonces la pregunta es: ¿ Qué podemos hacer más allá de eso?  ¿ Cómo es la educación?  ¿ Podemos dar diferentes\ntipos de acertijos y tareas?  ¿ Podemos hacer más instrucción y enseñanza basada en juegos que antes, verdad?  Se trata de un conjunto de herramientas muy potente. Otra gran pregunta para mí es: ¿ Cómo empezamos a hacer una\nversión multijugador de esto?  ¿ Cómo incluimos a muchas\npersonas en un aula interactuando con la IA?  ¿ Cómo creamos\npersonalidades persistentes para la IA con la que interactúa y la personalidad que seleccionó para seguir trabajando con ella? Estamos muy limitados\npor esta idea de que ahora finalmente podemos construir el\ntutor de Bloom, ¿verdad? Y eso es maravilloso, pero también fue una limitación humana. Ahora tenemos un nuevo sistema que\ncambiará la forma en que trabajamos, la forma en que organizamos el trabajo. Estaría pensando internamente, ¿ todavía queremos hacer Sprints?  ¿ Todavía queremos hacer Agile? Estos se construyeron alrededor de sistemas humanos.  ¿ Cómo es el nuevo modelo? Entonces creo que esa es la visión.  Y , ¿cómo llevas a\nun compañero, ya sabes, cómo te obliga a ir más\nallá del aula y resolver problemas? Tal vez podría impulsarte a\ncrear algo, ¿verdad? Entonces, en lugar de simplemente hacer un proyecto que es como un proyecto de una sola clase, cómo los integramos. Y luego, la otra cosa que\nsimplemente diría es que creo que STEM se volvió mucho menos interesante\nen relación con las humanidades de lo que lo fue en el pasado. Y las humanidades realmente\nayudan y las ciencias sociales realmente ayudan aquí porque\nfuncionan como una persona. Y cuanta más\nhistoria humana puedas profundizar, más podrás obligar a la IA\na pensar de maneras interesantes. Así que también pienso en intentar\ntejer algo de eso, ¿sabes? Muchas cosas que\nantes no eran prácticas ahora se vuelven prácticas. Muchas cosas que tenían una\norientación muy práctica se volvieron mucho más teóricas. Así que tomar esa iniciativa y repensar las agendas y los programas de estudios también es realmente interesante. - Tienes toda la razón. Como sabes, alguien que está a\ncaballo entre ambos mundos, ya sabes, con una\nformación más técnica, ciencias de la computación, ya sabes,\nvi en la escuela que muchos de los estudiantes que luchaban\ncon cosas como ingeniería y codificación, tenían problemas.\nreducir los problemas a algo que se pueda\nlinealizar en un algoritmo y pensar en todos los casos extremos y cómo se crean variables y cómo se\nreducen realmente a eso. Pero ahora con la IA,\naunque todavía es software, se ve lo contrario.  Les he dicho activamente incluso a los\nmiembros del equipo: \"Has escrito este mensaje\ncomo si fuera un algoritmo. No hagas eso\". La gente dice: \"Primero pregúntale\nesto al usuario y luego haz esto\". Yo dije: \"No, no hagas eso. Dile a la IA cuál es tu objetivo\". Porque quieres que la IA\nsea más robusta y flexible. No querrás que siempre haga eso primero y siempre haga eso segundo. Quieres que le dé tu objetivo aquí. No microgestiones cómo llega a la meta y lo hará\nde una manera más dinámica. O dale un sentido de tono o ya sabes, estas cosas no son... - Sí, dile quién es. Es mal software, es\nbuena gente, ¿verdad? Como si no funcionara bien como software porque no hace lo\nmismo cada vez.  Se queda atascado en bucles. Tienes que aprender a\ntrabajar con eso.  Te miente. Tienes que aprender a trabajar con ello. No importa lo que hagamos,\nhace estas cosas, ¿verdad? Es decir, haces lo\nmejor que puedes, eso disminuye, las alucinaciones disminuyen,\npero son reales. Es un verdadero problema. Entonces, si piensas en esto como\nuna persona, lo hace mejor.  Le he dado pruebas, ya sabes, obtiene mejores resultados en el\nmito educativo que los profesores.  Ya no cree más\nen los estilos de aprendizaje, por ejemplo, lo cual es genial,\npero todavía comete errores. Y creo que tienes razón,\nhay que dárselo a una persona, pero también hay que enseñar a las\npersonas que lo están usando. Es una persona, si empieza a\nsalirse por la tangente hay que reconducirla. No es una entidad súper inteligente que sepa cuál es el futuro. Y la gente lo usa así,\ncomo un oráculo todo el tiempo.  ¿ Cómo es el futuro de la IA? No lo sabe. Incluso si fuera inteligente como persona, no tiene respuestas para ti. Trátalo como a una persona y\nprográmalo como una persona y entonces será un tipo\nde bestia muy diferente con quien jugar. - No, eso es correcto. Y haces mucho trabajo, ya sabes, sólo en la otra dimensión. Trabajas mucho en simulaciones, simulaciones de negocios, cosas así.  Me imagino que irás a la ciudad. Y deberíamos pensar en colaborar. Me encantaría llevar algunas de\nsus simulaciones previas a la IA a niños de K-12 o en\notro contexto, pero tengo curiosidad por saber cómo\nlo piensan en el mundo de la IA. - Sí, nos encantaría. Quiero decir, he estado gastando, ya sabes, escribí un libro sobre juegos en\neducación hace como 12 años.  He estado creando juegos desde entonces. Logré que Wharton\ninvirtiera en esto. Tenía un equipo de 14 personas,\nhemos tenido gente que ganó el Premio Hugo a la mejor\nnovela de ciencia ficción. Veo algo de ciencia ficción detrás de ti. Entonces, ya sabes, como uno de nuestros\nescritores que nos ayudó con parte de la historia\ny son increíbles, ¿verdad? He pasado años creando estos juegos en los que diriges una\nnueva empresa falsa en tiempo real o estás en una\nmisión espacial condenada al fracaso a Saturno y te enseñan\nhabilidades de liderazgo. Y luego, por supuesto, lo\ninquietante fue que escribí un mensaje bien dirigido en la IA y comenzó a interpretar muy bien a\ntodos los personajes de mi juego, ¿verdad?  El 70% del esfuerzo de un año se\npodría lograr con un párrafo. Entonces creo que esta idea de jugar con simulaciones es otra cosa. Estamos acostumbrados a un\naprendizaje muy didáctico e incluso al tipo de\naprendizaje didáctico interactivo del modelo de tutor. Podemos empezar a hacer otras cosas, ¿verdad? Quiero decir, muchos\neducadores estarán familiarizados con el modelo de la edad del diamante, ¿verdad? De como este tutor universal que convierte la enseñanza en un juego. Lo que he aprendido es que\nno se pueden hacer juegos que enseñen lo suficientemente atractivos como para\nreemplazar los juegos reales. En el mejor de los casos, son un 80 % más divertidos que un juego de la vida real. Pero pueden ser una\nforma realmente interesante de enseñar y combinar simulaciones y juegos con aprendizaje didáctico real y pruebas y escribir un libro para hacer esto\ny el trabajo basado en proyectos. De repente todo esto es barato de hacer. Es fácil de hacer a\nescala.  Es muy emocionante. Porque puedo decirles que las\ncosas basadas en simulación marcan una gran diferencia en la vida de las personas. Y es algo\nque normalmente tendríamos que gastar millones de\ndólares en construir un simulador y ahora es algo que\npodríamos hacer mucho más fácilmente. Y creo que eso también es muy,\nmuy emocionante. - Quiero decir, lo digo en serio. Después de esto, nos conectaremos\nporque quiero, ya sabes, obviamente hay dos\nescuelas que ayudé a iniciar, Khan Lab School, que\ntambién tiene una escuela secundaria y tenemos esta otra escuela secundaria en línea. Creo que todas tus\nsimulaciones de escuelas de negocios. Me encantaría que, ya\nsabes, estudiantes de secundaria, preparatoria, tal vez incluso de primaria, los\nhicieran todos. Creo que sería transformador. - En realidad, es bastante divertido. Construimos esto para estudiantes universitarios. Nuestros mejores jugadores a menudo son\nestudiantes de secundaria que juegan estos juegos\nporque no tienen la oportunidad de hacer\nnegocios y se lo toman muy en serio y, como resultado,\nobtienen mucho provecho de ello. Mientras que alguien que está en\nuna clase de escuela de negocios, es como si se involucraran en ella, pero es un tipo diferente de experiencia.  Para los estudiantes de secundaria,\nel objetivo antes de esto era en realidad crear una clase\nen una caja de la misma manera que yo hice\ncursos masivos en línea como ustedes, y al igual que ustedes, reconocieron los límites\nde estas cosas, ¿verdad? Y de la misma manera hemos\nreconocido los límites de estos. Entonces, ¿cómo lograr que la gente\nexperimente el juego y aprenda bajo demanda? Se convirtió en\nnuestro gran objetivo y creo que lo hemos logrado. Así que me encantaría hablar sobre esas cosas y que las pruebes. Son, ya sabes, toda la educación. Hemos hablado con varios\nfundadores multimillonarios y, ya sabes, ficcionalizamos\nsu experiencia en el juego y, ya sabes, hay\ncientos de caminos ramificados y, de hecho, hemos llenado\nGoogle y Wikipedia con información falsa sobre\nel mundo del juego. Así que puedes simplemente buscar cosas en Google y obtener información útil de ellas. Así que también me divertí mucho construyéndolo. - Has hecho de la realidad\nparte de tu simulación. - Juegos de realidad alternativa.  Si, exacto. - Impresionante. Bueno, Ethan, podría hablar\ncontigo durante horas sobre esto. Creo que eres\nuna de las pocas personas que realmente se está inclinando por esto, y especialmente en la educación. Así que espero que esta no\nsea nuestra última conversación.  En realidad, tampoco es la\nprimera vez.  (risas) - Me encanta. Me encanta lo que estás haciendo con tu misión y es emocionante verlo, ¿sabes? Estuve perfectamente involucrado\nen todo, por ejemplo, una computadora portátil por niño durante todos estos esfuerzos educativos\ny ahora estamos realmente cerca de ese sueño de, ¿\ncómo podemos hacer que la tecnología realmente mejore la educación? Lo que ustedes están haciendo es muy importante y muy emocionante, pero también da mucho miedo a mucha gente. Pero creo que al aceptarlo, empiezas a ver el\nvalor real de lo que está sucediendo aquí. Así que gracias por invitarme. - Gracias.",
    "t_arabic": "- مرحباً جميعاً.  سال\nهنا من أكاديمية خان. وكما يعلم البعض منكم، فقد\nأصدرت كتابي الثاني، \"كلمات جديدة شجاعة\"، حول مستقبل الذكاء الاصطناعي في التعليم والعمل. إنه متاح أينما\nيمكنك شراء كتبك، ولكن كجزء من البحث لهذا الكتاب، أجريت بعض المقابلات مع\nبعض الأشخاص الرائعين، والتي أنت على وشك مشاهدتها. أنا متحمس لتقديم\nالبروفيسور إيثان موليك، وهو أستاذ في كلية وارتون بجامعة\nبنسلفانيا، والذي قام أيضًا بالكثير من العمل على المحاكاة\nفي كلية إدارة الأعمال، لكنني أعتقد أن الأمر الأكثر\nصلة بما نقوم به، أنت  لقد صنعت اسمًا لنفسك نوعًا ما على مدار الأشهر القليلة الماضية كشخص يستخدم الذكاء الاصطناعي\nمن أجل الخير في التعليم. مرحبًا بك يا إيثان.\n- أشكركم على استضافتي. يسعدني أن أكون هنا. - لذلك دعونا نبدأ من البداية. ما هو أول\nتلقين أو تعرض لك، خاصة أشياء مثل\nنماذج اللغة الكبيرة، ما هي بعض ردود أفعالك الأولية ثم ما هي بعض\nالطرق التي بدأت بها تدرك فعليًا\nأنها يمكن أن تكون ذات قيمة؟ - وكما قلت، لقد كنت\nأفكر في كيفية جعل التعليم ديمقراطيًا\nلفترة طويلة جدًا. مثلًا، أنا أنحدر من\nمنظور كلية إدارة الأعمال وهناك كل هذه الأبحاث التي تقول إن الكميات الصغيرة من\nتعليم إدارة الأعمال تغير حياة الناس وتتحكم في الدراسات حول العالم.  لقد كنت أفكر\nفي هذا الأمر لفترة من الوقت وكنت ألعب أيضًا\nبالأدوات التي تقوم بذلك، لذلك أقوم ببناء عمليات المحاكاة،\nولكنني أيضًا كنت على دراية بـ GPT 3، والذي كان\nإصدار GPT قبل الدردشة من البرنامج،  أي نوع من المقالات الجيدة عالية المستوى للصف الخامس\nفي تلك المرحلة. واعتقدت أنه يجب علي\nتوعية طلابي بهذه الأشياء. لذلك بدأت بتكليفهم\nبمهام للغش بها. لذا اكتب أفضل مقال\nممكن باستخدام هذا واستخدام Dall-E لإنشاء صورة ثم تحدث عن\nحالة العالم. والأمر المضحك للغاية هو أنه في منتصف مهمة الغش،\nعندما قام نصف طلابي بتسليمها ولكن\nالنصف الآخر لم يفعل، ظهرت Chat GPT. لذلك كان هناك\nتغيير مفاجئ في مستوى الجودة كان دراماتيكيًا للغاية\nخلال تلك الفترة. - وماذا لاحظت؟\nفي الواقع، أنا فضولي. أعني أنك قلت: \"حسنًا، من الناحية النظرية، يمكنك\nالغش بهذه الأشياء.\" لذا فإن الطلاب يغشون بهذه الأشياء، وبحكم التعريف، لا يعتبر ذلك\nغشًا إذا طلب منك الغش، لكن هل رأيت فرقًا؟ أعني أنه من الواضح أنه كان لديك\nاختلاف بين Chat GPT، الذي يستخدم GPT 3.5 وGPT 3 العادي. لقد رأيت بالفعل فرقًا هناك، لكن هل رأيت اختلافًا مقارنة بما رأيته في\nالسنوات السابقة من عمل الطلاب؟ - نعم، أعني، حسنًا، الأمر المثير للاهتمام هو أننا نحكم على الكتابة والذكاء على أنهما قريبان جدًا من بعضهما البعض، أليس كذلك؟ وكما تعلمون، بطرق\nيصعب فصلها، فإننا نعتبر كتابة المقالات هي الطريقة التي نتعلم بها كيفية\nالتفكير أثناء كتابتنا للمقالات. ربما هذا صحيح، وربما لا. نحن حقا لم نختبر هذه الأشياء. إنها مثل الكثير من الأمور التعليمية، فنحن لا نعرف الإجابات فعليًا. ولذلك كان لدي طلاب في صفي أشخاص رائعون\nولكنهم ليسوا كتابًا جيدين. اللغة الإنجليزية هي لغتهم الثالثة\nأو، كما تعلمون، جاءوا من خلفية\nلم يتعلموا فيها الكتابة بشكل جيد. لذا، حتى مجرد وجود\nالقليل من التلميح، فهو يشبه إلى حد ما القواعد النحوية، أليس كذلك؟ مثل، أحدثت فرقًا في\nجعلهم يكتبون بشكل أفضل. وبعد أن قدمت بعض\nطلابي إلى Chat GPT، قالوا، كما تعلمون، إنني\nأتلقى الآن معاودة اتصال بالوظيفة لم أقم بها من قبل وأحصل على\nالوظيفة التي أجري فيها مقابلة، ولكن لأنني\nأستطيع الكتابة  حسنا الآن، أليس كذلك؟ وهذا جزء من سبب\nجعلي استخدامات الذكاء الاصطناعي إلزامية في جميع فصولي الدراسية. لذلك لم أعد أقبل أي شيء لم\nيُكتب بشكل مثالي في هذه المرحلة. لماذا تهتم؟ - وما هو رأيك،\nفكر في الأمر من وجهة نظر صاحب العمل\nحيث أعتقد أنهم كانوا يستخدمون إشارة،\nشخص يكتب خطابًا تقديميًا بليغًا حقًا\nمقابل شخص لا يفعل ذلك، وكانوا يستخدمون هذه الإشارة الصغيرة. الآن كل شيء بليغ، ولكن ربما يأتي هذا الشخص\nإلى العمل ويقول، \"أوه، ربما مهاراتهم اللغوية\nليست قوية كما اعتقدت أنها مبنية على...\" ما هي وجهة نظرك؟  هل هم الغش أم أن هذا بخير؟ لأنه يمكنني استخدام Chat GPT أو أي شيء آخر لمواصلة الكتابة بشكل جيد. - إنه في الواقع\nسؤالان مثيران للاهتمام حقًا. الأول هو، كما تعلمون، سؤال الغش بشكل عام هو\nسؤال كبير نوعًا ما، أليس كذلك؟ ماذا يعني\nالغش هذه الأيام، أليس كذلك؟ إذا طلبت نصيحة من الذكاء الاصطناعي\n، لكن لا تستخدمها. إذا طلبت منك إكمال فقرة، وإذا طلبت ذلك للجميع، فهل هذا غش؟ إنه سؤال مختلف كثيرًا\nعن السرقة الأدبية، أليس كذلك؟ \nوالسؤال الثاني هو، كما تعلمون، الكثير من الأشياء الجيدة\nسوف تتضرر بسبب الذكاء الاصطناعي، لكن الكثير من الأشياء السيئة، أليس كذلك؟  لقد تبين أن الحكم على\nالأشخاص بناءً على خطابات التقديم لم يكن أبدًا\nطريقة رائعة بشكل خاص، أو أن المقال الجامعي لم يكن أبدًا طريقة رائعة بشكل خاص\nلتحديد القبول. أفضل طريقة لدينا\n للتحليلات الوصفية على نطاق واسع هي في الواقع\nإجراء مقابلة تفصيلية تعتمد على ما ينجزه الأشخاص فعليًا في حياتهم، أليس كذلك؟ إذا كانت مهارات الكتابة\nمهمة، فسيتعين عليك إعطاء الأشخاص\nاختبارًا منفصلاً للكتابة. لكن بالنسبة للعديد من الوظائف،\nفهذه ليست المهارة الرئيسية أو سيتم تنفيذها بواسطة الذكاء الاصطناعي الآن. لذلك، في بعض النواحي، يعد هذا غشًا، ولكنه أيضًا\nيجبرنا على إعادة النظر في ما هو ذو قيمة فعلية\nفيما يتعلق بالإشارة. الكثير من الأشياء التي نقوم بها، خاصة كمعلمين\nفي الغرفة، تتعلق بنوع من إشعال النار في وقتك\nلإظهار اهتمامك، أليس كذلك؟ على سبيل المثال، إذا طلب مني شخص ما أن أكتب له خطاب توصية\n، فإن الأمر يستغرق ساعة لكتابة\nخطاب توصية جيد حقًا. يمكنني لصق السيرة الذاتية\nللشخص والوظيفة التي يتقدم لها\nوما هو مكتوب في GPT 4 والحصول على رسالة أفضل\nمما قد يستغرق مني ساعة لكتابته. وأنا أواجه صعوبة دائمًا، هل أستخدم الحرف الذي تم إنشاؤه لأنه يشير إلى أفكاري،\nلكنني لن أقضي الوقت الذي كنت سأقضيه بعد الآن\nلإنجاز هذا العمل. وأعتقد أن هذا هو\nالتحدي المثير للاهتمام حقًا. - أحب عبارة\nإشعال النار في وقتي لإظهار أنني أهتم. أمي دائما تريد مني أن\nأقلها من المطار. (يضحك) - والدي أيضًا.  والدي\nأيضا.  (يضحك) نفس الشيء. - أفعل.  أفعل.  لقد أشعلت النار في هذا الجزء من يومي حتى أتمكن من إظهار اهتمامي بها. لكنني أعتقد أنك على حق،\nفنحن مليئون بالتقاليد، بما في ذلك ربما الرسالة التعريفية\nوكل هذا تقريبًا مجرد طقوس فقط لإشعال النار في وقتك\nلإظهار اهتمامك. لكن هل يضيفون قيمة بالفعل؟ وحتى بالنسبة للأشخاص الذين... بعض الأشخاص لديهم\nأشخاص آخرون يدربونهم، ويساعدونهم في أشياء مثل\nالمقالات الجامعية أو السيرة الذاتية، وهذا نوع من\nنسخة كثيفة الموارد من Chat GPT أو GPT 4.\n- بالضبط. وأعني، الشيء المثير، ولهذا السبب أحب ما\nتفعلونه يا رفاق، هو أنه لدينا فجأة مليارات\nالأشخاص الذين لديهم إمكانية الوصول إلى أفضل الذكاء الاصطناعي الذي\nتم إصداره للعامة على الإطلاق. على سبيل المثال، إذا كنت غنيًا، فلن تتمكن من\nالوصول إلى ذكاء اصطناعي أفضل ويمكنك الوصول\nإليه مجانًا من خلال Bing أو من خلال أنواع الأشياء التي تفعلونها\nيا رفاق، أليس كذلك؟ إنه متوفر في كل مكان. وهذا هو\nالشيء الأكثر إثارة للاهتمام في التعليم لأننا اعتدنا أن نواجه\nكل هذه الحواجز. كل المحاولات السابقة للقيام بذلك كانت صعبة وصعبة، أليس كذلك؟ لذلك أعتقد أن جزءًا من هذا\nالسؤال هو، كما تعلمون، أنه يضفي طابعًا ديمقراطيًا على أشياء لم نتمكن\nمن إضفاء الطابع الديمقراطي عليها من قبل.  لقد كان الأمر مثل، يمكنك\nتعيين مدرس خصوصي، وسوف تقوم بعمل أفضل. الآن ماذا يحدث عندما يكون\nلدينا معلم خاص يمكن للجميع استخدامه وهو في الواقع\nأفضل من المعلمين البشريين؟ هذا احتمال مثير حقًا\nومخيف بعض الشيء. - نعم أنت على حق. إنه أمر مثير ومخيف في نفس الوقت،\nونحن جميعًا، كما تعلمون، نعمل على خانميغو\nداخل أكاديمية خان ونقوم بنشره على نطاق\nواسع بشكل متزايد الآن. وأنا وأنت\nنتصادم كثيرًا لأننا نبدو في\nجدول المحادثات معًا كثيرًا. مثلًا، هذا ما تفعله أكاديمية خان، وانظر إلى هذا الأستاذ\nالذي لا يخشى استخدام الذكاء الاصطناعي. لذلك دعونا نواصل رحلتك لأنك تحدثت عن تلك الأيام الأولى، وشجعت الأطفال على اقتباس كلمة \"الغش\" باستخدام الذكاء الاصطناعي، ولكن ذلك كان يؤدي\nإلى نتائج أفضل. لكن هل غيرت\nما هي المهام؟  هل قمت بتغيير الحد الخاص بك لما يجعل مهمة جيدة؟ - نعم، أعني، هناك\nثلاثة أشياء كان علي القيام بها نتيجة للذكاء الاصطناعي. إذن المستوى الأول، وأعتقد أن الجميع سيواجهون هذه المشاكل، أليس كذلك؟ المستوى الأول يتوقع\nالمزيد من الطلاب، أليس كذلك؟ لذا فإن أول شيء يتعين علينا جميعًا فعله\nهو، كما تعلمون، أقوم بتدريس فصل دراسي حول ريادة الأعمال،\nوكما تعلمون، مرة أخرى، أعلم أن هناك أشخاصًا يستمعون ويعلمون، كما تعلمون، مهارات الكتابة الأساسية. سيكون عليك\nالتكيف بطرق مختلفة. سيكون هذا مختلفًا\nبالنسبة لكل شخص.  بالنسبة لبعض الناس،\nسيكون الأمر كله يتعلق بوجود مهام كتابية في الفصل\nحتى يتعلم الناس كيفية الكتابة لأنهم\nسيغشون خارج الفصل.  لقد فهمت ذلك، لذا فإن هذا\nليس أمرًا عالميًا، لكنها بالتأكيد حالتي. أتوقع المزيد. لذلك اعتاد الناس على تقديم\nخطة عمل. والآن يتعين عليهم تسليم\nخطة العمل، ورمز العمل، حتى لو لم يتمكنوا من البرمجة من قبل. أنا الآن رمز. لا أستطيع البرمجة، لكني\nكتبت 12 برنامج بايثون في الأسبوعين الماضيين، أليس كذلك؟ يجب عليك تسليم\nصفحة ويب تعمل بكامل طاقتها. يجب عليك إجراء مقابلات مع أشخاص حقيقيين ومزيفين باستخدام\nالذكاء الاصطناعي، وهناك بعض البيانات التي يمكنك مسحها باستخدام الذكاء الاصطناعي\nوهي دقيقة بالفعل. لذا فإن توقعاتي للعمل أصبحت الآن أعلى بكثير مما كانت عليه من قبل. إذن هذا هو نوع\nالتعديل الأول، أليس كذلك؟ المجموعة الثانية من التعديلات هي أنني الآن أدمج الذكاء الاصطناعي\nفي المهام. لذا فإن الذكاء الاصطناعي هو زميل لطلابي. لذلك انتهى بهم الأمر الآن إلى\nإحضار الذكاء الاصطناعي، كما تعلمون، هناك مهام. على سبيل المثال، كل مهمة يقومون بها يجب أن تخضع للنقد من قبل\nثلاثة رواد أعمال مشهورين آخرين على الأقل، وهو ما\nيتعين عليهم إنشاءه. لذلك يحصلون على ردود الفعل على طول الطريق. والشيء الثالث،\nوهو الشيء الكبير حقًا، هو تغيير الطريقة التي نؤدي بها الفصول الدراسية. المحاضرات ليست ذات\nمعنى كبير عندما يكون لدي أدوات مثل خانميغو التي يمكنها\nالقيام بتدريب مذهل حقًا، كما تعلمون، عن بعد. لذا فكر في كيفية قلب\nالفصل الدراسي بهذه الطريقة. - نعم، لا، حسنًا، أعني أن\nهناك الكثير هناك. أعني، لقد وجدت أمرًا رائعًا... لذلك سيكتب الطلاب\nملخصًا تنفيذيًا لخطة عمل أو شيء من هذا القبيل، ثم يسألون مثل، ستيف جوبز\nأو أحد رواد الأعمال المشهورين، كما تعلمون، لشركة Ford أو شخص ما،\nأو Tesla  ، شخص ما... أو أعتقد أن إيلون ماسك، ليشارك\nفي خطة أعمالهم وهذا جزء من المهمة الآن؟ - نعم.  يجب أن يكون لديهم... لذا، من أجل تحويل\nمخططهم فقط، والذي كان شيئًا أود التعليق عليه فقط، يجب أن يكون لديهم ثلاثة\nرواد أعمال مشهورين يعلقون على خطتهم، أليس كذلك؟ وهذا يعلمنا أيضًا\nالقليل عن مطالبات الكتابة، لكن حدود هذه\nالأشياء، لا تستحضر في الواقع روح\nستيف جوبز، أليس كذلك؟ بدلًا من ذلك، عليهم أن يدركوا، كما تعلمون، أن ذلك يساعدهم على التفكير في\nهذا العالم الجديد الذي نعيش فيه. ومن ثم عليهم أيضًا إجراء تشريح لما قبل الوفاة. لذا فإن المشاريع تنجح\nبشكل أفضل عندما تتخيل فعليًا كيف يمكن أن تفشل. لذلك يتعين عليهم توليد مجموعة كاملة من فرص الفشل\nنتيجة لذلك أيضًا. اعمل بشكل عكسي على كيفية حلها. لذلك يتيح لي القيام\nبأشياء مختلفة نعرفها من البحث تجعل الفرق تعمل بشكل أفضل، وتجعل الأشخاص يعملون بشكل أفضل. لكننا لم نتمكن من القيام بذلك من قبل لأنه\nكان يتطلب الكثير من العمل. - وهذا قوي جدًا. وكما تعلمون، ما تفعلونه أيضًا، سواء بشكل\nصريح أو ضمني، هو أنك تجعلهم على\nدراية تامة بهذه الأدوات\nوالقوة التي تتمتع بها. لأن أسوأ شيء يمكن أن تفعله هو أن هؤلاء الطلاب يعيشون في\nفقاعة ثم يخرجون إلى القوى العاملة خلال عام أو عامين ويقولون، \"انتظر،\nماذا حدث للتو؟ الجميع يستخدم GPT 5 الآن،\" أو أي شيء آخر  . لكنهم سيكونون قادرين على القيادة في ذلك. ووجهة نظرك حول\nالفصل الدراسي المعكوس، كما تعلم، كما تعلم، كنت أتحدث\nحتى عن ما قبل الذكاء الاصطناعي في عالم الفيديو حسب الطلب، بصراحة،\nحتى الفيديو المسبق عند الطلب، ودروس العلوم الإنسانية، وحتى\nكلية إدارة الأعمال يقرأ الصفوف القضية، تعالوا إلى المدرسة،\nوسنناقش الأمر. أعتقد أن هذا\nكان دائمًا أفضل الممارسات.  بل وأكثر من ذلك في عالم الذكاء الاصطناعي.  إلى أين يتجه هذا؟  كما تعلمون، هل تستمرون في\nتطوير دوراتكم؟ أنا متأكد من أن جميع أنواع\nأعضاء هيئة التدريس يأتون إليك ويقولون، \"ماذا أفعل؟\" ماذا تقول لهم؟ - أعني، الشيء الوحيد الذي\nنفعله هو أننا نشارك المطالبات، أليس كذلك؟ بالنسبة لي، هذا هو\nأهم شيء يجب القيام به. لدي بعض الأوراق البحثية، وأنا متأكد من أنه يمكننا وضع\nروابط في مكان ما للأشخاص، ولكن حيث نحاول اتباع مناهج تربوية نوعًا ما، أليس كذلك؟  إن الحث أمر سحري، لكنه\nيساعدك في الحصول على الخبرة. لذلك قمنا بكتابة بعض المطالبات التي تقوم بأشياء مختلفة\nمثل تشبيهات الشرح، وبعض الأشياء التي تفعلها في خانميجو، ولكن يمكن أن يكون ذلك قابلاً\nللتطبيق في العديد من الفصول الدراسية. هناك أدوات لمساعدة المعلمين، كما تعلمون. لذا فإنني أحاول معرفة\nكيف أن مهمة إرساء الديمقراطية التي تقومون بها يا رفاق هي\nنفس المهمة التي أفكر فيها. كيف نعطي أدوات المعلم؟ كيف نعطي الطلاب الأدوات؟  كما تعلمون، وعد\nالذكاء الاصطناعي هو فجأة، كما تعلمون، الشيء الذي اعتقدنا\nأن الإنترنت سيفعله، وهو إذا منحنا الجميع إمكانية\nالوصول إلى المعلومات. الجميع سوف يتعلم كل شيء.  لقد تبين أن مجموعة صغيرة جدًا\nمن الأشخاص هم في الواقع نوع من المتعلمين البنائيين\nالذين لا يحتاجون إلى الدعم ويمكنهم التعلم بمفردهم. لكن الآن لدينا أداة\nيمكنها بالفعل تقديم الدعم، والدروس الخصوصية،\nوبعض المواد الأخرى التي نعرف أنها فعالة وتنفذها على نطاق واسع. ولقد سمعتك تتحدث عن، كما تعلم، 2 سيجما لبلوم. أعني أننا لا\nنعرف حتى مدى نجاح هذا الأمر في هذه المرحلة، لكننا\nلم نتمكن من القيام بذلك من قبل. ومثلك تمامًا، لقد قمت\nبعمل ضخم، كما تعلمون، ليس قريبًا من نطاقك، ولكن كان لدي، كما تعلمون،\nبضع مئات الآلاف من الأشخاص يأخذون دورات الفيديو الخاصة بي عبر الإنترنت.  كما تعلمون، هناك\nفرق كبير بين ذلك وبين ممارسة\nالتمرين والحصول على ردود الفعل. لذلك نحن نحاول التفكير في\nكل هذه القطع. - وماذا تقول لأعضاء هيئة التدريس؟ لأنه ليس لدي أدنى شك، أعني أنك لا\nتتنقل في هذا الأمر بنجاح فحسب، بل أنت تزدهر في عالم الذكاء الاصطناعي المنتج. أنت تجعله يعمل من أجل التعليم. أشعر بتفاؤل مماثل لما تفعله، ولكنني أعتقد، كما\nتعلمون، أن 90% من المعلمين في الوقت الحالي ليسوا\nفي نفس الحالة الذهنية. إنهم نوع من الذعر.  كما تعلم، لنفترض أنك كنت\nتكتب مقطوعة موسيقية للطلاب الجدد، هذا كل ما كان عليك فعله. مثلًا، مهمتك بأكملها هي\nالتأكد من أن الطلاب يتعلمون الكتابة وأنك\nتقوم بتقييمهم. ماذا ستقول للمعلمين مثل هؤلاء الذين يشعرون\nبالخوف أكثر قليلاً من أن أشياء مثل Chat GPT انفجرت مثل قنبلة\nفي أسلوبهم التربوي؟ - أعني، أعتقد أننا بحاجة\nإلى البدء بالأخبار السيئة.  لقد فعلت ذلك بالتأكيد، أليس كذلك؟ أعني أن الكثير من الأشياء تم تفجيرها للتو وكان بعضها أشياء جيدة، أليس كذلك؟ أعني أن هناك طرقًا\nكنا نعلمها منذ 2000 عام والتي كانت منطقية جدًا. ربما لم تكن مدعومة بالأبحاث حقًا، لكننا جيدون جدًا فيها، أليس كذلك؟  لقد أصبحنا جيدين في المحاضرات، وأصبحنا جيدين في\nأداء واجبات المقالات في المنزل وتقييمها. كنا جيدين في تلك الأشياء.  لقد تم\nتفجير ذلك، أليس كذلك؟ أعني، حتى بالنسبة لأفضل\nطلابك، طلابك الذين لا يغشون. بالمناسبة، كان الطلاب\nيغشون إلى الأبد، أليس كذلك؟ لكن الغش أصبح\nأسهل وأرخص بكثير. لكن حتى الآن، أفضل طلابك في وضع أقل حظًا لأنهم\nلا يغشون، أليس كذلك؟ لأنهم، كما تعلمون،\nلا يكتبون بنفس الطريقة. لذا فإن الأمر ينفجر كثيرًا، ولكن إذا كنت تقوم بتدريس\nفصل دراسي للتكوين للطلاب الجدد، فيجب عليك تغيير طريقة تدريسك. هذا الذكاء الاصطناعي غير قابل للاكتشاف. وأي شخص يخبرك بخلاف ذلك لا يقول لك الحقيقة في الواقع. إنه في الأساس غير قابل للاكتشاف. أحد الأشياء التي تعلمتها\nمن طلابي الذين يغشون هو بعد جولتين من الغش، كما تعلمون، ذهابًا وإيابًا باستخدام\nالذكاء الاصطناعي، وهي أفضل طريقة للتفاعل معه، كما\nتعلمون، فقط ضع مطالبة، وقم بالفرز  من التعامل معها. المقالات غير قابلة للاكتشاف من قبل\nالبشر أو أي معلم للذكاء الاصطناعي. لقد فجر ما فعلته. لذلك عليك أن تفكر كفرصة، ولكنها أيضًا مخيفة،\nويمكننا أن نعترف بذلك كمعلمين. ما يجب أن ندركه هو أن\nالتعليم سيكون على ما يرام. سوف نتكيف مع هذا التغيير، أليس كذلك؟ إنها أكبر من الآلات الحاسبة،\nولكنها لا تختلف كثيرًا عن\nالآلات الحاسبة ذات الضرر الضيق التي تستخدمها في دروس الرياضيات. كمدرس،\nربما تريد الحصول على مزيد من التعليمات\nخارج الفصل باستخدام مقاطع الفيديو وأشياء أخرى،\nومهام كتابة أكثر نشاطًا في الفصل مع انتقاد بعضكما البعض\nوكتابة مقالات قصيرة، ويمكنك إنجاز هذا العمل. لكنه بالتأكيد تغيير كبير. ولكنها فرصة للقيام بأشياء جديدة ومعرفة ما يناسبك. وأيضًا، الشيء الذي أود\nالتأكيد عليه للمدربين هو أن هذا أيضًا يجعل حياتك\nأسهل بعدة طرق. مثلًا، هناك الكثير من\nالأشياء التي نتمنى أن نتمكن من القيام بها ولم يكن لدينا الوقت للقيام بها. ومرة أخرى، لدينا مطالبات لكل هذا. ويكتب مسابقات كبيرة بالنسبة لك. أعلم أن لديكم أدلة\nأيضًا للقيام بهذه الأشياء. يساعدك كمدرس. لذلك لا يقتصر الأمر على زيادة عبء العمل الخاص بك وجعل حياتك صعبة، بل إنه\nيقلل أيضًا من عبء العمل الخاص بك ويمنحك\nمزيدًا من الوقت للتفكير أكثر في التعليم وكيفية\nتغيير حياة الطلاب، ولهذا السبب نحن جميعًا في\nهذا الأمر في البداية  مكان. - لا، أستطيع أن أتخيل. أعتقد أنك طرحت بعض\nالنصائح الجيدة جدًا في إجابتك، وهي، إذا كنت أقوم بتدريس\nشركات اللغة الإنجليزية للطلاب الجدد في إحدى الجامعات أو إذا كنت أقوم\nبتدريس فصل شركات اللغة الإنجليزية في مدرسة ثانوية، فإن العالم الذي\nسنذهب إليه  يمكن أن يكون الأمر معقولًا جدًا، حسنًا،\nلديّك لمدة ساعة أو ساعة ونصف في كل مرة. اكتب، وربما\nتكتب باستخدام الذكاء الاصطناعي، فهو لا يكتب لك، ولكنه\nيمثل حتى يتمكن من المساعدة في الإجابة على بعض الأسئلة، وما إلى ذلك. ولكن بعد ذلك يمكنه التقييم، ويمكنه إجراء المرحلة الأولى من التقييم بالنسبة لي. وبالتالي\nسيحصل طلابك في الواقع على المزيد من وقت الكتابة والمزيد من\nالتعليقات في هذا العالم. ونعم، ربما ليس لديهم الكثير\nللقيام به في المنزل.  هذا جيد. كل شخص لديه أقل للقيام به في المنزل. لديك أقل للقيام به في المنزل.\nأنت لا تقوم بوضع العلامات، كما تعلم، مثل مقالتك الثمانين حول\nشيء ربما يكون مخدرًا\nللذهن في تلك المرحلة ولا يفعله الطلاب أيضًا. كل شيء يمكن أن يحدث في تلك الليلة وهو أمر فعال للجميع. لذا نعم، هذا منطقي جدًا. - نعم، وأعتقد، كما تعلمون، أن احتضان هذا\nسيكون مهمًا ومن الجيد أن تشعر بالخوف\nعندما تستمع إلى هذا وتقول، \"أوه لا، لا أريد تغيير ما كنت عليه\"  عمل.\" لكننا ندرك أيضًا أن الكثير\nمن الطرق التي نجعل بها الأشخاص يكتبون المقالات لم تكن منطقية. مثل، الأشخاص الذين لم يكونوا\nجيدين جدًا في الفصل، أليس كذلك؟  لقد كتبوا مقالات سيئة خارج الفصل. كم من الوقت لدينا\nلتعليمهم لجعلهم أفضل؟ حسنًا، في نوع من الفصول الدراسية المعكوسة، وبيئة التعلم النشطة،\nوالتعلم النشط أكثر أهمية من\nالفصول الدراسية المعكوسة، فكرة أننا نقوم بالأشياء في الفصل، ربما يكون هناك المزيد من الوقت لهذا المعلم. ربما يمكن للذكاء الاصطناعي أن يساعدهم على اللحاق بالركب أو يقدم لهم\nشرحًا حيث كانوا بدلاً من كونهم مدرسًا يقوم\nبتقييم 80 مقالة كما قلت، ربما لديك\nالذكاء الاصطناعي الذي سيساعدك على تحديد الزوجين اللذين يحتاجان إلى أكبر قدر من المساعدة أو الزوجين اللذين يحتاجان إلى أكبر قدر من المساعدة  هي أمثلة عظيمة.  كما تعلمون، وإعطاء ردود الفعل بهذه الطريقة. ليس لدينا كل الإجابات بعد، أليس كذلك؟ إذن نحن في بيئة استكشافية، لكن لا يمكننا التظاهر بأن\nالعالم لم يتغير. هذه ليست واحدة من تلك الأشياء،\nمثل دروس الفيديو ليوم واحد، ماذا ستفعل بشأن\nالدورات التدريبية الضخمة عبر الإنترنت؟  لقد فات الأوان لذلك. مثلًا، هذا موجود الآن وسواء\nأحببنا ذلك أم لا، علينا أن نتكيف كمدرسين. - وأين تعتقد أن هذا هو؟ لأنه كما تعلم، كنا نتحدث عن\nنماذج اللغات الكبيرة، لقد ذكرت Dall-E، الذي يدور\nحول الصور التوليدية. هناك تقنيات حول\nالفيديو والفيديو التنكسية وتحويل الكلام إلى نص وتحويل النص إلى كلام.  لقد رأيت بعض العروض التوضيحية، كما تعلمون،\nأشياء مثل تحويل الكلام إلى نص وتحويل النص إلى كلام\nموجودة منذ فترة، لكنني رأيت بعض العروض التوضيحية\nمؤخرًا لبعض تحويل النص إلى كلام لا يمكن\nتمييزه حقًا  من الأصل، كما تعلمون، الإنسان إذا جاز التعبير، والذي سيخلق\nمشاكل مع التزييف العميق وكل ذلك في العالم الأوسع. ولكن إلى أين تعتقد أن هذا يتجه؟ أعتقد أنه حتى بالنسبة للأشخاص مثلنا، هناك أشياء جديدة تحدث كل أسبوع. كيف تعتقد أن كل هذا سيبدو خلال عامين أو ثلاثة أعوام؟ وكيف\nتراقب كل شيء؟ - إذن بضعة أشياء هناك، أليس كذلك؟ الأول هو أنه يجب على الجميع أن يدركوا أن الذكاء الاصطناعي، الذكاء الاصطناعي التوليدي هو ما يسمى\nبتكنولوجيا الأغراض العامة. وكما تعلمون، أقوم بتدريس\nالابتكار في مجال ريادة الأعمال. في دراسات الابتكار، نادرًا ما تظهر\nالتقنيات ذات الأغراض العامة . إنها تأتي مرة واحدة، كما\nتعلم، كل جيل أو جيلين، فكر في\nالطاقة البخارية، وربما الإنترنت، وربما أجهزة الكمبيوتر، ولكنها\nتؤثر على كل جانب من جوانب الحياة. وهذا هو أسرع\nواحد رأيناه على الإطلاق. أسرع اعتماد. إنها الأكثر شخصية.\nيمكن للناس أن يفعلوا الأشياء. سيؤثر ذلك على كل\nصناعة بشكل مختلف، كل شخص بشكل مختلف،\nكل وظيفة بشكل مختلف. لكنه سيؤثر على كل شيء، أليس كذلك؟ الوظيفة الأقل\nتأثرًا بالذكاء الاصطناعي وفقًا للدراسات المبكرة التي أجريناها هي التسقيف.  وقد تحدثت إلى\nاثنين من عمال بناء الأسقف مثل، \"أوه لا، في الواقع\nسيتغير السقف أيضًا لأنه يمكننا الآن تنفيذ جميع مقترحاتنا وأشياءنا بمساعدة الذكاء الاصطناعي.\" لذلك سوف يتغير السقف أيضًا. لذا يجب علينا أن ندرك\nأن العالم يتغير بطرق لا نعرفها دائمًا. إذن ما يجب أن تفكر\nفيه كمدرس هو إعداد الناس للعيش في\nعالم سريع التكيف. لذلك، كلما بدأنا في استخدام الذكاء الاصطناعي وتعرفنا على\nاستخدامه، أصبح من الأسهل على الأشخاص التكيف مع كل ما\nسيأتي بعد ذلك. لأنني أعتقد تمامًا، كما تعلمون، أنا وأنت، أن هناك هذه اللحظة\nمن GPT 4 حيث يبدو الأمر كما لو، \"يا إلهي، إنه يفعل\nالكثير مما يفعله الناس.\" إنه يفكر مثل الناس.  مثل،\nهذا ليس برنامجًا حقًا. من الجدير التفكير في\nالأمر وكأنه شخص. إنه ليس شخصًا، لكن\nيمكنك التفكير فيه كشخص. يمكن أن يكون ذلك مفيدًا. ومن ثم فإن السؤال هو:\nوماذا بعد؟  نحن لا نعرف.  هل يستمر هذا في التحسن؟  هل يبقى تقريبًا في مكانه؟ ليس لدي إجابات على\nذلك، لكن علينا أن نكون مستعدين وأفضل طريقة للقيام\nبذلك هي البدء في استخدامه. - حسنًا، كما تعلم، بصفتك\nأستاذًا في كلية إدارة الأعمال، وأعني أنك تطرقت للتو إلى هذا الأمر، فإن العالم يتحرك بشكل أسرع\nوأسرع وأسرع. ما هي النصيحة، أنا متأكد من أن\nطلابنا يطلبون منك أو الآباء. مثل، ما الذي يجب أن يعمله أطفالي؟ مثلاً، ما هي المهارات التي ينبغي عليهم\nتطويرها، وأي منها ربما لم تعد مهمة\nكما كانت من قبل؟ - لذا أعتقد أن التفكير\nلا يزال مهما، أليس كذلك؟ لذا فإن الكثير من الأسباب التي جعلت الناس\nيقولون إن الكتابة مهمة، وكتابة المقالات هي التفكير،\nوأعتقد أن هذا لا يزال صحيحًا جدًا. نحن بحاجة لتعليم الناس كيفية التفكير. أعتقد أنه في الوقت الحالي، وآمل في\nالمستقبل المنظور، الذكاء الاصطناعي أمر رائع. إذا كنت في أدنى 50% من العديد من\nالفئات المختلفة، فأنت الآن في الشريحة المئوية 50 أو 60 أو 70. هذا مشوق. إنه يوسع الفرص للأشخاص\nالذين فعلوا ذلك من قبل، أليس كذلك؟ لم تكن تستطيع الكتابة من قبل،\nيمكنك أن تفعل ذلك الآن. لم تكن جيدًا في البرمجة، أنت الآن مبرمج جيد. مثل، هذا مثير. أعتقد أن السؤال هو،\nما الذي تجيده، وما الذي تحبه\nحتى تكون ضمن أفضل 10% من الأشخاص؟ وأعتقد أن هذا\nشيء يمكنك من خلاله إضافة الكثير من القيمة إلى عالم الذكاء الاصطناعي. لذلك أعتقد أن جزءًا من هذا\nيتعلق بالتفكير فيما تريد القيام به، وأن\nلديك موهبة وكيف يمكنك تطوير تلك الموهبة وتلك الخبرة، وهذا يتطلب منك أن تستمر في تعلم\nالمعرفة الأساسية للمدرسة. يمكنك بناء الخبرة من خلال بناء\nالمعرفة الأساسية، أليس كذلك؟ من خلال رؤية الكثير من الأمثلة، والعمل مع الذكاء الاصطناعي للوصول إلى هناك، وأعتقد أن هذا يمكن أن يوصلك\nإلى مكان مثير حقًا. - سأكتفي ببعض\nالأمثلة الملموسة. كما لو قال شخص ما، \"\nحلمي هو أن أصبح عامل بناء أسقف،\" فسوف تقول: \"رائع،\nسيكون هذا عملاً رائعًا في المستقبل لأنك\nستكون قادرًا على القيام بالمزيد من أعمال الأسقف وسيقوم الذكاء الاصطناعي بكتابة\nمقترحاتك  لك.\" ولكن إذا جاء إليك شخص ما وقال لك، \"أريد أن أصبح محررًا لحقوق الطبع والنشر،\" أو \"أريد...\" هل ستقول نفس الإجابة؟ فقط، كما تعلمون، هل تصبح\nجيدًا حقًا في ذلك على الرغم من أن GTP 4 جيد بالفعل في ذلك؟ - إذن هذا هو الرهان، أليس كذلك؟ لا نعلم إلى أي مدى\nستتحسن هذه الأنظمة ، أليس كذلك؟ وأعتقد أن هناك اضطرابًا. نحن نشهد، في الدراسات المبكرة،\n تحسنًا في الأداء بنسبة 30 إلى 80٪ في العديد من\nالمهام التحليلية عالية المستوى، أليس كذلك؟ كتابة المهام القائمة، مهام التحليل، المهام الاستشارية، مهام البرمجة. لذا، إذا كنت تريد أن تكون في هذه المجالات، فسيكون الذكاء الاصطناعي جزءًا من حياتك. لذا، عليك معرفة ما\nإذا كان بإمكانك استخدام الذكاء الاصطناعي لزيادة إنتاجيتك بعشر مرات،\nوستكون هناك قيمة كبيرة فيك.  لا تزال هناك حاجة\nلإنسان في الحلقة. إذا لم تتمكن من معرفة كيفية استخدام الذكاء الاصطناعي لزيادة إنتاجيتك، سأكون\nأكثر توتراً في تلك المجالات.  كما تعلمون، أعتقد أن ما هي\nالصناعات التي يجب الدخول فيها، أعني، لكي نكون منصفين، كان الناس\nيتوقعون أن الذكاء الاصطناعي سوف يتجاهل أطباء الأشعة\nعلى مدار الخمسة عشر عامًا الماضية، وكانوا يقولون لا تصبح أخصائي أشعة. لا يزال هناك الكثير من\nالوظائف لأخصائيي الأشعة. لذلك من الصعب الرهان. لن أقوم برهانات مهنية ضخمة. لكنني أود أن أقول أنه كلما كانت\nوظيفتك تعتمد على الكتابة وأكثر روتينية، إذا كنت\nكاتبًا روائيًا، فلا يزال الذكاء الاصطناعي لا يستطيع ذلك، أو كاتبًا كوميديًا، لا يزال الذكاء الاصطناعي\nغير قادر على كتابة نكتة جيدة. هذه وظائف صعبة على أي حال.\nولكن كما تعلمون، تلك هي الأماكن. لكن إذا كنت تحاول كتابة النصوص، فأعتقد أنه ما لم تتوصل إلى\nطريقة لاستخدام الذكاء الاصطناعي، فسوف أشعر بالتوتر، أليس كذلك؟ لذلك، كلما كان المجال أكثر تعرضًا للذكاء الاصطناعي،\nكلما كان الذكاء الاصطناعي أفضل فيه، كلما زادت حاجتك\nإلى أن تكون قنطورًا في النموذج. قال غاري كاسباروف: نصف رجل، نصف حصان، نصف شخص، نصف حصان. يجب أن تكون قادرًا على العمل\nمع الذكاء الاصطناعي كحصانك وأن تكون الإنسان المتكامل معه ومن ثم يمكنك الكتابة بشكل أفضل. لا أعرف، لقد وجدت أن كتابتي\nقد تحسنت بشكل كبير باستخدام الذكاء الاصطناعي لإعادة فقرة إلى\nالوراء ولم أعد مهتمًا بالعمل عليها\nبعد الآن لأنني عالقة. أعطني 20 نسخة من\nهذا، وسوف يحدث، أليس كذلك؟ لذلك أعتقد أن هناك أمل في هذه المجالات، ولكننا لا نعرف مدى\nجودة هذا الأمر وهذا أيضًا مخيف بعض الشيء. - وذكرت مخيفة. أعني، لأنك تبدو\nكشخص غير خائف جدًا الآن، لكن عندما تقول مخيف، ما هي الأفكار المخيفة التي تدور في رأسك؟ - أعني، هناك\nمستويين من الرعب، أليس كذلك؟ أعني أن هناك أشياء\nستحدث بالتأكيد. لدينا اضطراب\nسيحدث بالتأكيد، أليس كذلك؟ كما قلت، أصبح من\nالتافه الآن إنشاء مقاطع فيديو مزيفة، مقاطع فيديو مزيفة لنفسي وأنا أتحدث\nمع دقيقة واحدة من خطابي.  لقد فعلت ذلك من قبل.\nالصور المزيفة سهلة، أليس كذلك؟ المحتوى والكتلة سهلان. لذلك هناك مجموعة من القضايا الاجتماعية التي سيتعين علينا التعامل\nمعها نتيجة لذلك. ثم هناك أيضًا حقيقة أن هذا سيؤدي إلى تعطيل الوظائف. لا نعرف ما هي الوظائف حتى\nالآن وبأي طريقة. نحن لا نعرف مقدار\nالاضطراب الذي سيحدث.  كما تعلمون، عادةً من\nالناحية الاقتصادية، عندما تتعطل الوظائف، لا\nيتعلق الأمر بالوظائف، بل يتعلق بالمهام. لذا، ليست وظائفك هي التي\nتتغير، بل المهام التي تقوم بها. وعادة ما ينتهي ذلك بالحصول على مجموعة أفضل من المهام. لقد قمت بتأجيل الأشياء المملة، لكن هذه يمكن أن تكون فترة مزعجة. يتم طرد الناس. الأشخاص الذين سيتم\nتعيينهم لا يتم تعيينهم. لا نعرف كيف سينتهي هذا. لذلك هناك بعض المخاوف\nالتي ستحدث مع تعطيل الوظائف، حتى\nلو أدى ذلك إلى نمو الاقتصاد. ثم السؤال هو هل يستمر في\nالتحسن؟ في الوقت الحالي، إذا كنت من بين\nالعشرة الأوائل، أو 20% من المجال، أعتقد، كما تعلم، أن الذكاء الاصطناعي هو أداة مناسبة لك. والسؤال الآن هو: كيف\nيمكننا تدريب المتدربين عندما يكون الذكاء الاصطناعي متدربًا أفضل من الكثير من المتدربين لدينا؟ كيف يمكننا تدريب الناس في المستقبل؟ وإذا استمر الذكاء الاصطناعي في التحسن، فماذا لو كان أفضل من الجميع باستثناء أعلى 1%، فماذا\nسنفعل جميعًا بوظائفنا إذن؟ وبالطبع، هناك\nنوع من التفكير المخيف حقًا وهو أن الكثير من الناس يقضون\nالكثير من الوقت في القلق بشأن تلك المخاوف مقارنة بهذه المخاوف الأخرى، والتي أعتقد أنها أكبر من ذلك بكثير. وهو، كما تعلمون، ماذا\nيحدث إذا أصبح هذا الشيء في الواقع فائق الذكاء؟ فكرة AGI هذه وما شابه، ماذا يحدث بعد ذلك؟ لكنني أعتقد أنه لا\nداعي للقلق بشأن ذلك.  كما تعلمون، الناس قلقون بشأن ذلك، يجب أن تقلقوا بشأنه، لكنني\nأعتقد أن هذه الأشياء الأخرى حول ما يحدث\nللوظائف وكيف يمكننا البقاء على قيد الحياة في هذا العالم المضطرب،\nأعتقد أنها أكثر أهمية. وأعني، كما تعلمون، أن كلا\nمنا يتغذى على هذا، لكنني أعتقد أن التعليم\nجزء من المفتاح هنا. إن القدرة على التفكير\nوالتكيف سيكون أمرًا مهمًا. لا يتم تدريبنا على شيء واحد، بل يتم تدريبنا على أشياء كثيرة. - نعم، أعني أنك\nذكرت أنك تجعل\nطلاب كلية إدارة الأعمال يكتبون التعليمات البرمجية وخطة العمل، وأنت تعلم ذلك. ومرة أخرى، يمكنهم أن يكونوا تقريبًا مديرين على نطاق صغير\nلفريق الذكاء الاصطناعي، إذا جاز التعبير. - هذا صحيح تماما. أعني، أعتقد أن عليك أن\nتفكر في الأمر. كل شخص على وجه الأرض حصل للتو على متدرب مجاني. ماذا ستفعل به؟ هو نوع من أن يسأل الجميع. - أو 5.\n- أو 10. ويقومون بأشياء مختلفة\nوهذا ليس سحريًا. يرتد الناس عنها\nويخافون من الذكاء الاصطناعي. ولدي كل الأسباب التي تجعلني أشعر بالتوتر.  لقد تحدثنا عنهم هنا، ولكن الحقيقة هي أنها هنا. وشعوري عند تعليم\nالطلاب كيفية استخدام هذا هو أنك تحتاج إلى ما بين خمس إلى 10\nساعات من استخدامه في عملك لترى ماذا سيفعل لك. إذا لم تقضي خمس أو عشر ساعات، فلن تصل إلى هناك. لذا فإن نصيحتي\nهي أنه عليك استخدام هذا. إذا كنت مدرسًا، فأنت طالب، استخدمه في الأشياء وشاهد ما سيحدث. وهذه هي الطريقة الوحيدة\nللمضي قدمًا. إنه ليس سحرًا لنسخ\nمطالبة من الإنترنت. إنها حقًا مجرد تجربة\nوإجراء حوار مع هذا الشيء كما لو كنت مع شخص ما. - أنا أتفق مع ذلك بنسبة 100%، وهو\nشخص ربما قضى شخصيًا، في هذه\nالمرحلة، حوالي 300 ساعة. إذا أردت إضافة مهارة واحدة إلى الإبداع، لأنني رأيت الكثير من\nالأشخاص يفضلون Chat GPT أو يستخدمون GPT 4 ويقولون،\n\"ماذا أفعل؟\" (يضحك) كما تعلمون، السماء هي الحد الأقصى. مثلًا، جرب أشياء مثيرة للاهتمام\nوستدرك أنها قادرة على فعل أشياء، كما تعلم، ستكون خيالًا علميًا. أشعر بالفضول، كما تعلم، ما هي\nنصيحتك لنا؟  من الواضح أننا نعمل على خانميغو. نحن نحاول أن نجعل منه\nمدرسًا خاصًا لكل طالب، أو مساعد تدريس، كما\nتعلم، ربما أكثر من ذلك. نحن نحاول إضافة أشياء مثل الذاكرة وأنواع مختلفة من\nالأنشطة، وتوسيع آفاقنا. ما هي أنواع\nالأشياء التي تود أن تراها تفعلها لجعل حياة\nالطلاب أو المعلمين أو أولياء الأمور أسهل\nأو حياة أي شخص أسهل. - لذا أعتقد أن جزءًا من\nالشيء المثير للاهتمام هو أنه بمجرد أن يصبح التفاعل مع الإنسان سؤالًا مثيرًا للاهتمام، أليس كذلك؟ كيف نبني هذه الأدوات بحيث تتناسب مع\nالنظام البشري الذي لدينا؟ مثل ما هي النصيحة\nلكيفية استخدام الطلاب لها؟ كيف يقدمون التغذية الراجعة للمعلمين بالطريقة الصحيحة؟  كما تعلمون، أنتم يا رفاق\nتفكرون كثيرًا في ذلك، لكنني أعتقد أن كيفية ملاءمة هؤلاء\nمع الأنظمة البشرية أمر مهم. ثم أعتقد أن الأمر الآخر هو محاولة أن تكون أكثر إبداعًا، أليس كذلك؟ ما تفعله هو تكرار هذا الإنسان على مستوى عالٍ جدًا. ماذا لو كان لدي مدرس فردي؟ لكن، كما تعلمون، كان هذا\nأفضل ما يمكن أن نفكر فيه، أليس كذلك؟ - نعم.\n- إذن السؤال هو: ماذا يمكننا أن نفعل أبعد من ذلك؟ مثل، كيف يبدو التعليم؟ مثل، هل يمكننا تقديم\nأنواع مختلفة من الألغاز والمهام؟  هل يمكننا القيام بمزيد من التعليم والتدريس القائم على الألعاب أكثر مما فعلنا من قبل، أليس كذلك؟ هذه مجموعة قوية جدًا من الأدوات. سؤال كبير آخر بالنسبة لي هو: كيف نبدأ في عمل\nنسخة متعددة اللاعبين من هذا؟ كيف يمكننا تضمين العديد من\nالأشخاص في الفصل الدراسي الذين يتفاعلون مع الذكاء الاصطناعي؟ كيف نصنع\nشخصيات ثابتة للذكاء الاصطناعي الذي تتفاعل معه وقمت باختيار الشخصية لمواصلة العمل معه.  لقد أصبحنا مقيدين جدًا\nبفكرة الإعجاب هذه، والآن يمكننا أخيرًا بناء\nمعلم بلوم، أليس كذلك؟ وهذا رائع، ولكن هذا كان أيضًا مقيدًا بشريًا. لدينا نظام جديد الآن،\nوسيغير طريقة عملنا، وكيفية تنظيم العمل. سأفكر داخليًا، هل ما زلنا نريد القيام بسباقات السرعة؟ هل ما زلنا نريد أن نفعل رشيقة؟  تم بناؤها حول الأنظمة البشرية. كيف يبدو النموذج الجديد؟ لذلك أعتقد أن هذا هو الرأي. ومثل، كيف تأخذ\nرفيقًا، كما تعلمون، كيف يجبرك على\nتجاوز الفصل الدراسي أيضًا وحل المشكلات فعليًا؟ ربما قد يدفعك هذا إلى\nإنشاء شيء ما، أليس كذلك؟ لذا بدلًا من مجرد القيام بمشروع مثل، مشروع فئة واحدة، كيف ندمجهم معًا. والشيء الآخر الذي\nأود قوله هو أنني أعتقد أن العلوم والتكنولوجيا والهندسة والرياضيات أصبحت أقل إثارة للاهتمام\nبالنسبة للعلوم الإنسانية مما كانت عليه في الماضي. والعلوم الإنسانية\nتساعد حقًا والعلوم الاجتماعية تساعد حقًا هنا لأنها\nتعمل كشخص نوعًا ما. وكلما\nتعمقت في تاريخ البشرية، كلما تمكنت من إجبار الذكاء الاصطناعي\nعلى التفكير بطرق مثيرة للاهتمام. لذلك أعتقد أيضًا أن محاولة\nنسج بعض من ذلك، هل تعلم؟ الكثير من الأشياء التي\nلم تكن عملية قبل أن تصبح عملية. الكثير من الأشياء التي كانت\nذات توجه عملي للغاية أصبحت أكثر نظرية بكثير. لذا فإن أخذ زمام المبادرة وإعادة التفكير في جداول الأعمال والمناهج الدراسية هو أيضًا أمر مثير للاهتمام حقًا. - انت على حق تماما. كما تعلمون، شخص\nيجمع بين العالمين، كما تعلمون، بخلفية أكثر\nتقنية، وعلوم الكمبيوتر، كما تعلمون،\nرأيت في المدرسة أن الكثير من الطلاب الذين عانوا\nفي أشياء مثل الهندسة والبرمجة، واجهوا مشاكل\nتقليل المشكلات إلى شيء يمكنك\nجعله خطيًا نوعًا ما في خوارزمية والتفكير في جميع حالات الحافة وكيف يمكنك إنشاء متغيرات وكيف يمكنك\nتقليلها حقًا إلى ذلك. لكن الآن مع الذكاء الاصطناعي، على الرغم من\nأنه لا يزال برنامجًا، إلا أنك ترى الاتجاه الآخر.  لقد أخبرت حتى\nأعضاء الفريق بنشاط، \"لقد كتبت هذه المطالبة\nوكأنها خوارزمية. لا تفعل ذلك.\" يقول الناس: \"اطلب من\nالمستخدم هذا أولاً، ثم افعله.\"  فقلت لنفسي: \"لا، لا تفعل ذلك. أخبر الذكاء الاصطناعي ما هو هدفك.\" لأنك تريد أن يكون الذكاء الاصطناعي\nأكثر قوة ومرونة. أنت لا تريد أن يفعل ذلك دائمًا أولاً ويفعل ذلك دائمًا ثانيًا. تريد أن تعطيه هدفك هنا. لا تتحكم في التفاصيل الدقيقة لكيفية الوصول إلى الهدف، بل ستفعل ذلك\nبطريقة أكثر ديناميكية. أو أعطه إحساسًا بالنغمة أو كما تعلم، هذه الأشياء ليست... - نعم، أخبره من هو. إنها برامج سيئة، إنها\nأناس طيبون، أليس كذلك؟ يبدو أنه لا يعمل بشكل جيد مثل البرامج لأنه لا يفعل\nنفس الشيء في كل مرة. يعلق في الحلقات. مثل، عليك أن تتعلم كيفية\nالعمل معها.  انها تقع عليك. عليك أن تتعلم كيفية العمل معها. بغض النظر عما نفعله، فهو\nيفعل هذه الأشياء، أليس كذلك؟ مثلًا، إذا بذلت قصارى جهدك\n، فهذا ينخفض، والهلوسة تنخفض،\nلكنها حقيقية. إنها مشكلة حقيقية. لذا، إذا فكرت في هذا\nكشخص، فهذا أفضل. مثلًا، لقد أجريت لها اختبارات، كما تعلمون، فهي تؤدي أداءً أفضل في\nأسطورة التعليم من أداء المعلمين.  لم يعد يؤمن\nبأساليب التعلم على سبيل المثال، وهو أمر رائع،\nلكنه لا يزال يرتكب الأخطاء. وأعتقد أنك على حق،\nعليك أن تمنحه شخصًا، ولكن عليك أيضًا تعليم\nالأشخاص الذين يستخدمونه. إنه شخص، إذا بدأ\nبالانفجار، عليك إعادة توجيهه. إنه ليس كيانًا فائق الذكاء يعرف ما هو المستقبل. ويستخدمه الناس بهذه الطريقة،\nباعتباره وحيًا طوال الوقت. كيف يبدو مستقبل الذكاء الاصطناعي؟ لا يعرف. حتى لو كان ذكيًا كشخص، فهو لا يملك إجابات لك. تعامل معه كشخص وقم\nببرمجته كشخص، وسيكون اللعب معه نوعًا مختلفًا تمامًا\nمن الوحش. - لا، هذا صحيح. وأنت تقوم بالكثير من العمل، كما تعلم، فقط على البعد الآخر. أنت تقوم بالكثير من العمل على عمليات المحاكاة، ومحاكاة الأعمال، وأشياء من هذا القبيل. أستطيع أن أتخيل أنك ذاهب إلى المدينة. وعلينا أن نفكر في التعاون. أود أن أعرض حتى بعضًا من\nعمليات محاكاة ما قبل الذكاء الاصطناعي للأطفال في مرحلة الروضة وحتى الصف الثاني عشر أو في\nسياق آخر، ولكنني أشعر بالفضول حول كيفية تفكيركم\nفي الأمر في عالم الذكاء الاصطناعي. - نعم، نحن نحب ذلك. أعني، لقد كنت أنفق، كما تعلمون، لقد كتبت كتابًا عن الألعاب في\nالتعليم منذ 12 عامًا تقريبًا.  لقد قمت ببناء الألعاب منذ ذلك الحين. تمكنت من إيصال وارتون\nإليك، واستثمر في هذا الشيء.  كان لدي فريق مكون من 14 شخصًا، وكان لدينا\nأشخاص فازوا بجائزة هوغو لأفضل\nروايات الخيال العلمي. أرى بعض الخيال العلمي خلفك. إذًا، كما تعلم، باعتبارك أحد\nكتابنا الذين ساعدونا في بعض القصة\nوهم رائعون، أليس كذلك؟  لقد أمضيت سنوات في بناء هذه الألعاب حيث تدير\nشركة ناشئة مزيفة في الوقت الفعلي أو تكون في\nمهمة فضائية محكوم عليها بالفشل إلى زحل وهي تعلمك\nمهارات القيادة. وبعد ذلك بالطبع،\nالشيء المزعج هو أنني كتبت موجهًا موجهًا بشكل جيد إلى الذكاء الاصطناعي وبدأ في لعب الأدوار لجميع\nالشخصيات في لعبتي بشكل جيد جدًا، أليس كذلك؟ 70% من\nمجهود عام كامل يمكن إنجازه بفقرة واحدة. لذلك أعتقد أن فكرة اللعب بالمحاكاة شيء آخر.  لقد اعتدنا على\nالتعلم التعليمي للغاية وحتى نموذج المعلم من نوع\nالتعلم التعليمي التفاعلي. يمكننا أن نبدأ بفعل أشياء أخرى، أليس كذلك؟ أعني أن الكثير من\nالمعلمين سيكونون على دراية بنموذج العصر الماسي، أليس كذلك؟ مثل هذا المعلم العالمي الذي يحول تدريسه إلى لعبة. ما تعلمته هو أنه\nلا يمكنك إنشاء ألعاب تعليمية مقنعة بما يكفي لتحل\nمحل الألعاب الحقيقية. كما هي الحال في أفضل حالاتها، فهي تتمتع بقدر من المتعة يصل إلى 80% مثل الألعاب الواقعية. ولكنها يمكن أن تكون\nطريقة مثيرة للاهتمام حقًا للتدريس والجمع بين عمليات المحاكاة والألعاب والتعلم التعليمي الفعلي والاختبارات وكتابة كتاب للقيام بذلك\nوالعمل القائم على المشاريع. وفجأة أصبح كل هذا رخيصًا.  من السهل القيام بذلك على\nنطاق واسع.  انها مثيرة جدا. لأنني أستطيع أن أخبرك أن\nالأشياء المبنية على المحاكاة تُحدث فرقًا كبيرًا في حياة الناس. وهو مجرد شيء\nيتعين علينا عادةً إنفاق ملايين\nالدولارات لبناء شريحة اتصال، والآن أصبح أمرًا\nيمكننا القيام به بسهولة أكبر. وأعتقد أن هذا\nمثير حقًا أيضًا. - يعني أنا جاد في هذا الأمر. بعد ذلك، سنتواصل\nلأنني أريد، كما تعلمون، من الواضح أن هناك\nمدرستين ساعدت في تأسيسهما، مدرسة خان لاب، بما في ذلك\nمدرسة ثانوية أيضًا ولدينا مدرسة ثانوية أخرى عبر الإنترنت. أعتقد أن كل ما تبذلونه من\nالمحاكاة كلية إدارة الأعمال. أود أن يقوم بها جميع طلاب\nالمدارس المتوسطة والثانوية، وربما حتى الابتدائية\n. أعتقد أنها ستكون تحويلية. - في الواقع، إنه أمر مضحك جداً. بنينا هذا لطلاب الجامعات. غالبًا ما يكون أفضل لاعبينا\nطلابًا في المدارس الثانوية الذين يلعبون هذه الألعاب\nلأنهم لا يحصلون على فرصة للقيام\nبأشياء تجارية ويأخذونها على محمل الجد، ونتيجة لذلك،\nيحصلون على الكثير منها. بينما كشخص في\nفصل دراسي في كلية إدارة الأعمال، يبدو الأمر وكأنهم يدخلون فيه، ولكنها تجربة مختلفة من نوعها. طلاب المدارس الثانوية،\nالهدف قبل ذلك كان في الواقع إنشاء فصل دراسي\nفي صندوق بنفس الطريقة التي قمت بها بعمل\nدورات تدريبية ضخمة عبر الإنترنت مثلكم، ومثلكم تمامًا، أدركت حدود\nهذه الأشياء، أليس كذلك؟ وبنفس الطريقة التي\nأدركنا بها حدود هذه. فكيف نجعل الناس\nيجربون اللعبة ويتعلمون حسب الطلب\nأصبح هدفنا الكبير هنا وأعتقد أننا حققنا ذلك. لذلك أود أن أتحدث عن هذه الأشياء وأطلب منك تجربتها. إنهم، كما تعلمون، كل التعليم.  لقد تحدثنا إلى العديد من\nالمؤسسين المليارديرات، كما تعلمون، قمنا بتخيل\nتجربتهم في اللعبة وكما تعلمون، هناك\nالمئات من المسارات المتفرعة وقمنا بالفعل بملء\nGoogle وWikipedia بمعلومات مزيفة حول\nعالم اللعبة. لذلك يمكنك في الواقع استخدام أشياء Google فقط والحصول على معلومات مفيدة منها. لذلك استمتعت كثيرًا ببناء ذلك أيضًا. - لقد جعلت الواقع\nجزءًا من المحاكاة الخاصة بك. - ألعاب الواقع البديل.  نعم بالضبط. - مذهل. حسنًا، إيثان، يمكنني التحدث\nمعك لساعات حول هذا الموضوع. أعتقد، كما تعلم، أنك\nأحد الأشخاص القلائل الذين يميلون حقًا إلى هذا، وخاصة في مجال التعليم. لذلك أتوقع أن هذه لن\nتكون محادثتنا الأخيرة. إنها في الواقع ليست\nالأولى لدينا أيضًا.  (يضحك) - أحبه. أحب ما تفعله بمهمتك ومن المثير رؤية ذلك، هل تعلم؟  لقد كنت منخرطًا تمامًا\nفي كل شيء، مثل جهاز كمبيوتر محمول واحد لكل طفل خلال كل هذه الجهود التعليمية\nونحن الآن قريبون بالفعل من هذا الحلم مثل،\nكيف نجعل التكنولوجيا تجعل التعليم أفضل بالفعل؟  إن ما تفعلونه يا رفاق مهم للغاية ومثير للغاية، ولكنه أيضًا مخيف جدًا لكثير من الناس. لكنني أعتقد أنه مع احتضانها، تبدأ في رؤية\nالقيمة الحقيقية لما يحدث هنا. لذا أشكركم على استضافتي. - شكرًا لك.",
    "t_italian": "- Ciao a tutti.  Sal,\nsono della Khan Academy. E come alcuni di voi sanno,\nho pubblicato il mio secondo libro, \"Brave New Words\", sul futuro dell'intelligenza artificiale nell'istruzione e nel lavoro. È disponibile ovunque\ntu possa acquistare i tuoi libri, ma come parte della ricerca per quel libro, ho fatto alcune interviste con\nalcune persone affascinanti, che stai per guardare. Sono entusiasta di presentarvi\nil professor Ethan Mollick, professore alla Wharton School dell'Università della\nPennsylvania, che ha anche lavorato molto sulle simulazioni\nnelle business school, ma penso che sia ancora più\nrilevante per ciò che stiamo facendo, voi  negli ultimi mesi ti sei fatto un nome come qualcuno che ha utilizzato l'intelligenza artificiale\na fin di bene nell'istruzione. Quindi benvenuto, Ethan.\n- Grazie per avermi ospitato. Sono entusiasta di essere qui. - Allora cominciamo dall'inizio. Qual è stato il tuo primo\nindottrinamento o esposizione a, in particolare cose come i\ngrandi modelli linguistici, quali sono state alcune delle tue reazioni iniziali e poi quali sono stati alcuni dei\nmodi in cui hai iniziato a realizzare effettivamente che\npotrebbe essere prezioso? - Quindi, come hai detto, ho\npensato per molto tempo a come democratizzare l'istruzione\n. Ad esempio, vengo dal\npunto di vista delle business school e c'è tutta questa ricerca che, come piccole quantità di\nformazione aziendale, trasformano vite e studi controllati in tutto il mondo. Quindi ci ho pensato\nper un po' e ho anche provato\ncon strumenti che fanno questo, quindi costruendo simulazioni,\nma ero anche a conoscenza di GPT 3, che era la\nversione GPT pre-Chat del software,  che a quel punto era un buon tema di quinta elementare di alto livello\n. E ho pensato che avrei dovuto\nsensibilizzare i miei studenti su queste cose. Così ho iniziato ad assegnare loro dei\ncompiti per imbrogliare. Quindi scrivi il miglior saggio\nche puoi usando questo e usando Dall-E per generare un'immagine e poi parlare di dove\nfosse lo stato del mondo. E la cosa molto divertente è che a metà del compito di imbrogliare,\nquando metà dei miei studenti l'aveva consegnato ma\nl'altra metà no, è uscito Chat GPT. Quindi c'è stato un improvviso\ncambiamento nel livello di qualità che è stato piuttosto drammatico\nin quel periodo. - E cosa hai notato?\nIn realtà, sono curioso. Voglio dire, hai detto: \"Va bene, in teoria potresti\nimbrogliare con questa roba\". Quindi gli studenti imbrogliano con queste cose, e per definizione non è\nimbrogliare se ti viene detto di imbrogliare, ma hai notato la differenza? Voglio dire, ovviamente hai notato delle\ndifferenze tra Chat GPT, che utilizza GPT 3.5 e il normale GPT 3. Hai già notato una differenza lì, ma hai notato una differenza rispetto a ciò che hai visto negli\nanni precedenti dal lavoro degli studenti? - Sì, voglio dire, beh, la cosa interessante è che giudichiamo la scrittura e l'intelligenza come molto vicine l'una all'altra, giusto? E sai, in modi che\nsono difficili da separare, consideriamo la scrittura di saggi come il modo in cui impariamo a\npensare mentre scriviamo saggi. Forse è vero, forse no. Non abbiamo davvero testato queste cose. È come per molte cose educative, in realtà non conosciamo le risposte. E così ho avuto studenti nella mia classe che sono persone brillanti\nma non bravi scrittori. L'inglese è la loro terza\nlingua o, sai, provengono da un ambiente\nin cui non hanno mai imparato a scrivere molto bene. Quindi anche solo avere quel\npiccolo accenno, è un po' come Grammarly, giusto? Ad esempio, ha fatto la differenza nel\nfar sì che scrivessero meglio. E dopo aver presentato\nChat GPT ad alcuni dei miei studenti, hanno detto, sai,\nora ricevo chiamate di lavoro che prima non ricevevo e sto\nottenendo il lavoro per cui ho un colloquio, ma poiché\nso scrivere  bene adesso, vero? Quindi è parte del motivo per cui ho\nreso obbligatorio l'uso dell'intelligenza artificiale in tutte le mie lezioni. Quindi non accetto più nulla che non sia\nscritto perfettamente in questa fase. Perché preoccuparsi? - E qual è il tuo senso,\nsai, pensaci dal punto di vista di un datore di lavoro\ndove immagino che stessero usando un segnale,\nqualcuno che scrive una lettera di accompagnamento davvero eloquente\nrispetto a qualcuno che non lo fa, e stavano usando questo piccolo segnale. Ora è tutto eloquente, ma forse quella persona arriva\nal lavoro e dice: \"Oh, forse le sue\ncompetenze linguistiche non sono così forti come pensavo fossero basate su...\" Qual è il tuo punto di vista? Stanno tradendo o va bene così? Perché posso usare Chat GPT o qualsiasi altra cosa per continuare a scrivere bene. - In realtà sono due\ndomande davvero interessanti. Il primo è che la questione dell'imbroglio in generale è una specie\ndi grande domanda, giusto? Cosa significa\ntradire al giorno d'oggi, giusto? Se chiedo consiglio all'IA\n, ma non lo uso. Se ti chiedo di approfondire un paragrafo, se lo chiedo per tutto, è un imbroglio? È una questione molto diversa\ndal plagio, giusto? E poi la seconda\ndomanda è, sai, molte cose buone\nverranno danneggiate dall'intelligenza artificiale, ma molte cose cattive, giusto? Si scopre che giudicare\nle persone in base alle lettere di accompagnamento non è mai stato un\nmetodo particolarmente efficace, o un saggio universitario non è mai stato un metodo particolarmente efficace\nper decidere le ammissioni. Il metodo migliore che abbiamo\nper le meta-analisi su larga scala è in realtà\nfare un'intervista dettagliata basata su ciò che le persone realizzano effettivamente nella loro vita, giusto? Se le capacità di scrittura sono\nimportanti, dovrai sottoporre alle persone un\ntest di scrittura separato. Ma per molti lavori,\nquesta non è l'abilità principale o ora verrà svolta dall'intelligenza artificiale. Quindi, in un certo senso, è un imbroglio, ma\nci costringe anche a riconsiderare ciò che è effettivamente prezioso\nin termini di segnalazione. Molte cose che facciamo, soprattutto come istruttori\nnella stanza, mirano a dare fuoco al tuo tempo\nper dimostrare che ci tieni, giusto? Ad esempio, se qualcuno mi chiedesse di scrivere una lettera di raccomandazione\nper lui, ci vuole un'ora per scrivere una\nlettera di raccomandazione davvero buona. Potrei incollare il curriculum\ndella persona e il lavoro per cui si sta candidando e\ncosa dice in GPT 4 e ottenere una lettera migliore\ndi quella che impiegherei un'ora per scriverla. E sono sempre in difficoltà, tipo, uso la lettera generata perché indica i miei pensieri,\nma non sto più spendendo il tempo che avrei\nspeso per farlo funzionare. E penso che questa sia la\nsfida davvero interessante. - Adoro la tua frase in cui\ninfiammi il mio tempo per dimostrare che ci tengo. Mia madre vuole sempre che vada a\nprenderla all'aeroporto. (ride) - Anche i miei genitori.  Anche i miei genitori\n.  (ride) Stessa cosa. - Io faccio.  Io faccio. Ho dato fuoco a quella parte della mia giornata in modo da poterle dimostrare che ci tengo. Ma penso che tu abbia ragione,\nsiamo pieni di tradizioni, inclusa forse la\nlettera di accompagnamento e tutto questo che sono quasi solo rituali solo per accendere il tuo tempo e\ndimostrare che ci tieni. Ma aggiungono davvero valore? E anche per persone che... Alcune persone hanno altre\npersone che le istruiscono, aiutandole per cose come\nsaggi universitari o curriculum, e questa è una specie di\nversione ad alta intensità di risorse di Chat GPT o GPT 4.\n- Esattamente. E voglio dire, la cosa emozionante, ed è per questo che amo quello che state\nfacendo, è che all'improvviso abbiamo miliardi\ndi persone che hanno accesso alla migliore IA\nmai resa pubblica. Ad esempio, se sei ricco,\nnon hai accesso a un'intelligenza artificiale migliore e hai accesso gratuito\ntramite Bing o attraverso il tipo di cose che state\nfacendo, giusto? È disponibile ovunque. E questa è la\ncosa più profondamente interessante nell'istruzione perché\navevamo tutte queste barriere. Tutti i tentativi precedenti in tal senso sono stati duri e difficili, giusto? Quindi penso che parte della\nquestione sia, sai, democratizzare cose che non eravamo\nriusciti a democratizzare prima. Una volta era come se potessi\nassumere un tutor, farai meglio. Ora, cosa succede quando\nabbiamo un tutor che tutti possono usare e che è effettivamente\nmigliore dei tutor umani? È una prospettiva davvero eccitante e\nun po’ spaventosa. - Si hai ragione. È allo stesso tempo emozionante e spaventoso\ne tutti noi, come sapete, stiamo lavorando su Khanmigo\nall'interno della Khan Academy e lo stiamo diffondendo in modo sempre\npiù ampio. E tu ed io ci incontriamo\nspesso perché sembra che siamo\nspesso sul registro delle conferenze insieme. Ad esempio, questo è ciò che sta facendo la Khan Academy, e guarda questo professore\nche non ha paura di usare l'intelligenza artificiale. Quindi continuiamo il tuo viaggio perché hai parlato di quei primi giorni, incoraggiavi i ragazzi a citare \"imbrogliare\" usando l'intelligenza artificiale, ma in un certo senso portava\na risultati migliori. Ma hai cambiato\nquali sono gli incarichi? Hai cambiato la soglia di ciò che rende un buon compito? - Sì, quindi voglio dire, ci sono\nfondamentalmente tre cose che ho dovuto fare a causa dell'intelligenza artificiale. Quindi livello uno, e penso che tutti dovranno affrontare questi problemi, giusto? Il livello uno si aspetta solo di\npiù dagli studenti, giusto? Quindi la prima cosa che dobbiamo\nfare tutti è, sai, insegno un\ncorso di imprenditorialità e sai, ancora una volta, so che ci sono persone in ascolto che insegnano abilità di scrittura di base. Dovrai\nadattarti in diversi modi. Questo sarà diverso\nper ogni persona.  Per alcune persone, si\ntratterà solo di avere compiti di scrittura in classe\nin modo che le persone imparino a scrivere perché\nimbrogliano fuori dalla classe. Lo capisco, quindi\nnon è una cosa universale, ma è sicuramente il mio caso. Mi aspetto di più. Quindi le persone dovevano\nconsegnare un business plan. Ora devono consegnare un\nbusiness plan, un codice funzionante, anche se prima non avrebbero mai potuto programmare. Ora codifico. Non so programmare, ma ho\nscritto 12 programmi Python nelle ultime due settimane, giusto? Devi consegnare,\nsai, una pagina web perfettamente funzionante. Devi aver intervistato sia persone vere che false con l'\nintelligenza artificiale e ci sono alcuni dati che potresti esaminare con l'intelligenza artificiale\ne sono effettivamente accurati. Quindi le mie aspettative per il lavoro ora sono molto più alte di prima. Quindi questo è il tipo di\nprimo aggiustamento, giusto? La seconda serie di modifiche riguarda l'integrazione dell'intelligenza artificiale\nnegli incarichi. Quindi l’intelligenza artificiale è una compagna di squadra per i miei studenti. Quindi ora finiscono per\ndover portare l'intelligenza artificiale, sai, ci sono degli incarichi. Ad esempio, ogni incarico che consegnano deve essere criticato da\nalmeno tre altri famosi imprenditori, che\ndevono generare. Quindi ricevono feedback lungo il percorso. E poi la terza cosa,\nche è davvero importante, è cambiare il modo in cui organizziamo le classi. Le lezioni non hanno molto\nsenso quando ho strumenti come Khanmigo che potrebbero\nfornire una formazione davvero straordinaria, sai, da remoto. Quindi pensa a come possiamo ribaltare\nla classe in questo modo. - Sì, no, beh, voglio dire,\nc'è così tanto lì dentro. Voglio dire, ho trovato affascinante il tuo... Quindi gli studenti scriveranno\nuna sintesi di un piano aziendale o qualcosa del genere, e poi chiederanno a Steve Jobs\no a qualche famoso imprenditore , sai, Ford o qualcuno,\no Tesla  , qualcuno che... O immagino Elon Musk, che\nintervenga sul loro piano aziendale e questo fa parte dell'incarico adesso? - Sì.  Devono avere... Quindi, per modificare da\nsoli il loro schema, che prima era qualcosa su cui mi limitavo a commentare, devono avere tre\nfamosi imprenditori che commentano il loro piano, giusto? E questo insegna anche un\npo' sugli spunti di scrittura, ma i limiti di queste\ncose, in realtà non invocano lo spirito di\nSteve Jobs, giusto? Invece, devono rendersi conto che questo li aiuta a pensare a\nquesto nuovo mondo in cui ci troviamo. E poi devono anche fare la pre-mortem. Quindi i progetti riescono\nmeglio quando immagini effettivamente come potrebbero fallire. Quindi devono generare anche un sacco di opportunità di fallimento\ncome risultato. Lavora a ritroso su come risolverli. Quindi mi permette di fare\ncose diverse che sappiamo dalla ricerca far lavorare meglio i team, far lavorare meglio le persone. Ma non potevamo farlo prima perché\nera troppo lavoro. - E questo è così potente. E sapete, quello che state facendo, sembra\nesplicitamente o implicitamente, è semplicemente far\nloro conoscere intimamente questi strumenti e il\npotere che hanno. Perché la cosa peggiore che potresti fare è che questi studenti si trovino in una\nbolla e poi entrino nel mondo del lavoro tra un anno o due e dicano: \"Aspetta,\ncos'è successo? Adesso tutti usano GPT 5\" o qualsiasi altra cosa.  . Ma saranno in grado di guidare in questo. E il tuo punto su una\nclasse capovolta, sai, come sai, ho parlato\nanche di pre-IA in un mondo di video on-demand, onestamente,\nanche di video pre-on-demand, lezioni di materie umanistiche, persino\nbusiness school  le classi leggono il caso, vengono a scuola\ne ne discuteremo. Penso che sia sempre\nstata una buona pratica. Ancora di più in un mondo di intelligenza artificiale. Dove sta andando? Sai, stai continuando\nad evolvere i tuoi corsi? Sono sicuro che tutti i tipi di\ndocenti verranno da te e ti diranno: \"Cosa devo fare?\" Cosa stai dicendo loro? - Voglio dire, quindi una cosa che\nstiamo facendo è condividere suggerimenti, giusto? Tipo, per me, questa è la\ncosa più importante da fare. Quindi ho un paio di documenti e sono sicuro che possiamo mettere\ncollegamenti da qualche parte per le persone, ma dove stiamo cercando di adottare approcci pedagogici, giusto? Promuovere è magico, ma\nti aiuta ad avere esperienza. Quindi abbiamo scritto alcuni suggerimenti che fanno varie cose\ncome analogie esplicative, alcune delle cose che fai a Khanmigo, ma che possono essere\napplicabili a molte classi.  Ci sono strumenti per aiutare, sai, gli insegnanti. Quindi sto cercando di capire\ncome la missione di democratizzazione che avete voi ragazzi sia la\nstessa a cui sto pensando. Come diamo gli strumenti agli insegnanti? Come diamo gli strumenti agli studenti? Sapete, la promessa\ndell'intelligenza artificiale è che all'improvviso, la cosa che pensavamo\navrebbe fatto Internet, ovvero se avessimo dato a tutti l'\naccesso alle informazioni. Tutti impareranno tutto. Si scopre che un gruppo molto ristretto\ndi persone sono davvero degli studenti costruttivisti\nche non hanno bisogno di supporto e potrebbero semplicemente imparare da soli. Ma ora abbiamo uno strumento\nche può effettivamente fornire supporto, tutoraggio e\nparte dell'altro materiale che sappiamo funziona e lo fa su larga scala. E ti ho sentito parlare del 2 sigma di Bloom. Voglio dire, non sappiamo nemmeno\nquanto bene funzioni a questo punto, ma\nnon potevamo farlo prima. E proprio come te, ho\nfatto grandi cose, sai, nemmeno lontanamente vicine alla tua scala, ma ho avuto, sai,\nqualche centinaio di migliaia di persone che hanno seguito i miei corsi video online. Sai, c'è una grande\ndifferenza tra questo e fare effettivamente un\nesercizio e ricevere feedback. Quindi stiamo cercando di pensare a\ntutti questi tipi di pezzi. - E cosa stai dicendo ai docenti? Perché non ho dubbi, voglio dire, non solo stai già\naffrontando questo problema con successo, ma stai prosperando in un mondo di intelligenza artificiale generativa.  Lo stai facendo funzionare per l'istruzione. Provo un ottimismo simile a quello che fai tu, ma immagino, e\nsai, che il 90% circa degli insegnanti in questo momento non sia\nnello stesso stato d'animo. Stanno un po' fuori di testa. Sai, diciamo che stavi\nscrivendo un componimento da matricola, non dovevi fare altro. Ad esempio, il tuo intero lavoro è\nassicurarti che gli studenti stiano imparando a scrivere e\nche tu li stia valutando. Cosa diresti a insegnanti del genere che hanno un po' più\npaura che cose come Chat GPT esplodano come una bomba\nnel loro stile pedagogico? - Voglio dire, penso che dovremmo\niniziare con le cattive notizie.  Lo ha fatto assolutamente, vero? Voglio dire, un sacco di cose sono saltate in aria e alcune erano cose buone, giusto? Voglio dire, ci sono modi in cui\ninsegniamo da 2000 anni che avevano molto senso. Forse non erano realmente sostenuti dalla ricerca, ma siamo diventati molto bravi, giusto? Siamo diventati bravi a lezione, siamo diventati bravi a\nsvolgere compiti a casa e a valutarli. Eravamo bravi in ​​quelle cose.\nÈ esploso, vero? Voglio dire, anche per i tuoi\nstudenti migliori, i tuoi studenti che non imbroglierebbero. A proposito, gli studenti\ntradiscono da sempre, giusto? Ma imbrogliare è diventato\nmolto più facile ed economico. Ma anche adesso, i tuoi studenti migliori sono svantaggiati perché\nnon imbrogliano, giusto? Perché, sai,\nnon scrivono allo stesso modo. Quindi esplode molto, ma se insegni una\nlezione di composizione per matricole, devi cambiare il modo in cui insegni. Questa IA non è rilevabile. Chi ti dice il contrario in realtà non ti dice la verità. È essenzialmente non rilevabile. Una delle cose che ho imparato\ndai miei studenti che imbrogliano è che dopo un paio di giri di fare avanti e indietro con l'\nintelligenza artificiale, che è il modo migliore per interagire con essa,\nbasta inserire un suggerimento e ordinare  di impegnarsi con esso. I saggi non sono rilevabili\nné dagli esseri umani né da qualsiasi tutor di intelligenza artificiale.  Ha mandato all'aria quello che hai fatto. Quindi bisogna pensare come un'opportunità, ma è anche spaventoso, e\npossiamo ammetterlo come educatori. Ciò di cui dovremmo renderci conto è che\nl'istruzione andrà bene. Ci adatteremo a questo cambiamento, vero? È più grande delle calcolatrici,\nma non così diversa da quelle ristrette che\nfacevano i calcolatori dei danni durante le lezioni di matematica. Come insegnante,\nprobabilmente vorrai ricevere più istruzioni al\ndi fuori della classe con video e altre cose,\ncompiti di scrittura più attivi in ​​classe criticandoti a vicenda\ne scrivendo brevi saggi e potresti far funzionare la cosa. Ma è assolutamente un grande cambiamento. Ma è un'opportunità per fare cose nuove e per capire cosa funziona per te. Inoltre, la cosa che mi piace\nsottolineare agli istruttori è che questo ti semplifica la vita\nin molti modi. Ad esempio, ci sono molte\ncose che vorremmo poter fare e che non abbiamo avuto il tempo di fare. E ancora, abbiamo suggerimenti per tutto questo. Scrive ottimi quiz per te. So che anche voi ragazzi avete delle guide\nper fare queste cose. Ti aiuta come istruttore. Quindi non si tratta solo di aumentare il tuo carico di lavoro e renderti la vita difficile, ma\nanche di ridurre il tuo carico di lavoro e di darti un\npo' più di tempo per pensare di più all'istruzione e a come\ntrasformare la vita degli studenti, motivo per cui siamo tutti coinvolti\nin questo primo momento  posto. - No, posso immaginare. Penso che tu abbia fornito alcuni\nottimi consigli nella tua risposta, vale a dire, se insegno un\ncorso di inglese per matricole in un'università o se\ninsegno un corso di inglese in una scuola superiore, il mondo in cui\nandremo  potrebbe ragionevolmente essere, okay,\nti ho per un'ora, un'ora e mezza alla volta. Scrivi, e forse stai\nscrivendo con l'intelligenza artificiale, non scrive per te, ma\nagisce in modo che possa aiutarti a rispondere ad alcune domande, eccetera. Ma poi può valutare, può fare un primo passaggio di valutazione per me. E così i tuoi studenti\navranno effettivamente più tempo per scrivere e più\nfeedback in questo mondo. E sì, forse hanno meno\nda fare a casa.  Va bene. Tutti hanno meno da fare a casa.  Hai meno da fare a casa.\nNon stai valutando, sai, come il tuo ottantesimo saggio su,\nsai, qualcosa che è, sai, probabilmente\nsconvolgente a quel punto e nemmeno gli studenti lo fanno. Tutto può succedere in quella notte ed è semplicemente efficiente per tutti. Quindi sì, ha molto senso. - Sì, e penso che, sai, abbracciare questo\nsarà importante e va bene avere paura\nmentre lo ascolti e dire: \"Oh no, non voglio cambiare quello che sono stato  facendo.\" Ma riconosciamo anche che molti\ndei modi in cui le persone scrivono saggi non avevano senso. Ad esempio, le persone che non erano\nmolto brave in classe, giusto? Hanno scritto brutti saggi fuori dalla classe. Quanto tempo abbiamo per\ntutorarli per renderli migliori? Bene, in una sorta di classe capovolta, in un ambiente di apprendimento attivo,\ne l'apprendimento attivo è più importante della\nclasse capovolta, l'idea che stiamo facendo le cose in classe, forse c'è più tempo per questo tutor. Forse l'intelligenza artificiale può aiutarli a recuperare il ritardo o dare loro una\nspiegazione su dove si trovavano invece di essere un insegnante\nche valuta 80 saggi come hai detto tu, forse\nl'intelligenza artificiale ti aiuterà a contrassegnare la coppia che ha più bisogno di aiuto o una coppia che  sono ottimi esempi.  Lo sai e dai feedback in questo modo.  Non abbiamo ancora tutte le risposte, vero? Quindi siamo in un ambiente esplorativo, ma non possiamo fingere che\nil mondo non sia cambiato. Questa non è una di quelle cose,\ncome le videolezioni di un giorno, cosa farai con i\ncorsi online di massa?  E' troppo tardi per quello. Ad esempio, questo è qui adesso e, che ci\npiaccia o no, dobbiamo adattarci come istruttori. - E dove pensi che sia questo? Perché come sai, abbiamo parlato di\nmodelli linguistici di grandi dimensioni, hai menzionato Dall-E, che\nriguarda le immagini generative. Esistono tecnologie relative ai\nvideo, video degenerativi, sintesi vocale, sintesi vocale. Ho visto alcune demo,\ncose come la sintesi vocale e la sintesi vocale\nesistono da un po', ma ultimamente ho visto alcune demo\ndi alcune sintesi vocale che in realtà non sono\ndistinguibili  dall'originale, sai, l'essere umano per così dire, che creerà\nproblemi con falsi profondi e tutto il resto nel mondo più ampio. Ma dove pensi che andrà a finire? Penso che anche per gente come noi, ogni settimana, succedono cose nuove. Come pensi che sarà tutto questo tra due o tre anni? E come tieni\ntutto sotto controllo? - Quindi un paio di cose lì, giusto?  Il primo è che tutti devono riconoscere che l'intelligenza artificiale, l' intelligenza artificiale generativa, è quella che viene chiamata\nuna tecnologia di scopo generale. E, sai, insegno\ninnovazione imprenditoriale. Negli studi sull’innovazione,\nle tecnologie di uso generale compaiono molto raramente. Vengono in giro una volta ogni,\nsai, ogni generazione o due, penso\nall'energia del vapore, forse a Internet, forse ai computer, ma\ninfluenzano ogni aspetto della vita. E questo è il più veloce che\nabbiamo mai visto. Adozione più rapida. È il più personale.\nLe persone potrebbero fare delle cose. Interesserà ogni\nsettore in modo diverso, ogni persona in modo diverso,\nogni lavoro in modo diverso. Ma influenzerà tutto, giusto? \n Secondo i primi studi a nostra disposizione, il lavoro meno influenzato dall’intelligenza artificiale è quello delle coperture. E ho parlato con un\npaio di roofer dicendo: \"Oh no, in realtà\nanche i tetti cambieranno perché ora possiamo realizzare tutte le nostre proposte e cose del genere con l'aiuto dell'intelligenza artificiale\". Quindi cambierà anche il tetto. Quindi dovremmo riconoscere\nche il mondo sta cambiando in modi che non sempre conosciamo. Quindi ciò a cui dovresti pensare\ncome istruttore è preparare le persone a vivere in\nun mondo con un rapido adattamento. Quindi, più iniziamo a usare l'intelligenza artificiale e acquisiamo familiarità con il\nsuo utilizzo, più facile sarà per le persone adattarsi a\nciò che verrà dopo. Perché penso che, sai, io e te, c'è questo momento\ndi GPT 4 in cui è come, \"Oh mio Dio, fa davvero\nmolto di quello che fa la gente\". Pensa come le persone.  Ad esempio,\nquesto non è proprio un software. Vale la pena pensarci\ncome se fosse una persona. Non è una persona, ma\npuoi pensarla come una persona. Potrebbe essere utile. E poi la domanda è:\nquale sarà il prossimo passo?  Non lo sappiamo. La situazione continua a migliorare? Rimane più o meno dov'è? Non ho risposte a\nquesto, ma dobbiamo essere pronti e il modo migliore per farlo\nè iniziare a usarlo. - Beh, sai, come\nprofessore di business school, e voglio dire, ne hai appena parlato, il mondo si muove sempre più velocemente, sempre\npiù velocemente. Che consiglio, sono sicuro che i nostri\nstudenti te lo stiano chiedendo o i tuoi genitori. Ad esempio, cosa dovrebbero lavorare i miei figli? Ad esempio, quali competenze dovrebbero\nsviluppare e quali forse non sono così importanti\ncome lo erano prima? - Quindi penso che pensare sia\nancora importante, giusto? Quindi molti dei motivi per cui le persone insegnavano\ndicevano che scrivere era importante, scrivere saggi significava pensare,\npenso che sia ancora molto vero. Dobbiamo insegnare alle persone a pensare. Penso che per ora e, si spera, per il\nprossimo futuro, l'intelligenza artificiale sia fantastica. Se eri nell'ultimo 50% di molte\ncategorie diverse, ora sei al 50°, 60° o 70° percentile. È emozionante. Espande le opportunità per le\npersone che lo hanno fatto prima, giusto? Non potevi scrivere prima,\npotevi farlo adesso.  Non eri bravo a programmare, ora sei un bravo programmatore. Cioè, è emozionante. Penso che la domanda sia:\nin cosa sei bravo, cosa ti piace per\npoter essere nel 10% delle persone migliori? E penso che sia\nqualcosa in cui puoi aggiungere molto valore al mondo dell'intelligenza artificiale. Quindi penso che parte di questo\nriguardi pensare a cosa vuoi fare, che\nsai, hai talento e come sviluppi quel talento e quella competenza e questo richiede che tu impari ancora le\nconoscenze di base della scuola. Si costruisce esperienza costruendo\nconoscenze di base, giusto? Sai, vedendo molti esempi, lavorando con l'intelligenza artificiale per arrivarci, e penso che questo possa portarti\nin un posto davvero emozionante. - Mi limiterò a fare\nalcuni esempi tangibili.  Ad esempio, se qualcuno dicesse: \"Il mio\nsogno è fare il roofer\", tu diresti: \"Fantastico,\nsarà un ottimo lavoro in futuro perché sarai in\ngrado di fare più coperture e l'intelligenza artificiale scriverà le\ntue proposte\"  per te.\" Ma se qualcuno venisse da te e ti dicesse: \"Voglio diventare un redattore di copyright\" o \"Voglio...\", diresti la stessa risposta? Solo, sai, diventare davvero\nbravo anche se GTP 4 è già abbastanza bravo? - Quindi questa è la scommessa, giusto? Non sappiamo quanto\nmiglioreranno questi sistemi , giusto? E penso che ci sia un'interruzione. Stiamo riscontrando, nei primi\nstudi controllati, un miglioramento delle prestazioni dal 30 all'80% su molte\nattività analitiche ad alto potenziale dei colletti bianchi, giusto? Attività basate sulla scrittura, attività di analisi, attività di consulenza, attività di programmazione. Quindi, se vuoi lavorare in questi campi, l' intelligenza artificiale farà parte della tua vita. Quindi devi capire\nse puoi usare l'intelligenza artificiale per essere 10 volte più produttivo,\nci sarà un enorme valore in te. C'è ancora bisogno\ndi un essere umano nel circuito. Se non riesci a capire come utilizzare l'intelligenza artificiale per diventare più produttivo, sarei\npiù nervoso in quegli spazi. Sapete, penso in quali\nsettori entrare, voglio dire, per essere onesti, la gente ha\npredetto che i radiologi sarebbero stati obsoleti dall'intelligenza artificiale\nnegli ultimi 15 anni, dicendo di non diventare un radiologo. Ci sono ancora molti\nposti di lavoro per i radiologi. Quindi è difficile fare una scommessa. Non farei grandi scommesse sulla carriera. Ma direi che più il\ntuo lavoro è basato sulla scrittura e più è routine, se sei uno\nscrittore di narrativa, l'intelligenza artificiale ancora non riesce, o uno scrittore di commedie, l'intelligenza artificiale\nnon riesce ancora a scrivere una bella battuta. Sono comunque lavori duri.\nMa sai, quelli sono posti. Ma se stai cercando di fare copywriting, penso che, a meno che non trovi\nun modo per usare l'intelligenza artificiale, sarei nervoso, giusto? Quindi più\nil campo è esposto all'intelligenza artificiale, migliore è l'intelligenza artificiale , più devi\nessere un centauro nel modello. Garry Kasparov ha detto metà uomo, metà cavallo, metà persona, metà cavallo. Devi essere in grado di lavorare\ncon l'intelligenza artificiale come il tuo cavallo ed essere l'essere umano integrato con essa e poi potresti scrivere meglio. Non lo so, ho scoperto che la mia scrittura\nè migliorata enormemente usando l'intelligenza artificiale per riportare\nindietro un paragrafo su cui non sono più interessato a lavorarci\nperché sono bloccato. Dammi 20 versioni di\nquesto e lo fa, giusto? Quindi penso che ci sia speranza in questi campi, ma non sappiamo quanto\nandrà bene e anche questo è un po' spaventoso. - E hai menzionato la paura. Voglio dire, perché sembri\nuna persona per niente spaventata in questo momento, ma quando dici paura, quali sono i pensieri spaventosi nella tua testa? - Voglio dire, ci sono un paio di\nlivelli di paura, giusto? Voglio dire, ci sono cose che\naccadranno sicuramente. Abbiamo dei disagi che si\nverificheranno sicuramente, giusto? Come hai detto, ormai è\nbanale creare video falsi, video falsi in cui parlo\ncon un minuto del mio discorso. L'ho già fatto prima.\nLe foto false sono facili, vero? Il contenuto e la massa sono facili. Quindi ci sono un sacco di problemi sociali che dovremo affrontare\ncome risultato. Poi c’è anche il fatto che questo distruggerà i posti di lavoro. Non sappiamo ancora quali lavori\ne in che modo. Non sappiamo quanti\ndisagi comporteranno. Sapete, di solito in\ntermini economici, quando i posti di lavoro vengono interrotti, non si tratta di\nposti di lavoro, ma di compiti. Quindi non sono i tuoi lavori a\ncambiare, sono i compiti che svolgi. E di solito ciò si traduce nell'ottenimento di un pacchetto di compiti migliore. Rimandi le tue cose noiose, ma può essere un periodo dirompente. Le persone vengono licenziate. Le persone che verranno\nassunte non vengono assunte. Non sappiamo come andrà a finire. Quindi ci sarà un po’ di paura\nche accadrà con l’interruzione del lavoro, anche\nse farà crescere l’economia. E poi la domanda è:\ncontinua a migliorare? In questo momento, se sei tra i\nprimi 10, 20% di un campo, penso che l'intelligenza artificiale sia uno strumento per te. Ora la domanda è: come\nformiamo gli stagisti quando l'intelligenza artificiale funziona come uno stagista migliore di molti dei nostri stagisti che avremmo? Come formeremo le persone del futuro? E se l’intelligenza artificiale continua a migliorare, e se fosse migliore di tutti tranne l’1% più ricco, cosa\nfaremo allora tutti con il nostro lavoro? E poi, naturalmente, c'è quel\ntipo di pensiero davvero spaventoso per cui molte persone passano\ntroppo tempo a preoccuparsi rispetto a queste altre preoccupazioni, che penso siano molto più grandi. Cioè, cosa\nsuccede se questa cosa diventa davvero super intelligente? Questa idea dell'AGI e simili, cosa succede allora? Ma penso che non devi\npreoccuparti di questo. Sapete, le persone se ne preoccupano, dovreste preoccuparvene voi, ma\npenso che quest'altra questione su cosa succede ai\nposti di lavoro e come sopravviviamo in questo mondo di sconvolgimento,\npenso sia più importante. E voglio dire, sai, entrambi il\nnostro pane è imburrato da questo, ma penso che l'istruzione\nsia parte della chiave qui. Essere in grado di pensare e\nadattarsi sarà importante. Non essere addestrato per una cosa, ma essere addestrato per molte cose. - Sì, voglio dire, hai\ndetto che stai già facendo\nscrivere codice e business plan ai tuoi studenti della business school e lo sai. E ancora una volta, sono in grado di essere quasi un manager su piccola scala di\nun team di intelligenza artificiale, per così dire. - Esatto. Voglio dire, penso che\ndovresti pensarci. Tutti sulla terra hanno appena ottenuto uno stagista gratis. Cosa ne farai? È un po' come chiederlo a tutti. - O tipo 5.\n- O 10. E fanno\ncose diverse e non è magico. Le persone rimbalzano e\nsi spaventano dell'intelligenza artificiale. E ho tutte le ragioni per essere nervoso.  Ne abbiamo parlato qui, ma il fatto è che sono qui. E la mia sensazione nell'insegnare\nagli studenti come usarlo è che hai bisogno di 5-10\nore di utilizzo nel tuo lavoro per vedere cosa fa per te. Se non passi cinque o dieci ore, non ci arriverai. Quindi il mio consiglio\nè che devi usarlo. Se sei un insegnante, sei uno studente, usalo per le cose e guarda cosa succede. E questo è l'unico modo\nper andare avanti. Non è una magia copiare\nun messaggio da Internet.  Si tratta davvero solo di sperimentare\ned essere in dialogo con questa cosa come se fossi con una persona. - Sono d'accordo al 100% con questo\ne con qualcuno che probabilmente ha trascorso personalmente, a questo\npunto, circa 300 ore. Se dovessi aggiungere un'abilità alla creatività, perché ho visto così tante\npersone mettere mi piace, chattare GPT o usare GPT 4 e dire\n\"Cosa devo fare?\" (ride) Lo sai, il cielo è il limite. Ad esempio, prova cose interessanti\ne ti renderai conto che è in grado di fare cose che, sai, sarebbero state fantascienza. Sono curioso, sai, che\nconsigli hai per noi? Stiamo ovviamente lavorando su Khanmigo. Stiamo cercando di renderlo un\ntutor per ogni studente, un assistente didattico,\nforse più di questo. Stiamo cercando di aggiungere cose come memoria e diversi tipi di\nattività, espandere i nostri orizzonti. Quali sono le tipologie di\ncose che ti piacerebbe vederlo fare per rendere più\n facile la vita degli studenti, degli insegnanti o dei genitori\no di chiunque altro. - Quindi penso che parte\ndella cosa interessante sia che l'interfaccia con l'essere umano diventi una questione interessante, giusto? Come costruiamo questi strumenti in modo che si adattino al\nsistema umano di cui disponiamo? Ad esempio, qual è il consiglio\nsu come gli studenti li usano? Come danno feedback agli insegnanti nel modo giusto? Sapete, voi ragazzi ci state\npensando molto, ma penso che sia importante il modo in cui adattiamo quelli\ncon i sistemi umani. E poi penso che l'altra cosa sia cercare di essere ancora più creativi, giusto? Quello che stai facendo è replicare questo essere umano ad un livello molto alto. E se avessi un tutor individuale? Ma sai, questo era il\nmeglio che potevamo pensare, giusto? - Sì.\n- Quindi la domanda è: cosa possiamo fare oltre a questo? Ad esempio, che aspetto ha l'istruzione? Ad esempio, possiamo dare diversi\ntipi di enigmi e compiti? Possiamo fare più istruzioni e insegnamenti basati sui giochi rispetto a prima, giusto?  Si tratta di un insieme di strumenti molto potenti. Un'altra grande domanda per me è: come iniziamo a realizzare la\nversione multiplayer di questo? Come possiamo includere molte\npersone in una classe che interagiscono con l'intelligenza artificiale? Come creiamo\npersonalità persistenti per l'IA con cui interagisci e hai selezionato la personalità per continuare a lavorare con essa. Siamo molto vincolati\nda questa idea del tipo, ora possiamo finalmente costruire il\ntutor di Bloom, giusto? E questo è meraviglioso, ma era anche un vincolo umano. Ora abbiamo un nuovo sistema,\ncambierà il modo in cui lavoriamo, il modo in cui organizziamo il lavoro. Penserei internamente come, vogliamo ancora fare gli Sprint? Vogliamo ancora fare Agile? Quelli sono stati costruiti attorno ai sistemi umani. Che aspetto ha il nuovo modello? Quindi penso che questa sia la visione. E ad esempio, come porti\nun compagno, sai, come ti costringe ad andare\nanche oltre la classe e risolvere effettivamente i problemi? Forse potrebbe spingerti a\ncreare davvero qualcosa, giusto? Quindi, piuttosto che limitarsi a realizzare un progetto che è come un progetto per una singola classe, come li integriamo insieme. E poi l'altra cosa che\nvorrei solo dire è che penso che le discipline STEM siano diventate molto meno interessanti\nrispetto alle discipline umanistiche rispetto al passato. E le discipline umanistiche\naiutano davvero e le scienze sociali aiutano davvero qui perché\nfunziona come una persona. E più\npuoi immergerti nella storia umana, più puoi forzare l’intelligenza artificiale\na pensare in modi interessanti. Quindi penso anche di provare a\nintrecciarne un po', sai? Molte cose che\nprima non erano pratiche lo sono diventate. Molte cose che erano\norientate alla pratica sono diventate molto più teoriche. Quindi anche prendere l’iniziativa e ripensare gli ordini del giorno e i programmi è davvero interessante. - Hai assolutamente ragione. Come sai, qualcuno che è a\ncavallo tra entrambi i mondi, sai, con un\nbackground più tecnico, informatica, sai, ho\nvisto a scuola che molti studenti che avevano difficoltà\ncon cose come ingegneria e programmazione, avevano problemi\nridurre i problemi a qualcosa che potresti\nlinearizzare in un algoritmo e pensare a tutti i casi limite e a come creare variabili e come\nridurli davvero a quello. Ma ora con l’intelligenza artificiale, anche\nse è ancora un software, la vedi dall’altra parte. Ho detto attivamente anche ai\nmembri del team: \"Hai scritto questo messaggio\ncome se fosse un algoritmo. Non farlo\". La gente dice: \"Prima chiedi\nall'utente questo, poi fai questo\". Ho pensato: \"No, non farlo. Dì all'intelligenza artificiale qual è il tuo obiettivo\". Perché vuoi che l'intelligenza artificiale\nsia più robusta e flessibile. Non vuoi che lo faccia sempre prima e poi faccia sempre quello secondo. Vuoi che gli dia il tuo obiettivo qui. Non microgestire il modo in cui si arriva all'obiettivo e lo farà\nin un modo più dinamico. Oppure dagli un senso del tono o sai, queste cose non sono... - Sì, digli chi è. È cattivo software, è\nbrava gente, giusto? Come se non funzionasse bene come software perché non fa\nsempre la stessa cosa. Rimane bloccato in loop.  Ad esempio, devi imparare a\nlavorarci.  Ti mente. Devi imparare a lavorarci. Non importa cosa facciamo,\nfa queste cose, giusto? Tipo, fai del tuo\nmeglio, le cose stanno diminuendo, le allucinazioni stanno diminuendo,\nma sono reali. È un vero problema. Quindi se pensi a questo come a\nuna persona, è meglio. Ad esempio, gli ho dato dei test, sai, se la cava meglio sui\nmiti dell'istruzione rispetto a quanto fanno gli insegnanti. Non crede più\n, ad esempio, negli stili di apprendimento, il che è fantastico,\nma continua a commettere errori. E penso che tu abbia ragione,\ndevi darlo a una persona, ma devi anche insegnarlo alle\npersone che lo usano. È una persona, se inizia a\nprendere una direzione devi reindirizzarla. Non è un'entità super intelligente che sa qual è il futuro. E la gente lo usa sempre così,\ncome un oracolo. Come sarà il futuro dell’intelligenza artificiale? Non lo sa. Anche se fosse intelligente come persona, non ha risposte per te. Trattalo come una persona e\nprogrammalo come una persona ed è un tipo\ndi bestia molto diverso con cui giocare. - No, è vero. E lavori molto, sai, proprio nell'altra dimensione. Lavori molto su simulazioni, simulazioni aziendali, cose del genere. Potrei immaginare che andrai in città. E dovremmo pensare a collaborare. Mi piacerebbe distribuire alcune delle\ntue simulazioni pre-IA ai ragazzi delle scuole primarie e secondarie o in\naltri contesti, ma sono curioso di sapere come\nla pensi nel mondo dell'IA. - Sì, ci piacerebbe. Voglio dire, ho speso, sai, ho scritto un libro sui giochi\nnell'istruzione circa 12 anni fa. Da allora creo giochi. Sono riuscito a farti\nconoscere Wharton e a investire in questa cosa. Avevo un team di 14 persone,\nabbiamo avuto persone che hanno vinto il Premio Hugo per i migliori\nromanzi di fantascienza. Vedo un po' di fantascienza dietro di te. Quindi, sai, come uno dei nostri\nscrittori che ci ha aiutato con parte della trama\ne sono fantastici, giusto? Ho passato anni a costruire questi giochi in cui gestisci una finta\nstartup in tempo reale o sei in una\nmissione spaziale condannata su Saturno e ti insegnano le\ncapacità di leadership. E poi, ovviamente, la\ncosa inquietante è che ho digitato un messaggio ben diretto nell'IA e questa ha iniziato a interpretare molto bene\ntutti i personaggi del mio gioco, giusto?  Il 70% dell'impegno di un anno\npotrebbe essere realizzato con un paragrafo. Quindi penso che l'idea di giocare con le simulazioni sia un'altra cosa. Siamo abituati ad un\napprendimento molto didattico e persino al modello tutor di una sorta di\napprendimento didattico interattivo. Possiamo iniziare a fare altre cose, giusto? Voglio dire, molti\neducatori avranno familiarità con il modello dell'età del diamante, giusto? Come questo tutor universale che trasforma l'insegnamento in un gioco. Quello che ho imparato è che\nnon è possibile creare giochi che insegnano in modo così avvincente da poter prendere il\nposto dei giochi reali. Come nei casi migliori, sono divertenti all'80% quanto un gioco nella vita reale. Ma possono essere un\nmodo davvero interessante di insegnare combinando simulazioni e giochi con l'apprendimento didattico reale e i quiz e scrivere un libro per fare questo\ne un lavoro basato su progetti. All'improvviso tutto questo diventa economico. È facile da realizzare su\nlarga scala.  È così emozionante. Perché posso dirti che le\ncose basate sulla simulazione fanno una tale differenza nella vita delle persone. Ed è qualcosa\nche normalmente dovremmo spendere milioni di\ndollari per costruire una simulazione, mentre ora è qualcosa che\npotremmo fare molto più facilmente. E penso che anche questo sia davvero,\ndavvero emozionante. - Voglio dire, dico sul serio. Dopodiché, ci metteremo in contatto\nperché voglio, sai, ovviamente ci sono due\nscuole che ho contribuito ad avviare, la Khan Lab School, che include\nanche una scuola superiore e abbiamo quest'altra scuola superiore online. Penso a tutte le tue\nsimulazioni di business school. Mi piacerebbe che,\nsai, gli studenti delle scuole medie, superiori, forse anche le elementari li\nfacessero tutti. Penso che sarebbe trasformativo. - In realtà è piuttosto divertente. L'abbiamo costruito per gli studenti universitari.  I nostri migliori giocatori sono spesso\nstudenti delle scuole superiori che giocano a questi giochi\nperché non hanno la possibilità di fare\naffari e li prendono molto sul serio e, di conseguenza, ne\nricavano molto. Mentre come qualcuno che frequenta\nun corso di business school, è come se ci entrassero, ma è un tipo diverso di esperienza. Gli studenti delle scuole superiori,\nl'obiettivo prima era in realtà quello di creare una classe\nin un box nello stesso modo in cui ho seguito enormi\ncorsi online come te, e proprio come te, ho riconosciuto i limiti\ndi queste cose, giusto? E allo stesso modo ne abbiamo\nriconosciuto i limiti. Quindi, come possiamo convincere le persone\na sperimentare il gioco e ad imparare su richiesta\nè diventato il nostro grande obiettivo qui e penso che lo abbiamo raggiunto. Quindi mi piacerebbe parlare di queste cose e farti provare. Sono, sai, tutta l'istruzione. Abbiamo parlato con vari\nfondatori miliardari e, sai, abbiamo romanzato la\nloro esperienza nel gioco e sai, ci sono\ncentinaia di percorsi ramificati e abbiamo effettivamente riempito\nGoogle e Wikipedia con informazioni false sul\nmondo del gioco. Quindi puoi effettivamente solo cose di Google e ricavarne informazioni utili. Quindi mi sono divertito molto a costruire anche quello. - Hai reso la realtà\nparte della tua simulazione. - Giochi di realtà alternativa.  Si Esattamente. - Eccezionale. Beh, Ethan, potrei\nparlarti per ore di questo. Penso che tu sia\nuna delle poche persone che si impegnano davvero in questo, soprattutto nel campo dell'istruzione. Quindi mi aspetto che questa non\nsarà la nostra ultima conversazione.  In realtà non è\nnemmeno il nostro primo.  (ride) - Lo adoro. Adoro quello che stai facendo con la tua missione ed è semplicemente emozionante vederlo, sai? Ero perfettamente coinvolto\nin tutto, ad esempio, un laptop per bambino attraverso tutti questi sforzi educativi\ne ora siamo effettivamente vicini a quel sogno del tipo,\ncome possiamo fare in modo che la tecnologia migliori effettivamente l'istruzione? Quello che state facendo è davvero importante ed emozionante, ma è anche davvero spaventoso per molte persone. Ma penso che abbracciandolo, inizi a vedere il vero\nvalore di ciò che sta accadendo qui. Quindi grazie per avermi ospitato. - Grazie."
}