{
    "source": "KZ4O31Rguo8",
    "youtubelink": "https://www.youtube.com/watch?v=KZ4O31Rguo8",
    "t_english": "- [Instructor] What we're gonna do in this video is talk about some interesting things that have happened since 2008, and in particular, we're gonna talk about what an ample reserves regime is, but even more importantly, what its actual implications are and how you can analyze it with a graph like this. So let's just make sure we have our bearings first. So the horizontal axis right over here is reserve balances, and then the vertical axis here is interest rates. So for the first part of this discussion, let's ignore everything that we see in gray over here. That's what we're gonna talk about when we talk about the ample reserves regimes. Let's say we're talking about a period pre-2008. And in that situation, you could imagine the more reserve balances you have, the lower the demand is for reserve balances, because if more banks are sitting on reserves, well, then they don't need to go into the market and borrow reserves as much. And so what you would naturally expect is as reserve balances increase, demand goes down and of course, the actual interest that people would need to pay in order to get reserves if they're running low would go down. So, for example, let's ignore this red line here. Let's imagine a pre-2008 scenario where the actual reserves, the supply of reserves looks like this. And of course, the Federal Reserve can determine this by printing money, increasing its balance sheet or contracting its balance sheet. They can do that as they see fit. So in this situation right over here, these are the total reserves that are in the system that the Federal Reserve can decide. And you have now a market rate for overnight reserves. So if a bank is running low, let's say they had a lot of withdrawals, they need to meet their reserve requirements back then, well, then they would go into the, quote, money market and they would borrow some of that money from a bank that has excess reserves. Now, you might be wondering, why does this curve, this blue curve flatten out as you go further and further to the left? Why doesn't it do something like this? If the reserve balances are lower, and lower, lower, you'd think people would charge higher and higher interest rates to land reserves overnight. Well, what puts a cap on this is the discount window. This primary credit rate, this is the rate that a bank in good standing, a strong bank, you also have a secondary credit rate for slightly weaker bank, that would be a higher rate, but this is essentially what banks can go to the Federal Reserve and borrow directly from the Federal Reserve at the discount window. So that discount window rate right over here, that essentially puts a cap on the overnight borrowing rate, a cap on the rate that a bank would have to pay in order to borrow reserves. And so that's why you see the curve essentially gets limited by that. But now let's think about what happened in 2008, and to understand that, I always get a kick out of looking at the total assets of the Federal Reserve. This is essentially the Federal Reserve's balance sheet. You can view this as how much base money they have put into circulation. And I know these numbers are hard to read, so let me write it down for you. Out here, that is 2008, 2008. And the rightmost point, we are about three fourths of the way through 2023 over here. Now, you see something interesting happening essentially a little bit midway through 2008. The balance sheet increases significantly. We go from roughly 1 trillion of base money to $2 trillion of base money. So essentially what the Federal Reserve was doing, they were taking this vertical line and they were pushing it far to the right over here. Now, you might think historically why were they doing that. Well, some of you might remember, we had banks failing. It had a financial crisis. They wanted to shore up not just the banking system, but also the economy. So the Federal Reserve just started printing money, and it put us into a new territory, a territory of ample reserves. That's why it's called an ample reserves regime. Now, there's an interesting question, though. If you go to a situation of ample reserves, and that's essentially the situation that we could imagine right over here, well, if you just had your traditional demand curve here, this curve would've just kept going down and down and down. And essentially there's so much reserves in the system that the demand would go so low that if a bank had access reserves, it would pretty much get little to no interest on those reserves. Now, that's a tough situation in and of itself because some of those banks needed that interest on reserves because, once again, they were all in a tough situation. And also, you want a situation where banks could probably attract some depositors by hopefully giving some interest to the depositors themselves. That also would strengthen the banking system. So that's when in this ample reserves regime, the Federal Reserve did something else. They said, \"Okay, banks, it is no longer the case that the only way that you could get interest on your reserves is by lending it to other banks. We're going to allow you to take those reserves and deposit them with us, with the Federal Reserve, and we will give you interest on those reserves.\" That's what this IOR is, interest on reserves. And so if you are a banking institution, this essentially set up a floor on the interest that you would get on your reserves. Now, the question you might be wondering is, why doesn't this blue line then just flatten out right over there? And in some more simplified diagrams, you will actually see that. But it turns out that banks are not the only participants in the money market. You have other people who are potentially lending reserves to banks, and they don't have access to depositing their reserves with the Federal Reserve. So that's not a floor on them. The Federal Reserve introduced another rate. I won't go into the details of what on RRP stands for. These essentially repurchase agreements. This is essentially the Federal Reserve giving interest to non-banking institutions on reserves that they place with the actual Federal Reserve. So this places a hard floor, 'cause even those folks, they would never wanna lend below this because they could get that much interest with the Federal Reserve. Now, the next question you might be wondering is, all right, if we are out here in this ample reserves regime, traditionally the Federal Reserve could change the federal funds rate, the target rate by moving this red line to the left and the right. If you're in a non-ample reserves regime, if you move this red line to the left, well, what's gonna happen? You're going to essentially increase the overnight borrowing rate, and that would constrict the economy. And if you move it to the right, you're going to decrease the overnight borrowing rate, and that would stimulate the economy. If you're out here on the right side, if you move this vertical red line to the right or the left, it's not going to change the overnight borrowing rate because you're essentially going to be hugging this pretty flat blue line. And things have gotten even more ample since 2008. We went from roughly 1 trillion to 2 trillion, and then out here we are getting, approaching 8, 9 trillion. And you might say, \"Well, what happened right over here?\" Well, that was the COVID pandemic, where, once again, the Federal Reserve really wanted to stimulate the economy, and they did that by printing a ton of money. So in the scenario that we've been in for a while now, we are deep into an ample reserves regime. If we were in ample reserves in 2008, we're that much further right now in the 2020s. So how does the Federal Reserve actually control interest rates now? Well, what they can do is they can control these floors, or you could say this floor right over here. If they want to increase interest rates, they just increase the interest on reserves they give. And if they do that, then the curve will look something like this, and then the overnight borrowing rate will be higher, and then, of course, that would be restrictive for the economy, and if they wanna loosen, they can likewise lower the interest on reserves.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] ہم\nاس ویڈیو میں کچھ دلچسپ چیزوں کے بارے میں بات کر رہے ہیں جو 2008 کے بعد سے ہوئی ہیں،\nاور خاص طور پر، ہم اس کے بارے میں بات کرنے والے ہیں کہ\nکافی ذخیرہ کرنے والی حکومت کیا ہے، لیکن اس سے بھی اہم بات یہ ہے کہ\nاس کی اصل کیا ہے  مضمرات ہیں اور آپ اس\nطرح کے گراف کے ساتھ اس کا تجزیہ کیسے کرسکتے ہیں۔ تو آئیے صرف اس بات کو یقینی بنائیں کہ ہمارے\nپاس پہلے ہمارے بیرنگ ہیں۔ تو\nیہاں پر افقی محور ریزرو بیلنس ہے، اور پھر عمودی محور\nیہاں سود کی شرح ہے۔ تو اس بحث کے پہلے حصے کے لیے، آئیے ہر اس چیز کو نظر انداز کر دیں جو\nہم یہاں خاکستری میں دیکھتے ہیں۔ جب ہم\nکافی ذخائر کی حکومتوں کے بارے میں بات کریں گے تو ہم اسی کے بارے میں بات کرنے والے ہیں۔ ہم کہتے ہیں کہ ہم\n2008 سے پہلے کے دور کی بات کر رہے ہیں۔ اور اس صورت حال میں، آپ تصور کر سکتے ہیں کہ\nآپ کے پاس جتنے زیادہ ریزرو بیلنس ہوں گے، ریزرو بیلنس کی مانگ اتنی ہی کم ہوگی،\n کیونکہ اگر زیادہ بینک\nریزرو پر بیٹھے ہیں، ٹھیک ہے، تو پھر انہیں\nمارکیٹ میں جانے اور ذخائر قرض لینے کی ضرورت نہیں ہے۔  بہت اور اس طرح آپ فطری طور پر جس چیز کی توقع کریں گے وہ یہ ہے کہ ریزرو بیلنس\nبڑھنے کے ساتھ، طلب کم ہوتی جاتی ہے اور یقیناً، اصل سود جو لوگوں کو\nریزرو حاصل کرنے کے لیے ادا کرنا پڑے گا اگر وہ کم ہو جائیں تو کم ہو جائے گا۔ تو، مثال کے طور پر، آئیے\nیہاں اس سرخ لکیر کو نظر انداز کر دیں۔ آئیے 2008 سے پہلے کے منظر نامے کا تصور کریں\nجہاں اصل ذخائر، ذخائر کی فراہمی کچھ اس طرح نظر آتی ہے۔ اور بلاشبہ، فیڈرل\nریزرو رقم کو پرنٹ کرکے،\nاس کی بیلنس شیٹ کو بڑھا کر یا اس کی بیلنس شیٹ کو معاہدہ کرکے اس کا تعین کرسکتا ہے۔ وہ ایسا کر سکتے ہیں جیسا کہ وہ مناسب سمجھتے ہیں۔ تو اس صورت حال میں یہاں پر، یہ کل ذخائر ہیں\nجو اس نظام میں ہیں جن کا فیصلہ فیڈرل ریزرو کر سکتا ہے۔ اور اب آپ کے پاس\nرات بھر کے ذخائر کے لیے مارکیٹ ریٹ ہے۔ لہذا اگر کوئی بینک کم چل رہا ہے، فرض کریں کہ ان کے پاس بہت زیادہ رقم نکلوائی گئی تھی، انہیں اپنی ریزرو ضروریات کو پورا کرنے کی ضرورت ہے،\n ٹھیک ہے، پھر وہ،\nکوٹ، منی مارکیٹ میں جائیں گے اور وہ\nاس رقم میں سے کچھ قرض لیں گے۔  وہ بینک جس کے پاس زیادہ ذخائر ہیں۔ اب، آپ سوچ رہے ہوں گے کہ جب آپ آگے اور بائیں طرف جاتے ہیں تو یہ وکر، یہ\nنیلے رنگ کا وکر چپٹا کیوں ہوتا ہے ؟ یہ ایسا کچھ کیوں نہیں کرتا؟ اگر ریزرو بیلنس\nکم، اور کم، کم، آپ کو لگتا ہے کہ لوگ راتوں رات زمین کے ذخائر پر زیادہ اور زیادہ شرح سود وصول کریں گے۔\n ٹھیک ہے، جو چیز اس پر ٹوپی ڈالتی ہے وہ\nڈسکاؤنٹ ونڈو ہے۔ یہ بنیادی کریڈٹ ریٹ، یہ وہ شرح ہے جو ایک بینک اچھی\nحالت میں ہے، ایک مضبوط بینک ہے، آپ کے پاس قدرے کمزور بینک کے لیے ثانوی کریڈٹ کی شرح بھی ہے، یہ\nایک زیادہ شرح ہوگی، لیکن یہ بنیادی طور پر وہ ہے جو بینک فیڈرل کے پاس جا سکتے ہیں۔  ریزرو کریں اور ڈسکاؤنٹ ونڈو پر فیڈرل ریزرو سے براہ راست قرض لیں۔\n لہذا\nیہاں پر ڈسکاؤنٹ ونڈو ریٹ، جو بنیادی طور پر\nراتوں رات قرض لینے کی شرح پر ایک کیپ رکھتا ہے، اس شرح پر ایک کیپ جو\nبینک کو ذخائر ادھار لینے کے لیے ادا کرنا ہوگی۔ اور اسی لیے آپ دیکھتے ہیں کہ وکر بنیادی طور پر اس سے محدود ہو جاتا ہے۔ لیکن اب آئیے اس کے بارے میں سوچتے ہیں کہ\n2008 میں کیا ہوا تھا، اور اس کو سمجھنے کے لیے،\nمجھے فیڈرل ریزرو کے کل اثاثوں کو دیکھنے سے ہمیشہ ایک کک آؤٹ ہو جاتا ہے۔\n یہ بنیادی طور پر فیڈرل\nریزرو کی بیلنس شیٹ ہے۔ آپ اسے دیکھ سکتے ہیں کہ انہوں نے کتنی بنیادی رقم گردش میں ڈالی ہے۔ اور میں جانتا ہوں کہ ان نمبروں کو پڑھنا مشکل ہے، اس لیے مجھے آپ کے لیے لکھنے دیں۔ یہاں سے باہر، وہ 2008، 2008 ہے۔ اور سب سے صحیح بات، ہم یہاں 2023 کے راستے کے تقریباً تین چوتھائی حصے پر ہیں۔ اب، آپ دیکھتے ہیں کہ 2008 کے وسط میں بنیادی طور پر کچھ\nدلچسپ ہوتا ہے۔ \n بیلنس شیٹ میں نمایاں اضافہ ہوتا ہے۔ ہم تقریباً 1\nٹریلین بیس منی سے $2 ٹریلین بیس منی تک جاتے ہیں۔ لہذا بنیادی طور پر\nفیڈرل ریزرو کیا کر رہا تھا، وہ اس عمودی لائن کو لے رہے تھے اور وہ اسے یہاں سے دائیں طرف دھکیل رہے تھے۔\n اب، آپ تاریخی طور پر سوچ سکتے ہیں کہ\nوہ ایسا کیوں کر رہے تھے۔ ٹھیک ہے، آپ میں سے کچھ کو\nیاد ہوگا، ہمارے بینک ناکام ہو چکے تھے۔ اسے مالی بحران کا سامنا تھا۔ وہ نہ\nصرف بینکاری نظام بلکہ معیشت کو بھی آگے بڑھانا چاہتے تھے۔ چنانچہ فیڈرل ریزرو نے ابھی\nپیسے چھاپنا شروع کیے، اور اس نے ہمیں ایک نئے علاقے، کافی ذخائر کے علاقے میں ڈال دیا۔  اسی لیے اسے \nکافی ذخائر کا نظام کہا جاتا ہے۔ اب، اگرچہ، ایک دلچسپ\nسوال ہے. اگر آپ\nکافی ذخائر کی صورت حال کی طرف جاتے ہیں، اور یہ بنیادی طور پر ایسی صورت حال ہے جس کا ہم یہاں تصور کر سکتے ہیں، ٹھیک ہے، اگر آپ کے پاس صرف اپنا\nروایتی ڈیمانڈ وکر ہوتا تو یہ وکر\nنیچے اور نیچے جاتا رہتا۔ اور بنیادی طور پر\nسسٹم میں اتنے ذخائر ہیں کہ مانگ اتنی کم ہو جائے گی کہ اگر کسی بینک کے پاس ریزرو تک رسائی ہو تو اسے ان ذخائر پر بہت\nکم سود ملے گا۔ اب، یہ اپنے\nآپ میں ایک مشکل صورتحال ہے کیونکہ ان میں سے کچھ بینکوں کو\nذخائر پر سود کی ضرورت تھی کیونکہ، ایک بار پھر، وہ\nسب ایک مشکل صورتحال میں تھے۔ اور یہ بھی کہ، آپ ایسی صورت حال چاہتے ہیں جہاں بینک شاید\nکچھ ڈپازٹرز کو اپنی طرف متوجہ کر سکیں امید ہے کہ خود ڈیپازٹرز کو کچھ سود دے کر۔ اس سے بینکاری نظام بھی مضبوط ہوگا۔  لہذا\n جب اس\nکافی ذخائر کے نظام میں، فیڈرل ریزرو نے کچھ اور کیا۔ انہوں نے کہا، \"ٹھیک ہے، بینکوں،\nاب یہ معاملہ نہیں ہے کہ\nآپ اپنے ذخائر پر سود حاصل کرنے کا واحد طریقہ اسے\nدوسرے بینکوں کو قرض دینا ہے۔ ہم آپ کو\nان ذخائر کو لینے اور اپنے پاس جمع کرنے کی اجازت دیں گے۔\nفیڈرل ریزرو کے ساتھ، اور ہم آپ کو\nان ذخائر پر سود دیں گے۔\" یہ آئی او آر ہے،\nذخائر پر سود۔ اور اس طرح اگر آپ ایک بینکنگ ادارہ ہیں، تو یہ بنیادی طور پر\nاس سود پر ایک منزل طے کرتا ہے جو آپ کو اپنے ذخائر پر ملے گا۔ اب، جو سوال آپ\nسوچ رہے ہوں گے، وہ یہ ہے کہ یہ نیلی لکیر وہاں پر چپٹی کیوں نہیں ہوتی؟ اور کچھ اور آسان خاکوں میں، آپ حقیقت میں اسے دیکھیں گے۔ لیکن یہ پتہ چلتا ہے کہ کرنسی مارکیٹ میں\nصرف بینک ہی شریک نہیں ہیں۔ آپ کے پاس دوسرے لوگ ہیں جو ممکنہ طور پر\nبینکوں کو ریزرو قرض دے رہے ہیں، اور انہیں فیڈرل ریزرو میں اپنے ذخائر جمع کرنے تک رسائی نہیں ہے۔\n تو یہ ان پر فرش نہیں ہے۔ فیڈرل ریزرو نے\nایک اور شرح متعارف کرائی۔ میں اس کی تفصیلات میں نہیں جاؤں گا کہ\nRRP کا مطلب کیا ہے۔ یہ بنیادی طور پر دوبارہ خریداری کے معاہدے کرتے ہیں۔ یہ بنیادی طور پر\nفیڈرل ریزرو غیر بینکنگ اداروں کو ان\nذخائر پر سود دیتا ہے جو وہ حقیقی فیڈرل ریزرو کے ساتھ رکھتے ہیں۔ لہذا یہ ایک سخت منزل رکھتا ہے،\n'کیونکہ وہ لوگ بھی، وہ کبھی بھی اس سے نیچے قرض نہیں دینا چاہیں گے کیونکہ وہ فیڈرل ریزرو کے ساتھ اتنا سود حاصل کرسکتے ہیں۔ اب، اگلا سوال جو\nآپ سوچ رہے ہوں گے، ٹھیک ہے، اگر ہم یہاں\nاس وسیع ذخائر کے نظام میں ہیں، تو روایتی طور پر فیڈرل\nریزرو اس سرخ لکیر کو\nبائیں اور دائیں طرف منتقل کرکے فیڈرل فنڈز کی شرح، ہدف کی شرح کو تبدیل کرسکتا ہے۔  . اگر آپ غیر کافی ذخائر کے نظام میں ہیں، اگر آپ اس سرخ لکیر کو بائیں طرف منتقل کرتے ہیں، ٹھیک ہے، کیا ہونے والا ہے؟ آپ بنیادی طور پر راتوں رات قرض لینے کی شرح میں اضافہ کرنے جا رہے ہیں، اور یہ معیشت کو محدود کر دے گا۔ اور اگر آپ اسے دائیں طرف لے جاتے ہیں، تو آپ\nراتوں رات قرض لینے کی شرح کو کم کرنے جا رہے ہیں، اور اس سے معیشت کو تحریک ملے گی۔ اگر آپ یہاں سے باہر دائیں طرف ہیں، اگر آپ اس عمودی سرخ\nلکیر کو دائیں یا بائیں منتقل کرتے ہیں، تو یہ\nراتوں رات قرض لینے کی شرح کو تبدیل نہیں کرے گا کیونکہ آپ بنیادی طور پر\n اس خوبصورت فلیٹ نیلی لکیر کو گلے لگانے جا رہے ہیں۔ اور چیزیں\n2008 کے بعد سے اور بھی زیادہ ہو گئی ہیں۔ ہم تقریباً 1\nٹریلین سے 2 ٹریلین ہو گئے، اور پھر یہاں سے ہم\n8، 9 ٹریلین کے قریب پہنچ رہے ہیں۔ اور آپ کہہ سکتے ہیں، \"اچھا،\nیہاں کیا ہوا؟\" ٹھیک ہے، یہ COVID\nوبائی بیماری تھی، جہاں، ایک بار پھر، فیڈرل ریزرو واقعی\nمعیشت کو متحرک کرنا چاہتا تھا، اور انہوں نے\nایک ٹن رقم چھاپ کر ایسا کیا۔ لہذا اس منظر نامے میں جس میں ہم ابھی کچھ\nعرصے سے ہیں، ہم کافی ذخائر کے نظام میں گہرے ہیں۔ اگر ہم 2008 میں کافی ذخائر میں تھے، تو ہم ابھی 2020 کی دہائی میں اس سے کہیں آگے ہیں۔\n تو فیڈرل ریزرو اب سود کی شرحوں کو کس طرح کنٹرول کرتا ہے؟ ٹھیک ہے، وہ کیا کر سکتے ہیں\nوہ ان منزلوں کو کنٹرول کر سکتے ہیں، یا آپ یہ کہہ سکتے ہیں کہ یہ\nمنزل یہیں ہے۔ اگر وہ سود کی شرح میں اضافہ کرنا چاہتے ہیں، تو وہ صرف اپنے\nذخائر پر سود بڑھاتے ہیں۔ اور اگر وہ ایسا کرتے ہیں، تو وکر کچھ اس طرح نظر آئے گا،\n اور پھر راتوں رات\nقرض لینے کی شرح زیادہ ہوگی، اور پھر، یقیناً،\nیہ معیشت کے لیے محدود ہوگا، اور اگر وہ ڈھیل دینا چاہتے ہیں، تو وہ اسی طرح کم کر سکتے ہیں۔\nذخائر پر سود",
    "t_spanish": "- [Instructor] Lo que vamos a\nhacer en este video es hablar sobre algunas cosas interesantes que han sucedido desde\n2008 y, en particular, vamos a hablar sobre qué\nes un régimen de reservas amplias, pero aún más importante, cuáles son\nsus efectos reales.  Son las implicaciones y cómo se puede analizar\ncon un gráfico como este. Así que\nprimero asegurémonos de orientarnos. Entonces, el eje horizontal\naquí son los saldos de reservas, y luego el eje vertical\naquí son las tasas de interés. Entonces, durante la primera parte de esta discusión, ignoremos todo lo que\nvemos en gris aquí.  De eso vamos a hablar cuando hablemos de los\nregímenes de reservas amplias. Digamos que estamos hablando\nde un período anterior a 2008. Y en esa situación, se podría imaginar que cuantos más\nsaldos de reservas tenga, menor será la demanda\nde saldos de reservas, porque si hay más bancos con\nreservas, bueno, entonces no\nnecesitan ir al mercado y pedir prestado reservas como  mucho. Entonces, lo que naturalmente se esperaría es que a medida que aumentan los saldos de reservas\n, la demanda disminuya y, por supuesto, el interés real que la gente tendría que\npagar para obtener reservas si se están agotando disminuiría. Entonces, por ejemplo,\nignoremos esta línea roja aquí. Imaginemos un escenario anterior a 2008\nen el que las reservas reales, la oferta de reservas, se ve así. Y, por supuesto, la\nReserva Federal puede determinar esto imprimiendo dinero,\naumentando su balance o contrayéndolo. Pueden hacerlo como mejor les parezca. Entonces, en esta situación, estas son las reservas totales\nque están en el sistema que la Reserva Federal puede decidir. Y ahora tiene una\ntasa de mercado para las reservas a un día. Entonces, si un banco se está quedando sin fondos, digamos que tuvo muchos retiros, necesita cumplir con sus\nrequisitos de reserva en ese entonces, bueno, entonces\nentraría al mercado monetario de cotizaciones y pediría prestado parte\nde ese dinero a un banco.  banco que tiene exceso de reservas. Ahora, quizás te preguntes, ¿ por qué esta curva, esta\ncurva azul, se aplana a medida que avanzas más y más hacia la izquierda?  ¿ Por qué no hace algo como esto? Si los saldos de las reservas son\nmás bajos, y más bajos, uno pensaría que la gente cobraría tasas de interés cada vez más altas\npor las reservas de tierras de la noche a la mañana. Bueno, lo que pone un límite a\nesto es la ventana de descuento. Esta tasa de crédito primaria, esta es la tasa que un banco con buena\nreputación, un banco fuerte, también tiene una tasa de crédito secundaria para un banco ligeramente más débil,\nesa sería una tasa más alta, pero esto es esencialmente lo que los bancos pueden recurrir al Banco Federal.  Reserve y pida prestado directamente a\nla Reserva Federal en la ventanilla de descuento. Entonces, esa\ntasa de descuento de aquí, esencialmente pone un límite a\nla tasa de endeudamiento a un día, un límite a la tasa que\nun banco tendría que pagar para pedir prestado reservas. Y es por eso que ves que la curva esencialmente se ve limitada por eso. Pero ahora pensemos en\nlo que pasó en 2008, y para entenderlo,\nsiempre me divierte mirar los\nactivos totales de la Reserva Federal. Este es esencialmente el\nbalance de la Reserva Federal. Puede ver esto como la cantidad de dinero base que han puesto en circulación. Y sé que estos números son difíciles de leer, así que déjame escribirlos para ti. Aquí afuera, eso es 2008, 2008. Y el punto más a la derecha, aquí estamos aproximadamente a tres cuartas partes del camino hacia 2023. Ahora, se ve que algo\ninteresante sucede esencialmente a\nmediados de 2008. El balance aumenta significativamente. Pasamos de aproximadamente 1\nbillón de dinero base a 2 billones de dólares de dinero base. Básicamente, lo que\nestaba haciendo la Reserva Federal era tomar esta línea vertical y empujarla\nhacia la derecha aquí. Ahora bien, uno podría pensar históricamente\npor qué estaban haciendo eso. Bueno, algunos de ustedes\nrecordarán que teníamos bancos quebrados. Tuvo una crisis financiera. Querían apuntalar no\nsólo el sistema bancario, sino también la economía. Así que la Reserva Federal\nempezó a imprimir dinero y nos colocó en un nuevo territorio, un territorio de amplias reservas.  Por eso se le llama\nrégimen de reservas amplias.  Sin embargo , ahora hay una\npregunta interesante. Si se llega a una situación\nde amplias reservas, y esa es esencialmente la situación que podríamos imaginar aquí, bueno, si solo tuvieras tu\ncurva de demanda tradicional aquí, esta curva habría seguido\nbajando y bajando y bajando. Y esencialmente hay\ntantas reservas en el sistema que la demanda sería tan baja que si un banco tuviera acceso a reservas, obtendría\npoco o ningún interés sobre esas reservas. Ahora, esa es una\nsituación difícil en sí misma porque algunos de esos bancos\nnecesitaban ese interés sobre las reservas porque, una vez más,\ntodos estaban en una situación difícil. Y también se desea una situación en la que los bancos probablemente puedan\natraer a algunos depositantes, con la esperanza de que les den algún interés a los propios depositantes. Eso también fortalecería\nel sistema bancario. Entonces fue entonces cuando, en este\namplio régimen de reservas, la Reserva Federal hizo algo más. Dijeron: \"Está bien, bancos,\nya no es cierto que la única manera de\nobtener intereses sobre sus reservas sea\nprestándolas a otros bancos. Les permitiremos\ntomar esas reservas y depositarlas con nosotros\".  ,\ncon la Reserva Federal, y le daremos\nintereses sobre esas reservas\". Eso es lo que es este IOR,\nintereses sobre reservas. Entonces, si usted es una institución bancaria, esto esencialmente establece\nun límite mínimo para el interés que obtendría sobre sus reservas. Ahora, la pregunta que\nquizás se estén haciendo es: ¿ por qué esta línea azul no se aplana justo allí? Y en algunos diagramas más simplificados, realmente verás eso. Pero resulta que los bancos\nno son los únicos participantes en el mercado monetario. Hay otras personas que potencialmente están\nprestando reservas a los bancos y no tienen acceso para depositar sus reservas\nen la Reserva Federal. Entonces eso no es un piso para ellos. La Reserva Federal\nintrodujo otra tasa. No entraré en detalles\nde lo que significa PVP.  Se trata esencialmente de acuerdos de recompra.  Se trata esencialmente de que la\nReserva Federal dé intereses a instituciones no bancarias\nsobre las reservas que colocan en la Reserva Federal real. Entonces esto coloca un piso duro, porque\nincluso esas personas nunca querrían prestar por debajo de esto porque podrían obtener tanto interés con la Reserva Federal. Ahora, la siguiente pregunta que\nquizás se estén haciendo es, muy bien, si estamos aquí\nen este amplio régimen de reservas, tradicionalmente la\nReserva Federal podría cambiar la tasa de fondos federales, la tasa objetivo, moviendo esta línea roja\nhacia la izquierda y hacia la derecha.  . Si estás en un régimen de reservas insuficientes, si mueves esta línea roja hacia la izquierda, bueno, ¿qué pasará? Básicamente, se aumentará la tasa de endeudamiento a un día, y eso restringiría la economía. Y si lo mueve hacia la derecha, disminuirá la\ntasa de endeudamiento a un día, y eso estimularía la economía. Si estás aquí en el lado derecho, si mueves esta línea roja vertical\nhacia la derecha o hacia la izquierda, no cambiará\nla tasa de endeudamiento a un día porque esencialmente\nestarás abrazando esta línea azul bastante plana. Y las cosas se han vuelto\naún más amplias desde 2008. Pasamos de aproximadamente 1\nbillón a 2 billones, y luego aquí nos estamos\nacercando a 8, 9 billones. Y podrías decir: \"Bueno, ¿qué\npasó aquí?\" Bueno, esa fue la\npandemia de COVID, donde, una vez más, la Reserva Federal realmente\nquería estimular la economía, y lo hizo\nimprimiendo una tonelada de dinero. Entonces, en el escenario en el que hemos\nestado desde hace un tiempo, nos encontramos en lo más profundo de un régimen de reservas amplio. Si en 2008 teníamos amplias reservas, \nen la década de 2020 estamos mucho más lejos. Entonces, ¿cómo controla realmente la Reserva Federal las tasas de interés ahora? Bueno, lo que pueden hacer es\ncontrolar estos pisos, o se podría decir este\npiso de aquí. Si quieren aumentar las tasas de interés, simplemente aumentan los\nintereses sobre las reservas que dan. Y si hacen eso, entonces la curva se verá\nasí, y entonces la tasa de endeudamiento a un día\nserá más alta, y entonces, por supuesto,\neso sería restrictivo para la economía, y si quieren flexibilizar, también pueden bajar\nla tasa.  intereses sobre las reservas.",
    "t_arabic": "- [المدرس] ما\nسنفعله في هذا الفيديو هو الحديث عن بعض الأشياء المثيرة للاهتمام التي حدثت منذ\nعام 2008، وعلى وجه الخصوص، سنتحدث عن ماهية\nنظام الاحتياطيات الوفيرة، ولكن الأهم من ذلك، ما هو\nالفعلي له  الآثار المترتبة وكيف يمكنك تحليلها\nباستخدام رسم بياني مثل هذا. لذلك دعونا نتأكد من أن\nلدينا اتجاهاتنا أولاً. لذا فإن المحور الأفقي\nهنا هو الأرصدة الاحتياطية، ثم المحور الرأسي\nهنا هو أسعار الفائدة. لذا، بالنسبة للجزء الأول من هذه المناقشة، دعونا نتجاهل كل ما\nنراه باللون الرمادي هنا. هذا ما سنتحدث عنه عندما نتحدث عن\nأنظمة الاحتياطيات الوفيرة. لنفترض أننا نتحدث\nعن فترة ما قبل عام 2008. وفي هذه الحالة، يمكنك أن تتخيل أنه كلما زاد\nعدد الأرصدة الاحتياطية لديك، انخفض الطلب\nعلى الأرصدة الاحتياطية، لأنه إذا كان عدد أكبر من البنوك\nيحتفظ بالاحتياطيات، حسنًا، فلن\nيحتاجوا إلى الذهاب إلى السوق واقتراض الاحتياطيات  كثيراً. وبالتالي فإن ما تتوقعه بطبيعة الحال هو أنه مع زيادة أرصدة الاحتياطيات،\nينخفض ​​الطلب وبالطبع، ستنخفض الفائدة الفعلية التي سيحتاج الناس إلى\nدفعها من أجل الحصول على الاحتياطيات إذا كانت منخفضة. لذا، على سبيل المثال، دعونا\nنتجاهل هذا الخط الأحمر هنا. دعونا نتخيل سيناريو ما قبل عام 2008\nحيث تبدو الاحتياطيات الفعلية، وعرض الاحتياطيات هكذا. وبطبيعة الحال،\nيمكن للاحتياطي الفيدرالي تحديد ذلك عن طريق طباعة النقود، أو\nزيادة ميزانيته العمومية، أو تقليص ميزانيته العمومية. يمكنهم أن يفعلوا ذلك كما يرونه مناسبًا. لذا، في هذه الحالة هنا، هذه هي إجمالي الاحتياطيات\nالموجودة في النظام والتي يمكن للاحتياطي الفيدرالي أن يقررها. والآن لديك\nسعر السوق لاحتياطيات الليلة الواحدة. لذا، إذا كان أحد البنوك يعاني من انخفاض، لنفترض أن لديه الكثير من عمليات السحب، فإنه يحتاج إلى تلبية\nمتطلبات الاحتياطي الخاصة به في ذلك الوقت، حسنًا، عندها سيذهبون\nإلى سوق المال، ويقترضون بعضًا\nمن تلك الأموال من أحد البنوك.  البنك الذي لديه احتياطيات زائدة. الآن، ربما تتساءلون، لماذا يتسطح هذا المنحنى، هذا\nالمنحنى الأزرق كلما اتجهتم أكثر فأكثر نحو اليسار؟ لماذا لا يفعل شيئا مثل هذا؟ إذا كانت أرصدة الاحتياطيات\nأقل، وأقل، أقل، فأنت تعتقد أن الناس سيفرضون أسعار فائدة أعلى وأعلى\nعلى احتياطيات الأراضي بين عشية وضحاها. حسنًا، ما يضع حدًا أقصى\nلهذا هو نافذة الخصم. معدل الائتمان الأساسي هذا، هو المعدل الذي يحصل عليه البنك الذي يتمتع\nبوضع جيد، وهو بنك قوي، ولديك أيضًا معدل ائتمان ثانوي لبنك أضعف قليلاً،\nوسيكون هذا معدلًا أعلى، ولكن هذا هو في الأساس ما يمكن أن تذهب إليه البنوك إلى البنك الفيدرالي  الاحتياطي والاقتراض مباشرة\nمن الاحتياطي الفيدرالي في نافذة الخصم. لذا فإن معدل نافذة الخصم\nهنا، والذي يضع أساسًا حدًا أقصى\nلسعر الاقتراض لليلة واحدة، وهو حد أقصى للسعر الذي\nيتعين على البنك دفعه من أجل اقتراض الاحتياطيات. ولهذا السبب ترى أن المنحنى أصبح محدودًا بشكل أساسي بهذا. لكن دعونا الآن نفكر\nفيما حدث في عام 2008، ولكي نفهم ذلك،\nفإنني أشعر دائمًا بالمتعة عند النظر إلى إجمالي\nأصول الاحتياطي الفيدرالي. هذه هي في الأساس\nالميزانية العمومية للاحتياطي الفيدرالي. يمكنك عرض هذا على أساس مقدار الأموال الأساسية التي تم طرحها للتداول. وأنا أعلم أن هذه الأرقام صعبة القراءة، لذا دعني أكتبها لك. هنا، هذا هو 2008، 2008. وفي أقصى اليمين، نحن على بعد حوالي ثلاثة أرباع الطريق حتى عام 2023 هنا. الآن، ترى شيئًا مثيرًا\nللاهتمام يحدث في \nمنتصف عام 2008. الميزانية العمومية تزداد بشكل ملحوظ. ننتقل من ما يقرب من 1\nتريليون دولار من الأموال الأساسية إلى 2 تريليون دولار من الأموال الأساسية. لذا فإن ما كان\nيفعله الاحتياطي الفيدرالي بشكل أساسي، هو أنهم كانوا يتخذون هذا الخط العمودي ويدفعونه\nبعيدًا إلى اليمين هنا. الآن، قد تفكر تاريخيًا\nلماذا فعلوا ذلك. حسنًا، ربما يتذكر البعض منكم\n، كان لدينا بنوك فاشلة. كانت تعاني من أزمة مالية. لقد أرادوا دعم ليس\nفقط النظام المصرفي، بل والاقتصاد أيضًا. لذلك بدأ الاحتياطي الفيدرالي للتو في\nطباعة النقود، ووضعنا ذلك في منطقة جديدة، منطقة ذات احتياطيات وافرة. ولهذا السبب يطلق عليه\nنظام الاحتياطيات الوفيرة. الآن، هناك سؤال مثير للاهتمام\n، رغم ذلك. إذا ذهبت إلى حالة\nمن الاحتياطيات الوفيرة، وهذا هو الوضع الذي يمكن أن نتخيله هنا، حسنًا، إذا كان لديك\nمنحنى الطلب التقليدي الخاص بك هنا، فإن هذا المنحنى سيستمر في\nالانخفاض والهبوط والهبوط. وفي الأساس، هناك\nالكثير من الاحتياطيات في النظام بحيث ينخفض ​​الطلب إلى حد كبير، بحيث إذا كان لدى البنك احتياطيات، فإنه سيحصل على\nفائدة قليلة أو معدومة على تلك الاحتياطيات. الآن، هذا\nوضع صعب في حد ذاته لأن بعض تلك البنوك كانت\nبحاجة إلى هذه الفائدة على الاحتياطيات لأنها، مرة أخرى،\nكانت جميعها في وضع صعب. وأيضًا، تريد وضعًا تستطيع فيه البنوك\nجذب بعض المودعين من خلال منح بعض الفائدة للمودعين أنفسهم.  ومن شأن ذلك أيضاً أن يعزز\nالنظام المصرفي. وذلك عندما\n فعل بنك الاحتياطي الفيدرالي شيئًا آخر في نظام الاحتياطيات الوافر هذا. قالوا، \"حسنًا، أيها البنوك، لم\nتعد الطريقة الوحيدة\nللحصول على الفائدة على احتياطياتك هي عن طريق\nإقراضها لبنوك أخرى. سوف نسمح لك بأخذ\nتلك الاحتياطيات وإيداعها لدينا\nمع الاحتياطي الفيدرالي، وسنعطيك\nفائدة على تلك الاحتياطيات\". هذا هو IOR،\nالفائدة على الاحتياطيات. وبالتالي، إذا كنت مؤسسة مصرفية، فإن هذا يضع أساسًا حدًا أدنى للفائدة\n التي ستحصل عليها من احتياطياتك. الآن، السؤال الذي\nقد تتساءلون عنه هو، لماذا لا يتسطح هذا الخط الأزرق هناك؟ وفي بعض الرسوم البيانية المبسطة، سترون ذلك بالفعل. ولكن تبين أن البنوك\nليست هي المشاركين الوحيدين في سوق المال. هناك أشخاص آخرون يحتمل أن\nيقرضوا احتياطيات للبنوك، وليس لديهم إمكانية إيداع احتياطياتهم\nلدى الاحتياطي الفيدرالي. لذلك هذا ليس أرضية لهم.  قدم الاحتياطي الفيدرالي\nسعرًا آخر. لن أخوض في تفاصيل\nما يمثله RRP. هذه اتفاقيات إعادة الشراء بشكل أساسي. هذا هو في الأساس قيام\nالاحتياطي الفيدرالي بإعطاء فائدة للمؤسسات غير المصرفية\nعلى الاحتياطيات التي يضعونها لدى الاحتياطي الفيدرالي الفعلي. لذا فإن هذا يضع أرضية صلبة،\nلأنه حتى هؤلاء الأشخاص، لن يرغبوا أبدًا في الإقراض بأقل من هذا لأنهم قد يحصلون على هذا القدر من الفائدة من الاحتياطي الفيدرالي. الآن، السؤال التالي الذي\nقد تتساءل عنه هو، حسنًا، إذا كنا هنا\nفي نظام الاحتياطيات الوافر هذا، \nفيمكن للاحتياطي الفيدرالي تقليديًا تغيير سعر الفائدة على الأموال الفيدرالية، وهو السعر المستهدف عن طريق تحريك هذا الخط الأحمر\nإلى اليسار واليمين  . إذا كنت في نظام احتياطيات غير وافرة، وإذا قمت بتحريك هذا الخط الأحمر إلى اليسار، حسنًا، ماذا سيحدث؟ ستقوم بشكل أساسي بزيادة معدل الاقتراض لليلة واحدة، وهذا من شأنه أن يقيد الاقتصاد. وإذا قمت بتحريكه إلى اليمين، فسوف تقوم بتخفيض\nمعدل الاقتراض لليلة واحدة، وهذا من شأنه أن يحفز الاقتصاد. إذا كنت هنا على الجانب الأيمن، إذا قمت بتحريك هذا الخط الأحمر الرأسي\nإلى اليمين أو اليسار، فلن يغير ذلك\nسعر الاقتراض لليلة واحدة لأنك\nستعانق هذا الخط الأزرق المسطح جدًا. وقد أصبحت الأمور\nأكثر ضخامة منذ عام 2008. لقد انتقلنا من حوالي 1\nتريليون إلى 2 تريليون، ثم ها نحن نقترب من\n8، 9 تريليون. وقد تقول: \"حسنًا، ماذا\nحدث هنا؟\" حسنًا، كان ذلك هو جائحة فيروس كورونا، حيث أراد الاحتياطي الفيدرالي، مرة أخرى، تحفيز الاقتصاد حقًا، وقد فعلوا ذلك عن طريق طباعة طن من المال. \n \n \n لذا، في السيناريو الذي\nنعيشه منذ فترة، نحن في عمق نظام الاحتياطيات الوافرة. إذا كان لدينا احتياطيات وفيرة في عام 2008، فإننا سنكون أبعد من ذلك بكثير\nالآن في عشرينيات القرن الحالي. فكيف يتحكم بنك الاحتياطي الفيدرالي فعليًا في أسعار الفائدة الآن؟ حسنًا، ما يمكنهم فعله هو\nالتحكم في هذه الطوابق، أو يمكنك قول هذا\nالطابق هنا. إذا أرادوا زيادة أسعار الفائدة، فإنهم يقومون فقط بزيادة\nالفائدة على الاحتياطيات التي يقدمونها. وإذا فعلوا ذلك، فسيبدو المنحنى على\nهذا النحو، ومن ثم\nسيكون سعر الاقتراض لليلة واحدة أعلى، وبعد ذلك، بالطبع،\nسيكون ذلك مقيدًا للاقتصاد، وإذا أرادوا التخفيف، فيمكنهم أيضًا خفض\nالفائدة  الفائدة على الاحتياطيات.",
    "t_italian": "- [Istruttore] Ciò che\nfaremo in questo video è parlare di alcune cose interessanti che sono accadute dal\n2008 e, in particolare, parleremo di cos'è\nun regime di ampie riserve, ma, cosa ancora più importante, qual è il\nsuo effettivo  implicazioni e come\nanalizzarle con un grafico come questo. Quindi\nprima assicuriamoci di orientarci. Quindi l'asse orizzontale\nqui rappresenta i saldi delle riserve, e poi l'asse verticale\nqui rappresenta i tassi di interesse. Quindi, per la prima parte di questa discussione, ignoriamo tutto ciò che\nvediamo in grigio qui. Questo è ciò di cui parleremo quando parleremo dei\nregimi di ampie riserve. Diciamo che parliamo\ndi un periodo antecedente al 2008. E in quella situazione, si potrebbe immaginare che più\nsaldi di riserva si hanno, minore sarà la domanda\nper i saldi di riserva, perché se più banche\nsiedono sulle riserve, beh, allora non hanno\nbisogno di entrare nel mercato e prendere in prestito le riserve come  tanto. E quindi quello che ci si aspetterebbe naturalmente è che, man mano che i saldi di riserva\naumentano, la domanda diminuisce e, naturalmente, l'interesse effettivo che le persone dovrebbero\npagare per ottenere riserve se stanno per esaurirsi diminuirebbe. Quindi, ad esempio,\nignoriamo questa linea rossa qui. Immaginiamo uno scenario pre-2008\nin cui le riserve effettive, l'offerta di riserve, assomiglia a questa. E, naturalmente, la Federal\nReserve può determinarlo stampando moneta,\naumentando o contraendo il proprio bilancio. Possono farlo come meglio credono. Quindi, in questa situazione qui, queste sono le riserve totali\npresenti nel sistema che la Federal Reserve può decidere. E ora hai un\ntasso di mercato per le riserve overnight. Quindi, se una banca sta esaurendo, diciamo che ha fatto molti prelievi, deve soddisfare i suoi\nrequisiti di riserva in quel momento, beh, allora entrerebbe\nnel mercato monetario delle quotazioni e prenderebbe in prestito parte\ndi quel denaro da un  banca che ha riserve in eccesso. Ora, ti starai chiedendo, perché questa curva, questa\ncurva blu si appiattisce man mano che vai sempre più a sinistra? Perché non fa qualcosa del genere? Se i saldi delle riserve fossero\npiù bassi, e sempre più bassi, si potrebbe pensare che le persone addebiterebbero tassi di interesse sempre più alti\nalle riserve fondiarie da un giorno all’altro. Bene, ciò che mette un limite a tutto\nquesto è la finestra degli sconti. Questo tasso di credito primario, questo è il tasso che una banca in\nregola, una banca forte, ha anche un tasso di credito secondario per una banca leggermente più debole,\nche sarebbe un tasso più alto, ma questo è essenzialmente ciò che le banche possono chiedere al Federal  Prenota e prendi in prestito direttamente\ndalla Federal Reserve allo sportello sconti. Quindi quel tasso della finestra di sconto\nproprio qui, che essenzialmente pone un limite\nal tasso debitore overnight, un limite al tasso che\nuna banca dovrebbe pagare per prendere in prestito le riserve. Ed ecco perché vedi che la curva essenzialmente viene limitata da questo. Ma ora pensiamo a\nquello che è successo nel 2008, e per capirlo, mi fa\nsempre piacere guardare il totale delle\nattività della Federal Reserve. Questo è essenzialmente il\nbilancio della Federal Reserve. Puoi vederlo come la quantità di base monetaria che hanno messo in circolazione. E so che questi numeri sono difficili da leggere, quindi lascia che te lo scriva. Qui fuori, cioè nel 2008, 2008. E il punto più a destra, siamo a circa tre quarti del percorso fino al 2023 qui. Ora, vedete che qualcosa di\ninteressante accade essenzialmente a\nmetà del 2008. Il bilancio aumenta in modo significativo. Passiamo da circa 1\ntrilione di base monetaria a 2 trilioni di dollari di base monetaria. Quindi, in sostanza, quello che\nstava facendo la Federal Reserve, stava prendendo questa linea verticale e la stava spingendo\nmolto a destra qui. Ora, potresti pensare storicamente\nperché lo facevano. Ebbene, alcuni di voi potrebbero\nricordare che abbiamo avuto banche in fallimento. Ha avuto una crisi finanziaria. Volevano sostenere non\nsolo il sistema bancario, ma anche l’economia. Quindi la Federal Reserve ha appena\niniziato a stampare denaro, e ci ha portato in un nuovo territorio, un territorio di ampie riserve. Ecco perché si chiama\nregime di riserve ampie. Ora, però, c'è una\ndomanda interessante. Se andiamo in una situazione\ndi ampie riserve, e questa è essenzialmente la situazione che potremmo immaginare qui, beh, se avessi\nqui solo la tua tradizionale curva di domanda, questa curva avrebbe continuato ad\nandare sempre più in basso. Ed essenzialmente ci sono così\ntante riserve nel sistema che la domanda diventerebbe così bassa che se una banca avesse accesso alle riserve, otterrebbe praticamente\npoco o nessun interesse su quelle riserve. Ora, questa è una\nsituazione difficile di per sé perché alcune di quelle banche\navevano bisogno di quegli interessi sulle riserve perché, ancora una volta,\nerano tutte in una situazione difficile. Inoltre, si vuole una situazione in cui le banche potrebbero probabilmente\nattrarre alcuni depositanti, sperando di dare qualche interesse ai depositanti stessi. Ciò rafforzerebbe anche\nil sistema bancario. Fu allora che, in questo\nregime di ampie riserve, la Federal Reserve fece qualcos’altro. Dissero: \"Va bene, banche,\nnon è più il caso che l'unico modo per\nottenere interessi sulle vostre riserve sia\nprestandole ad altre banche. Vi permetteremo\ndi prendere quelle riserve e depositarle presso di noi\".  ,\ncon la Federal Reserve, e vi daremo\ngli interessi su quelle riserve.\" Ecco cos'è questo IOR,\ninteressi sulle riserve. Quindi, se sei un istituto bancario, questo essenzialmente stabilisce\nun limite massimo per gli interessi che otterresti sulle tue riserve. Ora, la domanda che\nforse ti starai chiedendo è: perché questa linea blu non si appiattisce proprio lì? E in alcuni diagrammi più semplificati, lo vedrai effettivamente. Ma si scopre che le banche\nnon sono gli unici partecipanti al mercato monetario.  Ci sono altre persone che potenzialmente\nprestano riserve alle banche e non hanno accesso a depositare le loro riserve\npresso la Federal Reserve. Quindi non c'è un piano per loro. La Federal Reserve\nha introdotto un altro tasso. Non entrerò nei dettagli\ndi ciò che significa RRP. Si tratta essenzialmente di accordi di riacquisto.  Si tratta essenzialmente della\nFederal Reserve che dà interessi alle istituzioni non bancarie\nsulle riserve che depositano presso la stessa Federal Reserve. Quindi questo pone un pavimento duro,\nperché anche quelle persone, non vorrebbero mai prestare al di sotto di questo perché potrebbero ottenere così tanti interessi con la Federal Reserve. Ora, la prossima domanda che\nvi starete chiedendo è, va bene, se siamo qui\nin questo regime di ampie riserve, tradizionalmente la Federal\nReserve potrebbe cambiare il tasso dei fondi federali, il tasso obiettivo spostando questa linea rossa\na sinistra e a destra  . Se sei in un regime di riserve non ampie, se sposti questa linea rossa a sinistra, beh, cosa succederà?  In sostanza aumenterete il tasso debitore overnight, e questo restringerebbe l’economia. E se lo sposti verso destra, diminuirai il\ntasso debitore overnight, e questo stimolerebbe l'economia. Se sei qui sul lato destro, se sposti questa linea rossa verticale\na destra o a sinistra, non cambierà\nil tasso debitore overnight perché essenzialmente\nabbraccerai questa linea blu piuttosto piatta. E le cose sono diventate\nancora più ampie dal 2008. Siamo passati da circa 1\ntrilione a 2 trilioni, e poi qui stiamo arrivando,\navvicinandoci a 8, 9 trilioni. E potresti dire: \"Bene, cosa è\nsuccesso proprio qui?\" Bene, quella era la\npandemia di COVID, dove, ancora una volta, la Federal Reserve\nvoleva davvero stimolare l’economia, e lo fece\nstampando tonnellate di denaro. Quindi, nello scenario in cui ci\ntroviamo ormai da un po’, ci troviamo in un regime di riserve abbondanti. Se nel 2008 disponevamo di ampie riserve, \noggi, negli anni 2020, siamo molto più avanti. Allora come fa la Federal Reserve a controllare effettivamente i tassi di interesse adesso? Bene, quello che possono fare è\ncontrollare questi piani, o potresti dire questo\npiano proprio qui. Se vogliono aumentare i tassi di interesse, aumentano semplicemente gli\ninteressi sulle riserve che danno. E se lo fanno, allora la curva sarà\nsimile a questa, e quindi il\ntasso debitore overnight sarà più alto, e quindi, ovviamente,\nciò sarebbe restrittivo per l’economia, e se vogliono allentare, possono allo stesso modo abbassare\nil tasso di interesse.  interessi sulle riserve."
}