{
    "source": "LKI1UmFbfaA",
    "youtubelink": "https://www.youtube.com/watch?v=LKI1UmFbfaA",
    "t_english": "- [Instructor] We see incredible optical illusions all around us almost every day, right? But what causes them? One of the main reasons is that when light goes from one medium to another, like, say, from vacuum or air into glass, it changes its speed because of which it bends. This bending is what we call refraction. So refraction is the phenomena where light bends when it changes medium, and it happens because it changes its speed when it goes from one medium to another. Now, one part of physics would be figuring out exactly how much it bends, and then using that to figure out the geometry of, like, you know how we get the images, why are the images big, they're small and inverted, and all of those cool things. We call that the geometrical optics. We are not gonna do that in this video, because in this video we're gonna try and understand why this happens. A couple of questions that we could be having in our mind is that question number one we could ask, hey, why is it that if light changes its speed, it should bend? I mean, for example, when light enters glass, it slows down. But why should it bend? Why can't it just continue in the same direction, just a little slower? Why should it bend? And then we could have an even more fundamental question, why does light change speed in the first place? (laughs) Why does light slow down, for example, when it enters glass? What's going on? So let's try and answer these questions one by one. So let's start with the first one. Why does light changing speed implies bending? To answer this question, let's remember our model of light. That is, it's an electromagnetic wave with oscillating electric fields. You can think of these as electric field vectors, and also magnetic fields, which I've not shown over here. Okay? But let me also get rid of these electric field vectors, and let me just look at the wave. This is an electromagnetic wave. Now the key thing over here is that this light is a wave in three dimensions. So, if we were to sort of like look from the top, we may see something like this. This was the wave that we looked at earlier, but now you can imagine a lot of these waves all stacked up. I'll show some more of these waves, but you can imagine, like, there are a lot of these waves all stacked up and that's what a, you know, this is how you can visualize this wave in 3D, and you now get to see something that you couldn't earlier. You can see these lines. These lines represent set of all crests, another set of all crests. You also see here a set of all troughs, right? We give a name to these lines. We call them, sorry, we call them wavefronts. Okay? What are wavefronts? You can say wavefronts are set of all points that are in phase with each other. Remember the word phase? In phase basically means that the electric field vectors over here are all oscillating in sync with each other. They'll all finish the same number of oscillations at any given time. Think of it that way. Okay? So set of all such points in phase, we call them as wavefronts. And over here we see these wavefronts to be parallel and straight and stuff, but that not be true. Wavefronts can have different shapes, but what's important for us is that the direction in which the wave travels will always be perpendicular to the wavefront. You can see that over here, right? Let me give you another example. Let's take a bigger example of water waves. If you're looking at water waves from the top, you can now see circular wavefronts. Again, set of all points that are in phase with each other. They're all cresting over here. You can see another, they're all cresting over here, right? So these are circular wavefronts. But again, if you look at the direction in which the wave is traveling, look at that. Look at that. You can see, locally, at that particular point, it is perpendicular to the wavefront. It is perpendicular to the wavefront. It can make sense, right? The wave is traveling outwards, but the wave direction is always perpendicular to the wavefront. That's an important one for us. Now, to understand what happens when it enters a medium like glass, let's just focus on one of these wavefronts and introduce our glass piece. And what helps me to visualize this is, instead of looking at this as a complete continuous wavefront, let me convert it into a few dots representing the wave crests. So you can imagine this is one of the wave crests of the wave. This is another wave crest of the wave. This whole thing is a wavefront. And now let's see what happens when it enters into the glass. Remember, the waves slow down. So let's see how that, you know, results in bending. Okay? So let's look at this frame by frame. So the next frame, all of them would have traveled equal distance forward because they're all traveling at the same speed. Again, they'll travel equal distance forward. But now you can see that this one, the one at the bottom, this crest enters the glass piece first. Therefore, it's going to slow down first. So, in the next frame, this one will travel less distance, but the ones over here will travel the same distance as before and see what happens as a result, you'll get something like this. That makes sense, right? This has traveled less distance, but the rest of them have traveled the same distance as before. And now notice this one enters into the glass piece. So, now this one will slow down, and so it will also travel less distance. Now this and this will travel at the same speed, but the rest of them will continue traveling at the same earlier speed. Now you see what happens, boom. Can you see what's going on as a result? What do you notice? Oh my god, you can actually now see the wavefront bending. What caused the bending? The bending happened because not all the wave crests slowed down at the same time. The ones at the bottom slowed down first and then slowly and steadily, the rest of them start slowing down. And now if you could see the wavefronts just like before, there you have it, this is what it would look like. Let's animate this one more time. Here's what it would look like. There it is. The wavefronts are bending, they're slowed down, and they're bending because of that. Beautiful, right? But now remember, if you want to figure out the direction in which the light ray is traveling, that direction will always be perpendicular to the direction of the wavefront. So let's look at it one more time and focus on just a beam of light and let's see what we get. So we're just gonna focus on a beam of light, and boom, there you go. You can now clearly see the whole thing bending. Beautiful, right? This is how we model refraction, thinking of light as an electromagnetic wave. Okay, let's test our understanding quickly. What if the light did not slow down as much as in glass? For example, if this was a different medium in which light was slightly faster, what would this bending look like? Well, now it wouldn't bend as much, because the wavefronts will not slow down as much as it did before. And as a result, look, they won't bend as much as they did before. So you can see how much the light ray bends clearly depends upon how much this light slows down, how much the light changes its speed. But another thing that would matter is the angle at which we incident light. For example, what if we incident light perpendicular to the surface? What would happen then? Well, now light wouldn't bend at all. Why? Because even though light is slowing down, look, the entire wavefront enters at exactly the same time, and therefore, the whole wavefront slows down together, there's no bending. So when you incident light perpendicularly, there will be no bending at all. So it depends on the angle at which you incident light as well. This means the amount of bending depends upon the angle at which you shine light on the surface. And it also depends upon how much light slows down or speeds up. It can speed up as well. And now that brings us to the second question, more fundamental one. Why does light change its speed in the first place? Why does light, for example, slow down when it goes from say, air to glass? What really happens to the electromagnetic waves when it enters a glass? One of the cool ways to figuring this out is to, instead of looking at the entire glass piece at once, just take a tiny, very tiny, very thin portion of the glass and see what happens to it, okay? So if the glass piece was not there, then the wave would just keep going forward. But because the glass piece is there and the glass contains electrons inside of it, we can model these electrons to be kind of like a tiny spring. And so, now when the electromagnetic waves go over those electrons, let me just show that. So here's an electron, for example, and as the electromagnetic wave passes over that electron, look, it makes it go up and down. It forces it to go up and down. And so we have these electrons, they are all going up and down, oscillating up and down. And what happens when charges oscillate up and down, they create their own electromagnetic waves. Ooh, this means all the electrons of this glass piece are going to generate another electromagnetic wave. They'll come out in both the direction. I'm just gonna show it over here so that we can see them apart. So here it is. Now the one going to the left is the reflected light, but since we're not interested on that, just let's look at the one that's going to the right. It's going to merge with the incoming light, with the original light that we have incident. And now the big question is, what happens when they merge together? Well, the technical term over here is interference. We say that these two waves will interfere with each other. And to figure out what happens to the resulting wave when waves interfere each other, all we have to do is just add up their heights at each location. For example, if we have a situation like what we have over here where the crests and the troughs, the peaks and the valleys are all lining up like this, then in the resulting wave, the peaks would be even bigger. The valleys would be even deeper, right? They all add up. And we would get something that looks like this. We'll get a wave that looks very similar to this, but bigger peaks and bigger valleys. We call this constructive interference because they are constructing each other, right? But what if the secondary wave was not like this? What if the secondary wave was like this, where the peaks matched exactly with the valleys of the secondary wave? What would happen then? Now they tend to cancel each other. The peaks over here tends to cancel with the valleys, and the valleys over here tends to cancel with the peaks. But because this wave is still much smaller compared to this one, because this wave is generated by a tiny sliver of a glass piece over here, so it's not much. So the height of this wave should be very, very tiny compared to the height of this one. But what will end up happening, the net result is that you'll get a wave that looks again, very much like this, but with decreased peaks and valleys, we call this destructive interference because they're destroying each other. In fact, if this wave had the same height as this wave, they would completely destroy each other because the peaks would be completely destroyed by the valleys. The valleys would be completely destroyed by the peaks and so on, which means to understand what really happens over here, we need to know exactly what is the phase difference between these two waves? In other words, we need to understand, you know, how are the crests of the waves and the troughs of the waves aligned? Like, how are they aligned over here? Now for that, we need to do the math, which we are not gonna do. But if we do the math, it turns out, for visible light frequency and for glass-like material, we would find that the secondary waves, the peaks are not completely lined up, but they're slightly shifted back like this. In fact, the peak of this will line up with the zero of the secondary wave, something like this. This is how they will line up. Unfortunately, we'll not be able to understand intuitively as to why it lines up that way, because we have to do the math, which we're gonna skip over here. But now comes the question, what would the resulting wave look like? Well, the resulting wave will not be a constructive interference nor a destructive interference, it'll be something in between. What we'll end up seeing is a wave, again, that looks pretty much like this, but since the peaks of these are not lined up, the resulting one will have a peak that is somewhere in between the peak of this one and the peak of this one. It'll be very close to the peak of this one, but it'll look somewhat like this. So you can kind of see, in fact, I think it should be very close like this. Okay, kind of like this. So the peaks of this one will be very, very close to the peaks of this one, but because of this wave, it'll be slightly pulled back. So the net effect, like putting it all together, to summarize, the net effect of these secondary waves is that the peaks of these waves get slightly pulled back. So, if I draw that wave over here, it would look very similar to this, but it'll be slightly pulled back. Look at it carefully, boom. This is the effect of one tiny glass piece over here. What if I put another glass piece somewhere over here? Well, again, the wave in front of it gets pulled back. Same idea, boom. What if I put another one? Pulls back. So notice that the wave is not really slowing down. The light is actually traveling at the same speed. But when you introduce these glass pieces, because of interference, the wave gets pulled back. So imagine a ball or something that's moving forward at some speed, but then it gets pulled back and then again continues to travel at the same speed where it's pulled back. Now this is what happens if there are discrete tiny pieces of glass. But remember, we have a continuous medium, which means there'll be continuous pullback happening. Again, imagine this ball going forward at some speed but being continuously pulled back, what it would look like? Here it is, and it'll compare with the ball that is not being pulled back. Look at this. Can you see it? Both the balls are always traveling at the same speed, but this one starts lagging because it's being continuously pulled back. It almost looks like it is slower than the other ball, but it's not. (laughs) But it gives you that illusion of being slower. The same thing is gonna happen over here because of these continuous pull back, and it will give us the illusion that the light has slowed down. And as a result, you will now get light traveling at a slower speed, and you'll also see the veiling being compressed because of the pullback effect as well. Finally, when you shine white light on a piece of glass, since it has different colors, meaning different frequencies, they would have different pullback effects. Therefore, different colors will travel with different speeds. It turns out that the violet end of the spectrum will have the maximum pullback effect, and so, it'll travel with the slowest speed, but the red end of the spectrum will have the least pullback effect, and it will travel with a higher speed, which means if you shoot white light at an angle, they won't bend, the different colors will bend differently. The violet, since it's slowed down a lot, will bend more compared to red. So, red will bend less, violet will bend more. And as a result, and of course, all the colors will be in between, and as a result, the colors separate out. That's why the prism separates out all the colors and is also the reason why we see rainbows.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] ہم اپنے ارد\n گرد تقریباً ہر روز ناقابل یقین نظری وہم دیکھتے ہیں، ٹھیک ہے؟ لیکن ان کا کیا سبب ہے؟  اس کی ایک بنیادی وجہ یہ ہے کہ جب روشنی\nایک میڈیم سے دوسرے میڈیم میں جاتی ہے، جیسے کہ ویکیوم یا ہوا سے شیشے میں، یہ اپنی رفتار بدلتی ہے جس\nکی وجہ سے وہ جھک جاتا ہے۔ اس موڑنے کو ہم ریفریکشن کہتے ہیں۔ لہذا اپورتن وہ مظاہر ہے جہاں روشنی درمیانے درجے میں تبدیل ہونے پر جھکتی ہے، اور ایسا اس لیے ہوتا ہے کہ\n جب یہ ایک میڈیم سے دوسرے میڈیم میں جاتا ہے تو وہ اپنی رفتار کو بدلتا ہے۔ اب، طبیعیات کا ایک حصہ یہ\nمعلوم کر رہا ہو گا کہ یہ کتنا جھکتا ہے، اور پھر اس کا استعمال کرتے ہوئے جیومیٹری کا پتہ لگانا، جیسے، آپ جانتے ہیں کہ ہم تصاویر کیسے حاصل کرتے ہیں،\nتصاویر بڑی کیوں ہیں، وہ چھوٹی اور الٹی ہیں،\nاور وہ تمام ٹھنڈی چیزیں۔ ہم اسے جیومیٹریکل آپٹکس کہتے ہیں۔ ہم اس ویڈیو میں ایسا نہیں کرنے والے ہیں، کیونکہ اس ویڈیو میں ہم یہ سمجھنے کی کوشش کر رہے ہیں کہ ایسا کیوں ہوتا ہے۔ کچھ سوالات جو\nہمارے ذہن میں ہو سکتے ہیں وہ سوال نمبر ایک یہ ہے کہ ہم پوچھ سکتے ہیں، ارے، ایسا کیوں ہے کہ اگر\nروشنی اپنی رفتار بدلتی ہے تو اسے جھکنا چاہیے؟ میرا مطلب ہے، مثال کے طور پر، جب روشنی\nشیشے میں داخل ہوتی ہے، تو وہ سست ہو جاتی ہے۔ لیکن یہ کیوں جھک جائے؟ یہ صرف\nایک ہی سمت میں جاری کیوں نہیں رہ سکتا، ذرا آہستہ؟ اسے کیوں جھکنا چاہیے؟ اور پھر ہمارے پاس ایک اور\nبھی بنیادی سوال ہوسکتا ہے، روشنی کی رفتار\nپہلی جگہ کیوں بدلتی ہے؟  (ہنستا ہے) روشنی کیوں سست ہوتی ہے، مثال کے طور پر، جب وہ شیشے میں داخل ہوتی ہے؟ کیا ہو رہا ہے؟ تو آئیے ایک\nایک کرکے ان سوالات کے جوابات دینے کی کوشش کریں۔ تو آئیے پہلے سے شروع کرتے ہیں۔ روشنی کی تبدیلی کی\nرفتار موڑنے کا مطلب کیوں ہے؟ اس سوال کا جواب دینے کے لیے، آئیے\nاپنے روشنی کے ماڈل کو یاد رکھیں۔ یعنی، یہ ایک برقی مقناطیسی لہر ہے جس میں الیکٹرک فیلڈز دوہری ہیں۔ آپ ان کو\nالیکٹرک فیلڈ ویکٹر اور مقناطیسی فیلڈز کے طور پر سوچ سکتے ہیں،\nجو میں نے یہاں نہیں دکھائے ہیں۔ ٹھیک ہے؟ لیکن مجھے\nان برقی فیلڈ ویکٹروں سے بھی چھٹکارا حاصل کرنے دو، اور مجھے صرف لہر کو دیکھنے دو۔ یہ ایک برقی مقناطیسی لہر ہے۔ اب یہاں اہم بات یہ ہے کہ یہ روشنی\nتین جہتوں میں ایک لہر ہے۔ لہذا، اگر ہم\nاوپر سے اس طرح نظر آتے ہیں، تو ہم اس طرح کچھ دیکھ سکتے ہیں. یہ وہ لہر تھی جسے\nہم نے پہلے دیکھا تھا، لیکن اب آپ تصور کر سکتے ہیں کہ ان میں سے بہت سی\nلہریں کھڑی ہیں۔ میں ان میں سے کچھ اور لہروں کو دکھاؤں گا، لیکن آپ تصور کر سکتے ہیں، جیسے، ان میں سے بہت ساری\nلہریں اسٹیک اپ ہیں اور یہی ہے، آپ جانتے ہیں، اس طرح آپ\nاس لہر کو 3D میں تصور کر سکتے ہیں، اور آپ اب حاصل کر سکتے ہیں۔  ایسی چیز دیکھنے کے لیے\nجو آپ پہلے نہیں دیکھ سکتے تھے۔ آپ یہ لائنیں دیکھ سکتے ہیں۔ یہ لکیریں تمام کریسٹ کے سیٹ کی نمائندگی کرتی ہیں، تمام کریسٹ کا ایک اور سیٹ۔ آپ یہاں تمام گرتوں کا ایک سیٹ بھی دیکھتے ہیں،\nٹھیک ہے؟ ہم ان لائنوں کو ایک نام دیتے ہیں۔ ہم انہیں کہتے ہیں، معذرت، ہم\nانہیں لہراتی کہتے ہیں۔ ٹھیک ہے؟ ویو فرنٹ کیا ہیں؟ آپ کہہ سکتے ہیں کہ ویو فرنٹ ان تمام پوائنٹس کے سیٹ ہیں جو\nایک دوسرے کے ساتھ مرحلے میں ہیں۔ لفظ مرحلہ یاد ہے؟ مرحلے میں بنیادی طور پر اس کا مطلب یہ ہے کہ یہاں پر موجود\nالیکٹرک فیلڈ ویکٹر \nایک دوسرے کے ساتھ ہم آہنگی میں دوہر رہے ہیں۔ وہ سب کسی بھی وقت ایک ہی تعداد میں دوغلے ختم کر دیں گے۔ اس کے بارے میں اس طرح سوچو۔ ٹھیک ہے؟ لہٰذا اس طرح کے تمام پوائنٹس کو فیز میں سیٹ کریں، ہم انہیں ویو فرنٹ کہتے ہیں۔ اور یہاں ہم دیکھتے ہیں کہ یہ\nویو فرنٹ متوازی اور سیدھے اور چیزیں ہیں،\nلیکن یہ سچ نہیں ہے۔ ویو فرنٹ کی مختلف شکلیں ہو سکتی ہیں، لیکن ہمارے لیے جو چیز اہم ہے وہ یہ ہے کہ\nلہر جس سمت میں سفر کرتی ہے وہ ہمیشہ ویو فرنٹ کے لیے کھڑی ہو گی۔\n آپ اسے یہاں دیکھ سکتے ہیں، ٹھیک ہے؟ میں آپ کو ایک اور مثال دیتا ہوں۔ آئیے\nپانی کی لہروں کی ایک بڑی مثال لیتے ہیں۔ اگر آپ\nاوپر سے پانی کی لہروں کو دیکھ رہے ہیں، تو اب آپ سرکلر لہروں کو دیکھ سکتے ہیں۔  ایک بار پھر، تمام پوائنٹس کا سیٹ جو\nایک دوسرے کے ساتھ مرحلے میں ہیں۔ وہ سب یہاں پر چڑھ رہے ہیں۔ آپ ایک اور کو دیکھ سکتے ہیں، وہ\nسب یہاں کرسٹ کر رہے ہیں، ٹھیک ہے؟ تو یہ سرکلر ویو فرنٹ ہیں۔ لیکن پھر، اگر آپ اس سمت کو دیکھتے ہیں جس میں لہر\nسفر کر رہی ہے، تو اسے دیکھو۔ اس کو دیکھو۔ آپ دیکھ سکتے ہیں، مقامی طور پر،\nاس خاص مقام پر، یہ ویو فرنٹ پر کھڑا ہے۔ یہ ویو فرنٹ پر کھڑا ہے۔ یہ سمجھ میں آ سکتا ہے، ٹھیک ہے؟ لہر باہر کی طرف سفر کر رہی ہے، لیکن لہر کی سمت\nہمیشہ ویو فرنٹ پر کھڑی ہوتی ہے۔ یہ ہمارے لیے ایک اہم ہے۔ اب، یہ سمجھنے کے لیے کہ جب یہ شیشے جیسے میڈیم میں داخل ہوتا ہے تو کیا ہوتا ہے، آئیے صرف ان لہروں میں سے ایک پر توجہ مرکوز کریں\n اور اپنے شیشے کے ٹکڑے کو متعارف کرائیں۔ اور جو چیز مجھے اس کا تصور کرنے میں مدد دیتی ہے وہ یہ ہے کہ اس کو ایک مکمل مسلسل ویو فرنٹ کے طور پر دیکھنے کے بجائے، مجھے اسے چند نقطوں میں تبدیل کرنے دیں جو لہر کی کرسٹ کی نمائندگی کرتے ہیں۔ تو آپ تصور کر سکتے ہیں کہ یہ لہر کی لہروں میں سے ایک ہے۔ یہ لہر کی ایک اور لہر ہے۔ یہ ساری چیز ایک ویو فرنٹ ہے۔ اور اب دیکھتے ہیں کہ جب شیشے میں داخل ہوتا ہے تو کیا ہوتا ہے۔ یاد رکھیں، لہریں سست ہو جاتی ہیں۔ تو آئیے دیکھتے ہیں کہ آپ\nجانتے ہیں کہ اس کا نتیجہ موڑنے میں کیسے آتا ہے۔ ٹھیک ہے؟ تو آئیے اس فریم کو فریم کے لحاظ سے دیکھتے ہیں۔ تو اگلا فریم، ان سب نے\nمساوی فاصلہ طے کیا ہوگا کیونکہ وہ سب\nایک ہی رفتار سے سفر کر رہے ہیں۔  ایک بار پھر، وہ\nآگے کے برابر مسافت طے کریں گے۔ لیکن اب آپ دیکھ سکتے ہیں کہ یہ\nایک، نیچے والا، یہ کرسٹ پہلے شیشے کے ٹکڑے میں داخل ہوتا ہے۔ لہذا، یہ سب سے پہلے سست ہو جائے گا. لہذا، اگلے فریم میں، یہ\nکم فاصلہ طے کرے گا، لیکن یہاں والے پہلے کی طرح\nہی فاصلہ طے کریں گے اور دیکھیں گے کہ اس کے\nنتیجے میں کیا ہوتا ہے، آپ کو کچھ اس طرح ملے گا۔ یہ سمجھ میں آتا ہے، ٹھیک ہے؟ اس نے کم فاصلہ طے کیا ہے لیکن باقی سب نے پہلے کی طرح ہی فاصلہ طے کیا ہے۔ اور اب دیکھیں کہ یہ\nشیشے کے ٹکڑے میں داخل ہوتا ہے۔ لہذا، اب یہ سست ہو جائے گا، اور اس طرح یہ بھی کم فاصلہ طے کرے گا. اب یہ اور یہ\nایک ہی رفتار سے سفر کریں گے، لیکن باقی سب اسی رفتار سے\nسفر کرتے رہیں گے۔ اب آپ دیکھتے ہیں کیا ہوتا ہے، بوم۔ کیا آپ دیکھ سکتے ہیں کہ اس کے نتیجے میں کیا ہو رہا ہے؟ آپ کیا نوٹس کرتے ہیں؟ اوہ میرے خدا، آپ حقیقت میں\nاب ویو فرنٹ کو جھکتے ہوئے دیکھ سکتے ہیں۔ موڑنے کی وجہ کیا ہے؟ موڑنا اس لیے ہوا کیونکہ ایک ہی وقت میں تمام موجیں سست نہیں ہوئیں۔  سب سے نیچے والے پہلے سست ہوتے ہیں\nاور پھر آہستہ آہستہ، باقی سب\nسست ہونے لگتے ہیں۔ اور اب اگر آپ\nویو فرنٹ کو پہلے کی طرح دیکھ سکتے ہیں، تو آپ کے پاس یہ ہے، یہ ایسا ہی\nنظر آئے گا۔ آئیے اسے ایک بار اور متحرک کریں۔  یہ کیسا نظر آئے گا۔ وہاں یہ ہے. ویو فرنٹ جھک رہے ہیں،\nوہ سست ہو رہے ہیں، اور اس کی وجہ سے وہ جھک رہے ہیں۔ خوبصورت، ٹھیک ہے؟ لیکن اب یاد رکھیں، اگر\nآپ اس سمت کا پتہ لگانا چاہتے ہیں جس میں\nروشنی کی کرن سفر کر رہی ہے، تو وہ سمت\nہمیشہ ویو فرنٹ کی سمت کے لیے کھڑی ہوگی۔ تو آئیے اسے ایک بار اور دیکھیں اور روشنی کی صرف ایک کرن پر توجہ مرکوز کریں\nاور دیکھتے ہیں کہ ہمیں کیا ملتا ہے۔ تو ہم صرف\nروشنی کی شہتیر پر توجہ مرکوز کرنے والے ہیں، اور عروج پر، آپ وہاں جائیں۔ اب آپ پوری چیز کو جھکتے ہوئے واضح طور پر دیکھ سکتے ہیں۔\n خوبصورت، ٹھیک ہے؟ اس طرح ہم اپورتن کو ماڈل کرتے ہیں، روشنی کو\nبرقی مقناطیسی لہر کے طور پر سوچتے ہیں۔ ٹھیک ہے، آئیے جلدی سے اپنی سمجھ کی جانچ کریں۔\n اگر روشنی اتنی\nکم نہ ہو جتنی شیشے میں ہوتی ہے؟ مثال کے طور پر، اگر یہ ایک\nمختلف میڈیم تھا جس میں روشنی قدرے تیز تھی، تو\nیہ جھکاؤ کیسا نظر آئے گا؟ ٹھیک ہے، اب یہ اتنا نہیں جھک جائے گا، کیونکہ لہروں کی رفتار اتنی سست نہیں ہوگی جتنی پہلے تھی۔ اور اس کے نتیجے میں، دیکھو، وہ اتنا نہیں جھکیں گے جتنا وہ پہلے کرتے تھے۔ لہذا آپ دیکھ سکتے ہیں کہ\nروشنی کی کرن واضح طور پر کتنا جھکتی ہے اس بات پر منحصر ہے کہ\nیہ روشنی کتنی کم ہوتی ہے، روشنی اپنی رفتار کو کتنی بدلتی ہے۔ لیکن ایک اور چیز جو\nاہمیت رکھتی ہے وہ زاویہ ہے جس پر ہم روشنی کا واقعہ پیش کرتے ہیں۔ مثال کے طور پر، اگر ہم روشنی کو سطح پر کھڑا کرتے ہیں تو کیا ہوگا؟ پھر کیا ہوتا؟ ٹھیک ہے، اب روشنی بالکل نہیں جھکتی ہے۔ کیوں؟ کیونکہ اگرچہ روشنی\nکم ہو رہی ہے، دیکھو، پورا ویو فرنٹ\nبالکل ایک ہی وقت میں داخل ہوتا ہے، اور اس وجہ سے، پورا\nویو فرنٹ ایک ساتھ سست ہو جاتا ہے، کوئی موڑنے والا نہیں ہے۔ لہذا جب آپ\nروشنی کو کھڑا کرتے ہیں، تو بالکل بھی موڑنے والا نہیں ہوگا۔ تو یہ اس زاویہ پر منحصر ہے جس پر آپ روشنی کا واقعہ بھی کرتے ہیں۔ اس کا مطلب ہے کہ\nموڑنے کی مقدار اس زاویے پر منحصر ہے جس پر آپ سطح پر روشنی ڈالتے ہیں۔ اور یہ اس بات پر بھی منحصر ہے کہ روشنی کتنی کم یا تیز ہوتی ہے۔ اس کی رفتار بھی بڑھ سکتی ہے۔ اور اب یہ ہمیں\nدوسرے سوال کی طرف لاتا ہے، زیادہ بنیادی سوال۔ روشنی\nسب سے پہلے اپنی رفتار کیوں بدلتی ہے؟ مثال کے طور پر جب روشنی، \nہوا سے شیشے کی طرف جاتی ہے تو سست کیوں ہو جاتی ہے؟  برقی مقناطیسی لہروں کا واقعی کیا ہوتا ہے \nجب یہ شیشے میں داخل ہوتی ہے؟  اس کا پتہ لگانے کا ایک عمدہ طریقہ یہ ہے کہ\n \nشیشے کے پورے ٹکڑے کو ایک ساتھ دیکھنے کے بجائے، شیشے کا ایک چھوٹا، بہت چھوٹا، بہت پتلا حصہ لیں اور دیکھیں کہ اس کا کیا ہوتا ہے، ٹھیک ہے؟ اس لیے اگر شیشے کا ٹکڑا نہ ہوتا تو لہر\nصرف آگے بڑھتی رہتی۔ لیکن چونکہ شیشے کا ٹکڑا وہاں موجود ہے اور شیشے کے\nاندر الیکٹران موجود ہیں، اس لیے ہم ان الیکٹرانوں کو ایک چھوٹے سے چشمے کی طرح ماڈل بنا سکتے ہیں۔ اور اس طرح، اب جب برقی مقناطیسی لہریں ان الیکٹرانوں کے اوپر جاتی ہیں، تو\nمیں صرف یہ دکھاتا ہوں۔ تو یہاں ایک الیکٹران ہے، مثال کے طور پر، اور جیسے ہی برقی مقناطیسی\nلہر اس الیکٹران کے اوپر سے گزرتی ہے، دیکھو، یہ\nاسے اوپر نیچے کرتا ہے۔ یہ اسے اوپر اور نیچے جانے پر مجبور کرتا ہے۔ اور اس طرح ہمارے پاس یہ الیکٹران ہیں، وہ سب اوپر اور\nنیچے جا رہے ہیں، اوپر اور نیچے دوہر رہے ہیں۔ اور کیا ہوتا ہے جب چارجز\nاوپر نیچے ہوتے ہیں، وہ اپنی\nبرقی مقناطیسی لہریں بناتے ہیں۔ اوہ، اس کا مطلب ہے کہ اس شیشے کے ٹکڑے کے تمام الیکٹران ایک اور برقی مقناطیسی لہر پیدا کرنے جا رہے ہیں۔ وہ دونوں سمتوں میں باہر آئیں گے۔ میں اسے یہاں دکھانے والا ہوں تاکہ ہم انہیں الگ دیکھ سکیں۔ تو یہ یہاں ہے۔ اب جو بائیں طرف جا رہی ہے وہ\nمنعکس شدہ روشنی ہے، لیکن چونکہ ہمیں اس میں کوئی دلچسپی نہیں ہے، آئیے صرف اس کو دیکھتے ہیں\nجو دائیں طرف جا رہی ہے۔ یہ\nآنے والی روشنی کے ساتھ ضم ہونے والا ہے، اصل روشنی کے ساتھ\nجو ہمارے پاس واقعہ ہے۔ اور اب بڑا سوال یہ ہے کہ جب وہ ایک ساتھ مل جاتے ہیں تو کیا ہوتا ہے؟ ٹھیک ہے، یہاں تکنیکی اصطلاح\nمداخلت ہے۔ ہم کہتے ہیں کہ یہ دونوں لہریں\nایک دوسرے میں مداخلت کریں گی۔ اور یہ جاننے کے لیے کہ جب لہریں ایک دوسرے میں مداخلت کرتی ہیں تو نتیجے میں آنے والی لہر کا کیا ہوتا ہے،\n ہمیں\nبس ہر مقام پر ان کی بلندیوں کو جوڑنا ہے۔ مثال کے طور پر، اگر ہمارے یہاں ایسی صورت حال ہو کہ جو ہمارے یہاں ہے،\nجہاں چوٹیاں اور گڑھے، چوٹیاں اور وادیاں\nسب اس طرح صف آرا ہوں، تو نتیجے میں آنے والی لہر میں\nچوٹیاں اور بھی بڑی ہوں گی۔ وادیاں اور بھی گہری ہوں گی، ٹھیک ہے؟ وہ سب کا اضافہ کرتے ہیں۔ اور ہمیں کچھ ملے گا\nجو اس طرح لگتا ہے۔ ہمیں ایک لہر ملے گی جو\nاس سے بہت ملتی جلتی ہے، لیکن بڑی چوٹیاں اور بڑی وادیاں۔ ہم اسے تعمیری مداخلت کہتے ہیں کیونکہ وہ\nایک دوسرے کی تعمیر کر رہے ہیں، ٹھیک ہے؟ لیکن اگر ثانوی\nلہر ایسی نہ ہوتی تو کیا ہوتا؟ کیا ہوگا اگر ثانوی لہر اس طرح ہوتی، جہاں چوٹیاں ثانوی لہر کی وادیوں سے بالکل ملتی ہیں؟ پھر کیا ہوتا؟ اب وہ ایک دوسرے کو منسوخ کرنے کا رجحان رکھتے ہیں۔ یہاں کی چوٹیاں\nوادیوں کے ساتھ منسوخ ہوتی ہیں، اور یہاں کی وادیاں\nچوٹیوں کے ساتھ منسوخ ہوتی ہیں۔ لیکن چونکہ یہ لہر اس کے مقابلے میں\nاب بھی بہت چھوٹی ہے، کیونکہ یہ لہر یہاں شیشے کے ٹکڑے کے ایک\nچھوٹے سے ٹکڑے سے پیدا ہوتی ہے، \nاس لیے یہ زیادہ نہیں ہے۔ لہذا اس لہر کی اونچائی اس کی اونچائی کے مقابلے میں بہت، بہت چھوٹی ہونی چاہئے۔\n لیکن آخر کیا ہو گا، خالص نتیجہ یہ ہے کہ آپ کو\nایک لہر ملے گی جو دوبارہ نظر آئے گی، بہت زیادہ اس طرح، لیکن چوٹیوں اور وادیوں میں کمی کے ساتھ، ہم اسے تباہ کن مداخلت کہتے ہیں کیونکہ وہ ایک دوسرے کو تباہ کر رہے ہیں۔ درحقیقت، اگر اس لہر کی\nاونچائی اس لہر کے برابر ہوتی تو وہ ایک دوسرے کو مکمل طور پر تباہ کر دیتے کیونکہ چوٹیاں \nوادیوں سے مکمل طور پر تباہ ہو جاتیں۔ وادیاں چوٹیوں وغیرہ سے مکمل طور پر تباہ ہو جائیں گی، جس کا مطلب یہ ہے کہ یہ سمجھنے کے لیے کہ\nیہاں واقعی کیا ہوتا ہے، ہمیں یہ جاننا ہوگا کہ\n ان دونوں لہروں کے درمیان مرحلے کا فرق کیا ہے؟ دوسرے لفظوں میں، ہمیں یہ\nسمجھنے کی ضرورت ہے، آپ جانتے ہیں، لہروں کے سرے اور لہروں کی گرتیں کیسے ایک دوسرے سے منسلک ہیں؟ جیسے، وہ یہاں پر کیسے منسلک ہیں؟ اب اس کے لیے ہمیں ریاضی کرنے کی ضرورت ہے، جو ہم نہیں کرنے والے ہیں۔ لیکن اگر ہم ریاضی کریں، تو یہ پتہ چلتا ہے کہ نظر آنے والی روشنی کی فریکوئنسی اور شیشے کی طرح کے مواد کے لیے، ہم دیکھیں گے کہ ثانوی لہریں، چوٹیاں مکمل طور پر قطار میں نہیں ہیں، لیکن وہ اس طرح تھوڑا سا\nپیچھے ہٹی ہوئی ہیں۔ درحقیقت، اس کی چوٹی\n ثانوی لہر کے صفر کے ساتھ مل جائے گی،\nکچھ اس طرح۔ اس طرح وہ صف بندی کریں گے۔ بدقسمتی سے، ہم\nبدیہی طور پر یہ سمجھنے کے قابل نہیں ہوں گے کہ یہ اس طرح کیوں ہے، کیونکہ ہمیں ریاضی کرنا ہے، جسے ہم یہاں چھوڑنے والے ہیں۔ لیکن اب سوال آتا ہے کہ اس کے نتیجے میں آنے والی لہر کیسی ہوگی؟ ٹھیک ہے، نتیجے میں آنے والی لہر کوئی تعمیری مداخلت نہیں ہوگی اور نہ ہی تباہ کن مداخلت، یہ درمیان میں کچھ ہوگی۔ جس چیز کو ہم آخر میں دیکھیں گے وہ ایک لہر ہے، جو کہ بہت کچھ اس طرح کی نظر آتی ہے، لیکن چونکہ ان کی چوٹیوں کو\nقطار میں نہیں رکھا گیا ہے، اس کے نتیجے میں ایک ایسی\nچوٹی ہوگی جو اس کی چوٹی کے درمیان کہیں ہوتی ہے۔\nاس کی چوٹی. یہ اس کی چوٹی کے بہت قریب ہوگا،\n لیکن یہ کچھ اس طرح نظر آئے گا۔ تو آپ دیکھ سکتے ہیں، درحقیقت، میرے خیال میں اسے اس طرح بہت قریب ہونا چاہیے۔ ٹھیک ہے، اس طرح. تو اس کی چوٹیاں اس کی چوٹیوں کے بہت قریب ہوں گی، لیکن اس لہر کی وجہ سے،\nاسے تھوڑا سا پیچھے ہٹا دیا جائے گا۔ تو خالص اثر، جیسا کہ ان سب کو\nایک ساتھ رکھنا، مختصراً، ان ثانوی لہروں کا خالص اثر یہ ہے کہ ان لہروں کی چوٹیاں\nقدرے پیچھے ہٹ جاتی ہیں۔ لہذا، اگر میں اس لہر کو یہاں کھینچتا ہوں، تو یہ اس سے بہت ملتی جلتی نظر آئے گی، لیکن اسے تھوڑا سا پیچھے ہٹا دیا جائے گا۔ اسے غور سے دیکھو، بوم۔ یہ\nیہاں پر ایک چھوٹے سے شیشے کے ٹکڑے کا اثر ہے۔ اگر میں ایک اور شیشے کا\nٹکڑا یہاں پر رکھ دوں تو کیا ہوگا؟ ٹھیک ہے، ایک بار پھر،\nاس کے سامنے لہر واپس کھینچ لی جاتی ہے. ایک ہی خیال، بوم. اگر میں ایک اور ڈالوں تو کیا ہوگا؟ پیچھے کھینچتا ہے۔ تو یاد رکھیں کہ لہر\nواقعی سست نہیں ہو رہی ہے۔ روشنی دراصل\nاسی رفتار سے سفر کر رہی ہے۔ لیکن جب آپ ان شیشے کے ٹکڑوں کو متعارف کراتے ہیں، مداخلت کی وجہ سے،\nلہر واپس کھینچ لی جاتی ہے۔ تو ایک گیند یا کسی چیز کا تصور کریں جو کچھ رفتار سے آگے بڑھ رہی ہے، لیکن پھر وہ پیچھے ہٹ جاتی ہے اور پھر دوبارہ\nاسی رفتار سے سفر کرتی رہتی ہے جہاں سے اسے پیچھے ہٹایا جاتا ہے۔ اب ایسا ہی ہوتا ہے اگر\nشیشے کے مجرد چھوٹے چھوٹے ٹکڑے ہوں۔ لیکن یاد رکھیں، ہمارے پاس ایک مسلسل میڈیم ہے، جس کا مطلب ہے کہ\nمسلسل پل بیک ہوتا رہے گا۔  ایک بار پھر تصور کریں کہ یہ گیند\nکچھ رفتار سے آگے بڑھ رہی ہے لیکن مسلسل پیچھے کھینچی جارہی ہے، یہ کیسی نظر آئے گی؟  یہ یہاں ہے، اور یہ\nاس گیند سے موازنہ کرے گا جسے پیچھے نہیں کھینچا جا رہا ہے۔ اسے دیکھو۔ کیا آپ اسے دیکھ سکتے ہیں؟ دونوں گیندیں ہمیشہ\nایک ہی رفتار سے سفر کرتی ہیں، لیکن یہ ایک پیچھے ہونے لگتی ہے کیونکہ اسے\nمسلسل پیچھے ہٹایا جا رہا ہے۔  ایسا لگتا ہے کہ یہ دوسری گیند کے مقابلے میں سست ہے،\nلیکن ایسا نہیں ہے۔  (ہنستا ہے) لیکن یہ آپ کو\nسست ہونے کا وہم دیتا ہے۔ ان مسلسل پیچھے ہٹنے کی وجہ سے یہاں بھی وہی ہونے والا ہے، اور اس سے ہمیں یہ وہم ملے گا کہ روشنی کم ہو گئی ہے۔ اور نتیجتاً، اب آپ کو\nہلکی رفتار سے سفر کرنے کا موقع ملے گا، اور آپ\n پل بیک اثر کی وجہ سے پردہ کو سکیڑا ہوا بھی دیکھیں گے۔ آخر میں، جب آپ\nشیشے کے ٹکڑے پر سفید روشنی چمکاتے ہیں، چونکہ اس کے مختلف رنگ ہوتے ہیں، یعنی مختلف تعدد، اس لیے ان کے مختلف\nپل بیک اثرات ہوتے ہیں۔ لہذا، مختلف رنگ مختلف رفتار کے ساتھ سفر کریں گے.  اس سے پتہ چلتا ہے کہ سپیکٹرم کے بنفشی سرے پر\nزیادہ سے زیادہ پل بیک اثر ہوگا، اور اس طرح، یہ سب سے\nسست رفتار کے ساتھ سفر کرے گا، لیکن سپیکٹرم کے سرخ سرے پر کم سے کم پل بیک اثر پڑے گا، اور یہ زیادہ سے زیادہ رفتار کے ساتھ سفر کرے گا۔  رفتار، جس کا مطلب ہے کہ اگر آپ\nسفید روشنی کو کسی زاویے پر گولی مارتے ہیں، تو وہ نہیں جھکیں گے، مختلف\nرنگ مختلف طریقے سے جھکیں گے۔ بنفشی، چونکہ یہ بہت سست ہے، سرخ کے مقابلے میں زیادہ جھک جائے گا۔ لہذا، سرخ کم جھک جائے گا،\nبنفشی زیادہ جھک جائے گا. اور اس کے نتیجے میں، اور ظاہر ہے، تمام رنگ درمیان میں ہوں گے، اور اس کے نتیجے میں، رنگ الگ ہو جائیں گے۔ یہی وجہ ہے کہ پرزم\nتمام رنگوں کو الگ کرتا ہے اور یہی وجہ ہے کہ\nہمیں قوس قزح نظر آتی ہے۔",
    "t_spanish": "- [Instructor] Vemos\nincreíbles ilusiones ópticas a nuestro alrededor casi todos los días, ¿verdad?  ¿ Pero qué los causa? Una de las razones principales es que cuando la luz pasa\nde un medio a otro, como, por ejemplo, del vacío o del aire al vidrio, cambia su velocidad,\npor lo que se curva. Esta flexión es lo que llamamos refracción. Entonces, la refracción es el fenómeno en el que la luz se curva cuando cambia de medio, y ocurre porque\ncambia su velocidad cuando pasa de un medio a otro. Ahora, una parte de la física\nsería descubrir exactamente cuánto se dobla, y luego usar eso para descubrir la geometría, ya sabes cómo obtenemos las\nimágenes, por qué las imágenes son grandes, son pequeñas y están invertidas,\ny todas esas cosas interesantes.  A esto lo llamamos óptica geométrica. No haremos eso en este video, porque en este video intentaremos entender por qué sucede esto. Un par de preguntas que\npodríamos tener en mente es la pregunta número uno que podríamos hacer: oye, ¿por qué si\nla luz cambia su velocidad, debería doblarse? Quiero decir, por ejemplo, cuando la luz\nentra en el vidrio, se ralentiza. Pero ¿por qué debería doblarse?  ¿ Por qué no puede simplemente continuar\nen la misma dirección, sólo que un poco más lento?  ¿ Por qué debería doblarse? Y entonces podríamos tener una\npregunta aún más fundamental: ¿ por qué la luz cambia de velocidad\nen primer lugar?  (Risas) ¿ Por qué la luz se ralentiza, por ejemplo, cuando entra en el cristal?  ¿ Qué está sucediendo? Así que intentemos responder\nestas preguntas una por una. Así que comencemos con el primero.  ¿ Por qué el cambio de velocidad de la luz\nimplica doblarse? Para responder a esta pregunta,\nrecordemos nuestro modelo de luz. Es decir, es una onda electromagnética con campos eléctricos oscilantes. Puedes considerarlos como\nvectores de campos eléctricos y también como campos magnéticos,\nque no he mostrado aquí.  ¿ Bueno? Pero permítanme deshacerme también de\nestos vectores de campo eléctrico y déjenme simplemente mirar la onda. Esta es una onda electromagnética. Ahora la clave aquí es que esta luz es una\nonda en tres dimensiones. Entonces, si\nmiráramos desde arriba, podríamos ver algo como esto. Esta fue la ola que\nvimos antes, pero ahora puedes imaginar muchas\nde estas olas todas apiladas. Mostraré más de estas ondas, pero puedes imaginar que hay muchas de estas\nondas apiladas y eso es lo que, ya sabes, así es como puedes\nvisualizar esta onda en 3D, y ahora obtienes  para ver algo\nque antes no podías. Puedes ver estas líneas. Estas líneas representan un conjunto de todas las crestas, otro conjunto de todas las crestas. También ves aquí un conjunto\nde todos los comederos, ¿verdad?  Le damos un nombre a estas líneas. Los llamamos, lo siento,\nlos llamamos frentes de onda.  ¿ Bueno?  ¿ Qué son los frentes de onda?  Se puede decir que los frentes de onda son un conjunto de todos los puntos que están\nen fase entre sí.  ¿ Recuerdas la palabra fase? En fase básicamente significa que\nlos vectores del campo eléctrico aquí oscilan\nen sincronía entre sí. Todos terminarán el mismo número de oscilaciones en un momento dado. Piense en ello de esa manera.  ¿ Bueno? Entonces, al conjunto de todos esos puntos en fase, los llamamos frentes de onda. Y aquí vemos que estos\nfrentes de onda son paralelos y rectos y esas cosas,\npero eso no es cierto. Los frentes de onda pueden tener diferentes formas, pero lo importante para nosotros es que la dirección en\nla que viaja la onda siempre será perpendicular\nal frente de onda. Puedes ver eso aquí, ¿verdad? Déjame darte otro ejemplo. Tomemos un ejemplo más amplio\nde ondas de agua. Si estás mirando las\nolas del agua desde arriba, ahora puedes ver frentes de onda circulares. Nuevamente, conjunto de todos los puntos que\nestán en fase entre sí. Todos están llegando a su punto máximo aquí. Puedes ver otro,\ntodos están llegando a su punto máximo aquí, ¿verdad? Entonces estos son frentes de onda circulares. Pero, de nuevo, si miras la dirección en la que viaja la onda\n, fíjate en eso. Mira eso. Puedes ver, localmente, que en\nese punto en particular es perpendicular al frente de onda. Es perpendicular al frente de onda. Puede tener sentido, ¿verdad? La onda viaja hacia afuera, pero la dirección de la onda\nsiempre es perpendicular al frente de onda. Ésa es una cuestión importante para nosotros. Ahora, para entender qué sucede cuando entra en un medio como el vidrio, centrémonos en\nuno de estos frentes de onda e introduzcamos nuestra pieza de vidrio. Y lo que me ayuda a visualizar esto es que, en lugar de verlo como un frente de onda continuo completo, permítanme convertirlo en unos pocos puntos que representan las crestas de las ondas. Así que puedes imaginar que esta es una de las crestas de la ola. Esta es otra cresta de la ola. Todo esto es un frente de onda. Y ahora veamos qué pasa cuando entra en el vaso. Recuerde, las olas disminuyen. Así que veamos cómo eso, ya\nsabes, resulta en flexión.  ¿ Bueno? Así que veamos esto cuadro por cuadro. Entonces, en el siguiente cuadro, todos habrían\nviajado la misma distancia hacia adelante porque todos\nviajan a la misma velocidad. Nuevamente, recorrerán la\nmisma distancia hacia adelante. Pero ahora pueden ver que ésta\n, la de abajo, esta cresta entra primero en la pieza de vidrio. Por lo tanto, primero disminuirá la velocidad. Entonces, en el siguiente cuadro,\neste viajará menos distancia, pero los de aquí\nviajarán la misma distancia que antes y verán qué\nsucede como resultado, obtendrán algo como esto. Eso tiene sentido, ¿verdad? Éste ha recorrido menos distancia, pero el resto ha recorrido la misma distancia que antes. Y ahora observe que éste\nentra en la pieza de vidrio. Entonces, ahora éste disminuirá la velocidad, y por lo tanto también recorrerá menos distancia. Ahora esto y esto\nviajarán a la misma velocidad, pero el resto\nseguirá viajando a la misma velocidad anterior. Ahora ya ves lo que pasa, boom.  ¿ Puedes ver lo que está pasando como resultado?  ¿ Que notaste? Dios mío,\nahora puedes ver cómo se dobla el frente de onda.  ¿ Qué causó la flexión? La curvatura se produjo porque no todas las crestas de las olas se desaceleraron al mismo tiempo. Los de abajo\ndesaceleraron primero y luego, lenta y constantemente, el resto\ncomienza a desacelerar. Y ahora, si pudieras ver los\nfrentes de onda como antes, ahí lo tienes, así es\ncomo se vería. Animemos esto una vez más. Así es como se vería. Ahí está. Los frentes de onda se están curvando,\nse ralentizan y por eso se están curvando. Hermosa, ¿verdad? Pero ahora recuerda, si\nquieres averiguar la dirección en la que\nviaja el rayo de luz, esa dirección\nsiempre será perpendicular a la dirección del frente de onda. Así que veámoslo una vez más y centrémonos en sólo un rayo de\nluz y veamos qué obtenemos. Así que simplemente nos\nenfocaremos en un rayo de luz y boom, ahí lo tienes. Ahora puedes ver claramente cómo se\ndobla todo. Hermosa, ¿verdad? Así es como modelamos la refracción, pensando en la luz como una\nonda electromagnética. Bien, probemos nuestra\ncomprensión rápidamente. ¿Y si la luz no se\nralentizara tanto como en el cristal? Por ejemplo, si se tratara de un\nmedio diferente en el que la luz fuera un poco más rápida, ¿cómo se\nvería esta curvatura? Bueno, ahora no se doblaría tanto, porque los frentes de onda no se ralentizarán tanto como antes. Y como resultado, mira, no se doblarán tanto como antes. Así que se puede ver que cuánto se\ncurva el rayo de luz depende claramente de cuánto se\ndesacelera esta luz, de cuánto cambia la velocidad de la luz. Pero otra cosa que\nsí importaría es el ángulo en el que incide la luz. Por ejemplo, ¿qué pasa si incidimos luz perpendicular a la superficie?  ¿ Qué pasaría entonces? Bueno, ahora la luz no se doblaría en absoluto.  ¿ Por qué? Porque aunque la luz se\nestá desacelerando, mire, todo el frente de onda entra\nexactamente al mismo tiempo y, por lo tanto, todo el\nfrente de onda se desacelera al mismo tiempo, no hay curvatura. Entonces, cuando la\nluz incide perpendicularmente, no habrá ninguna curvatura. Por lo tanto, también depende del ángulo en el que incide la luz. Esto significa que la cantidad de\nflexión depende del ángulo en el que ilumina la superficie. Y también depende de cuánta luz se desacelere o se acelere. También puede acelerar. Y ahora eso nos lleva\na la segunda pregunta, más fundamental.  ¿ Por qué la luz cambia su\nvelocidad en primer lugar?  ¿ Por qué la luz, por ejemplo, se ralentiza cuando pasa\ndel aire al vidrio?  ¿ Qué sucede realmente con las ondas electromagnéticas\ncuando entran en un vaso? Una de las mejores formas de\nresolver esto es, en lugar de mirar\ntoda la pieza de vidrio a la vez, simplemente tomar una porción pequeña, muy pequeña y muy delgada del vidrio y ver qué le sucede, ¿de acuerdo? Entonces, si el trozo de vidrio no estuviera allí, la ola\nseguiría avanzando. Pero como el trozo de vidrio está ahí y el vidrio contiene\nelectrones en su interior, podemos modelar estos electrones para que sean como un pequeño resorte. Y ahora, cuando las ondas electromagnéticas pasen por esos electrones,\npermítanme mostrarles eso. Aquí hay un electrón, por ejemplo, y cuando la\nonda electromagnética pasa sobre ese electrón, mira,\nlo hace subir y bajar.  Lo obliga a subir y bajar. Y entonces tenemos estos electrones, todos suben y\nbajan, oscilan hacia arriba y hacia abajo. Y lo que sucede cuando las cargas\noscilan hacia arriba y hacia abajo, crean sus propias\nondas electromagnéticas. Oh, esto significa que todos los electrones de esta pieza de vidrio van a generar otra onda electromagnética. Saldrán en ambas direcciones. Lo mostraré aquí para que podamos verlos separados. Asi que aqui esta. Ahora la que va hacia la\nizquierda es la luz reflejada, pero como eso no nos interesa, miremos la\nque va hacia la derecha.  Se fusionará\ncon la luz entrante, con la luz original\nque incide. Y ahora la gran pregunta es, ¿ qué pasa cuando se fusionan? Bueno, el término técnico\naquí es interferencia. Decimos que estas dos ondas\ninterferirán entre sí. Y para descubrir qué sucede con la onda resultante cuando las\nondas interfieren entre sí, todo lo que tenemos que hacer es\nsumar sus alturas en cada lugar. Por ejemplo, si tenemos una situación como la que tenemos\naquí, donde las crestas y los valles, los picos y los valles se\nalinean así, entonces, en la onda resultante,\nlos picos serían aún más grandes. Los valles serían aún más profundos, ¿verdad? Todos suman. Y obtendríamos algo\nparecido a esto. Tendremos una ola\nmuy similar a ésta, pero con picos y valles más grandes.  A esto lo llamamos interferencia constructiva porque se construyen\nmutuamente, ¿verdad? Pero ¿y si la\nonda secundaria no fuera así?  ¿ Qué pasaría si la onda secundaria fuera así, donde los picos coincidieran exactamente con los valles de la onda secundaria?  ¿ Qué pasaría entonces? Ahora tienden a anularse entre sí. Los picos de aquí tienden\na cancelarse con los valles, y los valles de aquí\ntienden a cancelarse con los picos. Pero debido a que esta onda\nes aún mucho más pequeña en comparación con esta, debido a que esta onda es\ngenerada por una pequeña astilla de vidrio de\naquí, entonces no es mucho. Así que la altura de esta ola debería ser muy, muy pequeña en comparación con\nla altura de ésta. Pero lo que terminará sucediendo, el resultado neto es que\nobtendrás una onda que se verá nuevamente, muy parecida a esta, pero con picos y valles disminuidos. A esto lo llamamos interferencia destructiva porque se están destruyendo entre sí. De hecho, si esta ola tuviera\nla misma altura que esta ola, se destruirían completamente entre sí porque los picos serían completamente\ndestruidos por los valles. Los valles serían completamente destruidos por los picos y demás, lo que significa que para entender\nlo que realmente sucede aquí, necesitamos saber exactamente\ncuál es la diferencia de fase entre estas dos ondas. En otras palabras, necesitamos\nentender, ya sabes, ¿ cómo están alineadas las crestas y los valles de las olas?  ¿ Cómo están alineados aquí? Ahora, para eso, necesitamos hacer los cálculos, lo cual no vamos a hacer. Pero si hacemos los cálculos, resulta que para la frecuencia de la luz visible y para el material similar al vidrio, encontraríamos que las ondas secundarias, los picos, no están completamente alineados, sino que están ligeramente\ndesplazados hacia atrás, así. De hecho, el pico de esta se\nalineará con el cero de la onda secundaria,\nalgo así. Así se alinearán. Desafortunadamente, no\npodremos entender intuitivamente por qué se alinea de esa manera, porque tenemos que hacer los cálculos, que nos saltaremos aquí. Pero ahora surge la pregunta: ¿ cómo sería la onda resultante? Bueno, la onda resultante no será una interferencia constructiva ni destructiva, será algo intermedio. Lo que terminaremos viendo es una onda, nuevamente, que se parece mucho a esta, pero como los picos de\néstas no están alineados, la resultante tendrá\nun pico que estará en algún lugar entre el pico de ésta\ny el  pico de éste. Estará muy cerca\ndel pico de este, pero se verá más o menos así.  Como pueden ver, de hecho, creo que debería estar muy cerca así. Vale, algo así. Así que los picos de ésta estarán muy, muy cerca de los picos de ésta, pero debido a esta ola,\nse retrasará ligeramente. Entonces, el efecto neto, \nen resumen, el efecto neto de estas ondas secundarias es que los picos de estas\nondas retroceden ligeramente. Entonces, si dibujo esa onda aquí, se verá muy similar a esta, pero estará ligeramente hacia atrás. Míralo con atención, boom. Este es el efecto de un\npequeño trozo de vidrio que hay aquí.  ¿ Qué pasa si pongo otro\ntrozo de vidrio en algún lugar por aquí? Bueno, de nuevo, la ola que tiene delante\nretrocede. La misma idea, boom.  ¿Y si pongo otro? Tira hacia atrás. Así que observemos que la ola en\nrealidad no se está desacelerando.  En realidad, la luz\nviaja a la misma velocidad. Pero cuando introduces estas piezas de vidrio, debido a la interferencia,\nla onda retrocede. Así que imagina una pelota o algo que se mueve hacia adelante a cierta velocidad, pero luego es empujado hacia atrás y luego continúa\nviajando a la misma velocidad a la que fue empujado hacia atrás. Ahora bien, esto es lo que sucede si hay\npequeños trozos de vidrio discretos. Pero recuerde, tenemos un medio continuo, lo que significa que se\nproducirá un retroceso continuo. Nuevamente, imagina esta pelota\navanzando a cierta velocidad pero siendo continuamente arrastrada hacia atrás, ¿ cómo se vería? Aquí está, y se\ncomparará con la pelota que no está siendo retirada. Mira este.  ¿ Puedes verlo? Ambas bolas siempre\nviajan a la misma velocidad, pero ésta comienza a retrasarse porque\nretrocede continuamente. Casi parece que es más lenta que la otra bola,\npero no lo es.  (risas) Pero te da esa\nilusión de ser más lento. Lo mismo sucederá aquí debido a este retroceso continuo y nos dará la ilusión de que la luz se ha ralentizado. Y como resultado, ahora la luz\nviajará a una velocidad más lenta y también verás que el\nvelo se comprime debido al efecto de retroceso. Finalmente, cuando iluminas con\nluz blanca un trozo de vidrio, dado que tiene diferentes colores, es decir, diferentes frecuencias, tendrían diferentes\nefectos de retroceso. Por lo tanto, diferentes colores viajarán con diferentes velocidades. Resulta que el extremo violeta del espectro tendrá\nel máximo efecto de retroceso y, por lo tanto, viajará\na la velocidad más lenta, pero el extremo rojo del espectro tendrá el menor efecto de retroceso y viajará con una mayor velocidad.  velocidad, lo que significa que si disparas\nluz blanca en ángulo, no se doblarán, los diferentes\ncolores se doblarán de manera diferente. El violeta, al estar mucho más lento, se doblará más respecto al rojo. Entonces, el rojo se doblará menos, el\nvioleta se doblará más. Y como resultado, y por supuesto, todos los colores estarán en el medio, y como resultado, los colores se separarán.  Por eso el prisma\nsepara todos los colores y también es la razón por la que\nvemos el arcoíris.",
    "t_arabic": "- [المدرس] نحن نرى\nخدعًا بصرية مذهلة في كل مكان حولنا كل يوم تقريبًا، أليس كذلك؟ لكن ما الذي يسببها؟ أحد الأسباب الرئيسية هو أنه عندما ينتقل الضوء\nمن وسط إلى آخر، مثلاً، من الفراغ أو الهواء إلى الزجاج، فإنه يغير سرعته التي\nبسببها ينحني. وهذا الانحناء هو ما نسميه الانكسار. فالانكسار هو الظاهرة التي ينحني فيها الضوء عندما يتغير الوسط، ويحدث لأنه\nتتغير سرعته عندما ينتقل من وسط إلى آخر. الآن، جزء واحد من الفيزياء\nهو معرفة مدى انحناءها بالضبط، ومن ثم استخدام ذلك لمعرفة الشكل الهندسي، مثل، كما تعلمون كيف نحصل على\nالصور، ولماذا تكون الصور كبيرة، فهي صغيرة ومقلوبة،\nوكل تلك الأشياء الرائعة. نحن نسمي ذلك البصريات الهندسية. لن نفعل ذلك في هذا الفيديو، لأننا في هذا الفيديو سنحاول أن نفهم سبب حدوث ذلك. بعض الأسئلة التي\nيمكن أن تدور في أذهاننا هي السؤال الأول الذي يمكننا طرحه، لماذا إذا\nتغير الضوء من سرعته، فيجب أن ينحني؟ أعني، على سبيل المثال، عندما\nيدخل الضوء إلى الزجاج، فإنه يتباطأ. ولكن لماذا يجب أن ينحني؟ لماذا لا يستمر الأمر\nفي نفس الاتجاه، ولكن بشكل أبطأ قليلاً؟ لماذا يجب أن ينحني؟ ومن ثم يمكن أن يكون لدينا\nسؤال أكثر جوهرية، لماذا يتغير الضوء\nفي المقام الأول؟  (يضحك) لماذا يتباطأ الضوء، على سبيل المثال، عندما يدخل الزجاج؟ ماذا يحدث هنا؟ لذلك دعونا نحاول الإجابة على\nهذه الأسئلة واحدًا تلو الآخر. لذلك دعونا نبدأ مع أول واحد. لماذا\nتشير سرعة الضوء المتغيرة إلى الانحناء؟ للإجابة على هذا السؤال، دعونا\nنتذكر نموذجنا للضوء. أي أنها موجة كهرومغناطيسية ذات مجالات كهربائية متذبذبة. يمكنك أن تفكر في هذه\nكمتجهات للمجال الكهربائي، وأيضًا مجالات مغناطيسية،\nوالتي لم أعرضها هنا. تمام؟ لكن دعوني أيضًا أتخلص من\nمتجهات المجال الكهربي هذه، وأنظر إلى الموجة. هذه موجة كهرومغناطيسية. الشيء الأساسي هنا هو أن هذا الضوء عبارة عن\nموجة ثلاثية الأبعاد. لذا، إذا أردنا\nالنظر من الأعلى، فقد نرى شيئًا كهذا.  كانت هذه هي الموجة التي\nنظرنا إليها سابقًا، لكن الآن يمكنك أن تتخيل الكثير\nمن هذه الموجات مجتمعة. سأعرض المزيد من هذه الموجات، ولكن يمكنك أن تتخيل، أن هناك الكثير من هذه\nالموجات مكدسة وهذا ما، كما تعلمون، هذه هي الطريقة التي يمكنك من خلالها\nتصور هذه الموجة بشكل ثلاثي الأبعاد، والآن تحصل على  لرؤية شيء\nلم تتمكن من رؤيته في وقت سابق. تستطيع أن ترى هذه الخطوط. تمثل هذه الخطوط مجموعة من جميع القمم، ومجموعة أخرى من جميع القمم. ترى هنا أيضًا مجموعة\nمن جميع الأحواض، أليس كذلك؟ نعطي اسما لهذه الخطوط. نحن نسميها، آسف،\nنسميها واجهات الموجة. تمام؟ ما هي واجهات الموجة؟ يمكنك القول أن واجهات الموجة يتم تعيينها من جميع النقاط الموجودة\nفي الطور مع بعضها البعض. تذكر مرحلة الكلمة؟ في الطور يعني بشكل أساسي أن\nنواقل المجال الكهربائي هنا جميعها تتأرجح\nبالتزامن مع بعضها البعض. سوف ينهون جميعًا نفس عدد التذبذبات في أي وقت محدد. فكر بها بهذه الطريقة. تمام؟ لذا، عند وضع كل هذه النقاط في الطور، نسميها واجهات موجية. وهنا نرى أن\nمقدمات الموجات هذه متوازية ومستقيمة وما إلى ذلك،\nلكن هذا ليس صحيحًا. يمكن أن يكون لواجهات الموجة أشكال مختلفة، لكن ما يهمنا هو أن الاتجاه الذي\nتنتقل فيه الموجة سيكون دائمًا متعامدًا\nمع واجهة الموجة. يمكنك أن ترى ذلك هنا، أليس كذلك؟ اسمح لي أن أقدم لك مثالا آخر. لنأخذ\nمثالا أكبر لموجات الماء. إذا كنت تنظر إلى\nموجات الماء من الأعلى، فيمكنك الآن رؤية واجهات موجية دائرية. مرة أخرى، مجموعة من جميع النقاط التي\nهي في المرحلة مع بعضها البعض. كلهم يتأرجحون هنا يمكنك أن ترى آخر،\nكلهم ​​يتجهون إلى هنا، أليس كذلك؟ إذن هذه هي واجهات الموجات الدائرية. لكن مرة أخرى، إذا نظرت إلى الاتجاه الذي تتحرك فيه الموجة\n، فانظر إلى ذلك. أنظر إلى ذلك. يمكنك أن ترى، محليًا، عند\nتلك النقطة المحددة، أنه عمودي على واجهة الموجة. وهو عمودي على واجهة الموجة. يمكن أن يكون له معنى، أليس كذلك؟ تنتقل الموجة إلى الخارج، لكن اتجاه الموجة يكون\nدائمًا متعامدًا مع مقدمة الموجة. هذا أمر مهم بالنسبة لنا. الآن، لفهم ما يحدث عندما يدخل إلى وسط مثل الزجاج، دعونا نركز فقط على\nإحدى هذه الموجات ونقدم القطعة الزجاجية. وما يساعدني على تصور ذلك هو، بدلًا من النظر إلى هذا كواجهة موجة كاملة ومتواصلة، دعني أقوم بتحويلها إلى بضع نقاط تمثل قمم الموجة. لذا يمكنك أن تتخيل أن هذه إحدى قمم الموجة. هذه قمة موجة أخرى للموجة. هذا الأمر برمته هو واجهة موجة. والآن دعونا نرى ماذا سيحدث عندما يدخل في الزجاج. تذكر أن الأمواج تتباطأ. لذلك دعونا نرى كيف يؤدي ذلك، كما\nتعلمون، إلى الانحناء. تمام؟ لذلك دعونا ننظر إلى هذا الإطار بإطار. لذا في الإطار التالي، جميعهم\nسيقطعون مسافة متساوية للأمام لأنهم جميعًا\nيتحركون بنفس السرعة. مرة أخرى، سوف يسافرون\nمسافة متساوية للأمام. لكن الآن يمكنك أن ترى أن هذا،\nالذي في الأسفل، هذه القمة تدخل القطعة الزجاجية أولاً. ولذلك، فإنه سوف يتباطأ أولا. لذا، في الإطار التالي،\nسيسافر هذا الشخص مسافة أقل، لكن الأشخاص الموجودين هنا\nسيسافرون نفس المسافة كما كان من قبل وانظروا ما\nسيحدث نتيجة لذلك، ستحصلون على شيء كهذا. هذا منطقي، أليس كذلك؟  لقد قطع هذا مسافة أقل، لكن الباقي قطع المسافة نفسها التي قطعها من قبل. والآن لاحظ أن هذا\nيدخل في القطعة الزجاجية. لذا، الآن ستتباطأ هذه السرعة، وبالتالي ستسافر أيضًا لمسافة أقل. الآن سيتحرك هذا وهذا\nبالسرعة نفسها، لكن الباقي\nسيستمر في السفر بنفس السرعة السابقة. الآن ترى ما يحدث، بوم.  هل يمكنك رؤية ما يحدث نتيجة لذلك؟ ماذا تلاحظ؟ يا إلهي، يمكنك\nالآن رؤية انحناء واجهة الموجة. ما سبب الانحناء؟ حدث الانحناء لأنه لم تتباطأ جميع قمم الموجات في نفس الوقت. تباطأت تلك الموجودة في الأسفل\nأولاً ثم ببطء وثبات،\nوبدأت البقية في التباطؤ. والآن، إذا كان بإمكانك رؤية\nمقدمات الموجات تمامًا كما فعلت من قبل، فهذا هو\nما ستبدو عليه. دعونا تحريك هذا مرة أخرى. وهنا ما سيبدو عليه. ذلك هو. تنحني مقدمات الموجة،\nوتتباطأ، وتنحني بسبب ذلك. جميلة، أليس كذلك؟ لكن تذكر الآن، إذا\nكنت تريد معرفة الاتجاه الذي\nيتحرك فيه شعاع الضوء، فسيكون هذا الاتجاه\nدائمًا عموديًا على اتجاه مقدمة الموجة. لذلك دعونا ننظر إليها مرة أخرى ونركز على مجرد شعاع من\nالضوء ودعونا نرى ما سنحصل عليه. لذلك سنركز فقط\nعلى شعاع الضوء، ويحدث انفجار، ها أنت ذا. يمكنك الآن أن ترى بوضوح أن\nالأمر برمته ينحني. جميلة، أليس كذلك؟ هذه هي الطريقة التي نمثل بها الانكسار، معتقدين أن الضوء\nموجة كهرومغناطيسية. حسنًا، دعونا نختبر\nفهمنا سريعًا. ماذا لو لم\nيتباطأ الضوء بنفس القدر كما هو الحال في الزجاج؟ على سبيل المثال، إذا كان هذا\nوسطًا مختلفًا حيث كان الضوء أسرع قليلًا، كيف\nسيبدو هذا الانحناء؟ حسنًا، الآن لن تنحني كثيرًا، لأن مقدمات الموجات لن تتباطأ بقدر ما كانت تفعل من قبل. ونتيجة لذلك، انظر، لن ينحنيوا كثيرًا كما فعلوا من قبل. لذا يمكنك أن ترى مدى\nانحناء شعاع الضوء بوضوح يعتمد على\nمقدار تباطؤ هذا الضوء، ومدى تغير سرعته. لكن الأمر الآخر الذي\nيهم هو الزاوية التي يسقط بها الضوء. على سبيل المثال، ماذا لو سلطنا الضوء بشكل عمودي على السطح؟ ماذا سيحدث بعد ذلك؟ حسنًا، الآن لن ينحني الضوء على الإطلاق. لماذا؟ لأنه على الرغم من أن الضوء\nيتباطأ، انظر، فإن جبهة الموجة بأكملها تدخل\nفي نفس الوقت تمامًا، وبالتالي،\nتتباطأ جبهة الموجة بأكملها معًا، ولا يوجد انحناء. لذا، عندما يسقط\nالضوء بشكل عمودي، لن يكون هناك انحناء على الإطلاق. لذلك يعتمد الأمر على الزاوية التي يسقط بها الضوء أيضًا. وهذا يعني أن مقدار\nالانحناء يعتمد على الزاوية التي يتم بها تسليط الضوء على السطح. ويعتمد ذلك أيضًا على مقدار تباطؤ الضوء أو سرعته. ويمكن تسريع كذلك. والآن يقودنا هذا\nإلى السؤال الثاني، وهو السؤال الأكثر جوهرية. لماذا يغير الضوء\nسرعته في المقام الأول؟ لماذا تتباطأ سرعة الضوء، على سبيل المثال، عندما ينتقل\nمن الهواء إلى الزجاج مثلاً؟ ماذا يحدث بالفعل للموجات الكهرومغناطيسية\nعندما تدخل الزجاج؟ إحدى الطرق الرائعة\nلمعرفة ذلك هي، بدلًا من النظر إلى\nقطعة الزجاج بأكملها مرة واحدة، فقط خذ جزءًا صغيرًا جدًا ورفيعًا جدًا من الزجاج وانظر ماذا سيحدث لها، حسنًا؟ لذا، إذا لم تكن القطعة الزجاجية موجودة، فستستمر الموجة في\nالمضي قدمًا. لكن نظرًا لوجود قطعة الزجاج والزجاج يحتوي على\nإلكترونات بداخله، يمكننا تمثيل هذه الإلكترونات لتكون مثل زنبرك صغير. والآن، عندما تمر الموجات الكهرومغناطيسية فوق تلك الإلكترونات،\nاسمحوا لي أن أوضح ذلك. إذن، هنا إلكترون، على سبيل المثال، وعندما\nتمر الموجة الكهرومغناطيسية فوق ذلك الإلكترون، انظر، فإنها\nتجعله يتحرك لأعلى ولأسفل. يجبره على الصعود والهبوط. إذن لدينا هذه الإلكترونات، جميعها تتحرك لأعلى\nولأسفل، وتتأرجح لأعلى ولأسفل. وما يحدث عندما\nتتأرجح الشحنات لأعلى ولأسفل، فإنها تخلق\nموجات كهرومغناطيسية خاصة بها. أوه، هذا يعني أن جميع الإلكترونات الموجودة في هذه القطعة الزجاجية ستولد موجة كهرومغناطيسية أخرى.  سوف يخرجون في كلا الاتجاهين. سأعرضها هنا فقط حتى نتمكن من رؤيتهم منفصلين. حتى هنا هو عليه. الآن الذي يتجه إلى\nاليسار هو الضوء المنعكس، ولكن بما أننا لسنا مهتمين بذلك، فلننظر فقط إلى الذي\nيتجه إلى اليمين. سوف يندمج\nمع الضوء الوارد، مع الضوء الأصلي\nالذي حصلنا عليه. والسؤال الكبير الآن هو: ماذا يحدث عندما يندمجان معًا؟ حسنًا، المصطلح التقني\nهنا هو التداخل. نقول أن هاتين الموجتين\nسوف تتداخلان مع بعضهما البعض. ولمعرفة ما يحدث للموجة الناتجة عندما\nتتداخل الموجات مع بعضها البعض، كل ما علينا فعله هو\nجمع ارتفاعاتها في كل موقع. على سبيل المثال، إذا كان لدينا موقف مثل ما لدينا\nهنا حيث تصطف القمم والقيعان والقمم والوديان على\nهذا النحو، ففي الموجة الناتجة،\nستكون القمم أكبر. ستكون الوديان أعمق، أليس كذلك؟ كلهم يضيفون. وسنحصل على شيء\nيبدو هكذا. سنحصل على موجة\nتشبه هذه إلى حد كبير، ولكن قمم أكبر ووديان أكبر. نحن نسمي هذا التدخل البناء لأنهم يبنون\nبعضهم البعض، أليس كذلك؟ ولكن ماذا لو\nلم تكن الموجة الثانوية بهذا الشكل؟ ماذا لو كانت الموجة الثانوية هكذا، حيث تتطابق قممها تماما مع أودية الموجة الثانوية؟ ماذا سيحدث بعد ذلك؟ الآن يميلون إلى إلغاء بعضهم البعض. القمم هنا تميل\nإلى الإلغاء مع الوديان، والوديان هنا\nتميل إلى الإلغاء مع القمم. لكن لأن هذه الموجة\nلا تزال أصغر بكثير مقارنة بهذه الموجة، لأن هذه الموجة\nتتولد بواسطة شريحة صغيرة من قطعة زجاجية\nهنا، لذا فهي ليست كثيرة. لذا فإن ارتفاع هذه الموجة يجب أن يكون صغيرًا جدًا مقارنة بارتفاع\nهذه الموجة. لكن ما سيحدث في النهاية، النتيجة النهائية هي أنك ستحصل\nعلى موجة تبدو مرة أخرى، مثل هذه إلى حد كبير، ولكن مع انخفاض القمم والوديان، نسمي هذا التدخل المدمر لأنهم يدمرون بعضهم البعض. في الواقع، لو كانت هذه الموجة\nبنفس ارتفاع هذه الموجة لدمرت بعضها البعض تمامًا، لأن القمم \nستدمرها الوديان تمامًا. ستدمر القمم الوديان تمامًا وما إلى ذلك، مما يعني أنه لكي نفهم\nما يحدث بالفعل هنا، نحتاج أن نعرف بالضبط\nما هو فرق الطور بين هاتين الموجتين؟ بمعنى آخر، علينا\nأن نفهم، كما تعلم، كيف تتم محاذاة قمم الأمواج وقيعان الأمواج؟ مثل، كيف يتم محاذاة هنا؟ والآن، علينا إجراء العمليات الحسابية، وهو ما لن نقوم به. لكن إذا قمنا بالحسابات، فقد اتضح أنه بالنسبة لتردد الضوء المرئي والمواد الشبيهة بالزجاج، فسنجد أن الموجات الثانوية، والقمم ليست مصطفة تمامًا، لكنها\nمنزاحة قليلاً للخلف مثل هذا. في الواقع، قمة هذا\nستصطف مع صفر الموجة الثانوية،\nشيء من هذا القبيل. هذه هي الطريقة التي سوف يصطفون بها. لسوء الحظ، لن نكون\nقادرين على أن نفهم بشكل بديهي سبب اصطفافها بهذه الطريقة، لأنه يتعين علينا إجراء العمليات الحسابية، والتي سنتخطاها هنا. ولكن الآن يأتي السؤال: كيف ستبدو الموجة الناتجة؟ حسنًا، الموجة الناتجة لن تكون تداخلًا بناءًا ولا تداخلًا هدامًا، بل ستكون شيئًا بينهما. ما سنراه في النهاية هو موجة، مرة أخرى، تبدو مثل هذه إلى حد كبير، ولكن بما أن قممها\nغير مصطفة، فإن الموجة الناتجة ستكون لها\nقمة تقع في مكان ما بين قمة هذه\nالقمة وقمة القمة.  ذروة هذا واحد. سيكون قريبًا جدًا من\nقمة هذا، لكنه سيبدو إلى حد ما مثل هذا. لذا، يمكنك أن ترى نوعًا ما، في الواقع، أعتقد أنه يجب أن يكون قريبًا جدًا من هذا القبيل. حسنا، نوع من هذا القبيل. لذا فإن قمم هذه الموجة ستكون قريبة جدًا جدًا من قمم هذه، ولكن بسبب هذه الموجة،\nسيتم سحبها قليلاً إلى الخلف. وبالتالي فإن التأثير الصافي، مثل تجميع كل ذلك\nمعًا، لتلخيص، التأثير الصافي لهذه الموجات الثانوية هو أن قمم هذه\nالموجات يتم سحبها قليلاً إلى الخلف. لذا، إذا قمت برسم تلك الموجة هنا، فستبدو مشابهة جدًا لهذه، لكنها ستتراجع قليلًا. انظر إليها بعناية، بوم. هذا هو تأثير\nقطعة زجاجية صغيرة هنا. ماذا لو وضعت قطعة زجاجية أخرى في\nمكان ما هنا؟ حسنًا، مرة أخرى،\nيتم سحب الموجة التي أمامها للخلف. نفس الفكرة يا بوم ماذا لو وضعت واحدة أخرى؟ تنسحب. لذا لاحظ أن الموجة\nلا تتباطأ حقًا.  في الواقع، الضوء\nيسير بنفس السرعة. لكن عند إدخال هذه القطع الزجاجية، بسبب التداخل، يتم\nسحب الموجة للخلف. لذا تخيل كرة أو شيئًا يتحرك للأمام بسرعة معينة، ولكن بعد ذلك يتم سحبه للخلف ثم يستمر مرة أخرى في\nالتحرك بنفس السرعة التي تم سحبه بها للخلف. وهذا ما يحدث إذا كانت هناك\nقطع صغيرة منفصلة من الزجاج. لكن تذكر، لدينا وسط مستمر، مما يعني أنه سيكون هناك\nتراجع مستمر. مرة أخرى، تخيل أن هذه الكرة\nتتحرك للأمام بسرعة معينة ولكن يتم سحبها باستمرار إلى الخلف، كيف ستبدو؟ ها هي، وسيتم\nمقارنتها بالكرة التي لم يتم سحبها للخلف. أنظر إلى هذا. هل تستطيع ان تراه؟  تتحرك كلتا الكرتين دائمًا\nبنفس السرعة، لكن هذه الكرات تبدأ في التأخر لأنها يتم\nسحبها للخلف بشكل مستمر. تبدو وكأنها أبطأ من الكرة الأخرى،\nلكنها ليست كذلك.  (يضحك) لكنه يمنحك هذا\nالوهم بأنك أبطأ. نفس الشيء سيحدث هنا بسبب هذا التراجع المستمر، وسيعطينا الوهم بأن الضوء قد تباطأ. ونتيجة لذلك، سوف ينتقل الضوء الآن\nبسرعة أبطأ، وسترى أيضًا أن\nالحجاب يتم ضغطه بسبب تأثير التراجع أيضًا. أخيرًا، عندما تقوم بتسليط\nالضوء الأبيض على قطعة من الزجاج، نظرًا لأن لها ألوانًا مختلفة، أي ترددات مختلفة، فسيكون لها\nتأثيرات انسحاب مختلفة. ولذلك، فإن الألوان المختلفة سوف تنتقل بسرعات مختلفة. لقد اتضح أن الطرف البنفسجي من الطيف سيكون له\nأقصى تأثير للتراجع، وبالتالي، سيسافر\nبأبطأ سرعة، لكن الطرف الأحمر من الطيف سيكون له تأثير التراجع الأقل، وسيسافر بسرعة أعلى.  السرعة، مما يعني أنه إذا قمت بتصوير\nالضوء الأبيض بزاوية، فلن ينحني،\nوستنحني الألوان المختلفة بشكل مختلف. اللون البنفسجي، نظرًا لأنه أبطأ كثيرًا، سوف ينحني أكثر مقارنة باللون الأحمر. لذا، فإن اللون الأحمر سوف ينحني بشكل أقل،\nوالبنفسجي سوف ينحني أكثر. ونتيجة لذلك، وبالطبع، ستكون جميع الألوان بينهما، ونتيجة لذلك، تنفصل الألوان. ولهذا السبب\nيفصل المنشور كل الألوان وهو أيضًا السبب\nوراء رؤيتنا لقوس قزح.",
    "t_italian": "- [Istruttore] Quasi ogni giorno vediamo\nincredibili illusioni ottiche intorno a noi, giusto? Ma cosa li causa? Uno dei motivi principali è che quando la luce passa\nda un mezzo a un altro, come, ad esempio, dal vuoto o dall'aria al vetro, cambia la sua velocità\na causa della quale si piega. Questa flessione è ciò che chiamiamo rifrazione. Quindi la rifrazione è il fenomeno per cui la luce si piega quando cambia mezzo, e ciò avviene perché\ncambia velocità quando passa da un mezzo all'altro. Ora, una parte della fisica\ndovrebbe capire esattamente quanto si piega, e poi usarlo per capire la geometria di, ad esempio, sai come otteniamo le\nimmagini, perché le immagini sono grandi, sono piccole e invertite,\ne tutte quelle cose interessanti.  La chiamiamo ottica geometrica. Non lo faremo in questo video, perché in questo video cercheremo di capire perché ciò accade. Un paio di domande che\npotremmo avere in mente sono la domanda numero uno: ehi, perché se\nla luce cambia velocità, dovrebbe piegarsi? Voglio dire, ad esempio, quando la luce\nentra nel vetro, rallenta. Ma perché dovrebbe piegarsi? Perché non può semplicemente continuare\nnella stessa direzione, solo un po' più lentamente? Perché dovrebbe piegarsi? E poi potremmo avere una\ndomanda ancora più fondamentale: perché la luce cambia velocità\n?  (ride) Perché la luce rallenta, ad esempio, quando entra nel vetro? Cosa sta succedendo? Proviamo quindi a rispondere a\nqueste domande una per una. Allora cominciamo con il primo. Perché il cambiamento della velocità della luce\nimplica una flessione? Per rispondere a questa domanda,\nricordiamo il nostro modello di luce. Cioè, è un'onda elettromagnetica con campi elettrici oscillanti. Puoi pensarli come\nvettori di campi elettrici e anche di campi magnetici,\nche non ho mostrato qui.  Va bene? Ma lasciatemi anche sbarazzare di\nquesti vettori del campo elettrico e lasciatemi guardare l'onda. Questa è un'onda elettromagnetica. Ora la cosa fondamentale qui è che questa luce è\nun'onda in tre dimensioni. Quindi, se\nguardassimo dall'alto, potremmo vedere qualcosa di simile. Questa era l'onda che\nabbiamo visto prima, ma ora puoi immaginare molte\ndi queste onde tutte impilate. Mostrerò altre onde di queste onde, ma puoi immaginare, ad esempio, che ci siano molte di queste\nonde tutte impilate ed è quello che, sai, è così che puoi\nvisualizzare quest'onda in 3D, e ora ottieni  per vedere qualcosa\nche non potevi vedere prima. Puoi vedere queste righe. Queste linee rappresentano un insieme di tutti gli stemmi, un altro insieme di tutti gli stemmi. Qui vedi anche una serie\ndi tutti i trogoli, giusto? Diamo un nome a queste linee.  Li chiamiamo, scusate, li\nchiamiamo fronti d'onda.  Va bene? Cosa sono i fronti d'onda?  Si può dire che i fronti d'onda sono l'insieme di tutti i punti che sono\nin fase tra loro. Ricordi la parola fase? In fase significa fondamentalmente che\ni vettori del campo elettrico qui oscillano tutti\nin sincronia tra loro. Finiranno tutti lo stesso numero di oscillazioni in un dato momento. Pensatela in questo modo.  Va bene? Quindi, l'insieme di tutti questi punti in fase, li chiamiamo fronti d'onda. E qui vediamo che questi\nfronti d'onda sono paralleli e diritti e cose del genere,\nma non è vero.  I fronti d'onda possono avere forme diverse, ma ciò che è importante per noi è che la direzione in\ncui viaggia l'onda sarà sempre perpendicolare\nal fronte d'onda. Puoi vederlo qui, vero? Lascia che ti faccia un altro esempio. Prendiamo un esempio più grande\ndelle onde dell'acqua. Se osservi le\nonde dell'acqua dall'alto, ora puoi vedere i fronti d'onda circolari. Ancora una volta, insieme di tutti i punti che\nsono in fase tra loro. Stanno tutti raggiungendo la cresta qui. Puoi vederne un altro, stanno\ntutti raggiungendo la cresta qui, giusto? Quindi questi sono fronti d'onda circolari. Ma ancora una volta, se guardi la direzione in cui viaggia l'onda\n, guarda quella. Guarda quello. Puoi vedere, localmente, in\nquel particolare punto, che è perpendicolare al fronte d'onda. È perpendicolare al fronte d'onda. Può avere senso, vero? L'onda viaggia verso l'esterno, ma la direzione dell'onda\nè sempre perpendicolare al fronte d'onda. Questo è importante per noi. Ora, per capire cosa succede quando entra in un mezzo come il vetro, concentriamoci su\nuno di questi fronti d'onda e presentiamo il nostro pezzo di vetro. E ciò che mi aiuta a visualizzarlo è che, invece di vederlo come un fronte d'onda continuo e completo, vorrei convertirlo in pochi punti che rappresentano le creste delle onde. Quindi potete immaginare che questa sia una delle creste dell'onda. Questa è un'altra cresta dell'onda. Tutta questa faccenda è un fronte d'onda. E ora vediamo cosa succede quando entra nel bicchiere. Ricorda, le onde rallentano. Quindi vediamo come questo si\ntraduce in una flessione.  Va bene? Quindi diamo un'occhiata a questo fotogramma per fotogramma. Quindi nel fotogramma successivo, tutti avrebbero\npercorso la stessa distanza in avanti perché viaggiano tutti\nalla stessa velocità. Ancora una volta, percorreranno la\nstessa distanza in avanti. Ma ora potete vedere che questo\n, quello in basso, questo stemma entra per primo nel pezzo di vetro. Pertanto, prima rallenterà. Quindi, nel prossimo fotogramma,\nquesto percorrerà una distanza minore, ma quelli qui\npercorreranno la stessa distanza di prima e vedendo cosa\nsuccede di conseguenza, otterrete qualcosa del genere. Ha senso, vero? Questo ha percorso una distanza minore, ma gli altri hanno percorso la stessa distanza di prima. E ora notate che questo\nentra nel pezzo di vetro. Quindi ora questo rallenterà e quindi percorrerà anche una distanza minore. Ora questo e questo\nviaggeranno alla stessa velocità, ma gli altri\ncontinueranno a viaggiare alla stessa velocità di prima. Ora vedi cosa succede, boom. Riesci a vedere cosa sta succedendo di conseguenza? Cosa noti? Oh mio Dio, ora puoi effettivamente\nvedere la flessione del fronte d'onda. Cosa ha causato la flessione? La flessione è avvenuta perché non tutte le creste delle onde hanno rallentato contemporaneamente. Quelli in fondo hanno\nprima rallentato e poi lentamente e costantemente, gli altri\niniziano a rallentare. E ora se poteste vedere i\nfronti d'onda proprio come prima, ecco\ncome apparirebbe. Animiamolo ancora una volta. Ecco come sarebbe. Eccolo. I fronti d'onda si stanno piegando,\nsono rallentati e si stanno piegando a causa di ciò. Bello, vero? Ma ora ricorda, se\nvuoi capire la direzione in cui\nviaggia il raggio di luce, quella direzione\nsarà sempre perpendicolare alla direzione del fronte d'onda. Quindi guardiamolo ancora una volta e concentriamoci solo su un raggio di\nluce e vediamo cosa otteniamo. Quindi ci concentreremo solo\nsu un raggio di luce e boom, ecco qua. Ora puoi vedere chiaramente\nil tutto piegarsi. Bello, vero? Questo è il modo in cui modelliamo la rifrazione, pensando alla luce come a\nun'onda elettromagnetica. Ok, mettiamo alla prova rapidamente la nostra\ncomprensione. E se la luce non\nrallentasse tanto quanto nel vetro? Ad esempio, se si trattasse di un\nmezzo diverso in cui la luce fosse leggermente più veloce, come\nsarebbe questa flessione? Bene, ora non si piegherebbe più di tanto, perché i fronti d'onda non rallenteranno più di prima. E di conseguenza, guarda, non si piegheranno più come prima. Quindi puoi vedere quanto\nil raggio di luce si piega dipende chiaramente da\nquanto questa luce rallenta, da quanto la luce cambia la sua velocità. Ma un’altra cosa che\nconta è l’angolo con cui incide la luce. Ad esempio, cosa succederebbe se la luce incidente fosse perpendicolare alla superficie? Cosa accadrebbe allora? Bene, ora la luce non si piegherebbe affatto. Perché? Perché anche se la luce\nrallenta, guarda, l'intero fronte d'onda entra\nesattamente nello stesso momento, e quindi l'intero\nfronte d'onda rallenta insieme, non c'è flessione. Quindi, quando incidete la\nluce perpendicolarmente, non ci sarà alcuna flessione. Quindi dipende anche dall'angolo con cui incide la luce. Ciò significa che la quantità di\npiegatura dipende dall'angolo con cui si illumina la superficie. E dipende anche da quanto la luce rallenta o accelera. Può anche accelerare. E ora questo ci porta\nalla seconda domanda, più fondamentale.  Innanzitutto perché la luce cambia\nvelocità? Perché la luce, ad esempio, rallenta quando passa\n, ad esempio, dall'aria al vetro? Cosa succede realmente alle onde elettromagnetiche\nquando entrano in un bicchiere? Uno dei modi migliori per\ncapirlo è, invece di guardare l'\nintero pezzo di vetro in una volta, prendere semplicemente una piccola, molto piccola, molto sottile porzione di vetro e vedere cosa succede, ok? Quindi se il pezzo di vetro non fosse lì, l’onda\ncontinuerebbe ad andare avanti. Ma poiché il pezzo di vetro è lì e il vetro contiene\nelettroni al suo interno, possiamo modellare questi elettroni in modo che siano una specie di minuscola molla. E quindi, ora che le onde elettromagnetiche passano sopra quegli elettroni,\nlasciatemelo mostrare. Quindi ecco un elettrone, per esempio, e quando l'\nonda elettromagnetica passa sopra quell'elettrone, guardate,\nlo fa andare su e giù. Lo costringe ad andare su e giù. E quindi abbiamo questi elettroni, vanno tutti su e\ngiù, oscillano su e giù. E cosa succede quando le cariche\noscillano su e giù, creano le proprie\nonde elettromagnetiche. Ooh, questo significa che tutti gli elettroni di questo pezzo di vetro genereranno un'altra onda elettromagnetica. Usciranno in entrambe le direzioni. Lo mostrerò qui così possiamo vederli separatamente. Quindi eccolo qui. Ora quella che va a\nsinistra è la luce riflessa, ma poiché non ci interessa, guardiamo solo quella\nche va a destra.  Si fonderà\ncon la luce in arrivo, con la luce originale\nche abbiamo incidente. E ora la grande domanda è: cosa succede quando si fondono insieme? Bene, il termine tecnico\nqui è interferenza. Diciamo che queste due onde\ninterferiranno tra loro. E per capire cosa succede all'onda risultante quando le\nonde interferiscono tra loro, tutto ciò che dobbiamo fare è\nsemplicemente sommare le loro altezze in ogni punto. Ad esempio, se abbiamo una situazione come quella che abbiamo\nqui, dove le creste e gli avvallamenti, i picchi e le valli\nsono tutti allineati in questo modo, allora nell'onda risultante\ni picchi sarebbero ancora più grandi. Le valli sarebbero ancora più profonde, giusto? Tutti si sommano. E otterremmo qualcosa\nche assomiglia a questo. Avremo un'onda\nmolto simile a questa, ma con picchi e valli più grandi. Chiamiamo questa interferenza costruttiva perché si stanno costruendo a\nvicenda, giusto? Ma cosa succederebbe se l’\nonda secondaria non fosse così? E se l'onda secondaria fosse così, dove i picchi corrispondessero esattamente alle valli dell'onda secondaria? Cosa accadrebbe allora? Adesso tendono ad annullarsi a vicenda. I picchi qui tendono\na cancellarsi con le valli, e le valli qui\ntendono a cancellarsi con i picchi. Ma perché quest'onda\nè ancora molto più piccola rispetto a questa, perché quest'onda è\ngenerata da una piccola scheggia di un pezzo di vetro\nqui, quindi non è molto. Quindi l'altezza di quest'onda dovrebbe essere molto, molto piccola rispetto\nall'altezza di questa. Ma ciò che alla fine accadrà, il risultato netto è che\notterrete un'onda che assomiglia di nuovo, molto simile a questa, ma con picchi e valli diminuiti, la chiamiamo interferenza distruttiva perché si distruggono a vicenda. Infatti, se quest'onda avesse\nla stessa altezza di quest'onda, si distruggerebbero completamente a vicenda perché le cime verrebbero completamente\ndistrutte dalle valli. Le valli verrebbero completamente distrutte dai picchi e così via, il che significa che per capire\ncosa succede realmente da queste parti, dobbiamo sapere esattamente\nqual è la differenza di fase tra queste due onde? In altre parole, dobbiamo\ncapire, sai, come sono allineate le creste e le depressioni delle onde? Tipo, come sono allineati qui? Ora, per questo, dobbiamo fare i conti, cosa che non faremo. Ma se facciamo i conti, si scopre che, per la frequenza della luce visibile e per il materiale simile al vetro, scopriremmo che le onde secondarie, i picchi, non sono completamente allineati, ma sono leggermente\nspostati indietro in questo modo. In effetti, il picco di questo si\nallineerà con lo zero dell'onda secondaria,\nqualcosa del genere. Ecco come si schiereranno. Sfortunatamente, non saremo in\ngrado di capire intuitivamente il motivo per cui tutto si allinea in questo modo, perché dobbiamo fare i conti, che qui salteremo. Ma ora arriva la domanda: come sarebbe l’onda risultante? Ebbene, l'onda risultante non sarà né un'interferenza costruttiva né un'interferenza distruttiva, sarà una via di mezzo. Ciò che alla fine vedremo è un'onda, ancora una volta, che assomiglia più o meno a questa, ma poiché i picchi di\nquesti non sono allineati, quello risultante avrà\nun picco che si trova da qualche parte tra il picco di questo\ne quello  picco di questo. Sarà molto vicino\nal picco di questo, ma sarà un po' così. Quindi puoi vedere, infatti, penso che dovrebbe essere molto vicino come questo. Ok, più o meno così. Quindi i picchi di questo saranno molto, molto vicini ai picchi di questo, ma a causa di quest'onda,\nsarà leggermente arretrato. Quindi l'effetto netto, come mettere tutto\ninsieme, per riassumere, l'effetto netto di queste onde secondarie è che i picchi di queste\nonde vengono leggermente arretrati. Quindi, se disegnassi quell'onda qui, sembrerebbe molto simile a questa, ma sarà leggermente arretrata. Guardalo attentamente, boom. Questo è l'effetto di un\nminuscolo pezzo di vetro qui. E se mettessi un altro\npezzo di vetro da qualche parte qui? Ebbene, ancora una volta, l'onda di\nfronte viene tirata indietro. Stessa idea, boom.  E se ne mettessi un altro? Tira indietro. Quindi nota che l'onda\nnon sta realmente rallentando.  In realtà la luce\nviaggia alla stessa velocità. Ma quando si introducono questi pezzi di vetro, a causa dell'interferenza,\nl'onda viene tirata indietro. Quindi immagina una palla o qualcosa che si muove in avanti ad una certa velocità, ma poi viene tirata indietro e poi continua di nuovo\na viaggiare alla stessa velocità con cui è stata tirata indietro. Ora questo è ciò che accade se ci sono\npiccoli pezzi di vetro discreti. Ma ricorda, abbiamo un mezzo continuo, il che significa che si\nverificheranno continui pullback. Ancora una volta, immagina che questa palla\nvada avanti ad una certa velocità ma venga continuamente tirata indietro, come sarebbe? Eccolo e verrà\nconfrontato con la palla che non viene tirata indietro. Guarda questo. Potete vederlo? Entrambe le palline viaggiano sempre\nalla stessa velocità, ma questa inizia a rallentare perché viene\ncontinuamente tirata indietro. Sembra quasi che sia più lenta dell'altra palla,\nma non lo è.  (ride) Ma ti dà l'\nillusione di essere più lento. La stessa cosa accadrà qui a causa di questi continui ritiri, e ci darà l'illusione che la luce abbia rallentato. Di conseguenza, ora la luce\nviaggerà a una velocità inferiore e vedrai anche il\nvelo compresso a causa dell'effetto pullback. Infine, quando si illumina\nun pezzo di vetro con luce bianca, poiché ha colori diversi, ovvero frequenze diverse, si avrebbero\neffetti di pullback diversi. Pertanto, colori diversi viaggeranno con velocità diverse. Si scopre che l' estremità viola dello spettro avrà\nil massimo effetto di pullback e quindi viaggerà\ncon la velocità più lenta, ma l'estremità rossa dello spettro avrà l'effetto di pullback minimo e viaggerà con una velocità maggiore.  velocità, il che significa che se spari la\nluce bianca ad angolo, non si piegheranno, i diversi\ncolori si piegheranno in modo diverso. Il viola, essendo molto rallentato, si piegherà di più rispetto al rosso. Quindi, il rosso si piegherà di meno, il\nviola si piegherà di più. E di conseguenza, ovviamente, tutti i colori saranno nel mezzo e, di conseguenza, i colori si separeranno. Ecco perché il prisma\nsepara tutti i colori ed è anche il motivo\nper cui vediamo gli arcobaleni."
}