{
    "source": "m09KpwyGAN4",
    "youtubelink": "https://www.youtube.com/watch?v=m09KpwyGAN4",
    "t_english": "(upbeat music) (mouse click) - Hi, I'm Khanmigo. Let's meet some great teachers just like you. - I teach chemistry. - IELD students, the English language learners. - Sixth grade math. - Computer science. - I teach high school math. - I'm a student teacher. - Please, tell us more! - I have to lead three different types of classes and I have to come up with how I'm gonna teach the curriculum and that's a really daunting process. But having Khanmigo, it's a really helpful assistant to kind of put all those pieces together. We're doing gas dynamics and we're teaching it through the lens of climate change. How can I make that real for my students? And so I might ask Khanmigo, \"Give me a hook for starting our unit on the chemistry of climate change,\" and it'll give me four or five options. - I like that I can ask Khanmigo a question or say, \"Hey, I need an easy, a medium, and a hard.\" And so it can help me develop my lesson plan into three different categories, where instead of going to multiple websites or looking for different resources, I can do it all in one location. - It really helps with differentiating the instruction for all the kids. - Yeah, it saves me a lot of time. Not having to do the groupings, it does it for me. Khanmigo kind of takes care of the initial blank white page, gives me that starting point. - From start to finish, just faster. - Could save 20, 30 minutes a day, times five. So I was kind of blown away by that. - If I wasn't going to use Khanmigo, then I'd have to search for all these different activities, or these exit tickets, or questions to ask, and that would take hours of my time each week. - My pleasure, but it's not about me. - It wasn't that Khanmigo was replacing human interaction, it was augmenting it. It's not really about the AI, it's that the AI is going to enable more human-to-human interactions. - You're able to go to those students that need the most amount of help and let the ones that are able to move on their own just excel. - That's right, it's about you and your students. So come on, let's get started. (upbeat music) (children talking) (school bell ringing) \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "(پرجوش موسیقی) (ماؤس کلک) - ہیلو، میں خانمیگو ہوں۔ آئیے\nآپ جیسے عظیم اساتذہ سے ملیں۔ - میں کیمسٹری پڑھاتا ہوں۔ - IELD طلباء،\nانگریزی زبان سیکھنے والے۔ - چھٹی جماعت کی ریاضی - کمپیوٹر سائنس۔ - میں ہائی اسکول میں ریاضی پڑھاتا ہوں۔ - میں ایک طالب علم استاد ہوں. - براہ کرم، ہمیں مزید بتائیں! - مجھے تین\nمختلف قسم کی کلاسوں کی قیادت کرنی ہے اور مجھے یہ سوچنا ہے کہ میں نصاب کو کیسے پڑھاؤں گا اور یہ واقعی ایک مشکل عمل ہے۔ لیکن خانمیگو ہونے کے بعد، ان تمام ٹکڑوں کو ایک ساتھ رکھنے میں یہ\nواقعی ایک مددگار مددگار ہے۔ ہم گیس کی حرکیات کر رہے ہیں اور ہم اسے\nموسمیاتی تبدیلی کی عینک کے ذریعے سکھا رہے ہیں۔ میں اسے اپنے طلباء کے لیے کیسے حقیقی بنا سکتا ہوں؟ اور اس لیے میں خانمیگو سے پوچھ سکتا ہوں\n، \"مجھے موسمیاتی تبدیلی کی کیمسٹری پر اپنا یونٹ شروع کرنے کے لیے ایک ہک دیں،\n\" اور یہ مجھے چار یا پانچ آپشنز دے گا۔ - مجھے یہ پسند ہے کہ میں\nخانمیگو سے کوئی سوال پوچھ سکتا ہوں یا کہہ سکتا ہوں، \"ارے، مجھے ایک\nآسان، ایک میڈیم اور ایک مشکل چاہیے۔\" اور اس طرح یہ مجھے\nاپنے سبق کے منصوبے کو تین مختلف زمروں میں تیار کرنے میں مدد کر سکتا ہے،\nجہاں ایک سے زیادہ ویب سائٹس پر جانے یا\nمختلف وسائل تلاش کرنے کے بجائے، میں یہ سب ایک جگہ پر کر سکتا ہوں۔ - یہ واقعی تمام بچوں کے لیے\nہدایات میں فرق کرنے میں مدد کرتا ہے۔ - ہاں، یہ میرا بہت وقت بچاتا ہے۔  گروپ بندی کرنے کی ضرورت نہیں،\nیہ میرے لیے کرتا ہے۔ خانمیگو قسم کے ابتدائی خالی سفید صفحے کا خیال رکھتا ہے، مجھے وہ نقطہ آغاز فراہم کرتا ہے۔ - شروع سے ختم تک، بس تیز۔ - دن میں 20، 30\nمنٹ، پانچ بار بچا سکتے ہیں۔ تو میں اس سے ایک طرح سے اڑا ہوا تھا۔ - اگر میں Khanmigo استعمال نہیں کرنے جا رہا تھا\n، تو مجھے ان تمام مختلف\nسرگرمیوں، یا ان ایگزٹ ٹکٹس، یا پوچھنے کے لیے سوالات تلاش کرنے ہوں گے، اور\nاس میں ہر ہفتے میرا وقت کے کئی گھنٹے لگیں گے۔ - میری خوشی، لیکن یہ میرے بارے میں نہیں ہے. - ایسا نہیں تھا کہ خانمیگو\nانسانی تعامل کی جگہ لے رہا تھا، یہ اسے بڑھا رہا تھا۔ یہ واقعی AI کے بارے میں نہیں ہے،\nیہ ہے کہ AI زیادہ سے زیادہ\nانسان سے انسانی تعاملات کو قابل بنائے گا۔ - آپ ان طلباء کے پاس جانے کے قابل ہیں جن کو سب سے زیادہ مدد کی ضرورت ہے اور جو خود آگے بڑھنے کے قابل ہیں انہیں صرف ایکسل کرنے دیں۔ - یہ ٹھیک ہے، یہ\nآپ اور آپ کے طلباء کے بارے میں ہے۔ تو آئیے، شروع کرتے ہیں۔ (پرجوش موسیقی) (بچے باتیں کرتے ہیں) (اسکول کی گھنٹی بجتی ہے)",
    "t_spanish": "(música alegre) (clic del mouse) - Hola, soy Khanmigo. Conozcamos a algunos grandes\nmaestros como tú. - Doy clases de química. - Estudiantes de IELD,\nestudiantes del idioma inglés. - Matemáticas de sexto grado. - Ciencias de la Computación. - Doy clases de matemáticas en secundaria. - Soy un estudiante de profesorado. - ¡Por favor, cuéntanos más! - Tengo que dirigir tres\ntipos diferentes de clases y tengo que idear cómo voy a enseñar el plan de estudios y ese es un proceso realmente desalentador. Pero tener a Khanmigo es\nun asistente realmente útil para unir todas esas piezas. Estamos haciendo dinámica de gases y la enseñamos a través de\nla lente del cambio climático.  ¿ Cómo puedo hacer que eso sea real para mis alumnos? Entonces podría pedirle a\nKhanmigo: \"Dame un gancho para iniciar nuestra unidad sobre la\nquímica del cambio climático\", y me dará cuatro o cinco opciones. - Me gusta poder\nhacerle una pregunta a Khanmigo o decirle: \"Oye, necesito una\nfácil, una media y una difícil\". Y por eso puede ayudarme a\ndesarrollar mi plan de lección en tres categorías diferentes,\ndonde en lugar de ir a varios sitios web o buscar\ndiferentes recursos, puedo hacerlo todo en un solo lugar. - Realmente ayuda a\ndiferenciar la instrucción para todos los niños. - Sí, me ahorra mucho tiempo.  Al no tener que hacer las\nagrupaciones, a mi me lo hace. Khanmigo se encarga de la página en blanco inicial, me da ese punto de partida. - De principio a fin, simplemente más rápido. - Podría ahorrar 20, 30\nminutos al día, cinco veces. Así que me quedé un poco impresionado por eso. - Si no fuera a usar\nKhanmigo, entonces tendría que buscar todas estas\nactividades diferentes, o estos boletos de salida, o preguntas que hacer, y\neso me tomaría horas de mi tiempo cada semana. - Es un placer, pero no se trata de mí. - No era que Khanmigo estuviera\nreemplazando la interacción humana, sino que la estaba aumentando.  En realidad no se trata de\nla IA, sino de que la IA permitirá más\ninteracciones entre humanos. - Puedes acudir a los estudiantes que necesitan la mayor cantidad de ayuda y dejar que los que pueden avanzar por sí solos sobresalgan. - Así es, se trata de\nti y tus alumnos. Así que vamos, comencemos. (música alegre) (niños hablando) (suena la campana de la escuela)",
    "t_arabic": "(موسيقى مبهجة) (نقرة بالماوس) - مرحبًا، أنا خانميجو. دعونا نلتقي ببعض\nالمعلمين العظماء مثلك تمامًا. - أقوم بتدريس الكيمياء. - طلاب IELD\nومتعلمي اللغة الإنجليزية. - رياضيات الصف السادس. - علوم الكمبيوتر. - أقوم بتدريس الرياضيات في المدرسة الثانوية. - أنا طالب مدرس. - من فضلك أخبرنا المزيد! - يجب أن أقود ثلاثة\nأنواع مختلفة من الفصول الدراسية ويجب أن أتوصل إلى كيفية تدريس المنهج، وهذه عملية شاقة حقًا. لكن وجود Khanmigo، يعد\nمساعدًا مفيدًا حقًا في تجميع كل هذه القطع معًا. نحن نقوم بدراسة ديناميكيات الغاز ونقوم بتدريسها من خلال\nعدسة تغير المناخ. كيف يمكنني أن أجعل ذلك حقيقيًا لطلابي؟ ولذلك قد أسأل\nخانميجو، \"أعطني دليلاً لبدء وحدتنا حول\nكيمياء تغير المناخ،\" وسيعطيني أربعة أو خمسة خيارات. - أحب أن أطرح\nسؤالاً على خانميغو أو أقول: \"مرحبًا، أحتاج إلى وسيلة\nسهلة ومتوسطة وصعبة.\" ومن ثم يمكن أن يساعدني ذلك في\nتطوير خطة الدرس الخاصة بي إلى ثلاث فئات مختلفة،\nحيث بدلاً من الانتقال إلى مواقع ويب متعددة أو البحث\nعن موارد مختلفة، يمكنني القيام بذلك كله في مكان واحد. - إنه يساعد حقًا في\nالتمييز بين التعليمات لجميع الأطفال. - نعم، إنه يوفر لي الكثير من الوقت. لا داعي للقيام\nبالمجموعات، فهو يفعل ذلك من أجلي. يعتني خانميغو بالصفحة البيضاء الأولية الفارغة، ويعطيني نقطة البداية تلك. - من البداية إلى النهاية، فقط أسرع. - يمكن أن يوفر 20، 30\nدقيقة في اليوم، ضرب خمسة. لذلك لقد أذهلني ذلك نوعًا ما. - إذا لم أكن سأستخدم\nخانميغو، فسيتعين علي البحث عن كل هذه\nالأنشطة المختلفة، أو تذاكر الخروج هذه، أو الأسئلة التي يجب طرحها،\nوسيستغرق ذلك ساعات من وقتي كل أسبوع. - من دواعي سروري، ولكن الأمر لا يتعلق بي. - لم يكن خانميغو\nيحل محل التفاعل البشري، بل كان يزيده. لا يتعلق الأمر حقًا\nبالذكاء الاصطناعي، ولكنه سيتيح المزيد من\nالتفاعلات بين البشر. - يمكنك الذهاب إلى هؤلاء الطلاب الذين يحتاجون إلى أكبر قدر من المساعدة والسماح للطلاب القادرين على التحرك بمفردهم بالتفوق. - هذا صحيح، الأمر يتعلق\nبك وبطلابك. لذا هيا، دعونا نبدأ. (موسيقى مبهجة) (أطفال يتحدثون) (قرع جرس المدرسة)",
    "t_italian": "(musica allegra) (clic del mouse) - Ciao, sono Khanmigo. Incontriamo alcuni grandi\ninsegnanti proprio come te. - Insegno chimica. - Studenti IELD, gli\nstudenti di lingua inglese. - Matematica di prima media. - Informatica. - Insegno matematica al liceo. - Sono un insegnante studentesco. - Per favore, dicci di più! - Devo condurre tre\ndiversi tipi di lezioni e devo decidere come insegnare il curriculum e questo è un processo davvero scoraggiante. Ma avere Khanmigo è\nun assistente davvero utile per mettere insieme tutti questi pezzi. Stiamo studiando la dinamica dei gas e la stiamo insegnando attraverso\nla lente del cambiamento climatico. Come posso renderlo reale per i miei studenti? Quindi potrei chiedere a\nKhanmigo: \"Dammi uno spunto per avviare la nostra unità sulla\nchimica del cambiamento climatico\", e mi darà quattro o cinque opzioni. - Mi piace poter\nfare una domanda a Khanmigo o dire: \"Ehi, ho bisogno di un\nfacile, di un medio e di un difficile\". Quindi può aiutarmi a\nsviluppare il mio programma di lezioni in tre diverse categorie,\ndove invece di visitare più siti Web o cercare\nrisorse diverse, posso fare tutto in un'unica posizione. - Aiuta davvero a\ndifferenziare l'istruzione per tutti i bambini. - Sì, mi fa risparmiare un sacco di tempo. Non dovendo fare i\nraggruppamenti, lo fa per me. Khanmigo si prende cura della pagina bianca iniziale, mi dà quel punto di partenza. - Dall'inizio alla fine, solo più veloce. - Potrebbe risparmiare 20, 30\nminuti al giorno, cinque volte. Quindi ne sono rimasto piuttosto sbalordito. - Se non avessi usato\nKhanmigo, avrei dovuto cercare tutte queste diverse\nattività, o questi biglietti d'uscita, o domande da porre, e\nquesto avrebbe richiesto ore del mio tempo ogni settimana. - Piacere mio, ma non riguarda me. - Non è che Khanmigo stesse\nsostituendo l'interazione umana, la stava piuttosto aumentando. Non è proprio una questione di\nintelligenza artificiale, è che l'intelligenza artificiale consentirà più\ninterazioni da uomo a uomo. - Puoi andare da quegli studenti che hanno bisogno di più aiuto e lasciare che quelli che sono in grado di muoversi da soli eccellano. - Esatto, riguarda\nte e i tuoi studenti. Quindi forza, cominciamo. (musica allegra) (bambini che parlano) (suono della campanella della scuola)"
}