{
    "source": "mfrDtmzmRk4",
    "youtubelink": "https://www.youtube.com/watch?v=mfrDtmzmRk4",
    "t_english": "- [Instructor] Let's work together on a program that uses variables and user input. Here's the problem I'm trying to solve. My friend Deshaun has a catering business and for each catering job that he takes, he needs to write up a contract between him and the client. Every contract uses the same basic template, but there are blanks that need to be filled in with the event details like the client name, the venue name, the date. These contracts end up being a lot of pages of legal speak, and a lot of these event detail values need to be copied onto multiple pages. Can we build Deshaun a program to help him generate contracts faster? Here, we have a bit of code to get us started. Deshaun copied over the first paragraph of his contract template for us to work with. The first thing I do when I get starter code like this is run it and see if it works and what it does. It looks like it formats the contract a bit with this nice heading, and then it just kind of prints out the template as is. There's still like these blanks here that need to be filled in. Of course, Deshaun's full contract is a lot longer than this, but I kind of like the idea of starting with just this first paragraph to get a feel for how I'm gonna solve this problem with a smaller sub-problem before I copy in a ton of text here. One thing I do notice with this code is that we have a linter error over here. It's one of these yellow triangles, so that means it's a warning, not an error, but I still wanna take a look at it and see if it's something I can fix. It looks like it's complaining about this line being too long, which you know, I kind of agree with. I have to horizontal scroll all the way over here just to get to the end of the string. It makes it hard to work with. To split a long string like this over multiple lines, I can divide the string into several smaller strings and then concatenate them together. Then, if I surround that whole expression in parentheses, I can put these strings on separate lines because of the parentheses, the computer treats this whole thing as a single instruction. Before we move on, I'm just gonna quickly rerun the program and make sure I didn't break anything while I was here. Okay, now let's think through how to design this program. I wanna generalize this code so I can substitute in the name of any client. The user experience that I'm going for is that Deshaun can come in and enter all the event details, essentially in text boxes, and then the program will give him the completed contract. For this first paragraph, it looks like the values I'm trying to fill in are the name of the client and the name of the catering company, so I probably want a variable for each of those. I'm going to want Deshaun to be able to enter some of those values, so I'll probably need an input function call here, but I don't wanna have to enter values in the console every time I run the program while I'm still working on it. So I'm just gonna stick some placeholder values in here for now. All I did was add a couple of assignment statements that I think are right, so I don't think there should be any bugs, but just to be sure, I'm gonna run the program. All right, now I wanna substitute those values in where the blanks are. That means I need to access these variables in this expression so I can substitute the value stored there into the contract string. So, where I have these underlines in the string, I'm gonna delete that blank and then separate the string into two parts at that juncture. There's a lot of strings, so let me check I didn't miss any quotation marks. Great, okay, now let's substitute my values in here. I wanna concatenate in the caterer name, which is stored in the variable caterer, and over here, I wanna concatenate in the client name, which is stored in the variable client. Now, when I run the program, I'm seeing those placeholder values I stored in those variables in place of the blanks in the contract. This messed up my line lengths over here a bit, so I'm gonna clean that up real quick so it's easier to read. There's one more blank here in the header, and it sounds like Deshaun wants the catering company name to go here. So I'm gonna do the same thing and divide that string at the blank and substitute in the caterer variable. Last step, let's go back to these placeholder values. Deshaun's company is called King Catering, so I'm gonna put that in here. The client name though is different on every contract, so I want Deshaun to be able to enter that value. That means I'm gonna want the input function here and I'm gonna make sure I include a descriptive prompt so Deshaun knows what value to enter. To test that it works, I'm gonna run the program and imagine I'm Deshaun trying to generate a new contract for a client. I enter in the client's name, and then it spits out the first paragraph of my contract. Woo, I have a prototype working. I'm gonna take this back to Deshaun and see what he thinks. Once I get his feedback, I can come back in and follow this pattern to generate the rest of the contract, or maybe you wanna give it a try.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] آئیے\nمل کر ایک ایسے پروگرام پر کام کریں جو متغیرات اور صارف کے ان پٹ کا استعمال کرتا ہو۔ یہاں وہ مسئلہ ہے جسے میں حل کرنے کی کوشش کر رہا ہوں۔ میرے دوست ڈیشاون کا کیٹرنگ کا کاروبار ہے اور کیٹرنگ کی ہر نوکری کے لیے\nاسے \nاپنے اور کلائنٹ کے درمیان ایک معاہدہ لکھنا ہوگا۔ ہر معاہدہ\nایک ہی بنیادی ٹیمپلیٹ کا استعمال کرتا ہے، لیکن کچھ خالی جگہیں ہیں\nجنہیں ایونٹ کی تفصیلات\nجیسے کلائنٹ کا نام، مقام کا نام، تاریخ سے پُر کرنے کی ضرورت ہے۔ یہ معاہدوں کا اختتام\nقانونی باتوں کے بہت سے صفحات پر ہوتا ہے، اور ان\nواقعات کی تفصیل کی بہت سی اقدار کو متعدد صفحات پر کاپی کرنے کی ضرورت ہوتی ہے۔ کیا ہم Deshaun کو تیزی سے معاہدے بنانے میں مدد کرنے کے لیے ایک پروگرام بنا سکتے ہیں؟ یہاں،\nہمارے پاس شروع کرنے کے لیے تھوڑا سا کوڈ ہے۔ ڈیشاون نے ہمارے ساتھ کام کرنے کے لیے اپنے معاہدے کے سانچے کے پہلے پیراگراف پر نقل کیا۔ \n \nجب مجھے اس طرح کا سٹارٹر کوڈ ملتا ہے تو میں سب سے پہلے اسے چلاتا ہوں اور دیکھتا ہوں کہ\nآیا یہ کام کرتا ہے اور کیا کرتا ہے۔  ایسا لگتا ہے کہ یہ\n اس اچھی سرخی کے ساتھ معاہدے کو تھوڑا سا فارمیٹ کرتا ہے، اور پھر یہ صرف ایک طرح سے\nٹیمپلیٹ کو پرنٹ کرتا ہے۔ یہاں ابھی بھی ایسے ہی خالی جگہیں ہیں جنہیں پُر کرنے کی ضرورت ہے۔ بلاشبہ، دیشاون کا مکمل\nمعاہدہ اس سے بہت لمبا ہے، لیکن مجھے اس طرح کا\nخیال پسند ہے کہ میں صرف اس پہلے\nپیراگراف سے شروع کروں تاکہ یہ محسوس ہو سکے کہ میں کیسا ہوں  اس مسئلے کو\nایک چھوٹے ذیلی مسئلے کے ساتھ حل کرنے سے پہلے میں یہاں ایک ٹن متن میں نقل کروں۔ ایک چیز جو میں اس کوڈ کے ساتھ نوٹ کرتا ہوں وہ یہ ہے کہ ہمارے یہاں لنٹر کی خرابی ہے۔ یہ ان پیلے رنگ کے مثلثوں میں سے ایک ہے، لہذا اس کا مطلب ہے کہ یہ ایک\nانتباہ ہے، غلطی نہیں، لیکن میں پھر بھی اس پر ایک نظر ڈالنا چاہتا ہوں اور دیکھنا چاہتا ہوں کہ آیا یہ کوئی ایسی چیز ہے جسے میں ٹھیک کر سکتا ہوں۔  ایسا لگتا ہے کہ یہ\nاس لائن کے بہت طویل ہونے کی شکایت کر رہا ہے، جسے آپ جانتے ہیں،\nمیں اس سے متفق ہوں۔ مجھے\n سٹرنگ کے آخر تک پہنچنے کے لیے یہاں ہر طرف افقی طور پر اسکرول کرنا ہے۔  اس کے ساتھ کام کرنا مشکل ہو جاتا ہے۔  اس طرح کی لمبی تار کو ایک سے زیادہ لائنوں پر تقسیم کرنے کے لیے، میں سٹرنگ کو\nکئی چھوٹی تاروں میں تقسیم کر سکتا ہوں اور پھر ان کو ایک ساتھ جوڑ سکتا ہوں۔ پھر، اگر میں اس پورے\nاظہار کو قوسین میں گھیر لیتا ہوں، تو میں قوسین کی وجہ سے ان تاروں کو الگ الگ لائنوں پر رکھ سکتا ہوں، کمپیوٹر اس ساری چیز کو ایک ہی ہدایات کے طور پر دیکھتا ہے۔ اس سے پہلے کہ ہم آگے بڑھیں، میں بس\nجلدی سے پروگرام کو دوبارہ چلانے والا ہوں اور اس بات کو یقینی بناؤں گا کہ\nجب میں یہاں تھا تو میں نے کچھ نہیں توڑا۔ ٹھیک ہے، اب سوچتے ہیں کہ\nاس پروگرام کو کیسے ڈیزائن کیا جائے۔ میں اس کوڈ کو عام کرنا چاہتا ہوں تاکہ میں\nکسی بھی کلائنٹ کے نام سے متبادل کر سکوں۔ صارف کا تجربہ جس کے لیے میں جا رہا ہوں وہ یہ ہے کہ Deshaun آکر تمام ایونٹ کی تفصیلات درج کر سکتا ہے،\nبنیادی طور پر ٹیکسٹ بکس میں، اور پھر پروگرام\nاسے مکمل معاہدہ دے گا۔ اس پہلے پیراگراف کے لیے، ایسا لگتا ہے کہ میں جن اقدار کو\nبھرنے کی کوشش کر رہا ہوں وہ کلائنٹ کا نام اور\nکیٹرنگ کمپنی کا نام ہیں، اس لیے میں شاید\nان میں سے ہر ایک کے لیے ایک متغیر چاہتا ہوں۔ میں چاہتا ہوں کہ Deshaun\n ان اقدار میں سے کچھ درج کرنے کے قابل ہو، اس لیے مجھے شاید یہاں ایک ان پٹ فنکشن کال کی ضرورت ہوگی،\nلیکن میں \nہر بار جب میں پروگرام چلاتا ہوں تو میں کنسول میں قدریں درج نہیں کرنا چاہتا۔ میں اب بھی اس پر کام کر رہا ہوں۔ تو میں ابھی\nکچھ پلیس ہولڈر کی قدروں کو یہاں رکھنے والا ہوں۔ میں نے صرف اسائنمنٹ کے چند بیانات شامل کیے\n جو میرے خیال میں درست ہیں، اس لیے مجھے نہیں لگتا کہ اس میں کوئی بگ نہیں ہونا چاہیے، لیکن صرف اس بات کا یقین کرنے کے لیے، میں\nپروگرام چلانے والا ہوں۔ ٹھیک ہے، اب میں\nان اقدار کو تبدیل کرنا چاہتا ہوں جہاں خالی جگہیں ہیں۔ اس کا مطلب ہے کہ مجھے اس اظہار میں\nان متغیرات تک رسائی حاصل کرنے کی ضرورت ہے تاکہ میں وہاں ذخیرہ شدہ قدر کو\nمعاہدے کے تار میں بدل سکوں۔ لہذا، جہاں میرے پاس\nسٹرنگ میں یہ انڈر لائنز ہیں، میں اس خالی جگہ کو حذف کر دوں گا اور پھر اس موڑ پر\nسٹرنگ کو دو حصوں میں الگ کر دوں گا۔ بہت ساری تاریں ہیں، تو مجھے چیک کرنے دیں کہ میں نے\nکوئی کوٹیشن مارکس نہیں چھوڑا۔ بہت اچھا، ٹھیک ہے، اب آئیے\nیہاں اپنی اقدار کو بدل دیں۔ میں کیٹرر کے نام میں جوڑنا چاہتا ہوں، جو کہ متغیر کیٹرر میں محفوظ ہے، اور یہاں، میں\nکلائنٹ کے نام سے جوڑنا چاہتا ہوں، جو متغیر کلائنٹ میں محفوظ ہے۔ اب، جب میں پروگرام چلاتا ہوں، میں ان\nپلیس ہولڈر ویلیوز کو دیکھ رہا ہوں جو میں نے ان متغیرات میں\nکنٹریکٹ میں خالی جگہوں کی جگہ پر محفوظ کی ہیں۔ اس نے یہاں میری لائن کی\nلمبائی کو تھوڑا سا گڑبڑ کیا، لہذا میں اسے جلدی صاف کرنے والا ہوں تاکہ اسے پڑھنا آسان ہو۔ یہاں ہیڈر میں ایک اور خالی جگہ ہے، اور ایسا لگتا ہے کہ Deshaun\nکیٹرنگ کمپنی کا نام یہاں جانا چاہتا ہے۔ تو میں ایک ہی کام کرنے والا ہوں اور اس سٹرنگ کو خالی جگہ پر تقسیم کروں گا اور کیٹرر متغیر میں بدل دوں گا۔ آخری مرحلہ، آئیے\nان پلیس ہولڈر اقدار پر واپس چلتے ہیں۔ Deshaun کی کمپنی کنگ کیٹرنگ کہلاتی ہے، اس لیے میں اسے یہاں ڈالنے والا ہوں۔ کلائنٹ کا نام اگرچہ\nہر معاہدے پر مختلف ہوتا ہے، اس لیے میں چاہتا ہوں کہ Deshaun\nاس قدر کو داخل کرنے کے قابل ہو۔ اس کا مطلب ہے کہ میں\nیہاں ان پٹ فنکشن چاہتا ہوں اور میں اس بات کو یقینی بنانے والا ہوں کہ میں\nایک وضاحتی پرامپٹ شامل کروں تاکہ Deshaun کو معلوم ہو کہ کون سی قدر درج کرنی ہے۔  یہ جانچنے کے لیے کہ یہ کام کرتا ہے،\nمیں پروگرام چلانے والا ہوں اور تصور کروں گا کہ میں Deshaun ایک کلائنٹ کے لیے ایک نیا معاہدہ تیار کرنے کی کوشش کر رہا ہوں۔ میں کلائنٹ کا نام درج کرتا ہوں، اور پھر یہ\nمیرے معاہدے کے پہلے پیراگراف کو ختم کرتا ہے۔ وو، میرے پاس ایک پروٹو ٹائپ کام کر رہا ہے۔ میں اسے واپس Deshaun پر لے جاؤں گا\nاور دیکھوں گا کہ وہ کیا سوچتا ہے۔ ایک بار جب مجھے اس کا فیڈ بیک مل جائے تو،\nمیں واپس آ سکتا ہوں اور باقی معاہدہ تیار کرنے کے لیے اس طرز پر عمل کر سکتا ہوں، یا ہو سکتا ہے کہ آپ اسے آزمانا چاہیں۔",
    "t_spanish": "- [Instructor] Trabajemos\njuntos en un programa que utilice variables y entradas del usuario. Este es el problema que estoy tratando de resolver. Mi amigo Deshaun tiene un negocio de catering y para cada trabajo de catering\nque acepta, necesita redactar un contrato\nentre él y el cliente. Cada contrato utiliza la\nmisma plantilla básica, pero hay espacios en blanco\nque deben completarse con los detalles del evento,\ncomo el nombre del cliente, el nombre del lugar y la fecha. Estos contratos terminan siendo\nmuchas páginas de lenguaje legal y muchos de estos\nvalores de detalles de eventos deben copiarse en varias páginas.  ¿ Podemos crearle a Deshaun un programa que le ayude a generar contratos más rápido? Aquí tenemos un poco de\ncódigo para comenzar. Deshaun copió el primer párrafo de su modelo de contrato\npara que podamos trabajar con él. Lo primero que hago\ncuando obtengo un código de inicio como este es ejecutarlo y ver\nsi funciona y qué hace. Parece que formatea\nun poco el contrato con este bonito título y luego simplemente\nimprime la plantilla tal como está. Todavía hay espacios en blanco que deben completarse. Por supuesto, el contrato completo de Deshaun\nes mucho más largo que esto, pero me\ngusta la idea de comenzar solo con este primer\npárrafo para tener una idea de cómo voy a  Resuelva este problema\ncon un subproblema más pequeño antes de copiar una tonelada de texto aquí. Una cosa que sí noto con este código es que tenemos un error de linter aquí. Es uno de estos triángulos amarillos, lo que significa que es una\nadvertencia, no un error, pero aun así quiero echarle un vistazo y ver si es algo que puedo solucionar. Parece que se está quejando\nde que esta línea es demasiado larga, con lo cual estoy de\nacuerdo. Tengo que desplazarme horizontalmente\nhasta aquí solo para llegar al final de la cadena. Hace que sea difícil trabajar con él. Para dividir una cadena larga como esta en varias líneas, puedo dividir la cadena\nen varias cadenas más pequeñas y luego concatenarlas. Luego, si rodeo toda esa\nexpresión entre paréntesis, puedo poner estas cadenas en líneas separadas porque, gracias a los paréntesis, la computadora trata todo esto como una sola instrucción. Antes de continuar,\nvolveré a ejecutar rápidamente el programa y me aseguraré de no haber roto\nnada mientras estuve aquí. Bien, ahora pensemos en\ncómo diseñar este programa. Quiero generalizar este código para poder sustituirlo en\nel nombre de cualquier cliente. La experiencia de usuario que busco es que Deshaun pueda ingresar e ingresar todos los detalles del evento,\nesencialmente en cuadros de texto, y luego el programa\nle entregará el contrato completo. Para este primer párrafo, parece que los valores que\nintento completar son el nombre del cliente y el nombre\nde la empresa de catering, por lo que probablemente quiera una\nvariable para cada uno de ellos. Querré que Deshaun\npueda ingresar algunos de esos valores, por lo que probablemente necesitaré una llamada de función de entrada\naquí, pero no quiero tener que ingresar valores en la consola\ncada vez que ejecuto el programa mientras  Todavía estoy trabajando en ello. Así que por ahora voy a colocar aquí\nalgunos valores de marcador de posición . Todo lo que hice fue agregar un par\nde declaraciones de asignación que creo que son correctas, así que no creo que deba haber ningún error, pero solo para estar seguro,\nejecutaré el programa. Muy bien, ahora quiero\nsustituir esos valores donde están los espacios en blanco. Eso significa que necesito\nacceder a estas variables en esta expresión para poder sustituir el valor almacenado allí\nen la cadena del contrato. Entonces, donde tengo estos\nsubrayados en la cadena, eliminaré ese espacio en blanco y luego separaré la\ncadena en dos partes en ese punto. Hay muchas cadenas, así que déjame comprobar que no\nomití ninguna comilla. Genial, está bien, ahora\nsustituyamos mis valores aquí. Quiero concatenar el nombre del proveedor, que está almacenado en la variable proveedor, y aquí, quiero\nconcatenar el nombre del cliente, que está almacenado en la variable cliente. Ahora, cuando ejecuto el programa, veo los\nvalores de marcador de posición que almacené en esas variables en lugar\nde los espacios en blanco en el contrato. Esto arruinó\nun poco la longitud de mis líneas aquí, así que voy a limpiarlas muy rápido para que sea más fácil de leer. Hay un espacio en blanco más aquí en el encabezado y parece que Deshaun\nquiere que el nombre de la empresa de catering vaya aquí. Así que haré lo mismo y dividiré esa cadena en el espacio en blanco y la sustituiré en la variable de catering. Último paso, volvamos a\nestos valores de marcador de posición.  La empresa de Deshaun se llama King Catering, así que la pondré aquí. Sin embargo, el nombre del cliente es\ndiferente en cada contrato, por lo que quiero que Deshaun\npueda ingresar ese valor. Eso significa que querré\nla función de entrada aquí y me aseguraré de\nincluir un mensaje descriptivo para que Deshaun sepa qué valor ingresar. Para probar que funciona,\nejecutaré el programa e imaginaré que soy Deshaun intentando generar un nuevo contrato para un cliente. Introduzco el nombre del cliente y luego aparece el\nprimer párrafo de mi contrato. Woo, tengo un prototipo funcionando.  Le llevaré esto a\nDeshaun y veré qué piensa. Una vez que reciba sus comentarios,\npuedo volver y seguir este patrón para generar el resto del contrato, o tal vez quieras intentarlo.",
    "t_arabic": "- [المدرس] دعونا نعمل\nمعًا على برنامج يستخدم المتغيرات ومدخلات المستخدم. هذه هي المشكلة التي أحاول حلها. صديقي ديشاون لديه عمل في مجال تقديم الطعام، ولكل وظيفة تقديم طعام\nيقوم بها، عليه كتابة عقد\nبينه وبين العميل. يستخدم كل عقد\nنفس القالب الأساسي، ولكن هناك فراغات\nيجب ملؤها بتفاصيل الحدث\nمثل اسم العميل واسم المكان والتاريخ. تنتهي هذه العقود بأن تكون عبارة عن\nصفحات كثيرة من الكلام القانوني، ويجب نسخ الكثير من\nقيم تفاصيل الأحداث هذه على صفحات متعددة.  هل يمكننا بناء برنامج Deshaun لمساعدته على توليد العقود بشكل أسرع؟ هنا، لدينا القليل من\nالتعليمات البرمجية للبدء.  قام ديشاون بنسخ الفقرة الأولى من نموذج عقده\nلكي نعمل معه. أول شيء أفعله\nعندما أحصل على رمز البدء مثل هذا هو تشغيله ومعرفة ما\nإذا كان يعمل وماذا يفعل. يبدو أنه يقوم بتنسيق\nالعقد قليلاً باستخدام هذا العنوان الجميل، ثم يقوم\nبطباعة القالب كما هو. لا تزال هناك مثل هذه الفراغات هنا التي يجب ملؤها. بالطبع، عقد Deshaun الكامل\nأطول بكثير من هذا، لكنني\nأحب فكرة البدء بهذه الفقرة الأولى فقط\nلأتعرف على ما سأفعله  قم بحل هذه المشكلة\nبمشكلة فرعية أصغر قبل أن أنسخ عددًا كبيرًا من النصوص هنا. شيء واحد لاحظته في هذا الرمز هو أن لدينا خطأً في الخطأ هنا. إنه أحد هذه المثلثات الصفراء، وهذا يعني أنه\nتحذير، وليس خطأ، ولكن ما زلت أريد إلقاء نظرة عليه ومعرفة ما إذا كان هناك شيء يمكنني إصلاحه. يبدو أنها تشكو\nمن أن هذا السطر طويل جدًا، وهو ما\nأتفق معه نوعًا ما، كما تعلمون.  لا بد لي من التمرير الأفقي\nعلى طول الطريق هنا فقط للوصول إلى نهاية السلسلة. يجعل من الصعب العمل معها. لتقسيم سلسلة طويلة مثل هذه على عدة أسطر، يمكنني تقسيم السلسلة\nإلى عدة سلاسل أصغر ثم ربطها معًا. بعد ذلك، إذا أحاطت هذا\nالتعبير بأكمله بين قوسين، فيمكنني وضع هذه السلاسل في أسطر منفصلة بسبب الأقواس، حيث يتعامل الكمبيوتر مع الأمر برمته كتعليمات واحدة. قبل أن نمضي قدمًا،\nسأقوم بإعادة تشغيل البرنامج سريعًا والتأكد من أنني لم أكسر\nأي شيء أثناء وجودي هنا. حسنًا، لنفكر الآن في\nكيفية تصميم هذا البرنامج. أريد تعميم هذا الرمز حتى أتمكن من استبداله\nباسم أي عميل. تجربة المستخدم التي سأسعى إليها هي أن Deshaun يمكنه الدخول وإدخال جميع تفاصيل الحدث،\nبشكل أساسي في مربعات النص، وبعد ذلك سيمنحه البرنامج\nالعقد المكتمل. بالنسبة لهذه الفقرة الأولى، يبدو أن القيم التي\nأحاول ملؤها هي اسم العميل واسم\nشركة تقديم الطعام، لذلك ربما أريد\nمتغيرًا لكل منهما. أريد أن\nيتمكن Deshaun من إدخال بعض هذه القيم، لذلك ربما سأحتاج إلى استدعاء دالة إدخال\nهنا، لكنني لا أريد إدخال قيم في وحدة التحكم في\nكل مرة أقوم فيها بتشغيل البرنامج أثناء تشغيله  ما زلت أعمل على ذلك. لذلك سأقوم فقط بلصق\nبعض القيم النائبة هنا في الوقت الحالي. كل ما فعلته هو إضافة بعض\nعبارات المهمة التي أعتقد أنها صحيحة، لذلك لا أعتقد أنه يجب أن يكون هناك أي أخطاء، ولكن فقط للتأكد،\nسأقوم بتشغيل البرنامج. حسنًا، الآن أريد\nالتعويض بهذه القيم في أماكن الفراغات. وهذا يعني أنني بحاجة\nللوصول إلى هذه المتغيرات في هذا التعبير حتى أتمكن من استبدال القيمة المخزنة هناك\nفي سلسلة العقد. لذلك، عندما يكون لدي هذه\nالخطوط في السلسلة، سأقوم بحذف ذلك الفراغ ثم أفصل\nالسلسلة إلى جزأين عند تلك المرحلة. هناك الكثير من السلاسل، لذا دعني أتأكد من عدم\nتفويت أي علامات اقتباس. عظيم، حسنًا، الآن دعنا\nنستبدل القيم الخاصة بي هنا. أريد أن أقوم بالتسلسل في اسم متعهد تقديم الطعام، الذي تم تخزينه في متعهد تقديم الطعام المتغير، وهنا، أريد أن أقوم\nبالتسلسل في اسم العميل، الذي تم تخزينه في العميل المتغير. الآن، عندما أقوم بتشغيل البرنامج، أرى\nقيم العناصر النائبة التي قمت بتخزينها في تلك المتغيرات بدلاً\nمن الفراغات في العقد.  لقد أفسد هذا الأمر\nطول سطوري هنا قليلًا، لذا سأقوم بتنظيف ذلك بسرعة كبيرة حتى يكون من الأسهل قراءته. يوجد مكان فارغ آخر هنا في رأس الصفحة، ويبدو أن Deshaun\nيريد أن يوضع اسم شركة تقديم الطعام هنا. لذا سأفعل نفس الشيء وأقسم تلك السلسلة على الفراغ وأستبدلها في متغير متعهد تقديم الطعام. الخطوة الأخيرة، دعونا نعود إلى\nقيم العناصر النائبة هذه. شركة ديشاون اسمها King Catering، لذا سأضعها هنا. ومع ذلك، يختلف اسم العميل\nفي كل عقد، لذلك أريد أن\nيتمكن Deshaun من إدخال هذه القيمة. هذا يعني أنني أريد\nوظيفة الإدخال هنا وسأتأكد من\nتضمين موجه وصفي حتى يعرف Deshaun القيمة التي يجب إدخالها. لاختبار نجاح الأمر،\nسأقوم بتشغيل البرنامج وأتخيل أنني ديشاون أحاول إنشاء عقد جديد للعميل. أقوم بإدخال اسم العميل، وبعد ذلك يتم كتابة\nالفقرة الأولى من عقدي. وو، لدي نموذج أولي يعمل. سأعيد هذا إلى\nديشاون وأرى ما يفكر فيه. بمجرد أن أحصل على تعليقاته،\nيمكنني العودة واتباع هذا النمط لإنشاء بقية العقد، أو ربما ترغب في تجربته.",
    "t_italian": "- [Istruttore] Lavoriamo\ninsieme su un programma che utilizza variabili e input dell'utente. Ecco il problema che sto cercando di risolvere. Il mio amico Deshaun ha un'attività di ristorazione e per ogni lavoro di ristorazione\nche accetta deve redigere un contratto\ntra lui e il cliente. Ogni contratto utilizza lo\nstesso modello di base, ma ci sono degli spazi vuoti\nche devono essere riempiti con i dettagli dell'evento\ncome il nome del cliente, il nome della sede, la data. Questi contratti finiscono per contenere\nmolte pagine di discorsi legali e molti di questi\nvalori di dettaglio degli eventi devono essere copiati su più pagine. Possiamo costruire per Deshaun un programma che lo aiuti a generare contratti più velocemente? Qui abbiamo un po' di\ncodice per iniziare. Deshaun ha copiato il primo paragrafo del suo modello di contratto\naffinché potessimo lavorarci. La prima cosa che faccio\nquando ricevo un codice iniziale come questo è eseguirlo e vedere\nse funziona e cosa fa. Sembra che formatti\nun po' il contratto con questa bella intestazione, e poi\nstampa il modello così com'è. Ci sono ancora questi spazi vuoti qui che devono essere riempiti. Naturalmente, il contratto completo di Deshaun\nè molto più lungo di così, ma mi\npiace l'idea di iniziare solo con questo primo\nparagrafo per avere un'idea di come farò  risolvi questo problema\ncon un sottoproblema più piccolo prima di copiare qui un sacco di testo. Una cosa che noto con questo codice è che qui abbiamo un errore di linter. È uno di questi triangoli gialli, quindi significa che è un\navviso, non un errore, ma voglio comunque dargli un'occhiata e vedere se è qualcosa che posso risolvere. Sembra che si stia lamentando\ndel fatto che questa riga è troppo lunga, cosa che, sai,\nsono d'accordo. Devo scorrere orizzontalmente\nfino a qui solo per arrivare alla fine della stringa. Rende difficile lavorarci. Per dividere una stringa lunga come questa su più righe, posso dividerla\nin più stringhe più piccole e quindi concatenarle insieme. Quindi, se racchiudo l'intera\nespressione tra parentesi, posso mettere queste stringhe su righe separate perché le parentesi, il computer tratta l'intera cosa come una singola istruzione. Prima di andare avanti,\nrieseguirò velocemente il programma e mi assicurerò di non aver rotto\nnulla mentre ero qui. Ok, ora pensiamo a\ncome progettare questo programma. Voglio generalizzare questo codice in modo da poterlo sostituire\na nome di qualsiasi cliente. L'esperienza utente che cerco è che Deshaun possa entrare e inserire tutti i dettagli dell'evento,\nessenzialmente in caselle di testo, e poi il programma\ngli darà il contratto completato. Per questo primo paragrafo sembra che i valori che sto\ncercando di inserire siano il nome del cliente e il nome\ndell'azienda di catering, quindi probabilmente voglio una\nvariabile per ciascuno di essi. Voglio che Deshaun\nsia in grado di inserire alcuni di questi valori, quindi probabilmente avrò bisogno di una chiamata alla funzione di input\nqui, ma non voglio dover inserire valori nella console\nogni volta che eseguo il programma mentre io  ci sto ancora lavorando. Quindi per ora inserirò qui solo\nalcuni valori segnaposto . Tutto quello che ho fatto è stato aggiungere un paio\ndi istruzioni di assegnazione che penso siano giuste, quindi non penso che ci dovrebbero essere bug, ma per essere sicuro,\neseguirò il programma. Va bene, ora voglio\nsostituire quei valori dove sono gli spazi vuoti. Ciò significa che devo\naccedere a queste variabili in questa espressione in modo da poter sostituire il valore memorizzato lì\nnella stringa del contratto. Quindi, dove ho queste\nsottolineature nella stringa, eliminerò lo spazio vuoto e poi separerò la\nstringa in due parti in quel punto. Ci sono molte stringhe, quindi fammi controllare di non aver\nperso nessuna virgoletta. Ottimo, ok, ora\nsostituiamo i miei valori qui. Voglio concatenare il nome del ristoratore, che è memorizzato nella variabile catering, e qui, voglio\nconcatenare il nome del cliente, che è memorizzato nella variabile client. Ora, quando eseguo il programma, vedo i\nvalori segnaposto che ho memorizzato in quelle variabili al posto\ndegli spazi vuoti nel contratto. Questo ha incasinato\nun po' la lunghezza delle mie righe qui, quindi lo ripulirò molto velocemente in modo che sia più facile da leggere. C'è ancora uno spazio vuoto qui nell'intestazione e sembra che Deshaun\nvoglia che il nome della società di catering venga inserito qui. Quindi farò la stessa cosa e dividerò quella stringa nello spazio vuoto e la sostituirò con la variabile catering. Ultimo passaggio, torniamo a\nquesti valori segnaposto.  L' azienda di Deshaun si chiama King Catering, quindi lo inserirò qui. Il nome del cliente però è\ndiverso per ogni contratto, quindi voglio che Deshaun\npossa inserire quel valore. Ciò significa che vorrò\nla funzione di input qui e mi assicurerò di\nincludere un prompt descrittivo in modo che Deshaun sappia quale valore inserire. Per verificare che funzioni,\neseguirò il programma e immagino di essere Deshaun che cerca di generare un nuovo contratto per un cliente. Inserisco il nome del cliente e poi viene fuori il\nprimo paragrafo del mio contratto. Woo, ho un prototipo funzionante. Lo riporterò a\nDeshaun e vedrò cosa ne pensa. Una volta ricevuto il suo feedback,\nposso tornare e seguire questo schema per generare il resto del contratto, o forse vuoi provarci."
}