{
    "source": "Mst8ixkiNbw",
    "youtubelink": "https://www.youtube.com/watch?v=Mst8ixkiNbw",
    "t_english": "- Hi, I'm Michelle, a Professional Learning Specialist here at Khan Academy, and a former classroom teacher, just like you. Meet Khanmigo, your AI driven companion who's revolutionizing teaching for a more engaging and efficient experience. Khanmigo has many exciting features that support teachers, and this video will showcase ways that you can use Khanmigo to create course specific content to enhance the learning experience for all of the students in the classes that you're teaching. This is Khanmigo's dashboard, brimming with a multitude of unique time saving features, all tailored to elevate your teaching experience. Let's begin with the learning objective feature. Because although I know what I wanna teach, I still need to develop a clear and measurable learning objective to guide my instruction. Using the learning objective feature with Khanmigo can help clarify my goals making lesson planning more efficient. It also aids in student understanding as well, so they'll know exactly what's expected for them to learn. Once I select the learning objective, I just have to let Khanmigo know the grade level, this is for my 10th grade class. And what the topic is, this is for my jewelry class. And in a matter of seconds, Khanmigo creates the learning objective that I can use to lead my lesson. If there's something that I wanna change about the learning objective, all I have to do is click on it and I can let Khanmigo know if I wanna make changes to it. If I wanna try something different or if I wanna discuss it. I think I'm going to make changes to this because I'd like this to be an I can statement, and just as fast as I was able to type it, Khanmigo changed it to an I can statement for me. Thanks, Khanmigo. The next feature I'd like to explore is the lesson hook feature, because let's face it, it's not just about teaching, it's about creating memorable, engaging experiences that enhance understanding and retention. As soon as I select the lesson hook feature, Khanmigo wants to know the grade level. This is for my ninth grade class. And the lesson topic, this is for my photography class. And then I just have to let Khanmigo know the context of the Lesson Hooks that I'd like it to create. Students demonstrate an understanding of the exposure process. All right, Khanmigo, write me some great lesson hooks, please. And in a matter of seconds, Khanmigo creates three fantastic lesson hooks that'll get my students excited about photography. Thanks, Khanmigo. Now that my students' curiosity has been sparked, Khanmigo can assist me with crafting compelling lesson plans by utilizing the lesson plan feature. I can select topics from one of Khanmigo's rich course offerings, or I can select my own topic, which is what I plan to do. I just have to let Khanmigo know the standard or the learning objective. Students demonstrate an understanding of the exposure process. And this is for my ninth grade photography class. Khanmigo will generate a detailed lesson plan for me, which includes the objectives, materials, assessments, activities, and much, much more. Plus, the lesson plan is completely customizable, so I'm in charge and I know I'll do what's best for my students. Like I don't think my students will do well with this 3, 2, 1 exit ticket activity. All I have to do is click on it and then ask Khanmigo to try something different. Once my lesson plan is complete, I'm able to print or export it. And when I export it, I can export it to a Word document, a PDF, or a Google Drive. This was so easy. Thanks so much, Khanmigo. The next feature I'm going to explore is the informational text feature. This feature will create an informational text passage for the grade level you want, from first grade all the way through the collegiate level. Once you input the intended grade level and the topic of your choice, you just have to select the length the passage you'd like to create. And whether you select 100 words, 300 words, or 750 words, Khanmigo will do the rest. I'm gonna go with 300 words. Fantastic. This is also an excellent feature for integrating cross curriculum content because it provides students with multiple ways to engage with the material. All right, I am going to go ahead and export this. I'm gonna save this to my Google Drive. Hm, upon further reflection, I think this text may be a little difficult for some of my struggling readers. No worries, I can use Khanmigo's leveler. Oh, that's a great idea. As an educator, I understand the value of exposing students to grade level text and vocabulary. However, balancing this with comprehension is crucial. The leveler feature adjusts text complexity to match student abilities, ensuring understanding while engaging with grade level material and personalizing instruction to each student's needs. All I have to do is click on the leveler. Once I let Khanmigo know the title of the text, I just copy and paste the original text in the space provided and then let Khanmigo know the grade I'd like it leveled to. I do have a few students who are on a sixth grade reading level, so I'm going to select that. And Khanmigo will rewrite the text for my students who are on a sixth grade reading level. That was so easy. Now I can make sure that all of my students get the same information, regardless of the grade level that they read on. As an educator, I aim to craft thought provoking discussion prompts tailored to specific topics for my students. My goal is to ignite their curiosity and stimulate intellectual discourse, so I'm going to use the discussion prompt feature. I just have to let Khanmigo know the grade level and the topic. This is for my 10th grade agriculture class, and we're currently examining the role of the agricultural industry and the environment. And in a matter of seconds, Khanmigo creates multiple detailed and thought provoking discussion questions that will be sure to get my students chatting in a good way. The multiple choice assessment feature with Khanmigo is a teacher's dream come true. It's an innovative tool that transforms evaluating your students into an engaging, interactive process. It could be your secret weapon for assessing student understanding, identifying gaps and guiding instruction. With a one click of the button, you just let Khanmigo know your grade level. This is for my 10th grade Spanish class. How many questions that you'd like to include? I want 10. And then the topic. Currently, we're working on types of clothing. And in a matter of seconds, Khanmigo creates a 10-question detailed, multiple choice quiz that includes the answer key. Thanks so much, Khanmigo. That saved me so much time. Imagine a tool that brings learning to life right in your classroom. Khanmigo's real world context generator does just that. It transforms abstract concepts into relatable scenarios, making learning fun and relatable. I just have to let Khanmigo know the grade level and the topic. This is for my sixth grade intensive reading class who is currently working on making inferences. Khanmigo, please write me some great ideas. And, again, in a matter of seconds, Khanmigo creates three unique and engaging ideas that I can share with my students, enhancing their understanding and interest in this topic. Thank you, Khanmigo. If you're looking for a fun, engaging way to learn for your students, you have to try our fun class summary poem feature. It's a unique rhythmic way to summarize lessons for your students. Let's give it a try. When I select the button, Khanmigo wants me to ask my students what they learned today. Today in my guitar class, we focus on the techniques of basic strumming and plucking. Then Khanmigo wants me to ask my students for a fun word, summer. That's what's on my mind right now, and Khanmigo will do the rest. And here's our poem. In the heat of summer, we strum and pluck. On our guitars, we're in luck. With fingers dancing, creating a tune underneath the bright, warm June. Strumming high, plucking low, in summer's heat, our skills do grow. As you can see, it's not just a poem, it's a memory booster, a creativity enhancer, and a super cool learning tool. Thanks so much, Khanmigo. Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen. And to never miss exciting announcements about new free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، \nیہاں خان اکیڈمی میں ایک پروفیشنل لرننگ اسپیشلسٹ، اور ایک سابقہ ​​کلاس روم\nٹیچر، بالکل آپ کی طرح۔ خانمیگو سے ملیں، جو آپ کے AI سے چلنے والے ساتھی ہیں\nجو زیادہ پرکشش اور موثر تجربے کے لیے تدریس میں انقلاب برپا کر رہے ہیں۔\n Khanmigo میں بہت ساری دلچسپ\nخصوصیات ہیں جو اساتذہ کو سپورٹ کرتی ہیں، اور یہ ویڈیو ان\nطریقوں کو ظاہر کرے گی جن سے آپ خانمیگو کو کورس کے مخصوص مواد بنانے کے لیے استعمال کر سکتے ہیں تاکہ آپ جس کلاس میں پڑھا رہے ہیں ان تمام طلبا کے لیے سیکھنے کے تجربے کو بڑھا سکیں۔ \n یہ Khanmigo کا ڈیش بورڈ ہے، جو وقت بچانے کی بے شمار منفرد خصوصیات سے بھرا ہوا ہے\n، جو\nآپ کے تدریسی تجربے کو بلند کرنے کے لیے تیار کیا گیا ہے۔ آئیے\nسیکھنے کے مقصد کی خصوصیت کے ساتھ شروع کرتے ہیں۔ کیونکہ اگرچہ میں جانتا ہوں کہ\nمیں کیا سکھانا چاہتا ہوں، مجھے پھر بھی اپنی ہدایات کی رہنمائی کے لیے ایک واضح اور قابل پیمائش سیکھنے کا مقصد تیار کرنے کی ضرورت ہے۔ \nKhanmigo کے ساتھ سیکھنے کے مقصد کی خصوصیت کو استعمال کرنے سے سبق کی منصوبہ بندی کو مزید موثر بنانے میں میرے مقاصد کو واضح کرنے میں مدد مل سکتی ہے۔ اس سے طالب علم کو سمجھنے میں بھی مدد ملتی ہے،\n لہذا وہ جان لیں گے کہ\nان سے سیکھنے کی کیا توقع ہے۔ ایک بار جب میں سیکھنے کا مقصد منتخب کر لیتا ہوں، مجھے صرف خانمیگو کو\nگریڈ لیول بتانا ہوتا ہے، یہ میری 10ویں جماعت کی کلاس کے لیے ہے۔ اور موضوع کیا ہے، یہ\nمیری جیولری کلاس کے لیے ہے۔ اور چند سیکنڈوں میں، Khanmigo سیکھنے کا مقصد بناتا ہے جسے میں اپنے سبق کی رہنمائی کے لیے استعمال کر سکتا ہوں۔ اگر میں سیکھنے کے مقصد کے بارے میں کچھ تبدیل کرنا چاہتا ہوں، تو مجھے صرف اس پر کلک کرنا ہے اور میں Khanmigo کو بتا سکتا ہوں کہ\nآیا میں اس میں تبدیلیاں کرنا چاہتا ہوں۔ اگر میں کچھ مختلف کرنا چاہتا ہوں\nیا اگر میں اس پر بات کرنا چاہتا ہوں۔ مجھے لگتا ہے کہ میں اس میں تبدیلیاں کرنے جا رہا ہوں کیونکہ میں اسے\nایک I can بیان بنانا چاہوں گا، اور جتنی جلدی میں اسے ٹائپ کرنے میں کامیاب ہوا، Khanmigo نے اسے\nمیرے لیے I can بیان میں تبدیل کر دیا۔ شکریہ، خانمیگو۔ اگلی خصوصیت جس کو میں دریافت کرنا چاہتا ہوں وہ سبق ہک کی خصوصیت ہے،\nکیونکہ آئیے اس کا سامنا کرتے ہیں، یہ صرف پڑھانے کے بارے میں نہیں ہے، یہ یادگار، دلکش تجربات تخلیق کرنے کے بارے میں ہے\n جو سمجھ اور برقراری کو بڑھاتے ہیں۔ جیسے ہی میں\nسبق ہک فیچر کو منتخب کرتا ہوں، خانمیگو گریڈ لیول جاننا چاہتا ہے۔ یہ میری نویں جماعت کی کلاس کے لیے ہے۔ اور سبق کا موضوع، یہ\nمیری فوٹو گرافی کی کلاس کے لیے ہے۔ اور پھر مجھے صرف\nخانمیگو کو سبق ہکس کے سیاق و سباق سے آگاہ کرنا ہے جو\nمیں اسے بنانا چاہتا ہوں۔ طلباء نمائش کے عمل کی سمجھ کا مظاہرہ کرتے ہیں۔ ٹھیک ہے، خانمیگو، براہِ کرم مجھے کچھ بہترین سبق لکھیں۔ اور چند سیکنڈوں میں، Khanmigo تین\nشاندار سبق آموز ہکس بناتا ہے جو میرے طلباء کو\nفوٹو گرافی کے بارے میں پرجوش کر دیتے ہیں۔ شکریہ، خانمیگو۔ اب جبکہ میرے طالب علموں کا\nتجسس پیدا ہو گیا ہے، خانمیگو سبق کے منصوبے کی خصوصیت کو استعمال کر کے زبردست سبق کے منصوبے بنانے میں میری مدد کر سکتا ہے۔ میں Khanmigo کے بھرپور کورس کی پیشکشوں میں سے کسی ایک سے عنوانات منتخب کر سکتا ہوں، یا میں اپنا موضوع خود منتخب کر سکتا ہوں،\nجو کہ میں کرنے کا ارادہ رکھتا ہوں۔ مجھے صرف\nخانمیگو کو معیاری یا سیکھنے کا مقصد بتانا ہے۔ طلباء نمائش کے عمل کی سمجھ کا مظاہرہ کرتے ہیں۔ اور یہ میری نویں\nجماعت کی فوٹو گرافی کی کلاس کے لیے ہے۔ Khanmigo\nمیرے لیے ایک تفصیلی سبق کا منصوبہ تیار کرے گا، جس میں مقاصد،\nمواد، تشخیص، سرگرمیاں، اور بہت کچھ شامل ہے۔  اس کے علاوہ، سبق کا منصوبہ\nمکمل طور پر حسب ضرورت ہے، اس لیے میں انچارج ہوں اور میں جانتا ہوں کہ میں وہی کروں گا جو\nمیرے طلباء کے لیے بہترین ہے۔ جیسا کہ مجھے نہیں لگتا کہ میرے\nطلباء اس 3، 2، 1 ایگزٹ ٹکٹ کی سرگرمی کے ساتھ اچھا کام کریں گے۔ مجھے بس اس پر کلک کرنا ہے اور پھر خانمیگو سے\nکچھ مختلف کرنے کو کہنا ہے۔ میرا سبق کا منصوبہ مکمل ہونے کے بعد، میں اسے پرنٹ یا ایکسپورٹ کرنے کے قابل ہوں۔ اور جب میں اسے ایکسپورٹ کرتا ہوں تو میں\nاسے ورڈ دستاویز، پی ڈی ایف، یا گوگل ڈرائیو میں ایکسپورٹ کرسکتا ہوں۔ یہ اتنا آسان تھا۔\nبہت شکریہ، خانمیگو۔ اگلی خصوصیت جس کو میں دریافت کرنے جا رہا ہوں وہ معلوماتی متن کی خصوصیت ہے۔ یہ فیچر\n آپ کے مطلوبہ گریڈ لیول کے لیے ایک معلوماتی ٹیکسٹ پیسیج بنائے گا، پہلی جماعت سے لے کر\nکالج کی سطح تک۔ ایک بار جب آپ مطلوبہ گریڈ لیول اور اپنی پسند کا موضوع درج کر دیتے ہیں، تو آپ کو صرف اس طوالت کو منتخب کرنا ہوگا جس کو\n آپ بنانا چاہتے ہیں۔ اور چاہے آپ 100\nالفاظ، 300 الفاظ، یا 750 الفاظ منتخب کریں، باقی کام خانمیگو کرے گا۔ میں 300 الفاظ کے ساتھ جانے والا ہوں۔ لاجواب۔ یہ کراس کریکولم مواد کو مربوط کرنے کے لیے بھی ایک بہترین خصوصیت ہے کیونکہ یہ\nطلباء کو مواد کے ساتھ مشغول ہونے کے متعدد طریقے فراہم کرتا ہے۔ ٹھیک ہے، میں\nآگے بڑھ کر اسے ایکسپورٹ کرنے جا رہا ہوں۔ میں اسے اپنی گوگل ڈرائیو میں محفوظ کرنے والا ہوں۔ ہم، مزید غور کرنے پر، میں سمجھتا ہوں کہ یہ متن\n میرے کچھ جدوجہد کرنے والے قارئین کے لیے تھوڑا مشکل ہو سکتا ہے۔ پریشان ہونے کی کوئی بات نہیں، میں خانمیگو کا لیولر استعمال کر سکتا ہوں۔ اوہ، یہ ایک بہت اچھا خیال ہے. ایک معلم کے طور پر، میں\nطلباء کو گریڈ لیول کے متن اور الفاظ سے روشناس کرانے کی اہمیت کو سمجھتا ہوں۔ تاہم، فہم کے ساتھ اس میں توازن رکھنا بہت\nضروری ہے۔ لیولر فیچر\n طالب علم کی صلاحیتوں سے مطابقت رکھنے کے لیے متن کی پیچیدگی کو ایڈجسٹ کرتا ہے، گریڈ لیول کے مواد کے ساتھ مشغول ہونے کے دوران سمجھ بوجھ کو یقینی بناتا ہے اور\nہر طالب علم کی ضروریات کے مطابق ہدایات کو ذاتی بناتا ہے۔ مجھے صرف لیولر پر کلک کرنا ہے۔ ایک بار جب میں خانمیگو کو\nمتن کے عنوان سے آگاہ کرتا ہوں، میں صرف اصل متن کو فراہم کردہ جگہ میں کاپی اور پیسٹ کرتا ہوں\nاور پھر خانمیگو کو بتاتا ہوں کہ میں اسے کس درجہ پر لانا چاہتا ہوں۔ میرے پاس کچھ طلباء ہیں جو چھٹی جماعت کے پڑھنے کی سطح پر ہیں، لہذا میں اسے منتخب کرنے جا رہا ہوں۔ اور خانمیگو\nمیرے ان طلباء کے لیے متن کو دوبارہ لکھے گا جو چھٹی جماعت کے پڑھنے کی سطح پر ہیں۔ یہ اتنا آسان تھا۔ اب میں اس بات کو یقینی بنا سکتا ہوں\nکہ میرے تمام طلباء کو یکساں معلومات حاصل ہوں، قطع نظر اس کے کہ\nوہ جس گریڈ پر پڑھتے ہیں۔ ایک معلم کے طور پر، میرا مقصد\n \nاپنے طلباء کے لیے مخصوص عنوانات کے مطابق سوچ کو بھڑکانے والے مباحثے کے اشارے تیار کرنا ہے۔ میرا مقصد ان کے تجسس کو بھڑکانا اور فکری گفتگو کو ابھارنا ہے، اس لیے میں\nڈسکشن پرامپٹ فیچر استعمال کرنے جا رہا ہوں۔ مجھے صرف خانمیگو کو گریڈ لیول اور موضوع سے آگاہ کرنا ہے۔ یہ میری 10ویں\nجماعت کی زراعت کی کلاس کے لیے ہے، اور ہم فی الحال زرعی صنعت\nاور ماحولیات کے کردار کا جائزہ لے رہے ہیں۔ اور چند سیکنڈوں میں، خانمیگو متعدد مفصل اور فکر انگیز بحث کے\nسوالات تخلیق کرتا ہے جو یقینی طور پر میرے طالب علموں کو اچھے طریقے سے چیٹنگ کرنے میں مدد فراہم کریں گے۔  Khanmigo کے ساتھ ایک سے زیادہ انتخاب کی تشخیص کی\nخصوصیت ایک استاد کا خواب پورا ہونا ہے۔ یہ ایک اختراعی ٹول ہے جو آپ کے طلباء کی جانچ کو ایک پرکشش، انٹرایکٹو عمل میں بدل دیتا ہے۔ یہ طالب علم کی تفہیم کا اندازہ لگانے، خلاء کی نشاندہی کرنے اور ہدایات کی رہنمائی کے لیے آپ کا خفیہ ہتھیار ہو سکتا ہے۔ بٹن پر ایک کلک کے ساتھ، آپ خانمیگو کو\nاپنے گریڈ کی سطح سے آگاہ کرتے ہیں۔ یہ میری 10ویں جماعت کی ہسپانوی کلاس کے لیے ہے۔  آپ کتنے سوالات\nشامل کرنا چاہیں گے؟ میں 10 چاہتا ہوں۔ اور پھر موضوع۔ فی الحال، ہم\nلباس کی اقسام پر کام کر رہے ہیں۔ اور چند\nسیکنڈوں میں، Khanmigo 10 سوالوں پر مشتمل ایک تفصیلی،\nمتعدد انتخابی کوئز بناتا ہے جس میں جواب کی کلید شامل ہوتی ہے۔ بہت شکریہ، خانمیگو۔\nاس سے میرا بہت وقت بچ گیا۔ ایک ایسے ٹول کا تصور کریں جو\n آپ کے کلاس روم میں ہی سیکھنے کو زندگی بخشے۔ خانمیگو کا حقیقی دنیا کا سیاق و سباق\nپیدا کرنے والا ایسا ہی کرتا ہے۔ یہ تجریدی تصورات کو\nمتعلقہ منظرناموں میں تبدیل کرتا ہے، جس سے سیکھنے کو مزہ آتا ہے اور متعلقہ۔ مجھے صرف خانمیگو کو گریڈ لیول اور موضوع سے آگاہ کرنا ہے۔ یہ میری چھٹی جماعت کی\nگہری پڑھنے والی کلاس کے لیے ہے جو فی الحال\nاندازہ لگانے پر کام کر رہی ہے۔ خانمیگو، براہ کرم\nمجھے کچھ عمدہ خیالات لکھیں۔ اور، ایک بار پھر، چند سیکنڈوں میں، Khanmigo تین\nمنفرد اور دلکش خیالات تخلیق کرتا ہے جو میں اپنے طلباء کے ساتھ شیئر کر سکتا ہوں، \nاس موضوع میں ان کی سمجھ اور دلچسپی کو بڑھا سکتا ہوں۔ شکریہ خانمیگو۔ اگر آپ اپنے طلباء کے لیے\nسیکھنے کے لیے ایک تفریحی، دل چسپ طریقہ تلاش کر رہے ہیں، تو آپ کو ہماری تفریحی کلاس کے خلاصے کی نظم کی خصوصیت کو آزمانا ہوگا۔ یہ آپ کے طلباء کے لیے اسباق کا خلاصہ کرنے کا ایک انوکھا ردھم والا طریقہ ہے۔ آئیے اسے آزماتے ہیں۔ جب میں\nبٹن کو منتخب کرتا ہوں، خانمیگو چاہتا ہے کہ میں اپنے طلباء سے پوچھوں کہ\nانہوں نے آج کیا سیکھا۔ آج میری گٹار کلاس میں،\nہم بنیادی سٹرمنگ اور پلکنگ کی تکنیکوں پر توجہ مرکوز کرتے ہیں۔ پھر خانمیگو چاہتا ہے کہ میں اپنے طلباء سے ایک تفریحی لفظ، سمر کے لیے پوچھوں۔ ابھی میرے ذہن میں یہی ہے، اور باقی کام خانمیگو کرے گا۔ اور یہاں ہماری نظم ہے۔ گرمی کی گرمی میں، ہم ہڑبڑاتے اور توڑتے ہیں۔ ہمارے گٹار پر، ہم قسمت میں ہیں. انگلیوں کے ساتھ رقص کرتے ہوئے، روشن، گرم جون کے نیچے ایک دھن پیدا کرنا۔ گرمی کی گرمی میں، اونچی آواز میں، کم توڑنے، ہماری مہارتیں بڑھ جاتی ہیں۔ جیسا کہ آپ دیکھ سکتے ہیں، یہ صرف\nایک نظم نہیں ہے، یہ میموری کو بڑھانے والا، تخلیقی صلاحیتوں کو بڑھانے والا، اور\nسیکھنے کا ایک زبردست ٹول ہے۔ بہت شکریہ، خانمیگو۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ خانمیگو کلاس روم میں آپ اور آپ کے طلباء کی کس طرح مدد کر سکتا ہے،\n اپنی اسکرین پر موجود لنکس پر عمل کریں۔ اور خان اکیڈمی پر نئے مفت کورس کے مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں،\n سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola, soy Michelle, una especialista en aprendizaje profesional\naquí en Khan Academy y ex\nmaestra de aula, como tú. Conozca a Khanmigo, su compañero impulsado por IA\nque está revolucionando la enseñanza para brindar una experiencia más atractiva y\neficiente. Khanmigo tiene muchas\ncaracterísticas interesantes que apoyan a los profesores, y este video mostrará\nformas en que puede usar Khanmigo para crear contenido específico del curso para mejorar la experiencia de aprendizaje para todos los estudiantes en las\nclases que está enseñando. Este es el panel de Khanmigo, repleto de una multitud de\nfunciones únicas para ahorrar tiempo, todas diseñadas para mejorar\nsu experiencia docente. Comencemos con la\nfunción del objetivo de aprendizaje. Porque aunque sé\nlo que quiero enseñar, todavía necesito desarrollar un objetivo de aprendizaje claro y mensurable para guiar mi instrucción. Usar la función de objetivos de aprendizaje\ncon Khanmigo puede ayudarme a aclarar mis objetivos y hacer que la planificación de lecciones sea más eficiente. También ayuda a la\ncomprensión de los estudiantes, para que sepan exactamente lo que se\nespera que aprendan. Una vez que selecciono el objetivo de aprendizaje, solo tengo que informarle a Khanmigo\nel nivel de grado, esto es para mi clase de décimo grado. Y cuál es el tema, esto\nes para mi clase de joyería. Y en cuestión de segundos, Khanmigo crea el objetivo de aprendizaje que puedo utilizar para dirigir mi lección. Si hay algo que quiero cambiar sobre el objetivo de aprendizaje, todo lo que tengo que hacer es hacer clic en él y puedo informarle a Khanmigo\nsi quiero realizar cambios. Si quiero probar algo diferente\no si quiero discutirlo. Creo que voy a hacer cambios en esto porque me gustaría que\nfuera una declaración de Puedo, y tan rápido como pude escribirla, Khanmigo la cambió a una\ndeclaración de Puedo. Gracias, Khanmigo. La siguiente característica que me gustaría explorar es la función de gancho de lección,\nporque seamos realistas, no se trata sólo de enseñar, sino de crear\nexperiencias memorables y atractivas que mejoren la comprensión y la retención. Tan pronto como selecciono la\nfunción de enlace de lección, Khanmigo quiere saber el nivel de grado. Esto es para mi clase de noveno grado. Y el tema de la lección, esto\nes para mi clase de fotografía. Y luego solo tengo que\ninformarle a Khanmigo el contexto de los ganchos de lección que me\ngustaría que creara. Los estudiantes demuestran una comprensión del proceso de exposición. Muy bien, Khanmigo, escríbeme algunas lecciones geniales, por favor. Y en cuestión de segundos, Khanmigo crea tres\nfantásticos ganchos para lecciones que entusiasmarán a mis alumnos\ncon la fotografía. Gracias, Khanmigo. Ahora que se ha despertado la curiosidad de mis alumnos\n, Khanmigo puede ayudarme a elaborar planes de lecciones atractivos utilizando la función de plan de lecciones. Puedo seleccionar temas de una de las ricas ofertas de cursos de Khanmigo, o puedo seleccionar mi propio tema,\nque es lo que planeo hacer. Solo tengo que\ninformarle a Khanmigo el estándar o el objetivo de aprendizaje. Los estudiantes demuestran una comprensión del proceso de exposición. Y esto es para mi\nclase de fotografía de noveno grado. Khanmigo generará un\nplan de lección detallado para mí, que incluye los objetivos,\nmateriales, evaluaciones, actividades y mucho, mucho más. Además, el plan de lección es\ncompletamente personalizable, por lo que estoy a cargo y sé que haré lo\nmejor para mis alumnos. No creo que a mis\nalumnos les vaya bien con esta actividad de boleto de salida 3, 2, 1. Todo lo que tengo que hacer es hacer clic en él y luego pedirle a Khanmigo que\npruebe algo diferente. Una vez que mi plan de lección esté completo, puedo imprimirlo o exportarlo. Y cuando lo exporto, puedo\nexportarlo a un documento de Word, un PDF o Google Drive. Esto fue muy fácil.\nMuchas gracias Khanmigo. La siguiente característica que voy a explorar es la característica de texto informativo. Esta función creará un\npasaje de texto informativo para el nivel de grado que desee, desde el primer grado\nhasta el nivel universitario. Una vez que ingrese el nivel de grado deseado y el tema de su elección, solo tiene que seleccionar\nla longitud del pasaje que desea crear. Y ya sea que seleccione 100\npalabras, 300 palabras o 750 palabras, Khanmigo hará el resto.  Voy a ir con 300 palabras. Fantástico. Esta también es una característica excelente para integrar contenido transversal del plan de estudios porque proporciona a\nlos estudiantes múltiples formas de interactuar con el material. Muy bien, voy a\nseguir adelante y exportar esto. Voy a guardar esto en mi Google Drive. Mmmm, tras reflexionar más a fondo, creo que este texto puede\nresultar un poco difícil para algunos de mis lectores con dificultades. No te preocupes, puedo usar el nivelador de Khanmigo. Oh, esa es una gran idea. Como educador, entiendo\nel valor de exponer a los estudiantes a textos y vocabulario de nivel de grado. Sin embargo, es crucial equilibrar esto con\nla comprensión. La función de nivelación\najusta la complejidad del texto para que coincida con las habilidades de los estudiantes, lo que garantiza la comprensión mientras interactúa con el material del nivel de grado y personaliza la instrucción\nsegún las necesidades de cada estudiante. Todo lo que tengo que hacer es hacer clic en el nivelador. Una vez que le informo a Khanmigo\nel título del texto, simplemente copio y pego el texto original en el espacio provisto\ny luego le informo a Khanmigo el grado al que me gustaría nivelarlo. Tengo algunos estudiantes que están en un nivel de lectura de sexto grado, así que seleccionaré eso. Y Khanmigo reescribirá\nel texto para mis alumnos que están en el nivel de lectura de sexto grado. Eso fue tan fácil. Ahora puedo asegurarme\nde que todos mis alumnos obtengan la misma información, independientemente del\nnivel de grado en el que lean. Como educador, mi objetivo es crear\ntemas de debate que inviten a la reflexión y que se adapten a\ntemas específicos para mis alumnos. Mi objetivo es despertar su curiosidad y estimular el discurso intelectual, por eso voy a utilizar la\nfunción de inicio de discusión. Sólo tengo que informarle a Khanmigo el nivel de grado y el tema. Esto es para mi\nclase de agricultura de décimo grado y actualmente estamos examinando el papel de la industria agrícola\ny el medio ambiente. Y en cuestión de segundos, Khanmigo crea múltiples preguntas de discusión detalladas y estimulantes\nque seguramente harán que mis alumnos conversen de buena manera. La función de evaluación de opción múltiple\nde Khanmigo es el sueño de todo profesor hecho realidad. Es una herramienta innovadora que transforma la evaluación de sus estudiantes en un proceso atractivo e interactivo. Podría ser su arma secreta para evaluar la comprensión de los estudiantes, identificar brechas y guiar la instrucción. Con un solo clic en el botón, le \ninforma a Khanmigo su nivel de grado. Esto es para mi clase de español de décimo grado.  ¿ Cuántas preguntas\nte gustaría incluir? Quiero 10. Y luego el tema. Actualmente estamos trabajando\nen tipos de ropa. Y en cuestión de\nsegundos, Khanmigo crea un cuestionario detallado de opción múltiple de 10 preguntas\n que incluye la clave de respuestas. Muchas gracias Khanmigo.\nEso me ahorró mucho tiempo. Imagine una herramienta que\ndé vida al aprendizaje directamente en su salón de clases.  El generador de contexto del mundo real de Khanmigo\nhace precisamente eso. Transforma conceptos abstractos\nen escenarios identificables, haciendo que el aprendizaje sea divertido y identificable. Sólo tengo que informarle a Khanmigo el nivel de grado y el tema. Esto es para mi\nclase de lectura intensiva de sexto grado que actualmente está trabajando\nen hacer inferencias. Khanmigo, por favor\nescríbeme algunas ideas geniales. Y, nuevamente, en cuestión de segundos, Khanmigo crea tres\nideas únicas y atractivas que puedo compartir con mis alumnos, mejorando su comprensión\ne interés en este tema. Gracias Khanmigo. Si está buscando una\nforma divertida y atractiva de que sus alumnos aprendan, debe probar nuestra divertida función de poema resumido de clase. Es una forma rítmica única de resumir las lecciones para sus alumnos. Hagamos un intento. Cuando selecciono el\nbotón, Khanmigo quiere que les pregunte a mis alumnos qué\naprendieron hoy. Hoy, en mi clase de guitarra,\nnos centramos en las técnicas básicas de rasgueo y punteo. Entonces Khanmigo quiere que les pida a mis alumnos una palabra divertida: verano. Eso es lo que tengo en mente ahora mismo y Khanmigo hará el resto. Y aquí está nuestro poema. En pleno verano, rasgueamos y punteamos. En nuestras guitarras estamos de suerte. Con los dedos bailando, creando una melodía bajo el brillante y cálido junio. Rasgueando alto, punteando bajo, en el calor del verano, nuestras habilidades crecen. Como puedes ver, no es sólo\nun poema, es un refuerzo de la memoria, un potenciador de la creatividad y\nuna herramienta de aprendizaje genial. Muchas gracias Khanmigo. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo Khanmigo puede ayudarlo a usted y a sus\nalumnos en el aula, siga los enlaces en su pantalla. Y para no perderse nunca anuncios interesantes sobre nuevos materiales de cursos gratuitos\nen Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- مرحبًا، أنا ميشيل، أخصائية تعلم احترافية\nهنا في أكاديمية خان، ومعلمة سابقة في الفصل الدراسي\n، مثلك تمامًا. تعرف على Khanmigo، رفيقك الذي يعتمد على الذكاء الاصطناعي\nوالذي أحدث ثورة في التدريس من أجل تجربة أكثر جاذبية\nوكفاءة. يحتوي Khanmigo على العديد من\nالميزات المثيرة التي تدعم المعلمين، وسيعرض هذا الفيديو\nالطرق التي يمكنك من خلالها استخدام Khanmigo لإنشاء محتوى محدد للدورة التدريبية لتعزيز تجربة التعلم لجميع الطلاب في\nالفصول الدراسية التي تقوم بتدريسها. هذه هي لوحة تحكم Khanmigo، المليئة بالعديد من\nالميزات الفريدة لتوفير الوقت، وكلها مصممة للارتقاء\nبتجربة التدريس الخاصة بك. لنبدأ\nبميزة الهدف التعليمي. لأنه على الرغم من أنني أعرف\nما أريد تدريسه، إلا أنني لا أزال بحاجة إلى تطوير هدف تعليمي واضح وقابل للقياس لتوجيه عملية التدريس.  يمكن أن يساعد استخدام ميزة الهدف التعليمي\nمع Khanmigo في توضيح أهدافي مما يجعل تخطيط الدرس أكثر كفاءة.  كما أنه يساعد أيضًا في فهم الطلاب،\n حتى يعرفوا بالضبط ما هو\nمتوقع منهم أن يتعلموه. بمجرد أن أحدد هدف التعلم، يجب علي فقط أن أخبر خانميغو\nبمستوى الصف، وهذا خاص بفصل الصف العاشر. وما هو الموضوع، هذا\nمخصص لصف المجوهرات الخاص بي. وفي غضون ثوانٍ، ينشئ خانميغو الهدف التعليمي الذي يمكنني استخدامه لقيادة الدرس. إذا كان هناك شيء أريد تغييره فيما يتعلق بالهدف التعليمي، فكل ما علي فعله هو النقر عليه ويمكنني السماح لـ Khanmigo بمعرفة ما\nإذا كنت أريد إجراء تغييرات عليه. إذا كنت أريد تجربة شيء مختلف\nأو إذا كنت أريد مناقشته. أعتقد أنني سأقوم بإجراء تغييرات على هذا لأنني أرغب في أن\nتكون هذه عبارة \"أستطيع\"، وبنفس السرعة التي تمكنت من كتابتها، قام خانميغو بتغييرها إلى\nعبارة \"أستطيع\" نيابةً عني. شكرا خانميجو. الميزة التالية التي أود استكشافها هي ميزة ربط الدروس،\nلأننا لنواجه الأمر، لا يتعلق الأمر بالتدريس فحسب، بل يتعلق بإنشاء تجارب لا تُنسى\nوجذابة تعزز الفهم والاحتفاظ. بمجرد تحديد\nميزة ربط الدرس، يريد خانميغو معرفة مستوى الصف. هذا بالنسبة لصفي التاسع وموضوع الدرس هذا\nخاص بفصل التصوير الفوتوغرافي. وبعد ذلك يجب علي فقط أن أسمح لـ\nKhanmigo بمعرفة سياق خطافات الدرس التي\nأرغب في إنشائها. يُظهر الطلاب فهمًا لعملية التعرض. حسنًا يا خانميجو، اكتب لي بعض الدروس الرائعة من فضلك. وفي غضون ثوانٍ، أنشأ خانميغو ثلاثة\nدروس رائعة ستثير\nحماسة طلابي بشأن التصوير الفوتوغرافي. شكرا خانميجو. الآن بعد أن\nأثار فضول طلابي، يمكن لـ Khanmigo مساعدتي في صياغة خطط دروس مقنعة من خلال الاستفادة من ميزة خطة الدرس. يمكنني اختيار موضوعات من أحد عروض دورات Khanmigo الغنية، أو يمكنني اختيار الموضوع الخاص بي،\nوهو ما أخطط للقيام به. عليّ فقط أن أخبر\nخانميغو بالمعيار أو الهدف التعليمي. يُظهر الطلاب فهمًا لعملية التعرض. وهذا لفصل\nالتصوير الفوتوغرافي للصف التاسع. سيقوم خانميغو بإنشاء\nخطة درس مفصلة بالنسبة لي، والتي تتضمن الأهداف والمواد\nوالتقييمات والأنشطة وغير ذلك الكثير. بالإضافة إلى ذلك، فإن خطة الدرس\nقابلة للتخصيص بالكامل، لذا فأنا المسؤول وأعلم أنني سأفعل ما هو\nأفضل لطلابي. لأنني لا أعتقد أن\nطلابي سيحققون نتائج جيدة في نشاط تذكرة الخروج 3، 2، 1. كل ما علي فعله هو النقر عليه ثم مطالبة خانميغو\nبتجربة شيء مختلف. بمجرد اكتمال خطة الدرس، يمكنني طباعتها أو تصديرها. وعندما أقوم بتصديره، يمكنني\nتصديره إلى مستند Word أو PDF أو Google Drive. كان هذا سهلا جدا.  شكرا\nجزيلا، خانميجو. الميزة التالية التي سأستكشفها هي ميزة النص المعلوماتي. ستنشئ هذه الميزة\nمقطعًا نصيًا إعلاميًا لمستوى الصف الذي تريده، بدءًا من الصف الأول وحتى\nالمستوى الجامعي. بمجرد إدخال مستوى الصف المقصود والموضوع الذي تختاره، عليك فقط تحديد\nطول المقطع الذي ترغب في إنشائه. وسواء قمت بتحديد 100\nكلمة، أو 300 كلمة، أو 750 كلمة، فإن خانميغو سيقوم بالباقي. سأذهب مع 300 كلمة. رائع.  تعد هذه أيضًا ميزة ممتازة لدمج محتوى المناهج الدراسية لأنها توفر\nللطلاب طرقًا متعددة للتفاعل مع المادة. حسنًا،\nسأمضي قدمًا وأقوم بتصدير هذا. سأحفظ هذا في Google Drive الخاص بي. حسنًا، بعد المزيد من التفكير، أعتقد أن هذا النص قد\nيكون صعبًا بعض الشيء بالنسبة لبعض القراء المتعثرين. لا داعي للقلق، يمكنني استخدام أداة تسوية خانميجو. أوه، هذه فكرة عظيمة. كمعلم، أفهم\nقيمة تعريض الطلاب للنصوص والمفردات على مستوى الصف الدراسي. ومع ذلك، فإن تحقيق التوازن بين هذا\nوالفهم أمر بالغ الأهمية.  تعمل ميزة التسوية على\nضبط تعقيد النص ليتناسب مع قدرات الطلاب، مما يضمن الفهم أثناء التعامل مع مواد مستوى الصف الدراسي وتخصيص التعليمات\nوفقًا لاحتياجات كل طالب. كل ما علي فعله هو النقر على أداة التسوية. بمجرد أن أعلم خانميغو\nبعنوان النص، أقوم فقط بنسخ النص الأصلي ولصقه في المساحة المتوفرة\nثم أعلم خانميغو بالدرجة التي أرغب في تسويتها إليها. لدي عدد قليل من الطلاب في مستوى القراءة للصف السادس، لذا سأختار ذلك. وسيقوم خانميغو بإعادة كتابة\nالنص لطلابي الذين هم في مستوى القراءة في الصف السادس. كان ذلك سهلاً للغاية. يمكنني الآن التأكد\nمن حصول جميع طلابي على نفس المعلومات، بغض النظر عن\nمستوى الصف الذي قرأوا فيه. كمعلم، أهدف إلى صياغة\nمناقشات مثيرة للتفكير ومصممة خصيصًا\nلموضوعات محددة لطلابي. هدفي هو إثارة فضولهم وتحفيز الخطاب الفكري، لذلك سأستخدم\nميزة المناقشة الفورية. عليّ فقط أن أخبر خانميغو بمستوى الصف والموضوع. هذا مخصص لفصل\nالزراعة في الصف العاشر، ونحن حاليًا ندرس دور الصناعة الزراعية\nوالبيئة. وفي غضون ثوانٍ، يقوم Khanmigo بإنشاء العديد من أسئلة المناقشة التفصيلية والمثيرة للتفكير\nوالتي من المؤكد أنها ستجعل طلابي يدردشون بطريقة جيدة.  إن ميزة تقييم الاختيارات المتعددة\nمع Khanmigo هي حلم المعلم الذي أصبح حقيقة. إنها أداة مبتكرة تحول تقييم طلابك إلى عملية تفاعلية جذابة. يمكن أن يكون سلاحك السري لتقييم فهم الطلاب وتحديد الفجوات وتوجيه التعليمات. بنقرة واحدة على الزر، ما عليك سوى السماح لـ Khanmigo\nبمعرفة مستوى الصف الخاص بك. هذا لفصل اللغة الإسبانية للصف العاشر. كم عدد الأسئلة التي\nترغب في تضمينها؟ أريد 10. ثم الموضوع. حاليًا، نحن نعمل\nعلى أنواع الملابس. وفي غضون\nثوانٍ، يقوم Khanmigo بإنشاء اختبار تفصيلي مكون من 10 أسئلة\nمتعددة الاختيارات يتضمن مفتاح الإجابة. شكرا جزيلا، خانميجو.  لقد\nوفر لي ذلك الكثير من الوقت. تخيل أداة\nتضفي الحيوية على التعلم في الفصل الدراسي الخاص بك.  يقوم منشئ سياق العالم الحقيقي لـ Khanmigo\nبذلك. إنه يحول المفاهيم المجردة\nإلى سيناريوهات قابلة للربط، مما يجعل التعلم ممتعًا ومترابطًا. عليّ فقط أن أخبر خانميغو بمستوى الصف والموضوع. هذا مخصص\nلفصل القراءة المكثف للصف السادس والذي يعمل حاليًا\nعلى التوصل إلى استنتاجات. خانميغو، من فضلك اكتب\nلي بعض الأفكار العظيمة. ومرة أخرى، في غضون ثوانٍ، أنشأ خانميغو ثلاث\nأفكار فريدة وجذابة يمكنني مشاركتها مع طلابي، مما يعزز فهمهم\nواهتمامهم بهذا الموضوع. شكرا لك، خانميجو. إذا كنت تبحث عن\nطريقة ممتعة وجذابة للتعلم لطلابك، فعليك تجربة ميزة القصائد التلخيصية الممتعة الخاصة بنا. إنها طريقة إيقاعية فريدة لتلخيص الدروس لطلابك. دعنا نعطيها محاولة. عندما أحدد\nالزر، يريد خانميغو أن أسأل طلابي عما\nتعلموه اليوم. اليوم في صف الجيتار الخاص بي،\nنركز على تقنيات العزف والنتف الأساسية. ثم يريد خانميغو مني أن أطلب من طلابي كلمة ممتعة، الصيف. هذا ما يدور في ذهني الآن، وسيقوم خانميغو بالباقي. وهنا قصيدتنا. في حرارة الصيف، نعزف ونقطف. على القيثارات لدينا، نحن محظوظون. مع رقص الأصابع، مما يخلق لحنًا تحت شهر يونيو المشرق والدافئ. بالعزف عاليًا، والنتف منخفضًا، في حرارة الصيف، تنمو مهاراتنا. كما ترون، إنها ليست مجرد\nقصيدة، إنها معززة للذاكرة، ومعززة للإبداع،\nوأداة تعليمية رائعة للغاية. شكرا جزيلا، خانميجو. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد حول كيفية دعم Khanmigo لك\nولطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك. وحتى لا تفوت أبدًا الإعلانات المثيرة حول المواد الدراسية المجانية الجديدة\nفي أكاديمية خان، تأكد من الاشتراك.",
    "t_italian": "- Ciao, sono Michelle, una specialista dell'apprendimento professionale\nqui alla Khan Academy e un'ex\ninsegnante di classe, proprio come te. Incontra Khanmigo, il tuo compagno guidato dall'intelligenza artificiale\nche sta rivoluzionando l'insegnamento per un'esperienza più coinvolgente ed\nefficiente. Khanmigo ha molte\nfunzionalità interessanti che supportano gli insegnanti e questo video mostrerà i\nmodi in cui puoi utilizzare Khanmigo per creare contenuti specifici del corso per migliorare l'esperienza di apprendimento per tutti gli studenti delle\nclassi in cui insegni. Questa è la dashboard di Khanmigo, ricca di una moltitudine di\nfunzionalità uniche per risparmiare tempo, tutte su misura per migliorare\nla tua esperienza di insegnamento. Cominciamo con la\nfunzionalità dell'obiettivo di apprendimento. Perché anche se so\ncosa voglio insegnare, devo comunque sviluppare un obiettivo di apprendimento chiaro e misurabile per guidare il mio insegnamento. Usare la funzione degli obiettivi di apprendimento\ncon Khanmigo può aiutarmi a chiarire i miei obiettivi rendendo la pianificazione delle lezioni più efficiente. Aiuta\nanche la comprensione degli studenti, in modo che sappiano esattamente cosa ci si\naspetta che imparino. Una volta selezionato l'obiettivo di apprendimento, devo solo far\nsapere a Khanmigo il livello della mia classe, questo è per la mia classe di 10a elementare. E qual è l'argomento, questo\nè per il mio corso di gioielleria. E in pochi secondi, Khanmigo crea l'obiettivo di apprendimento che posso utilizzare per condurre la mia lezione. Se c'è qualcosa che voglio cambiare riguardo all'obiettivo di apprendimento, tutto quello che devo fare è cliccarci sopra e posso far sapere a Khanmigo\nse voglio apportare modifiche. Se voglio provare qualcosa di diverso\no se voglio discuterne. Penso che apporterò delle modifiche a questo perché mi piacerebbe che\nfosse un'affermazione \"I can\", e con la stessa rapidità con cui sono riuscito a scriverlo, Khanmigo l'ha cambiato in\nun'affermazione \"I can\" per me. Grazie, Khanmigo. La prossima caratteristica che vorrei esplorare è la funzione di aggancio della lezione,\nperché ammettiamolo, non si tratta solo di insegnare, si tratta di creare\nesperienze memorabili e coinvolgenti che migliorano la comprensione e la memorizzazione. Non appena seleziono la\nfunzione di blocco della lezione, Khanmigo vuole conoscere il livello del voto. Questo è per la mia classe di prima media. E l'argomento della lezione\nè per il mio corso di fotografia. E poi non mi resta che far\nsapere a Khanmigo il contesto dei Lesson Hooks che\nvorrei che creasse. Gli studenti dimostrano di comprendere il processo di esposizione. Va bene, Khanmigo, scrivimi degli ottimi spunti per le lezioni, per favore. E in pochi secondi, Khanmigo crea tre\nfantastici riassunti delle lezioni che faranno appassionare i miei studenti\nalla fotografia. Grazie, Khanmigo. Ora che la curiosità dei miei studenti è\nstata stimolata, Khanmigo può aiutarmi a creare piani di lezione avvincenti utilizzando la funzione piano di lezione. Posso selezionare argomenti da una delle ricche offerte di corsi di Khanmigo oppure posso selezionare il mio argomento,\nche è ciò che intendo fare. Devo solo far\nconoscere a Khanmigo lo standard o l'obiettivo di apprendimento. Gli studenti dimostrano di comprendere il processo di esposizione. E questo è per il mio\ncorso di fotografia di prima media. Khanmigo genererà\nper me un piano di lezione dettagliato, che include obiettivi,\nmateriali, valutazioni, attività e molto, molto altro. Inoltre, il programma delle lezioni è\ncompletamente personalizzabile, quindi sono io il responsabile e so che farò ciò che è\nmeglio per i miei studenti. Ad esempio, non penso che i miei\nstudenti se la caveranno bene con questa attività con biglietto di uscita 3, 2, 1. Tutto quello che devo fare è cliccarci sopra e poi chiedere a Khanmigo di\nprovare qualcosa di diverso. Una volta completato il programma della lezione, posso stamparlo o esportarlo. E quando lo esporto, posso\nesportarlo in un documento Word, PDF o Google Drive.  È stato così facile.  Grazie\nmille, Khanmigo. La prossima caratteristica che esplorerò è la funzione di testo informativo. Questa funzione creerà un\npassaggio di testo informativo per il livello scolastico desiderato, dalla prima elementare\nfino al livello collegiale. Una volta inserito il livello di voto desiderato e l'argomento di tua scelta, devi solo selezionare\nla lunghezza del passaggio che desideri creare. E se selezioni 100\nparole, 300 parole o 750 parole, Khanmigo farà il resto. Vado con 300 parole. Fantastico. Questa è anche una funzionalità eccellente per l'integrazione di contenuti interdisciplinari perché offre agli\nstudenti diversi modi per interagire con il materiale. Va bene,\nandrò avanti ed esporterò questo. Lo salverò sul mio Google Drive. Hm, dopo un'ulteriore riflessione, penso che questo testo potrebbe\nessere un po' difficile per alcuni dei miei lettori in difficoltà. Non preoccuparti, posso usare il livellatore di Khanmigo. Oh, è un'ottima idea. Come educatore, capisco\nil valore di esporre gli studenti al testo e al vocabolario di livello scolastico. Tuttavia, bilanciare questo con\nla comprensione è cruciale. La funzione di livellamento\nregola la complessità del testo in base alle capacità degli studenti, garantendo la comprensione mentre si interagisce con il materiale di livello scolastico e personalizza l'istruzione in base\nalle esigenze di ogni studente. Tutto quello che devo fare è cliccare sul livellatore. Una volta che ho comunicato a Khanmigo\nil titolo del testo, copio e incollo semplicemente il testo originale nello spazio fornito\ne poi faccio sapere a Khanmigo il voto a cui vorrei che fosse livellato. Ho alcuni studenti che hanno un livello di lettura di prima media, quindi selezionerò quello. E Khanmigo riscriverà\nil testo per i miei studenti che hanno un livello di lettura di prima media.  È stato così facile. Ora posso assicurarmi\nche tutti i miei studenti ricevano le stesse informazioni, indipendentemente dal\nlivello scolastico in cui leggono. Come educatore, il mio obiettivo è creare\nspunti di discussione stimolanti su misura per\nargomenti specifici per i miei studenti.  Il mio obiettivo è accendere la loro curiosità e stimolare il discorso intellettuale, quindi utilizzerò la\nfunzione di suggerimento della discussione. Devo solo far sapere a Khanmigo il livello della scuola e l'argomento. Questo è per il mio corso di agricoltura del decimo anno\n e attualmente stiamo esaminando il ruolo del settore agricolo\ne dell'ambiente. E in pochi secondi, Khanmigo crea molteplici domande di discussione dettagliate e stimolanti\nche sicuramente faranno chiacchierare i miei studenti in modo positivo. La funzionalità di valutazione a scelta multipla\ndi Khanmigo è il sogno di ogni insegnante che diventa realtà. È uno strumento innovativo che trasforma la valutazione dei tuoi studenti in un processo coinvolgente e interattivo. Potrebbe essere la tua arma segreta per valutare la comprensione degli studenti, identificare le lacune e guidare l'istruzione. Con un semplice clic del pulsante, fai\nsapere a Khanmigo il tuo livello di voto. Questo è per la mia lezione di spagnolo di decima elementare. Quante domande\ndesideri includere?  Ne voglio 10. E poi l'argomento. Attualmente stiamo lavorando\nsui tipi di abbigliamento. E in pochi\nsecondi, Khanmigo crea un quiz dettagliato a scelta multipla di 10 domande\n che include la chiave di risposta. Grazie mille, Khanmigo.\nQuesto mi ha fatto risparmiare così tanto tempo. Immagina uno strumento che\ndia vita all'apprendimento direttamente nella tua classe.  Il generatore di contesto del mondo reale di Khanmigo\nfa proprio questo. Trasforma concetti astratti\nin scenari riconoscibili, rendendo l'apprendimento divertente e riconoscibile. Devo solo far sapere a Khanmigo il livello della scuola e l'argomento. Questo è per il mio\ncorso di lettura intensivo di prima media che attualmente sta lavorando\nper fare inferenze. Khanmigo, per favore\nscrivimi delle idee fantastiche. E, ancora una volta, in pochi secondi, Khanmigo crea tre\nidee uniche e coinvolgenti che posso condividere con i miei studenti, migliorando la loro comprensione\ne interesse per questo argomento. Grazie, Khanmigo. Se stai cercando un\nmodo divertente e coinvolgente di apprendere per i tuoi studenti, devi provare la nostra divertente funzione di poesia di riepilogo della lezione. È un modo ritmico unico per riassumere le lezioni per i tuoi studenti. Proviamolo. Quando seleziono il\npulsante, Khanmigo vuole che chieda ai miei studenti cosa\nhanno imparato oggi. Oggi nel mio corso di chitarra\nci concentreremo sulle tecniche di strimpellatura e pizzicatura di base. Poi Khanmigo vuole che chieda ai miei studenti una parola divertente, estate. Questo è ciò che ho in mente in questo momento, e Khanmigo farà il resto. Ed ecco la nostra poesia. Nella calura estiva, strimpelliamo e pizzichiamo. Con le nostre chitarre siamo fortunati. Con le dita che danzano, creando una melodia sotto il luminoso e caldo giugno. Suonando in alto, pizzicando in basso, nella calura estiva, le nostre abilità crescono. Come puoi vedere, non è solo\nuna poesia, è un potenziamento della memoria, un potenziamento della creatività e\nuno strumento di apprendimento fantastico. Grazie mille, Khanmigo. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come Khanmigo può supportare te e i tuoi\nstudenti in classe, segui i collegamenti sullo schermo. E per non perdere mai gli entusiasmanti annunci sui nuovi materiali dei corsi gratuiti\nsu Khan Academy, assicurati di iscriverti."
}