{
    "source": "N0lBsW3ZzN8",
    "youtubelink": "https://www.youtube.com/watch?v=N0lBsW3ZzN8",
    "t_english": "- [Instructor] We can look at stars or nebulae, or even planets which are very, very far away, and estimate what composes them, what are the elements that are there inside of them? But how do we do that? How can we sit here on Earth, and figure out what elements are present inside, say, the atmosphere of an exoplanet? We do that by using the atomic spectra and spectral analysis. But what exactly are these things? Well, let's find out. Let's start by looking at the model of an atom, and we're gonna look at the simplest one, the hydrogen atom. Inside the hydrogen atom, we know there is one proton and one electron. And in most popular depictions, we show the electron circling around the proton, right? But that's not the right model, because electrons are not tiny balls of matter that go around like this, like the planets. Instead, they're quantum objects that have both particle and wave properties. And one of the wave properties is that waves are spread out, they're not at one particular location, but they're spread out, which means electrons are also spread out. We call that as an electron cloud. And these electron clouds can have different shapes. For example, if you consider the hydrogen at its lowest energy level, then the shape of the electron happens to look somewhat like this. It's kind of like a sphere. And it's not that the electron is orbiting over here. No, no, no, this cloud that I've drawn over here itself represents the electron. Now here's the main question for us. What happens to this atom if we supply it some energy? When you supply some energy, the electron absorbs the energy. And the question is, what happens to it? Well, if there is enough energy, then the electron can absorb it and just escape the atom. In that case, the electron just escapes it, and you just are left with a single proton over here. Okay, but what if you don't give it that much energy? What if you give it a little bit of energy, not enough energy to escape it, but just a little bit of energy. Then what happens? Ooh, now some interesting things can happen. And to understand that, let's take an analogy over here. My favorite analogy is thinking about a well in which you have a ball over here. This ball is analogous to the electron over here, just like how this ball is sitting inside a well. And if we want that ball to escape that well, we have to supply energy to it, enough energy. In a similar way, this electron is also sit, this electron cloud is also sitting inside a well. The difference is here you have a physical well that is caused due to gravity. Here, it's a different kind of well, it's a well that is caused due to electric forces. We call this as a potential well, in general, but the idea is the same. To escape that well, we have to supply it enough energy. And now the big question was what if you don't supply that much energy? What if you supply a little bit of energy? Then what's going to happen? Well, we might think nothing's going to happen. If I supplied a little bit of energy, well, it's gonna come back down, right? Well, it turns out that the potential well over here is not like this. Instead, the potential well can be thought of to look somewhat like this. What we see is that there are different levels at which the ball can be sitting. Right now, it is at its lowest level, which we'll number as one. Now if we supply it this much energy, the ball can actually go and sit at two. That's possible, there's another energy level at which the ball can sit. If you supplied even more energy, the ball can sit at a slightly higher energy level, and so on and so forth. Guess what, the same is the case with our electrons. Right now, this electron is at its lowest level, but there are other higher levels that can occupy. If supply just enough energy, it can jump to higher levels. And when it does that, the electron cloud will change its shape. Let me just give you an example of that. So if we supply just enough energy so that the electron can jump to, let's say, the next level like this, then the shape of the electron will change. The new shape would look somewhat like this. This is at energy level two, the next available energy level. And you can kind of see just like how the ball is now farther away from the earth, from the ground, because it has higher energy, similarly, you can kind of see that the electron cloud is sort of bigger because it has more energy, right? But turns out, and unlike what we see over here, there are other shapes that the electrons can take at this new energy level. For example, another shape that the electron cloud can take looks somewhat like this. It's pretty cool, right? Don't worry too much about how we get this shape and all of that, it just happens to be true that there are multiple shapes at which it can take, but what's important is that right now, this electron is at a higher energy level, the second energy level that's available. And if I supply even more energy, again, just enough energy to get to the next level, well, the shape will again change, it'll become even bigger. And at this level, it can have even more shifts. It's pretty cool. But this is the model that we have today. This is the quantum mechanical model of atoms. And just to give some technical names over here, these different shapes that we talked about, we call them the orbitals. Notice, it's not an orbit. It's not that electron is orbiting, this whole cloud itself represents an electron, and we call that the orbitals. And these energy levels, well, we give a name to them as well. We call that the principal quantum number. A fancy name, but all it's telling us is at what energy level these orbitals are, right? All the orbitals at a particular quantum number will always have the same energy level, okay? And of course, if you're wondering how do we supply that energy? Well, there are multiple ways to do that. By collision, by heating the atoms, or even by radiating some light on it, there are multiple ways in which we can supply the energy. It's just that if you supply the right amount of energy, electrons can jump to higher energy levels. But for our purposes, the shapes, the orbitals are not really important. What's important are these different energy levels, and understanding what happens when electrons jump from one to another, right? So for that, let's just get rid of the shapes, and use circles to represent the different energy levels. So again, what I've drawn over here, look, this represents the first energy level that's available for the electron. Doesn't mean that the electrons orbiting over here, okay? Then you have the second energy level, just like what we saw in the orbital, the second energy level is bigger. The third energy level is even bigger, it's even farther away, and so on and so forth. And again, these are the principal quantum numbers, which represents the energy levels. But how many such energy levels do we have? That's a good question. Well, it turns out that I have only drawn four, but it turns out that there are infinite energy levels that you can have. You can kind of imagine putting infinite amount of steps over here. And then you can do that. If you keep on decreasing the step size, you can sort of like, you can imagine that you can keep on squeezing out lots, and lots, and lots, and lots of steps. That's basically how the energy levels are. And we can show this using a diagram, an energy level diagram, which kind of looks like this. So look, this is the first energy level, second energy level, third energy level, fourth energy level, fifth, sixth, seventh, eight, ninth. And eventually you have the infinite energy level. Now it doesn't mean it takes infinite energy to go over here. No, no, no, look, look, it takes a finite amount of energy to go from here to here, but I have put infinite steps in between by reducing the step size. In a similar way, you can think that there are infinite levels that we can put from here to here. You can kind of imagine when you're very far away from the proton, you are pretty much at the infinite energy level. So you don't need infinite energy to actually go over here, okay? Anyways, now comes the question what happens when electrons jump to a higher energy level? Well, first of all, we call this the ground state, and we call these other higher energy levels the excited state. So let's say we heat up an atom, and the electron jumps from the ground state to the third level, the excited state over here, okay? What happens to it? It turns out electrons cannot stay in the excited state for long because they're very unstable. And so they will immediately try to jump back to any lower available energy level. So it's possible that can jump directly from three to one, or it is possible that it can jump from three to two, and then two to one. Anything is possible, okay? And when it does so, when it jumps from a higher level to lower level, electron has lost some energy. Where does the energy go? Energy must go somewhere, energy conservation. That energy goes out as a photon of light. So for example, if the electron jumps from level three to level two, it releases a photon of light, and that photon will have the same energy as the difference between these two energies. Now it turns out for hydrogen, if you actually do the calculation, the difference between the energy levels for level three and level two, that energy corresponds to red color of light. You can remember that the energy of a photon is correlated with its frequency or its wavelength. More the energy of the photon, more is its frequency, or shorter is the wavelength. For this particular energy difference, the wavelength or the frequency happens to be in the red color. Similarly, what would happen if the electron jumped from four to two? Well, you can kind of imagine, four to two is a bigger jump, which means more energy lost, so the energy of the photon will be higher. The frequency therefore would be higher than the red color. It turns out it'll lie somewhere in the blue color. And if the jump is from five to two, and six to two, it'll be even more towards, you know, violet, indigo. And then from seven to two and so on, it becomes ultraviolet, we'll not be able to see it. Okay, what about other jumps? For example, you have, say, jump from two to one. Well, it turns out that this energy jump is so big, and I've probably not drawn it accurately, but it turns out to be so big that even that lies in the ultraviolet region, which we'll not be able to see it. In fact, except for these four for hydrogen, except for these four jumps, all the other jumps will either be in the ultraviolet region, too high frequency for us to see, or it'll be too small, too low frequency, like the energy difference over here, like four to three, or five to four, or six to three. They'll be so small that it'll be, again, the frequency will be too low for us to see. So when it comes to hydrogen, it's only these four jumps that are visible to us. That means these are the only four colors that hydrogen light will emit in the visible region. So this means if you were to take a hydrogen gas and then hit it up, that because there are so many atoms, there'll be so many electron transitions continuously happening, almost all the possible jumps that you can think of will happen, and therefore light will come out, and the hydrogen gas will glow. But in the visible section, the light will only be composed of these four specific wavelengths. So we will see a light that is a combination of these four wavelengths. And if we then use, say, a prism, or something like a diffraction grating, which can separate those particular wavelengths, then you can see these four individual wavelengths separately, and it will look somewhat like this. And we will call this the atomic spectrum, or the hydrogen spectrum. And what's cool about the atomic spectrum is that every element will have its own energy level. That means every element will give out very specific colors of light, very specific wavelengths of light. So these wavelengths are specific to hydrogen. Helium, for example, will give very different wavelengths of light. Let show you what helium looks like. It looks like this. These wavelengths of light are the characteristic of helium. So this means an atomic spectrum is like a signature of that element. So tomorrow, if we have an unknown gas, and we want to figure out what's made of, we'll just heat it up and look at its spectrum. And if that spectrum looks like this, then what we can do is we can say that, and we can look at these lines and we can say, hey, hey, look, look, these are the element, these are the lines that only come from hydrogen. So there must be hydrogen from it. And then we can look at these wavelengths and say, hey, these wavelengths only come from helium. No other elements will give me these lines, so there must also be helium in it, and so on and so forth. And by looking at the brightness, we can also figure out which one is more abundant. So for example, over here you can see the hydrogen lines are brighter, so we can say there's more hydrogen compared to helium. This is called spectral analysis. And by the way, this kind of spectrum is called an emission spectrum, because it's the spectrum that we get, because those specific colors are emitted by the atoms. But you may be wondering, well, is there any other kind of spectrum? Yes, if you were to look at the spectrum that you get from, say, the Sun, you'll not see this. Instead, what you'll find is you'll see continuous color, and some of the lines will be absorbed. In fact, those specific lines that we just draw over here in the emission spectrum, those lines will be actually absorbed. And there'll be other elements in that spectrum, and therefore there'll be other lines as well. But the lines will seem absorbed, some colors will be absorbed. And that we call as an absorption spectrum. That's what we'll get if you look at, say, the spectrum of the Sun. But why do we get that? Why are we getting something like this? Well, let's see. When you're looking at the Sun, for example, the Sun's core is extremely hot, very hot. And such hot, dense objects, they tend to give out white light. All the colors, they don't do this, they give out just white light, okay? So if you were to just see that particular light through the prism, then we should expect just all the colors of the rainbow, right? However, the outer layer is much cooler, therefore the atoms over here will absorb light over here. Now if there's hydrogen, for example, which colors of light, which wavelengths of light will it absorb? He'll only absorb those wavelengths of light whose photons have just enough energy to give them these transitions, which means in the visible section, they will absorb these specific colors of light. And similarly, if there's helium and carbon, all of them, again, they will absorb their characteristic, you know, colors. And that's why those specific colors will be missing, and that's why we will see dark lines over here. But wait a second. Once they absorb them, shouldn't they also again release them? Yes, they do release those colors, but when you're looking over here, those colors will be absorbed from the outer layer, and then they'll be released in all the other direction. They will be emitted back in the other directions, but they'll be emitted in all the other directions. So mostly in this direction, those colors will be missing, and that's why you get the absorption spectrum. But the analysis is the same. By looking at which colors are absorbed, which particular wavelengths are absorbed, you can identify which elements are present, say, in the outer atmosphere over here. This is how we figure out the elements present inside the atmosphere of different exoplanets for example. So whether you get an absorption spectrum or an emission spectrum really actually depends upon your waving angle. But regardless, the analysis stays the same, okay? Now here's a cool summary that I found on the web telescopes page over here, okay? The summary of everything we saw, the light that we get directly from the hot sources would be continuous spectrum. If there are things that are relatively cooler, gases like say nebulae, or the outer layers, then they will absorb, and what you'll now see is the absorption spectrum. But if you're waving angle is such that you directly see the light coming from those gases that absorb the light, then you'll be able to see the emission spectrum.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] ہم\nستاروں یا نیبولا، یا یہاں تک کہ سیاروں کو دیکھ سکتے ہیں جو\nبہت، بہت دور ہیں، اور اندازہ لگا سکتے ہیں کہ ان کی تشکیل کیا ہے، \nان کے اندر کون سے عناصر موجود ہیں؟ لیکن ہم ایسا کیسے کریں؟ ہم یہاں زمین پر کیسے بیٹھ سکتے ہیں، اور یہ معلوم کر سکتے ہیں کہ\n ایک سیارہ کے ماحول کے اندر کون سے عناصر موجود ہیں؟ ہم ایسا کرتے ہیں جوہری سپیکٹرا اور سپیکٹرل تجزیہ کا استعمال کرتے ہوئے. لیکن یہ چیزیں بالکل کیا ہیں؟ اچھا، آئیے معلوم کرتے ہیں۔ آئیے\nایک ایٹم کے ماڈل کو دیکھ کر شروع کریں، اور ہم سب سے\nآسان، ہائیڈروجن ایٹم کو دیکھیں گے۔ ہائیڈروجن ایٹم کے اندر، ہم جانتے ہیں کہ ایک\nپروٹون اور ایک الیکٹران ہے۔ اور سب سے زیادہ مشہور تصویروں میں، ہم الیکٹران کو پروٹون کے گرد چکر لگاتے دکھاتے ہیں،\nٹھیک ہے؟ لیکن یہ صحیح ماڈل نہیں ہے، کیونکہ الیکٹران\nمادے کی چھوٹی گیندیں نہیں ہیں جو\nسیاروں کی طرح اس طرح گھومتی ہیں۔  اس کے بجائے، وہ کوانٹم اشیاء ہیں جن میں ذرہ\nاور لہر دونوں خصوصیات ہیں۔ اور لہر کی خصوصیات میں سے ایک یہ\nہے کہ لہریں پھیلی ہوئی ہیں، وہ کسی خاص مقام پر نہیں ہیں، بلکہ وہ پھیلی ہوئی ہیں، جس کا مطلب ہے کہ الیکٹران بھی پھیلے ہوئے ہیں۔ ہم اسے الیکٹران کلاؤڈ کہتے ہیں۔ اور یہ الیکٹران بادلوں کی\nمختلف شکلیں ہو سکتی ہیں۔ مثال کے طور پر، اگر آپ ہائیڈروجن کو اس کی سب سے کم توانائی کی سطح پر دیکھتے ہیں، تو الیکٹران کی شکل کچھ اس طرح نظر آتی ہے۔ یہ ایک دائرے کی طرح ہے۔ اور ایسا نہیں ہے کہ الیکٹران\nیہاں گردش کر رہا ہے۔ نہیں، نہیں، نہیں، یہ بادل\nجسے میں نے یہاں کھینچا ہے خود الیکٹران کی نمائندگی کرتا ہے۔ اب یہاں ہمارے لیے بنیادی سوال ہے۔ \nاگر ہم اسے کچھ توانائی فراہم کریں تو اس ایٹم کا کیا ہوگا؟ جب آپ کچھ توانائی فراہم کرتے ہیں، تو الیکٹران توانائی کو جذب کرتا ہے۔ اور سوال یہ ہے کہ اس سے کیا ہوتا ہے؟ ٹھیک ہے، اگر کافی توانائی ہے، تو الیکٹران اسے جذب کر سکتا ہے\nاور صرف ایٹم سے بچ سکتا ہے۔ اس صورت میں،\nالیکٹران صرف اس سے بچ جاتا ہے، اور آپ کے پاس صرف\nایک پروٹون رہ جاتا ہے۔ ٹھیک ہے، لیکن اگر آپ\nاسے اتنی توانائی نہیں دیتے تو کیا ہوگا؟ کیا ہوگا اگر آپ اسے\nتھوڑی سی توانائی دیں، اس سے بچنے کے لیے کافی توانائی نہیں، بلکہ تھوڑی سی توانائی۔ پھر کیا ہوتا ہے؟ اوہ، اب کچھ دلچسپ\nچیزیں ہو سکتی ہیں۔ اور اسے سمجھنے کے لیے، آئیے\nیہاں ایک تشبیہ لیتے ہیں۔ میری پسندیدہ مشابہت\nایک کنویں کے بارے میں سوچ رہی ہے جس میں آپ کے پاس ایک گیند ہے۔ یہ گیند یہاں کے الیکٹران کے مشابہ ہے،\n بالکل اسی طرح جیسے یہ گیند کنویں کے\nاندر بیٹھی ہے۔ اور اگر ہم چاہتے ہیں کہ وہ گیند اچھی\nطرح سے بچ جائے، تو ہمیں اسے توانائی فراہم کرنی ہوگی،\nکافی توانائی۔ اسی طرح یہ\nالیکٹران بھی بیٹھا ہے، یہ الیکٹران بادل\nبھی کنویں کے اندر بیٹھا ہے۔ فرق یہ ہے کہ\nآپ کے پاس ایک جسمانی کنواں ہے جو کشش ثقل کی وجہ سے ہوتا ہے۔ یہاں، یہ ایک مختلف قسم کا کنواں ہے، یہ ایک کنواں ہے جو\nبرقی قوتوں کی وجہ سے ہوتا ہے۔ ہم اسے\nعام طور پر ایک ممکنہ کنواں کہتے ہیں، لیکن خیال ایک ہی ہے۔  اس سے بچنے کے لیے، ہمیں\nاسے کافی توانائی فراہم کرنی ہوگی۔ اور اب بڑا سوال یہ تھا کہ اگر آپ اتنی توانائی فراہم نہیں کرتے تو کیا ہوگا؟ اگر آپ تھوڑی سی توانائی فراہم کرتے ہیں تو کیا ہوگا؟ پھر کیا ہونے والا ہے؟ ٹھیک ہے، ہم سوچ سکتے ہیں کہ کچھ\nنہیں ہونے والا ہے۔ اگر میں نے تھوڑی سی توانائی فراہم کی تو ٹھیک ہے، یہ واپس آ جائے گا، ٹھیک ہے؟ ٹھیک ہے، یہ پتہ چلتا ہے کہ\nیہاں ممکنہ کنواں ایسا نہیں ہے۔  اس کے بجائے، ممکنہ\nکنواں کچھ اس طرح نظر آنے کے بارے میں سوچا جا سکتا ہے۔ ہم جو دیکھتے ہیں وہ یہ ہے کہ\nمختلف سطحیں ہیں جن پر گیند بیٹھ سکتی ہے۔ ابھی، یہ اپنی کم ترین سطح پر ہے، جسے ہم ایک کے طور پر نمبر دیں گے۔ اب اگر ہم اسے اتنی توانائی فراہم کرتے ہیں تو گیند درحقیقت دو پر جا کر بیٹھ سکتی ہے۔ یہ ممکن ہے،\nایک اور توانائی کی سطح ہے جس پر گیند بیٹھ سکتی ہے۔ اگر آپ اس سے بھی زیادہ توانائی فراہم کرتے ہیں، تو گیند\nقدرے زیادہ توانائی کی سطح پر بیٹھ سکتی ہے، اور اسی طرح آگے۔ اندازہ لگائیں،\nہمارے الیکٹران کا بھی یہی حال ہے۔ ابھی، یہ الیکٹران\nاپنی سب سے نچلی سطح پر ہے، لیکن اس کے علاوہ اور بھی اونچی\nسطحیں ہیں جو قابض ہوسکتی ہیں۔ اگر صرف کافی توانائی کی فراہمی ہے، تو\nیہ اعلی سطح پر چھلانگ لگا سکتا ہے. اور جب یہ ایسا کرے گا تو الیکٹران کلاؤڈ اپنی شکل بدل دے گا۔ میں آپ کو صرف اس کی ایک مثال دیتا ہوں۔ لہذا اگر ہم صرف اتنی توانائی فراہم کرتے ہیں کہ الیکٹران\nچھلانگ لگا سکے، آئیے کہتے ہیں، اس طرح کی اگلی سطح، تو الیکٹران کی شکل\nبدل جائے گی۔ نئی شکل\nکچھ اس طرح نظر آئے گی۔ یہ توانائی کی سطح دو پر ہے، اگلی دستیاب توانائی کی سطح۔ اور آپ اس طرح دیکھ سکتے ہیں کہ\nگیند اب \nزمین سے، زمین سے کس طرح دور ہے، کیونکہ اس میں توانائی زیادہ ہے، اسی طرح، آپ اس طرح دیکھ سکتے ہیں کہ الیکٹران کا بادل تھوڑا بڑا ہے کیونکہ اس میں زیادہ توانائی ہے،  ٹھیک ہے؟ لیکن پتہ چلتا ہے، اور\nجو کچھ ہم یہاں دیکھتے ہیں اس کے برعکس، دوسری شکلیں ہیں\nجو الیکٹران اس نئی توانائی کی سطح پر لے سکتے ہیں۔ مثال کے طور پر، ایک اور شکل جسے\nالیکٹران کلاؤڈ لے سکتا ہے کچھ اس طرح نظر آتا ہے۔ یہ بہت اچھا ہے، ٹھیک ہے؟  اس بارے میں زیادہ فکر نہ کریں کہ\nہمیں یہ شکل اور یہ سب کیسے حاصل ہوتا ہے، یہ صرف سچ ہوتا ہے کہ متعدد\nشکلیں ہیں جن پر یہ لے سکتا ہے، لیکن اہم بات یہ ہے کہ اس وقت یہ الیکٹران اعلی توانائی کی سطح پر ہے۔  ، دوسری توانائی کی سطح جو دستیاب ہے۔ اور اگر میں اس سے بھی زیادہ توانائی فراہم کرتا ہوں، ایک بار پھر، \nاگلی سطح تک پہنچنے کے لیے صرف اتنی توانائی، ٹھیک ہے، شکل پھر سے بدل جائے گی، یہ اور بھی بڑی ہو جائے گی۔ اور اس سطح پر، اس میں\nاور بھی زیادہ تبدیلیاں ہو سکتی ہیں۔ یہ بہت اچھا ہے۔ لیکن یہ وہ ماڈل ہے جو آج ہمارے پاس ہے۔ یہ\nایٹموں کا کوانٹم مکینیکل ماڈل ہے۔ اور صرف\nیہاں پر کچھ تکنیکی نام دینے کے لیے، یہ مختلف شکلیں\nجن کے بارے میں ہم نے بات کی، ہم انہیں مداری کہتے ہیں۔ نوٹس، یہ ایک مدار نہیں ہے. ایسا نہیں ہے کہ الیکٹران گردش کر رہا ہے، یہ پورا بادل خود\nایک الیکٹران کی نمائندگی کرتا ہے، اور ہم اسے مدار کہتے ہیں۔ اور یہ توانائی کی سطحیں، ٹھیک ہے، ہم ان کو بھی ایک نام دیتے ہیں۔ ہم اسے پرنسپل کوانٹم نمبر کہتے ہیں۔ ایک فینسی نام، لیکن یہ ہمیں بتا رہا ہے کہ یہ مدار کس توانائی کی سطح پر ہیں،\nٹھیک ہے؟ ایک مخصوص کوانٹم نمبر پر موجود تمام مداروں کی\n \nتوانائی کی سطح ہمیشہ ایک جیسی ہوگی، ٹھیک ہے؟ اور یقینا، اگر آپ سوچ رہے ہیں کہ ہم اس توانائی کو کیسے فراہم کرتے ہیں؟ ٹھیک ہے، ایسا کرنے کے کئی طریقے ہیں۔ تصادم سے، ایٹموں کو گرم کرکے، یا اس پر کچھ روشنی ڈال کر بھی، کئی طریقے ہیں\nجن سے ہم توانائی فراہم کر سکتے ہیں۔ یہ صرف اتنا ہے کہ اگر آپ\nصحیح مقدار میں توانائی فراہم کرتے ہیں، تو الیکٹران توانائی کی اعلی سطحوں پر چھلانگ لگا سکتے ہیں۔\n لیکن ہمارے مقاصد کے لیے، شکلیں، مدار\nواقعی اہم نہیں ہیں۔ یہ\nمختلف توانائی کی سطحیں کیا اہم ہیں، اور یہ سمجھنا کہ\nجب الیکٹران ایک سے دوسرے میں چھلانگ لگاتے ہیں تو کیا ہوتا ہے، ٹھیک ہے؟ تو اس کے لیے، آئیے صرف\nشکلوں سے چھٹکارا حاصل کریں، اور مختلف توانائی کی سطحوں کی نمائندگی کرنے کے لیے دائروں کا استعمال کریں۔\n تو پھر، جو میں نے یہاں کھینچا ہے، دیکھو، یہ\nتوانائی کی پہلی سطح کی نمائندگی کرتا ہے جو الیکٹران کے لیے دستیاب ہے۔  کیا مطلب یہ نہیں کہ الیکٹران\nیہاں پر چکر لگا رہے ہیں، ٹھیک ہے؟ پھر آپ کے پاس دوسری توانائی کی سطح ہے، جس طرح ہم نے مدار میں دیکھا، دوسری توانائی کی سطح بڑی ہے۔ تیسری توانائی کی سطح اس سے بھی بڑی ہے، یہ اس سے بھی زیادہ دور ہے،\nوغیرہ وغیرہ۔ اور پھر، یہ\nپرنسپل کوانٹم نمبرز ہیں، جو توانائی کی سطحوں کی نمائندگی کرتے ہیں۔ لیکن\nہمارے پاس اتنی توانائی کی سطح کتنی ہے؟ یہ ایک اچھا سوال ہے۔ ٹھیک ہے، یہ پتہ چلتا ہے کہ\nمیں نے صرف چار کھینچے ہیں، لیکن یہ پتہ چلتا ہے کہ آپ کے پاس\nتوانائی کی لامحدود سطحیں ہیں۔ آپ یہاں پر لامحدود قدم رکھنے کا تصور کر سکتے ہیں۔\n اور پھر آپ ایسا کر سکتے ہیں۔ اگر آپ قدموں کے سائز کو کم کرتے رہتے ہیں، تو آپ اس طرح کر سکتے ہیں، آپ تصور کر سکتے ہیں کہ آپ\n بہت سارے، اور بہت سے، اور\nبہت سارے، اور بہت سارے اقدامات کو نچوڑتے رہ سکتے ہیں۔ بنیادی طور پر\nتوانائی کی سطحیں اسی طرح ہیں۔ اور ہم اسے ایک خاکہ، توانائی کی سطح کا ایک خاکہ استعمال کرتے ہوئے دکھا سکتے ہیں، \nجو اس طرح کی نظر آتی ہے۔ تو دیکھو یہ پہلا انرجی لیول ہے، دوسرا انرجی لیول، تیسرا انرجی لیول، چوتھا انرجی لیول، پانچواں،\nچھٹا، ساتواں، آٹھواں، نواں۔ اور آخر کار آپ کے پاس\nلامحدود توانائی کی سطح ہے۔ اب اس کا مطلب یہ نہیں ہے کہ یہاں پر جانے کے لیے\nلامحدود توانائی درکار ہے۔ نہیں، نہیں، نہیں، دیکھو، دیکھو، \nیہاں سے یہاں تک جانے کے لیے ایک محدود مقدار میں توانائی درکار ہوتی ہے، لیکن میں نے قدموں کے سائز کو کم کر کے درمیان میں لامحدود قدم رکھے ہیں۔ اسی طرح آپ\nسوچ سکتے ہیں کہ لامحدود سطحیں ہیں جنہیں ہم\nیہاں سے یہاں تک رکھ سکتے ہیں۔ آپ تصور کر سکتے ہیں\nجب آپ پروٹون سے بہت دور ہوتے ہیں، آپ کافی حد تک\nلامحدود توانائی کی سطح پر ہوتے ہیں۔ تو آپ کو یہاں پر جانے کے لیے لامحدود توانائی کی ضرورت نہیں ہے، ٹھیک ہے؟ بہر حال، اب سوال آتا ہے کہ جب الیکٹران\nتوانائی کی بلند سطح پر چھلانگ لگاتے ہیں تو کیا ہوتا ہے؟ ٹھیک ہے، سب سے پہلے، ہم\nاسے زمینی حالت کہتے ہیں، اور ہم ان دیگر\nاعلی توانائی کی سطحوں کو پرجوش حالت کہتے ہیں۔ تو ہم کہتے ہیں کہ ہم ایک ایٹم کو گرم کرتے ہیں، اور الیکٹران\nزمینی حالت سے تیسرے درجے پر چھلانگ لگاتا ہے،\nیہاں پر پرجوش حالت، ٹھیک ہے؟ اس سے کیا ہوتا ہے؟  اس سے پتہ چلتا ہے کہ الیکٹران زیادہ دیر تک\nپرجوش حالت میں نہیں رہ سکتے کیونکہ وہ بہت غیر مستحکم ہیں۔ اور اس طرح وہ\nفوری طور پر کسی بھی کم دستیاب توانائی کی سطح پر واپس جانے کی کوشش کریں گے۔ تو یہ ممکن ہے کہ\nتین سے ایک پر براہ راست چھلانگ لگا سکے، یا یہ ممکن ہے کہ یہ\nتین سے دو، اور پھر دو سے ایک تک چھلانگ لگا سکے۔ کچھ بھی ممکن ہے، ٹھیک ہے؟ اور جب یہ ایسا کرتا ہے، جب یہ اونچی\nسطح سے نچلی سطح پر چھلانگ لگاتا ہے، الیکٹران نے کچھ توانائی کھو دی ہے۔ توانائی کہاں جاتی ہے؟ توانائی کو کہیں جانا چاہیے،\nتوانائی کا تحفظ۔ وہ توانائی روشنی کے فوٹون کے طور پر نکلتی ہے۔ لہذا مثال کے طور پر، اگر\nالیکٹران سطح تین سے سطح دو پر چھلانگ لگاتا ہے، تو یہ\nروشنی کا ایک فوٹون جاری کرتا ہے، اور اس فوٹون میں وہی توانائی ہوگی جو\nان دونوں توانائیوں کے درمیان فرق ہے۔ اب یہ ہائیڈروجن کے لیے نکلا، اگر آپ اصل میں حساب لگاتے ہیں، لیول تھری اور لیول ٹو کے لیے توانائی کی سطح کے درمیان فرق، وہ توانائی\nروشنی کے سرخ رنگ کے مساوی ہے۔ آپ یاد رکھ سکتے ہیں کہ\nفوٹوون کی توانائی اس کی فریکوئنسی یا اس کی طول موج سے منسلک ہوتی ہے۔  فوٹون کی توانائی جتنی زیادہ ہے،\nاس کی فریکوئنسی زیادہ ہے، یا طول موج کم ہے۔ توانائی کے اس خاص فرق کے لیے، طول موج یا\nتعدد سرخ رنگ میں ہوتا ہے۔ اسی طرح،\nاگر الیکٹران چار سے دو چھلانگ لگاتا ہے تو کیا ہوگا؟ ٹھیک ہے، آپ تصور کر سکتے ہیں،\nچار سے دو ایک بڑی چھلانگ ہے، جس کا مطلب ہے کہ زیادہ توانائی ضائع ہو جائے گی، اس لیے فوٹون کی توانائی\nزیادہ ہو گی۔ لہذا تعدد\nسرخ رنگ سے زیادہ ہوگی۔  پتہ چلتا ہے کہ یہ\nنیلے رنگ میں کہیں پڑا ہوگا۔ اور اگر چھلانگ\nپانچ سے دو، اور چھ سے دو تک ہے، تو یہ اور بھی زیادہ ہو جائے گا،\nآپ جانتے ہیں، بنفشی، انڈگو۔ اور پھر سات سے دو اور اسی طرح یہ بالائے بنفشی بن جاتا ہے،\nہم اسے نہیں دیکھ پائیں گے۔ ٹھیک ہے، دوسرے چھلانگوں کا کیا ہوگا؟ مثال کے طور پر، آپ کا\nکہنا ہے کہ، دو سے ایک تک چھلانگ لگانا ہے۔ ٹھیک ہے، یہ پتہ چلتا ہے کہ\nیہ توانائی کی چھلانگ اتنی بڑی ہے، اور میں نے شاید اسے درست طریقے سے نہیں کھینچا ہے، لیکن یہ اتنا بڑا ہے کہ یہ بھی الٹرا وائلٹ کے علاقے میں ہے، جسے ہم اسے نہیں دیکھ سکیں گے.  . درحقیقت،\nہائیڈروجن کے لیے ان چاروں کو چھوڑ کر، ان چار چھلانگوں کے علاوہ، باقی تمام چھلانگیں یا تو الٹرا وائلٹ ریجن میں ہوں گی،\nہمارے دیکھنے کے لیے بہت زیادہ فریکوئنسی، یا یہ بہت چھوٹی، بہت کم فریکوئنسی ہوگی، جیسے  یہاں توانائی کا فرق، جیسے چار سے تین، یا پانچ\nسے چار، یا چھ سے تین۔ وہ اتنے چھوٹے ہوں گے کہ دوبارہ، تعدد\nہمارے دیکھنے کے لیے بہت کم ہو جائے گا۔ تو جب ہائیڈروجن کی بات آتی ہے، تو یہ صرف یہ چار چھلانگیں ہیں\nجو ہمیں نظر آتی ہیں۔ اس کا مطلب ہے کہ یہ صرف چار رنگ ہیں جو\nنظر آنے والے علاقے میں ہائیڈروجن روشنی خارج کریں گے۔ تو اس کا مطلب یہ ہے کہ اگر آپ کو\nہائیڈروجن گیس لینا ہے اور پھر اسے مارنا ہے، کیونکہ وہاں بہت سارے ایٹم موجود ہیں، وہاں بہت سارے الیکٹران ٹرانزیشن\nمسلسل ہو رہے ہوں گے، تقریباً تمام ممکنہ چھلانگیں جن کے بارے میں آپ سوچ سکتے ہیں ہو جائے گا، اور  اس لیے روشنی نکلے گی، اور ہائیڈروجن گیس چمکے گی۔ لیکن نظر آنے والے حصے میں، روشنی صرف ان چار مخصوص طول موجوں پر مشتمل ہوگی۔ تو ہم ایک روشنی دیکھیں گے\nجو ان چار طول موجوں کا مجموعہ ہے۔ اور اگر پھر ہم استعمال کرتے ہیں، کہتے ہیں، ایک پرزم، یا کوئی ایسی چیز جیسے ڈفریکشن گریٹنگ، جو ان\nمخصوص طول موجوں کو الگ کر سکتی ہے، تو آپ ان\nچار انفرادی طول موجوں کو الگ الگ دیکھ سکتے ہیں، اور یہ\nکچھ اس طرح نظر آئے گا۔ اور ہم اسے اٹامک سپیکٹرم یا ہائیڈروجن سپیکٹرم کہیں گے۔ اور جوہری سپیکٹرم کے بارے میں اچھی بات یہ ہے کہ ہر عنصر کی\nاپنی توانائی کی سطح ہوگی۔ اس کا مطلب ہے کہ ہر عنصر روشنی کے بہت مخصوص رنگ، روشنی کی خاص طول موج دے گا۔ تو یہ طول موج\nہائیڈروجن کے لیے مخصوص ہیں۔ مثال کے طور پر، ہیلیم روشنی کی بہت مختلف طول موج دے گا۔\n آئیے آپ کو دکھائیں کہ ہیلیم کیسا لگتا ہے۔  ایسا لگتا ہے۔ روشنی کی یہ طول موجیں\nہیلیم کی خصوصیت ہیں۔ تو اس کا مطلب ہے کہ ایک جوہری سپیکٹرم اس عنصر کے دستخط کی طرح ہے۔ تو کل، اگر ہمارے پاس کوئی نامعلوم گیس ہے، اور ہم یہ جاننا چاہتے ہیں کہ کس چیز سے بنی ہے، تو ہم اسے صرف گرم کریں گے\nاور اس کے سپیکٹرم کو دیکھیں گے۔ اور اگر وہ سپیکٹرم اس طرح نظر آتا ہے، تو ہم کیا کر سکتے ہیں ہم یہ کہہ سکتے ہیں، اور ہم ان لائنوں کو دیکھ سکتے ہیں\nاور ہم کہہ سکتے ہیں، ارے، ارے، دیکھو، دیکھو،\nیہ عنصر ہیں، یہ وہ لائنیں ہیں جو\nصرف  ہائیڈروجن سے آتے ہیں. تو اس سے ہائیڈروجن ضرور نکلتی ہے۔ اور پھر ہم\nان طول موجوں کو دیکھ کر کہہ سکتے ہیں، ارے، یہ طول موجیں\nصرف ہیلیم سے آتی ہیں۔  کوئی اور عناصر\nمجھے یہ لائنیں نہیں دیں گے، اس لیے اس میں ہیلیم بھی ہونا چاہیے، وغیرہ وغیرہ۔ اور چمک کو دیکھ کر ہم یہ بھی اندازہ لگا سکتے ہیں کہ\nکون سا زیادہ وافر ہے۔ تو مثال کے طور پر، یہاں آپ دیکھ سکتے ہیں کہ ہائیڈروجن لائنیں زیادہ روشن ہیں، لہذا ہم کہہ سکتے ہیں کہ\nہیلیم کے مقابلے میں زیادہ ہائیڈروجن ہے۔ اسے سپیکٹرل تجزیہ کہا جاتا ہے۔ اور ویسے، اس قسم\nکے سپیکٹرم کو ایمیشن سپیکٹرم کہا جاتا ہے، کیونکہ یہ وہ سپیکٹرم ہے جو ہمیں ملتا ہے، کیونکہ وہ مخصوص رنگ\nایٹموں سے خارج ہوتے ہیں۔ لیکن آپ سوچ رہے ہوں گے، ٹھیک ہے، کیا کوئی اور قسم کا سپیکٹرم ہے؟ ہاں، اگر آپ\nاس سپیکٹرم کو دیکھیں جس سے آپ حاصل کرتے ہیں، کہتے ہیں، سورج، آپ کو یہ نظر نہیں آئے گا۔  اس کے بجائے، آپ کو جو ملے گا وہ یہ ہے کہ\nآپ کو مسلسل رنگ نظر آئے گا، اور کچھ لائنیں جذب ہو جائیں گی۔ درحقیقت، وہ مخصوص لکیریں جنہیں ہم صرف\nاخراج کے اسپیکٹرم میں کھینچتے ہیں، وہ لکیریں دراصل جذب ہو جائیں گی۔ اور\nاس سپیکٹرم میں دوسرے عناصر بھی ہوں گے، اور اسی لیے\nدوسری لائنیں بھی ہوں گی۔ لیکن لکیریں جذب ہوتی نظر آئیں گی، کچھ رنگ جذب ہو جائیں گے۔ اور جسے ہم\nجذب سپیکٹرم کہتے ہیں۔ اگر آپ سورج کے سپیکٹرم کو دیکھیں تو ہمیں یہی ملے گا۔ لیکن ہم یہ کیوں حاصل کرتے ہیں؟ ہمیں ایسا کچھ کیوں مل رہا ہے؟ ٹھیک ہے، چلو دیکھتے ہیں. جب آپ\nسورج کو دیکھ رہے ہیں، مثال کے طور پر، سورج کا مرکز انتہائی گرم، بہت گرم ہے۔ اور ایسی گرم، گھنی اشیاء، وہ سفید روشنی دیتے ہیں۔ تمام رنگ، وہ ایسا نہیں کرتے، وہ صرف سفید روشنی دیتے ہیں، ٹھیک ہے؟ لہذا اگر آپ صرف\nاس خاص روشنی کو پرزم کے ذریعے دیکھنا چاہتے ہیں، تو ہمیں صرف قوس قزح کے تمام رنگوں کی توقع کرنی چاہئے، ٹھیک ہے؟ تاہم، بیرونی تہہ زیادہ ٹھنڈی ہے، اس لیے یہاں پر موجود ایٹم\nروشنی کو جذب کریں گے۔ اب اگر ہائیڈروجن ہے، مثال کے طور پر، روشنی کے کون سے رنگ، روشنی کی کون سی طول موج یہ جذب کرے گی؟ وہ صرف\nروشنی کی ان طول موجوں کو جذب کرے گا جن کے فوٹون کے پاس اتنی توانائی ہے کہ وہ انہیں یہ ٹرانزیشن دے سکیں، جس کا مطلب ہے کہ دکھائی دینے والے حصے میں، وہ\nروشنی کے ان مخصوص رنگوں کو جذب کریں گے۔ اور اسی طرح، اگر\nہیلیم اور کاربن ہیں، تو یہ سب دوبارہ،\nاپنی خصوصیت کو جذب کر لیں گے، آپ جانتے ہیں، رنگ۔ اور یہی وجہ ہے کہ وہ مخصوص\nرنگ غائب ہوں گے، اور اسی لیے ہمیں\nیہاں سیاہ لکیریں نظر آئیں گی۔ لیکن ایک سیکنڈ انتظار کریں۔ ایک بار جب وہ انہیں جذب کر لیں تو کیا انہیں دوبارہ چھوڑنا نہیں چاہیے؟ ہاں، وہ ان رنگوں کو جاری کرتے ہیں، لیکن جب آپ یہاں دیکھ رہے ہوں گے، تو وہ رنگ\nبیرونی تہہ سے جذب ہو جائیں گے، اور پھر وہ\nتمام دوسری سمتوں میں جاری کیے جائیں گے۔ وہ\nدوسری سمتوں میں واپس خارج ہوں گے، لیکن وہ\nباقی تمام سمتوں میں خارج ہوں گے۔ لہذا زیادہ تر اس سمت میں،\nوہ رنگ غائب ہوں گے، اور اسی وجہ سے آپ کو\nجذب سپیکٹرم ملتا ہے۔ لیکن تجزیہ وہی ہے۔  یہ دیکھ کر کہ کون سے رنگ جذب ہوتے ہیں، کون سی خاص طول موج جذب ہوتی ہے، آپ پہچان سکتے ہیں کہ یہاں بیرونی ماحول میں کون سے\nعناصر موجود ہیں۔ اس طرح ہم مثال کے طور پر مختلف سیاروں\n کے ماحول کے اندر موجود عناصر کا پتہ لگاتے ہیں۔\n تو چاہے آپ کو جذب سپیکٹرم ملے یا اخراج کا سپیکٹرم درحقیقت\nآپ کے لہرانے والے زاویے پر منحصر ہے۔ لیکن قطع نظر، تجزیہ\nوہی رہتا ہے، ٹھیک ہے؟ اب یہاں ایک عمدہ خلاصہ ہے جو مجھے ویب\nدوربین کے صفحے پر ملا ہے، ٹھیک ہے؟ ہر چیز کا خلاصہ جو ہم نے دیکھا، روشنی جو ہم\nبراہ راست گرم ذرائع سے حاصل کرتے ہیں وہ مسلسل سپیکٹرم ہوگی۔ اگر ایسی چیزیں ہیں جو\nنسبتاً ٹھنڈی ہیں، گیسیں جیسے کہ نیبولا،\nیا بیرونی پرتیں، تو وہ جذب ہو جائیں گی، اور اب آپ جو دیکھیں گے وہ\nجذب سپیکٹرم ہے۔ لیکن اگر آپ لہرا رہے ہیں زاویہ اس طرح ہے کہ آپ ان گیسوں سے آنے والی روشنی کو براہ راست دیکھتے ہیں جو روشنی کو جذب کرتی ہیں، تو آپ\nاخراج کے اسپیکٹرم کو دیکھ سکیں گے۔",
    "t_spanish": "- [Instructor] Podemos\nmirar estrellas o nebulosas, o incluso planetas que\nestán muy, muy lejanos, y estimar qué los compone, ¿ cuáles son los elementos que\nhay dentro de ellos? Pero cómo hacemos eso?  ¿ Cómo podemos sentarnos aquí en la Tierra y descubrir qué\nelementos están presentes dentro, digamos, de la atmósfera de un exoplaneta?  Lo hacemos utilizando los espectros atómicos y el análisis espectral.  ¿ Pero qué son exactamente estas cosas? Bueno, averigüémoslo. Comencemos mirando\nel modelo de un átomo y veremos el\nmás simple, el átomo de hidrógeno. Dentro del átomo de hidrógeno sabemos que hay un\nprotón y un electrón. Y en las representaciones más populares, mostramos el electrón dando vueltas\nalrededor del protón, ¿verdad? Pero ese no es el modelo correcto, porque los electrones\nno son pequeñas bolas de materia que giran\nasí, como los planetas. En cambio, son objetos cuánticos que tienen propiedades tanto de partícula\ncomo de onda. Y una de las propiedades de las ondas\nes que las ondas están dispersas, no están en un lugar particular, pero están dispersas, lo que significa que los electrones también están esparcidos.  A esto lo llamamos nube de electrones. Y estas nubes de electrones\npueden tener diferentes formas. Por ejemplo, si consideramos el hidrógeno en su nivel de energía más bajo, entonces la forma del electrón se parece algo a esto. Es algo así como una esfera. Y no es que el electrón\nesté orbitando por aquí. No, no, no, esta nube\nque he dibujado aquí representa el electrón. Ahora aquí está la pregunta principal para nosotros.  ¿ Qué le sucede a este átomo\nsi le suministramos algo de energía? Cuando suministras algo de energía, el electrón absorbe la energía. Y la pregunta es, ¿qué pasa con eso? Bueno, si hay suficiente energía, entonces el electrón puede\nabsorberla y escapar del átomo. En ese caso, el\nelectrón simplemente se escapa y aquí solo te queda\nun protón. Vale, pero ¿y si no le das\ntanta energía?  ¿ Qué pasa si le das un\npoco de energía, no la suficiente para escapar de él, pero sólo un poco de energía? Entonces ¿qué pasa? Oh, ahora\npueden suceder algunas cosas interesantes. Y para entender eso,\nhagamos una analogía aquí. Mi analogía favorita es\npensar en un pozo en el que te diviertes aquí. Esta bola es análoga\nal electrón de aquí, tal como esta bola\nestá dentro de un pozo. Y si queremos que esa bola\nescape tan bien, tenemos que suministrarle energía\n, suficiente energía. De manera similar, este\nelectrón también está sentado, esta nube de electrones\ntambién está dentro de un pozo. La diferencia es que aquí\ntienes un pozo físico causado por la gravedad. Aquí, es un tipo diferente de pozo, es un pozo causado\npor fuerzas eléctricas.  A esto lo llamamos\npozo potencial, en general, pero la idea es la misma. Para escapar de ese pozo, tenemos\nque suministrarle suficiente energía. Y ahora la gran pregunta era ¿y si no se suministra tanta energía?  ¿ Qué pasa si suministras un poco de energía? Entonces ¿qué va a pasar? Bueno, podríamos pensar que\nno va a pasar nada. Si proporciono un poco de energía, bueno, volverá a bajar, ¿verdad? Bueno, resulta que el\npotencial de aquí no es así. En cambio, se\npuede pensar que el pozo potencial se parecería a esto. Lo que vemos es que\nhay diferentes niveles en los que se puede asentar la pelota. En este momento, se encuentra en su nivel más bajo, que numeraremos como uno. Ahora bien, si le suministramos tanta energía, la pelota puede realmente ir y sentarse a las dos. Eso es posible, hay\notro nivel de energía en el que la pelota puede sentarse. Si suministraste aún más energía, la pelota puede sentarse en un\nnivel de energía ligeramente más alto, y así sucesivamente. Adivina qué, lo mismo\nocurre con nuestros electrones. Ahora mismo, este electrón\nse encuentra en su nivel más bajo, pero hay otros\nniveles superiores que pueden ocupar. Si se suministra suficiente energía,\npuede saltar a niveles más altos. Y cuando lo haga, la nube de electrones cambiará de forma. Déjame darte un ejemplo de eso. Entonces, si suministramos suficiente energía para que el electrón\npueda saltar, digamos, al siguiente nivel como este, entonces la forma del\nelectrón cambiará. La nueva forma se\nparecería a esto. Esto es en el nivel de energía dos, el siguiente nivel de energía disponible. Y puedes ver\ncómo la bola ahora está más lejos de la\nTierra, del suelo, porque tiene mayor energía, de manera similar, puedes ver que la nube de electrones es más grande porque tiene más energía.  ¿bien? Pero resulta que, a diferencia de\nlo que vemos aquí, hay otras formas\nque los electrones pueden adoptar en este nuevo nivel de energía. Por ejemplo, otra forma que\npuede adoptar la nube de electrones se parece a ésta. Es muy bueno, ¿verdad? No se preocupe demasiado por\ncómo obtenemos esta forma y todo eso, simplemente resulta cierto que hay múltiples\nformas que puede adoptar, pero lo importante es que en este momento, este electrón se encuentra en un nivel de energía más alto.  , el segundo nivel de energía que está disponible. Y si proporciono aún más energía, de nuevo, sólo la energía suficiente para\npasar al siguiente nivel, bueno, la forma volverá a cambiar, se volverá aún más grande. Y en este nivel, puede\ntener aún más turnos. Es genial. Pero este es el modelo que tenemos hoy. Este es el\nmodelo mecánico cuántico de los átomos. Y sólo para dar algunos\nnombres técnicos aquí, estas diferentes formas\nde las que hablamos, las llamamos orbitales. Aviso, no es una órbita. No es que el electrón esté orbitando, toda esta nube en sí misma\nrepresenta un electrón, y a eso lo llamamos orbitales. Y a estos niveles de energía, bueno, también les damos un nombre.  A esto lo llamamos número cuántico principal. Un nombre elegante, pero lo único que nos dice es a qué nivel de energía se\nencuentran estos orbitales, ¿verdad? Todos los orbitales de un\nnúmero cuántico concreto siempre tendrán el\nmismo nivel de energía, ¿vale? Y por supuesto, si te preguntas ¿ cómo suministramos esa energía? Bueno, hay varias formas de hacerlo. Mediante colisión, calentando los átomos o incluso irradiando algo de luz sobre ellos, existen múltiples formas de\nsuministrar energía. Es sólo que si se suministra\nla cantidad adecuada de energía, los electrones pueden saltar a\nniveles de energía más altos. Pero para nuestros propósitos, las formas y los orbitales\nno son realmente importantes. Lo importante son estos\ndiferentes niveles de energía y comprender qué\nsucede cuando los electrones saltan de uno a otro, ¿verdad? Entonces, para eso, simplemente\neliminemos las formas y usemos círculos para representar\nlos diferentes niveles de energía. De nuevo, lo que he dibujado aquí, mira, esto representa\nel primer nivel de energía que está disponible para el electrón. No significa que los electrones\norbiten por aquí, ¿vale? Luego tienes el segundo nivel de energía, tal como vimos en el orbital, el segundo nivel de energía es más grande. El tercer nivel de energía es aún más grande, está aún más lejos,\ny así sucesivamente. Y nuevamente, estos son los\nnúmeros cuánticos principales, que representan los niveles de energía.  ¿ Pero cuántos\nniveles de energía tenemos? Buena pregunta. Bueno, resulta que\nsolo he dibujado cuatro, pero resulta que\nhay infinitos niveles de energía que puedes tener. Puedes imaginarte\nponiendo una cantidad infinita de pasos aquí. Y luego puedes hacer eso. Si continúas disminuyendo el tamaño del paso, te puede gustar, puedes imaginar que\npuedes seguir exprimiendo muchos, muchos, y\nmuchos, y muchos pasos. Básicamente así\nson los niveles de energía. Y podemos mostrar esto usando un diagrama, un diagrama de niveles de energía,\nque se parece a esto. Miren, este es el primer nivel de energía, el segundo nivel de energía, el tercer nivel de energía, el cuarto nivel de energía, el quinto, sexto, séptimo,\noctavo, noveno. Y eventualmente tienes\nel nivel de energía infinito. Ahora bien, eso no significa que se\nnecesite energía infinita para llegar hasta aquí. No, no, no, mira, mira, se necesita una cantidad finita de\nenergía para ir de aquí a aquí, pero he puesto infinitos pasos de por medio reduciendo el tamaño del paso. De manera similar,\npuedes pensar que hay infinitos niveles que\npodemos poner de aquí para aquí. Puedes imaginar que\ncuando estás muy lejos del protón, estás prácticamente en\nel nivel de energía infinito. Así que no necesitas energía infinita para llegar hasta aquí, ¿vale? De todos modos, ahora surge la pregunta ¿ qué sucede cuando los electrones\nsaltan a un nivel de energía más alto? Bueno, en primer lugar, a\nesto lo llamamos estado fundamental, y a estos otros\nniveles de energía superiores los llamamos estado excitado. Entonces digamos que calentamos un átomo y el electrón salta\ndel estado fundamental al tercer nivel, el\nestado excitado de aquí, ¿vale?  ¿ Qué le pasa? Resulta que los electrones no pueden\npermanecer en estado excitado por mucho tiempo porque son muy inestables. Y entonces\nintentarán inmediatamente volver a cualquier nivel de energía disponible más bajo. Entonces es posible que pueda saltar\ndirectamente de tres a uno, o es posible que\npueda saltar de tres a dos, y luego de dos a uno. Todo es posible, ¿vale? Y cuando lo hace, cuando salta de un\nnivel superior a un nivel inferior, el electrón ha perdido algo de energía.  ¿A dónde va la energía? La energía debe ir a alguna parte, la\nconservación de la energía. Esa energía sale como un fotón de luz. Entonces, por ejemplo, si el\nelectrón salta del nivel tres al nivel dos, libera\nun fotón de luz, y ese fotón tendrá la misma energía que la diferencia entre\nestas dos energías. Ahora resulta que para el hidrógeno, si realmente se hace el cálculo, la diferencia entre los niveles de energía para el nivel tres y el nivel dos, esa energía corresponde\nal color rojo de la luz. Puedes recordar que la\nenergía de un fotón está correlacionada con su frecuencia o su longitud de onda.  A mayor energía del\nfotón, mayor es su frecuencia o más corta es su longitud de onda. Para esta diferencia de energía particular, la longitud de onda o la\nfrecuencia está en color rojo. De manera similar, ¿qué pasaría\nsi el electrón saltara de cuatro a dos? Bueno, como os podéis imaginar,\ncuatro a dos es un salto mayor, lo que significa que se pierde más energía, por lo que la energía del\nfotón será mayor. Por tanto, la frecuencia\nsería mayor que la del color rojo. Resulta que estará en\nalgún lugar del color azul. Y si el salto es de\ncinco a dos, y de seis a dos, será aún más hacia, ya\nsabes, violeta, índigo. Y luego de siete a dos y así sucesivamente, se vuelve ultravioleta,\nno podremos verlo. Bien, ¿qué pasa con otros saltos? Por ejemplo, tienes que\nsaltar de dos a uno. Bueno, resulta que\neste salto de energía es tan grande, y probablemente no lo he dibujado con precisión, pero resulta ser tan grande que incluso eso se encuentra en la región ultravioleta, que no podremos verlo.  . De hecho, excepto\nestos cuatro para el hidrógeno, excepto estos cuatro saltos, todos los demás saltos estarán en la región ultravioleta, una\nfrecuencia demasiado alta para que podamos verlos, o serán demasiado pequeños, de frecuencia demasiado baja, como el  diferencia de energía aquí, como cuatro a tres, o cinco a\ncuatro, o seis a tres. Serán tan pequeños que, nuevamente, la frecuencia será\ndemasiado baja para que podamos verla. Entonces, cuando se trata de hidrógeno, sólo estos cuatro saltos\nson visibles para nosotros. Eso significa que estos son los únicos cuatro colores que emitirá la luz del hidrógeno\nen la región visible. Entonces, esto significa que si\ntomaras un gas hidrógeno y luego lo golpearas, debido a que hay tantos átomos, habrá tantas transiciones electrónicas\nsucediendo continuamente, casi todos los saltos posibles que puedas imaginar ocurrirán, y  por lo tanto, saldrá luz y el gas hidrógeno brillará. Pero en la sección visible, la luz sólo estará compuesta por estas cuatro longitudes de onda específicas. Entonces veremos una luz\nque es una combinación de estas cuatro longitudes de onda. Y si luego usamos, digamos, un prisma o algo así como una rejilla de difracción, que pueda separar esas\nlongitudes de onda particulares, entonces podrán ver estas\ncuatro longitudes de onda individuales por separado, y se\nverá más o menos así. Y a esto lo llamaremos espectro atómico o espectro del hidrógeno. Y lo bueno del espectro atómico es que cada elemento\ntendrá su propio nivel de energía. Eso significa que cada elemento emitirá colores de luz muy específicos, longitudes de onda de luz muy específicas. Entonces estas longitudes de onda son\nespecíficas del hidrógeno. El helio, por ejemplo, producirá\nlongitudes de onda de luz muy diferentes. Déjanos mostrarte cómo se ve el helio. Se parece a esto. Estas longitudes de onda de la luz son\nlas características del helio. Entonces esto significa que un espectro atómico es como una firma de ese elemento. Así que mañana, si tenemos un gas desconocido y queremos descubrir de qué está hecho, simplemente lo calentaremos\ny observaremos su espectro. Y si ese espectro se ve así, entonces lo que podemos hacer es decir eso, y podemos mirar estas\nlíneas y podemos decir, oye, oye, mira, mira,\nestos son el elemento, estas son las líneas que\nsolo  provienen del hidrógeno. Entonces debe haber hidrógeno en él. Y luego podemos mirar\nestas longitudes de onda y decir, oye, estas longitudes de onda\nsolo provienen del helio. Ningún otro elemento\nme dará estas líneas, por lo que también debe contener helio, y así sucesivamente. Y al observar el brillo, también podemos determinar\ncuál es más abundante. Entonces, por ejemplo, aquí pueden ver que las líneas de hidrógeno son más brillantes, por lo que podemos decir que hay más\nhidrógeno en comparación con helio. Esto se llama análisis espectral. Y por cierto, este tipo\nde espectro se llama espectro de emisión, porque es el espectro que obtenemos, porque esos colores específicos\nson emitidos por los átomos. Pero quizás te preguntes: ¿ existe algún otro tipo de espectro? Sí, si miraras\nel espectro que obtienes, digamos, del Sol, no verías esto. En cambio, lo que encontrará es que\nverá un color continuo y algunas de las líneas serán absorbidas. De hecho, esas líneas específicas que acabamos de dibujar aquí\nen el espectro de emisión, esas líneas en realidad serán absorbidas. Y habrá otros\nelementos en ese espectro y, por lo tanto,\ntambién habrá otras líneas. Pero las líneas parecerán absorbidas, algunos colores serán absorbidos. Y a eso lo llamamos\nespectro de absorción. Eso es lo que obtendremos si observamos, digamos, el espectro del Sol.  ¿ Pero por qué entendemos eso?  ¿ Por qué recibimos algo como esto? Bien, veamos. Cuando miras\nal Sol, por ejemplo, el núcleo del Sol está extremadamente caliente, muy caliente. Y estos objetos tan calientes y densos tienden a emitir luz blanca. Todos los colores no hacen esto, solo emiten luz blanca, ¿vale? Entonces, si\nviéramos esa luz en particular a través del prisma, entonces deberíamos esperar todos los colores del arco iris, ¿verdad? Sin embargo, la capa exterior es mucho más fría, por lo tanto los átomos de aquí\nabsorberán la luz de aquí. Ahora bien, si hay hidrógeno, por ejemplo, ¿ qué colores de luz, qué longitudes de onda de luz absorberá? Sólo absorberá aquellas\nlongitudes de onda de luz cuyos fotones tengan la energía suficiente para darles estas transiciones, lo que significa que en la sección visible, absorberán estos\ncolores de luz específicos. Y de manera similar, si hay\nhelio y carbono, todos absorberán\nsus colores característicos. Y es por eso que\nfaltarán esos colores específicos, y es por eso que\nveremos líneas oscuras aquí. Pero espera un segundo. Una vez que los absorben, ¿ no deberían también liberarlos nuevamente? Sí, liberan esos colores, pero cuando miran hacia aquí, esos colores serán absorbidos\ndesde la capa exterior y luego se liberarán\nen la otra dirección.  Se emitirán\nen otras direcciones, pero se emitirán en\ntodas las demás direcciones. Entonces, principalmente en esta dirección,\nesos colores faltarán, y es por eso que obtienes\nel espectro de absorción. Pero el análisis es el mismo. Al observar qué colores se absorben, qué longitudes de onda particulares se absorben, se puede identificar qué\nelementos están presentes, digamos, en la atmósfera exterior de aquí. Así es como podemos\nidentificar, por ejemplo, los elementos presentes en la atmósfera de\ndiferentes exoplanetas. Entonces, si obtienes un espectro de absorción o un espectro de emisión realmente depende\nde tu ángulo de onda. Pero de todos modos, el análisis\nsigue siendo el mismo, ¿vale? Ahora aquí hay un resumen interesante que encontré en la\npágina web de telescopios, ¿de acuerdo? El resumen de todo lo que vimos, la luz que obtenemos\ndirectamente de las fuentes calientes sería de espectro continuo. Si hay cosas que\nson relativamente más frías, gases como, por ejemplo, las nebulosas\no las capas externas, entonces absorberán, y lo que verán ahora es\nel espectro de absorción. Pero si el ángulo de su onda es tal que ve directamente la luz proveniente de los gases que absorben la luz, entonces podrá\nver el espectro de emisión.",
    "t_arabic": "- [المدرس] يمكننا\nالنظر إلى النجوم أو السدم، أو حتى الكواكب البعيدة\nجدًا جدًا، وتقدير العناصر التي تتكون منها، وما هي العناصر\nالموجودة بداخلها؟ لكن كيف نفعل ذلك؟ كيف يمكننا أن نجلس هنا على الأرض، ونكتشف ما هي\nالعناصر الموجودة داخل الغلاف الجوي لكوكب خارج المجموعة الشمسية، على سبيل المثال؟ نحن نفعل ذلك باستخدام الأطياف الذرية والتحليل الطيفي. ولكن ما هي هذه الأشياء بالضبط؟ حسنا، دعونا معرفة ذلك. لنبدأ بالنظر\nإلى نموذج الذرة، وسننظر إلى\nأبسطها، ذرة الهيدروجين.  نعلم أنه يوجد داخل ذرة الهيدروجين \nبروتون واحد وإلكترون واحد. وفي معظم الصور الشائعة، نظهر الإلكترون وهو يدور\nحول البروتون، أليس كذلك؟ لكن هذا ليس النموذج الصحيح، لأن الإلكترونات\nليست كرات صغيرة من المادة تدور بهذا الشكل\n، مثل الكواكب. وبدلاً من ذلك، فهي كائنات كمومية لها\nخصائص جسيمية وموجية. وإحدى خصائص الموجة\nهي أن الموجات تنتشر، وهي ليست في مكان معين، ولكنها منتشرة، مما يعني أن الإلكترونات منتشرة أيضًا. نحن نسمي ذلك سحابة إلكترونية.  ويمكن لهذه السحب الإلكترونية أن يكون\nلها أشكال مختلفة. على سبيل المثال، إذا اعتبرت الهيدروجين عند أدنى مستوى طاقة له، فإن شكل الإلكترون سيبدو إلى حد ما بهذا الشكل. انها نوع من مثل المجال. وليس الأمر أن الإلكترون\nيدور هنا. لا، لا، لا، هذه السحابة\nالتي رسمتها هنا بحد ذاتها تمثل الإلكترون. الآن هذا هو السؤال الرئيسي بالنسبة لنا. ماذا يحدث لهذه الذرة\nإذا زودناها ببعض الطاقة؟ عندما تقوم بتزويد بعض الطاقة، يمتص الإلكترون الطاقة. والسؤال هو ماذا يحدث لها؟ حسنًا، إذا كانت هناك طاقة كافية، فيمكن للإلكترون أن يمتصها\nويهرب من الذرة. في هذه الحالة،\nيهرب الإلكترون منه، ويتبقى لك\nبروتون واحد هنا. حسنًا، ولكن ماذا لو لم\nتمنحه الكثير من الطاقة؟ ماذا لو أعطيته\nالقليل من الطاقة، ليست طاقة كافية للهروب منه، ولكن القليل من الطاقة فقط.  ومن ثم ماذا حدث؟ أوه، الآن\nيمكن أن تحدث بعض الأشياء المثيرة للاهتمام. ولكي نفهم ذلك، دعونا\nنأخذ تشبيهًا هنا. التشبيه المفضل لدي هو\nالتفكير في البئر الذي توجد فيه كرة هنا. هذه الكرة تشبه\nالإلكترون هنا، تمامًا مثل هذه الكرة\nداخل البئر. وإذا أردنا لهذه الكرة\nأن تهرب من هذا البئر، علينا أن نزودها بالطاقة\n، ما يكفي من الطاقة. وبطريقة مماثلة، هذا\nالإلكترون موجود أيضًا، وهذه السحابة الإلكترونية\nموجودة أيضًا داخل البئر. الفرق هنا هو أن\nلديك بئرًا ماديًا ناتجًا عن الجاذبية. هنا، إنه نوع مختلف من الآبار، إنه بئر ناتج\nعن القوى الكهربائية. نحن نسمي هذا\nبئرًا محتملًا بشكل عام، لكن الفكرة هي نفسها. للهروب من ذلك البئر، علينا\nأن نزوده بما يكفي من الطاقة. والآن كان السؤال الكبير هو ماذا لو لم توفر هذا القدر من الطاقة؟ ماذا لو قمت بتزويد القليل من الطاقة؟ ثم ماذا سيحدث؟ حسنًا، قد نعتقد أنه\nلن يحدث شيء. إذا قمت بتزويد القليل من الطاقة، حسنًا، فسوف تعود للأسفل، أليس كذلك؟ حسنًا، اتضح أن\nالإمكانات هنا ليست بهذا الشكل. وبدلاً من ذلك،\nيمكن التفكير في البئر المحتملة لتبدو بهذا الشكل إلى حدٍ ما. ما نراه هو أن هناك\nمستويات مختلفة يمكن أن تستقر فيها الكرة. وهو الآن في أدنى مستوى له، والذي سنرقمه بالرقم واحد. والآن، إذا زودناها بهذا القدر من الطاقة، فيمكن للكرة أن تتحرك وتستقر عند الثانية. هذا ممكن، هناك\nمستوى طاقة آخر يمكن للكرة أن تجلس عنده. إذا قمت بتزويد المزيد من الطاقة، يمكن للكرة أن تستقر عند\nمستوى طاقة أعلى قليلاً، وهكذا دواليك. خمن ماذا، الأمر نفسه\nينطبق على إلكتروناتنا. في الوقت الحالي، هذا الإلكترون\nفي أدنى مستوياته، ولكن هناك مستويات أعلى أخرى\nيمكن أن يشغلها. إذا تم توفير طاقة كافية فقط،\nفيمكن أن تقفز إلى مستويات أعلى. وعندما يحدث ذلك، فإن السحابة الإلكترونية ستغير شكلها. واسمحوا لي أن أعطيكم مثالاً على ذلك. لذا، إذا زودنا ما يكفي من الطاقة حتى\nيتمكن الإلكترون من القفز إلى المستوى التالي مثل هذا، على سبيل المثال، فإن شكل\nالإلكترون سيتغير. سيبدو الشكل الجديد\nإلى حد ما مثل هذا. هذا عند مستوى الطاقة الثاني، وهو مستوى الطاقة التالي المتاح. ويمكنك أن ترى تمامًا\nكيف أصبحت الكرة الآن أبعد عن\nالأرض، عن الأرض، لأنها تتمتع بطاقة أعلى، وبالمثل، يمكنك أن ترى نوعًا ما أن السحابة الإلكترونية أكبر نوعًا ما لأنها تحتوي على طاقة أكبر.  يمين؟ لكن اتضح، وعلى عكس\nما نراه هنا، أن هناك أشكالًا أخرى\nيمكن للإلكترونات أن تتخذها عند مستوى الطاقة الجديد هذا. على سبيل المثال، هناك شكل آخر\nيمكن أن تتخذه السحابة الإلكترونية يشبه هذا إلى حد ما. إنه رائع، أليس كذلك؟ لا تقلق كثيرًا بشأن\nكيفية حصولنا على هذا الشكل وكل ذلك، فمن الصحيح أن هناك\nأشكالًا متعددة يمكن أن يتخذها، ولكن المهم هو أن هذا الإلكترون في الوقت الحالي في مستوى طاقة أعلى  ، مستوى الطاقة الثاني المتوفر. وإذا قمت بتزويد المزيد من الطاقة، مرة أخرى، ما يكفي من الطاقة\nللوصول إلى المستوى التالي، حسنًا، سيتغير الشكل مرة أخرى، وسيصبح أكبر. وعلى هذا المستوى، يمكن أن يكون هناك المزيد من\nالتحولات. إنه رائع. لكن هذا هو النموذج الذي لدينا اليوم. هذا هو\nالنموذج الميكانيكي الكمي للذرات. ولإعطاء بعض\nالأسماء التقنية هنا، هذه الأشكال المختلفة\nالتي تحدثنا عنها، نسميها المدارات. لاحظ أنه ليس مدارًا. لا يعني ذلك أن الإلكترون يدور، فهذه السحابة بأكملها\nتمثل إلكترونًا، ونحن نسمي ذلك المدارات. ومستويات الطاقة هذه، حسنًا، نعطيها اسمًا أيضًا. نحن نسمي ذلك رقم الكم الرئيسي. اسم فاخر، لكن كل ما يخبرنا به هو مستوى الطاقة الذي توجد به\nهذه المدارات، أليس كذلك؟ جميع المدارات عند\nعدد كمي معين سيكون لها دائمًا\nنفس مستوى الطاقة، حسنًا؟ وبالطبع، إذا كنت تتساءل كيف يمكننا توفير تلك الطاقة؟ حسنًا، هناك طرق متعددة للقيام بذلك. عن طريق الاصطدام، أو عن طريق تسخين الذرات، أو حتى عن طريق إشعاع بعض الضوء عليها، هناك طرق متعددة\nيمكننا من خلالها توفير الطاقة.  كل ما في الأمر هو أنه إذا قمت بتزويد\nالكمية المناسبة من الطاقة، فيمكن للإلكترونات القفز إلى\nمستويات طاقة أعلى. لكن بالنسبة لأغراضنا، فإن الأشكال والمدارات\nليست مهمة حقًا. ما أهمية\nمستويات الطاقة المختلفة هذه، وفهم ما\nيحدث عندما تقفز الإلكترونات من واحدة إلى أخرى، أليس كذلك؟ لذلك، دعونا\nنتخلص من الأشكال، ونستخدم الدوائر لتمثيل\nمستويات الطاقة المختلفة. إذن مرة أخرى، ما رسمته هنا، انظر، هذا يمثل\nأول مستوى طاقة متاح للإلكترون. لا يعني ذلك أن الإلكترونات\nتدور هنا، حسنًا؟ ثم لديك مستوى الطاقة الثاني، تمامًا مثل ما رأيناه في المدار، مستوى الطاقة الثاني أكبر. مستوى الطاقة الثالث أكبر، وهو أبعد، وهكذا\nدواليك. ومرة أخرى، هذه هي\nأرقام الكم الرئيسية، التي تمثل مستويات الطاقة. ولكن كم عدد\nمستويات الطاقة لدينا؟ هذا سؤال جيد. حسنًا، اتضح أنني\nرسمت أربعة فقط، لكن اتضح أن\nهناك مستويات طاقة لا حصر لها يمكنك الحصول عليها. يمكنك أن تتخيل\nوضع عدد لا حصر له من الخطوات هنا. وبعد ذلك يمكنك أن تفعل ذلك. إذا واصلت تقليل حجم الخطوة، فيمكنك أن تتخيل أنه\nيمكنك الاستمرار في الضغط على الكثير والكثير\nوالكثير من الخطوات. هذا هو الأساس كيف هي\nمستويات الطاقة. ويمكننا توضيح ذلك باستخدام رسم بياني، أي رسم تخطيطي لمستويات الطاقة،\nالذي يبدو بهذا الشكل. انظر، هذا هو مستوى الطاقة الأول، ومستوى الطاقة الثاني، ومستوى الطاقة الثالث، ومستوى الطاقة الرابع، والخامس،\nوالسادس، والسابع، والثامن، والتاسع. وفي النهاية لديك\nمستوى طاقة لا نهائي. الآن هذا لا يعني أن الأمر\nيتطلب طاقة لا نهائية للذهاب إلى هنا. لا، لا، لا، انظر، انظر، يتطلب الأمر قدرًا محدودًا من\nالطاقة للانتقال من هنا إلى هنا، لكنني وضعت خطوات لا حصر لها بينهما عن طريق تقليل حجم الخطوة. وبطريقة مماثلة،\nيمكنك أن تعتقد أن هناك مستويات لا حصر لها\nيمكننا وضعها من هنا إلى هنا. يمكنك أن تتخيل نوعًا ما\nعندما تكون بعيدًا جدًا عن البروتون، فأنت تقريبًا في\nمستوى الطاقة اللانهائي. إذن أنت لا تحتاج إلى طاقة لا نهائية للذهاب إلى هنا، حسنًا؟ على أي حال، يأتي السؤال الآن ماذا يحدث عندما\nتقفز الإلكترونات إلى مستوى طاقة أعلى؟ حسنًا، أولًا،\nنسمي هذه الحالة الأرضية، ونطلق على\nمستويات الطاقة الأعلى الأخرى هذه الحالة المثارة. لنفترض أننا قمنا بتسخين ذرة، ويقفز الإلكترون\nمن الحالة الأرضية إلى المستوى الثالث،\nالحالة المثارة هنا، حسنًا؟ ماذا يحدث لها؟ اتضح أن الإلكترونات لا يمكنها\nالبقاء في الحالة المثارة لفترة طويلة لأنها غير مستقرة على الإطلاق. ولذا\nسيحاولون على الفور العودة إلى أي مستوى طاقة متاح أقل. لذلك من الممكن أن يقفز\nمباشرة من ثلاثة إلى واحد، أو من الممكن أن\nيقفز من ثلاثة إلى اثنين، ومن ثم اثنين إلى واحد. كل شيء ممكن، حسنا؟ وعندما يفعل ذلك، أي عندما يقفز من\nمستوى أعلى إلى مستوى أدنى، يكون الإلكترون قد فقد بعض الطاقة. أين تذهب الطاقة؟ الطاقة يجب أن تذهب إلى مكان ما،\nوالحفاظ على الطاقة. وتخرج هذه الطاقة على شكل فوتون من الضوء. على سبيل المثال، إذا\nقفز الإلكترون من المستوى الثالث إلى المستوى الثاني، فإنه يطلق\nفوتونًا من الضوء، وسيكون لهذا الفوتون نفس طاقة الفرق بين\nهاتين الطاقتين. الآن اتضح بالنسبة للهيدروجين، إذا قمت بالفعل بالحساب، الفرق بين مستويات الطاقة للمستوى الثالث والمستوى الثاني، تلك الطاقة تتوافق\nمع اللون الأحمر للضوء. يمكنك أن تتذكر أن\nطاقة الفوتون ترتبط بتردده أو طوله الموجي. كلما زادت طاقة\nالفوتون، زاد تردده، أو قصر الطول الموجي. بالنسبة لهذا الاختلاف في الطاقة، يكون الطول الموجي أو\nالتردد باللون الأحمر. وبالمثل، ماذا سيحدث\nإذا قفز الإلكترون من أربعة إلى اثنين؟ حسنًا، يمكنك أن تتخيل نوعًا ما،\nأربعة إلى اثنين هي قفزة أكبر، مما يعني فقدان المزيد من الطاقة، وبالتالي فإن طاقة\nالفوتون ستكون أعلى. وبالتالي فإن التردد\nسيكون أعلى من اللون الأحمر. اتضح أنها سوف تقع في\nمكان ما باللون الأزرق. وإذا كانت القفزة من\nخمسة إلى اثنين، ومن ستة إلى اثنين، فستكون أكثر نحو،\nكما تعلمون، البنفسجي والنيلي.  وبعد ذلك من الساعة السابعة إلى الثانية وهكذا، تصبح الأشعة فوق البنفسجية،\nولن نتمكن من رؤيتها. حسنًا، ماذا عن القفزات الأخرى؟ على سبيل المثال، لديك، على\nسبيل المثال، القفز من اثنين إلى واحد. حسنًا، اتضح أن\nهذه القفزة في الطاقة كبيرة جدًا، وربما لم أرسمها بدقة، ولكن تبين أنها كبيرة جدًا لدرجة أنها تقع في المنطقة فوق البنفسجية، والتي لن نتمكن من رؤيتها  . في الواقع، باستثناء\nهذه القفزات الأربع للهيدروجين، باستثناء هذه القفزات الأربع، فإن جميع القفزات الأخرى ستكون إما في المنطقة فوق البنفسجية، وهي ذات\nتردد مرتفع جدًا بحيث لا نستطيع رؤيته، أو ستكون صغيرة جدًا، وتردد منخفض جدًا، مثل  فرق الطاقة هنا، مثل أربعة إلى ثلاثة، أو خمسة\nإلى أربعة، أو ستة إلى ثلاثة. ستكون صغيرة جدًا، مرة أخرى، سيكون التردد\nمنخفضًا جدًا بحيث لا نستطيع رؤيته. لذلك عندما يتعلق الأمر بالهيدروجين، فإن هذه القفزات الأربع فقط هي التي\nنراها. وهذا يعني أن هذه هي الألوان الأربعة الوحيدة التي ينبعث منها ضوء الهيدروجين\nفي المنطقة المرئية. وهذا يعني أنك إذا\nأخذت غاز الهيدروجين ثم قمت بضربه، نظرًا لوجود الكثير من الذرات، سيكون هناك الكثير من التحولات الإلكترونية التي\nتحدث بشكل مستمر، تقريبًا كل القفزات المحتملة التي يمكنك التفكير فيها ستحدث، و  ولذلك سيخرج الضوء، ويتوهج غاز الهيدروجين. لكن في الجزء المرئي، سيتكون الضوء فقط من هذه الأطوال الموجية الأربعة المحددة. لذا، سنرى ضوءًا\nعبارة عن مزيج من هذه الأطوال الموجية الأربعة. وإذا استخدمنا بعد ذلك، على سبيل المثال، منشورًا، أو ما يشبه محزوز الحيود، والذي يمكنه فصل تلك\nالأطوال الموجية المحددة، فيمكنك رؤية هذه\nالأطوال الموجية الأربعة بشكل منفصل، وسيبدو الأمر بهذا الشكل إلى\nحد ما. وسنسمي هذا بالطيف الذري، أو طيف الهيدروجين. والأمر الرائع في الطيف الذري هو أن كل عنصر سيكون\nله مستوى طاقة خاص به. وهذا يعني أن كل عنصر سيعطي ألوانًا محددة جدًا من الضوء، وأطوال موجية محددة جدًا من الضوء. إذن هذه الأطوال الموجية\nخاصة بالهيدروجين. الهيليوم، على سبيل المثال، سيعطي\nأطوال موجية مختلفة جدًا من الضوء. دعونا نريكم كيف يبدو الهيليوم. تبدو هكذا. هذه الأطوال الموجية للضوء هي\nسمة الهيليوم. وهذا يعني أن الطيف الذري يشبه توقيع ذلك العنصر. لذا غدًا، إذا كان لدينا غاز غير معروف، وأردنا معرفة المادة التي يتكون منها، فسنقوم بتسخينه\nوننظر إلى طيفه. وإذا كان هذا الطيف يبدو هكذا، فإن ما يمكننا فعله هو أن نقول ذلك، ويمكننا أن ننظر إلى هذه\nالخطوط ونستطيع أن نقول، مهلاً، مهلاً، انظر، انظر،\nهذه هي العناصر، هذه هي الخطوط التي\nلا تمثل سوى  تأتي من الهيدروجين. لذلك يجب أن يكون هناك هيدروجين منه. ومن ثم يمكننا أن ننظر إلى\nهذه الأطوال الموجية ونقول، هذه الأطوال الموجية\nتأتي فقط من الهيليوم. لن تعطيني أي عناصر أخرى\nهذه الخطوط، لذلك يجب أن يكون هناك أيضًا الهيليوم فيها، وهكذا دواليك. ومن خلال النظر إلى السطوع، يمكننا أيضًا معرفة\nأيهما أكثر وفرة. على سبيل المثال، هنا يمكنك رؤية خطوط الهيدروجين أكثر سطوعًا، لذلك يمكننا القول أن هناك\nهيدروجين أكثر مقارنة بالهيليوم. وهذا ما يسمى التحليل الطيفي. وبالمناسبة، هذا النوع\nمن الطيف يسمى طيف الانبعاث، لأنه هو الطيف الذي نحصل عليه، لأن تلك الألوان المحددة\nتنبعث من الذرات. لكن ربما تتساءل، هل هناك أي نوع آخر من الطيف؟ نعم، إذا نظرت إلى\nالطيف الذي تحصل عليه من الشمس، على سبيل المثال، فلن ترى هذا. بدلًا من ذلك، ما ستجده هو أنك\nسترى لونًا مستمرًا، وسيتم امتصاص بعض الخطوط. في الواقع، تلك الخطوط المحددة التي رسمناها هنا\nفي طيف الانبعاث، سيتم امتصاصها بالفعل. وستكون هناك\nعناصر أخرى في هذا الطيف، وبالتالي ستكون هناك\nخطوط أخرى أيضًا. لكن الخطوط ستبدو ممتصة، وبعض الألوان سيتم امتصاصها.  وهذا ما نسميه\nبطيف الامتصاص. هذا ما سنحصل عليه إذا نظرت، على سبيل المثال، إلى طيف الشمس. ولكن لماذا نحصل على ذلك؟ لماذا نحصل على شيء مثل هذا؟ حسنا دعنا نري. عندما تنظر إلى\nالشمس، على سبيل المثال، يكون قلب الشمس حارًا جدًا، حارًا جدًا. ومثل هذه الأجسام الساخنة والكثيفة، فإنها تميل إلى إصدار الضوء الأبيض. كل الألوان، لا تفعل ذلك، إنها تعطي الضوء الأبيض فقط، حسنًا؟ لذا، إذا كنت تريد فقط\nرؤية هذا الضوء من خلال المنشور، فيجب أن نتوقع كل ألوان قوس قزح فقط، أليس كذلك؟ ومع ذلك، فإن الطبقة الخارجية أكثر برودة بكثير، وبالتالي فإن الذرات هنا\nسوف تمتص الضوء هنا. الآن، إذا كان هناك هيدروجين، على سبيل المثال، ما هي ألوان الضوء، وما هي الأطوال الموجية للضوء التي سوف يمتصها؟  سوف يمتص فقط تلك\nالأطوال الموجية للضوء التي تمتلك فوتوناتها طاقة كافية لمنحها هذه التحولات، مما يعني أنها في القسم المرئي، سوف تمتص هذه\nالألوان المحددة من الضوء. وبالمثل، إذا كان هناك\nالهيليوم والكربون، جميعهم، مرة أخرى، سوف يمتصون\nألوانهم المميزة، كما تعلمون.  ولهذا السبب\nستكون هذه الألوان المحددة مفقودة، ولهذا السبب\nسنرى خطوطًا داكنة هنا. لكن انتظر ثانية. بمجرد أن يمتصوها، ألا يجب عليهم أيضًا إطلاق سراحهم مرة أخرى؟ نعم، إنها تطلق تلك الألوان، ولكن عندما تنظر هنا، سيتم امتصاص تلك الألوان\nمن الطبقة الخارجية، ثم سيتم إطلاقها\nفي الاتجاه الآخر. سوف تنبعث مرة أخرى\nفي الاتجاهات الأخرى، لكنها سوف تنبعث في\nجميع الاتجاهات الأخرى. لذا في الغالب في هذا الاتجاه،\nستكون تلك الألوان مفقودة، ولهذا السبب تحصل على\nطيف الامتصاص. لكن التحليل هو نفسه. من خلال النظر إلى الألوان التي يتم امتصاصها، وأي أطوال موجية معينة يتم امتصاصها، يمكنك تحديد\nالعناصر الموجودة، على سبيل المثال، في الغلاف الجوي الخارجي هنا. وهذه هي الطريقة التي نتعرف بها على\nالعناصر الموجودة داخل الغلاف الجوي\nللكواكب الخارجية المختلفة على سبيل المثال. لذا، سواء حصلت على طيف الامتصاص أو طيف الانبعاث، فهذا يعتمد في الواقع\nعلى زاوية التلويح. لكن بغض النظر،\nيبقى التحليل كما هو، حسنًا؟ الآن إليكم ملخصًا رائعًا وجدته على\nصفحة تلسكوبات الويب هنا، حسنًا؟ خلاصة كل ما رأيناه، الضوء الذي نحصل عليه\nمباشرة من المصادر الساخنة سيكون طيفًا مستمرًا. إذا كانت هناك أشياء أكثر\nبرودة نسبيًا، مثل الغازات مثل السدم،\nأو الطبقات الخارجية، فسوف تمتص، وما ستراه الآن هو\nطيف الامتصاص. لكن إذا كانت زاوية التلويح بحيث ترى مباشرة الضوء القادم من تلك الغازات التي تمتص الضوء، فستكون قادرًا على\nرؤية طيف الانبعاث.",
    "t_italian": "- [Istruttore] Possiamo\nguardare le stelle o le nebulose, o anche i pianeti\nmolto, molto lontani, e valutare cosa le compone, quali sono gli elementi che ci\nsono al loro interno? Ma come lo facciamo? Come possiamo sederci qui sulla Terra e capire quali\nelementi sono presenti, ad esempio, nell'atmosfera di un pianeta extrasolare?  Lo facciamo utilizzando gli spettri atomici e l'analisi spettrale. Ma cosa sono esattamente queste cose? Bene, scopriamolo. Cominciamo guardando\nil modello di un atomo e considereremo\nquello più semplice, l'atomo di idrogeno.  Sappiamo che all'interno dell'atomo di idrogeno ci sono un\nprotone e un elettrone. E nelle raffigurazioni più popolari mostriamo l'elettrone che gira\nattorno al protone, giusto? Ma questo non è il modello giusto, perché gli elettroni\nnon sono minuscole palline di materia che girano in\nquesto modo, come i pianeti. Invece, sono oggetti quantistici che hanno proprietà sia di particelle\nche di onde. E una delle proprietà delle onde\nè che le onde sono sparse, non si trovano in un punto particolare, ma sono sparse, il che significa che anche gli elettroni sono sparsi. La chiamiamo nuvola di elettroni. E queste nuvole di elettroni\npossono avere forme diverse. Ad esempio, se consideriamo l'idrogeno al suo livello energetico più basso, la forma dell'elettrone sembra assomigliare a questa. È un po' come una sfera. E non è che l'elettrone\nstia orbitando qui. No, no, no, questa nuvola\nche ho disegnato qui rappresenta essa stessa l'elettrone. Ora ecco la domanda principale per noi. Cosa succede a questo atomo\nse gli forniamo energia? Quando fornisci energia, l'elettrone assorbe l'energia. E la domanda è: cosa gli succede? Bene, se c'è abbastanza energia, allora l'elettrone può\nassorbirla e sfuggire all'atomo. In tal caso, l'\nelettrone semplicemente gli sfugge e qui ti rimane solo\nun singolo protone. Ok, ma cosa succede se non gli\ndai così tanta energia?  E se gli dessi un\npo' di energia, non abbastanza energia per sfuggirgli, ma solo un po' di energia? Allora cosa succede? Ooh, ora\npossono succedere alcune cose interessanti. E per capirlo,\nfacciamo un'analogia qui. La mia analogia preferita è\npensare a un pozzo in cui hai una palla qui. Questa palla è analoga\nall'elettrone qui, proprio come questa palla si\ntrova all'interno di un pozzo. E se vogliamo che la palla\nscappi così bene, dobbiamo fornirle energia\n, abbastanza energia. In modo simile,\nanche questo elettrone è seduto, anche questa nuvola di elettroni è\nseduta all'interno di un pozzo. La differenza è che qui\nhai un bene fisico causato dalla gravità. Qui è un tipo diverso di pozzo, è un pozzo causato\nda forze elettriche. Lo chiamiamo\npozzo potenziale, in generale, ma l'idea è la stessa. Per sfuggire a quel bene, dobbiamo\nfornirgli abbastanza energia. E ora la grande domanda era: cosa accadrebbe se non fornissimo così tanta energia?  E se fornissi un po' di energia? Allora cosa succederà? Beh, potremmo pensare che\nnon succederà nulla. Se fornissi un po' di energia, beh, tornerà giù, giusto? Ebbene, si scopre che il\npotenziale qui non è così. Invece, si\npuò pensare che il pozzo potenziale assomigli in qualche modo a questo. Ciò che vediamo è che ci\nsono diversi livelli a cui la palla può stare.  In questo momento è al livello più basso, che numereremo come uno. Ora, se gli forniamo così tanta energia, la palla può effettivamente andare a fermarsi a due. Questo è possibile, c'è\nun altro livello di energia al quale la palla può sedersi. Se fornisci ancora più energia, la palla può posizionarsi a un\nlivello di energia leggermente più alto e così via. Indovina un po', lo stesso\nvale per i nostri elettroni. In questo momento, questo elettrone\nè al suo livello più basso, ma ci sono altri livelli più alti\nche possono occuparlo. Se fornisce energia appena sufficiente,\npuò passare a livelli più alti. E quando lo farà, la nuvola di elettroni cambierà forma. Lasciate che vi faccia solo un esempio. Quindi se forniamo energia appena sufficiente affinché l'elettrone\npossa saltare, diciamo, al livello successivo come questo, allora la forma dell'elettrone\ncambierà. La nuova forma sarebbe\nsimile a questa. Questo è al livello energetico due, il successivo livello energetico disponibile. E potete vedere proprio\ncome la palla è ora più lontana dalla\nterra, dal suolo, perché ha un'energia più elevata, allo stesso modo, potete vedere che la nuvola di elettroni è un po' più grande perché ha più energia,  Giusto? Ma a differenza di\nquello che vediamo qui, ci sono altre forme\nche gli elettroni possono assumere a questo nuovo livello di energia. Ad esempio, un’altra forma che\npuò assumere la nuvola di elettroni è simile a questa. È davvero bello, vero? Non preoccuparti troppo di\ncome otteniamo questa forma e tutto il resto, è solo vero che ci sono più\nforme che può assumere, ma ciò che è importante è che in questo momento questo elettrone si trova a un livello energetico più elevato  , il secondo livello di energia disponibile. E se fornisco ancora più energia, ancora una volta, solo l'energia sufficiente per\nraggiungere il livello successivo, beh, la forma cambierà di nuovo, diventerà ancora più grande. E a questo livello, possono\nesserci ancora più spostamenti. È molto bello. Ma questo è il modello che abbiamo oggi. Questo è il\nmodello quantomeccanico degli atomi. E giusto per dare qualche\nnome tecnico, queste diverse forme\ndi cui abbiamo parlato, le chiamiamo orbitali. Notate, non è un'orbita. Non è che l'elettrone sia in orbita, l'intera nuvola stessa\nrappresenta un elettrone e lo chiamiamo orbitali. E a questi livelli energetici, beh, diamo un nome anche a loro.  Lo chiamiamo numero quantico principale. Un nome di fantasia, ma ci dice solo a quale livello energetico si\ntrovano questi orbitali, giusto? Tutti gli orbitali di un\nparticolare numero quantico avranno sempre lo\nstesso livello di energia, ok? E, naturalmente, se ti stai chiedendo come forniamo quell'energia? Bene, ci sono diversi modi per farlo. Attraverso la collisione, il riscaldamento degli atomi o anche l'irradiazione di luce su di essi, esistono diversi modi in\ncui possiamo fornire energia. È solo che se fornisci\nla giusta quantità di energia, gli elettroni possono saltare a\nlivelli energetici più alti. Ma per i nostri scopi, le forme e gli orbitali\nnon sono realmente importanti. Ciò che è importante sono questi\ndiversi livelli energetici e capire cosa\nsuccede quando gli elettroni saltano da uno all'altro, giusto? Quindi, per questo,\nliberiamoci delle forme e usiamo i cerchi per rappresentare\ni diversi livelli di energia. Quindi, ancora una volta, quello che ho disegnato qui, guarda, questo rappresenta\nil primo livello di energia disponibile per l'elettrone. Non significa che gli elettroni\norbitano qui, ok? Poi c'è il secondo livello di energia, proprio come quello che abbiamo visto nell'orbitale, il secondo livello di energia è più grande. Il terzo livello energetico è ancora più grande, è ancora più lontano\ne così via. E ancora, questi sono i\nprincipali numeri quantici, che rappresentano i livelli energetici. Ma quanti livelli energetici di questo tipo\nabbiamo? Questa è una bella domanda. Bene, a quanto pare ne\nho pescati solo quattro, ma a quanto pare ci\nsono infiniti livelli di energia che puoi avere. Puoi immaginare di\nmettere un numero infinito di gradini qui. E poi puoi farlo. Se continui a diminuire la dimensione del passo, puoi in un certo senso immaginare di\npoter continuare a spremere molti, e molti, e\nmolti, e molti passi. Fondamentalmente\ni livelli di energia sono così. E possiamo mostrarlo usando un diagramma, un diagramma del livello energetico,\nche assomiglia a questo. Quindi guarda, questo è il primo livello energetico, il secondo livello energetico, il terzo livello energetico, il quarto livello energetico, il quinto, il\nsesto, il settimo, l'otto, il nono. E alla fine ottieni\nil livello di energia infinito. Ora, ciò non significa che ci\nvoglia un'energia infinita per andare qui. No, no, no, guarda, guarda, ci vuole una quantità finita di\nenergia per andare da qui a qui, ma ho messo infiniti passi in mezzo riducendo la dimensione del passo. In modo simile, si\npuò pensare che ci siano infiniti livelli che\npossiamo mettere da qui a qui. Puoi immaginare che\nquando sei molto lontano dal protone, sei praticamente al\nlivello di energia infinita. Quindi non ti serve un'energia infinita per venire qui, ok? Ad ogni modo, ora arriva la domanda: cosa succede quando gli elettroni\nsaltano a un livello energetico più elevato? Bene, prima di tutto\nchiamiamo questo stato fondamentale e chiamiamo questi altri\nlivelli energetici più elevati stato eccitato. Quindi diciamo che riscaldiamo un atomo e l'elettrone salta\ndallo stato fondamentale al terzo livello, lo\nstato eccitato qui, ok? Cosa gli succede?  Si scopre che gli elettroni non possono\nrimanere a lungo nello stato eccitato perché sono molto instabili. E così\ncercheranno immediatamente di tornare a qualsiasi livello di energia disponibile più basso. Quindi è possibile che possa saltare\ndirettamente da tre a uno, oppure è possibile che\npossa saltare da tre a due, e poi da due a uno. Tutto è possibile, ok? E quando lo fa, quando salta da un\nlivello superiore a un livello inferiore, l’ elettrone ha perso un po’ di energia. Dove va l'energia? L'energia deve andare da qualche parte, il\nrisparmio energetico. Quell'energia si spegne come un fotone di luce. Quindi, ad esempio, se l'\nelettrone salta dal livello tre al livello due, rilascia\nun fotone di luce e quel fotone avrà la stessa energia della differenza tra\nqueste due energie. Ora risulta che per l'idrogeno, se si fa effettivamente il calcolo, la differenza tra i livelli di energia per il livello tre e il livello due, quell'energia corrisponde\nal colore rosso della luce. Puoi ricordare che l'\nenergia di un fotone è correlata alla sua frequenza o alla sua lunghezza d'onda. Maggiore è l'energia del\nfotone, maggiore è la sua frequenza, o minore è la lunghezza d'onda. Per questa particolare differenza di energia, la lunghezza d'onda o la\nfrequenza sembra essere di colore rosso.  Allo stesso modo, cosa accadrebbe\nse l’elettrone saltasse da quattro a due? Beh, puoi immaginare,\nquattro a due è un salto più grande, il che significa più energia persa, quindi l'energia del\nfotone sarà più alta. La frequenza quindi\nsarebbe superiore al colore rosso.  Si scopre che si troverà\nda qualche parte nel colore blu. E se il salto è da\ncinque a due, e da sei a due, sarà ancora più verso,\nsai, il viola, l'indaco. E poi dalle sette alle due e così via diventa ultravioletto,\nnon potremo vederlo. Ok, che mi dici degli altri salti? Ad esempio, devi\nsaltare da due a uno. Bene, a quanto pare\nquesto salto di energia è così grande, e probabilmente non l'ho disegnato accuratamente, ma risulta essere così grande che anche quello si trova nella regione dell'ultravioletto, e non saremo in grado di vederlo  . Infatti, ad eccezione di\nquesti quattro per l'idrogeno, ad eccezione di questi quattro salti, tutti gli altri salti o saranno nella regione dell'ultravioletto, con una\nfrequenza troppo alta per noi da vedere, o saranno troppo piccoli, con una frequenza troppo bassa, come il  differenza di energia qui, come quattro a tre, o cinque\na quattro, o sei a tre. Saranno così piccoli che, ancora una volta, la frequenza sarà\ntroppo bassa per essere vista. Quindi, quando si tratta di idrogeno, sono visibili solo questi quattro salti\n. Ciò significa che questi sono gli unici quattro colori che la luce dell’idrogeno\nemetterà nella regione visibile. Quindi questo significa che se\nprendessi un gas idrogeno e poi lo mettessi in moto, poiché ci sono così tanti atomi, ci sarebbero così tante transizioni elettroniche che\navvengono continuamente, quasi tutti i possibili salti a cui puoi pensare accadrebbero, e  quindi uscirà la luce e l'idrogeno gassoso brillerà. Ma nella sezione visibile, la luce sarà composta solo da queste quattro lunghezze d'onda specifiche. Quindi vedremo una luce\nche è una combinazione di queste quattro lunghezze d'onda. E se poi usiamo, diciamo, un prisma, o qualcosa come un reticolo di diffrazione, che può separare quelle\nparticolari lunghezze d'onda, allora potete vedere queste\nquattro lunghezze d'onda individuali separatamente, e il risultato sarà\nsimile a questo. E lo chiameremo spettro atomico o spettro dell'idrogeno. E la cosa bella dello spettro atomico è che ogni elemento\navrà il proprio livello di energia. Ciò significa che ogni elemento emetterà colori di luce molto specifici, lunghezze d'onda della luce molto specifiche. Quindi queste lunghezze d'onda sono\nspecifiche dell'idrogeno. L'elio, ad esempio, darà\nlunghezze d'onda della luce molto diverse. Lascia che ti mostriamo come appare l'elio. Sembra così. Queste lunghezze d'onda della luce sono\nle caratteristiche dell'elio. Quindi questo significa che uno spettro atomico è come una firma di quell'elemento. Quindi domani, se abbiamo un gas sconosciuto e vogliamo capire di cosa è fatto, lo riscalderemo\ne ne osserveremo lo spettro. E se lo spettro assomiglia a questo, allora quello che possiamo fare è dirlo, e possiamo guardare queste\nlinee e dire, ehi, ehi, guarda, guarda,\nquesti sono gli elementi, queste sono le linee che\nsolo  provengono dall'idrogeno. Quindi deve esserci idrogeno da esso. E poi possiamo guardare\nqueste lunghezze d'onda e dire, ehi, queste lunghezze d'onda\nprovengono solo dall'elio. Nessun altro elemento\nmi darà queste linee, quindi deve esserci anche dell'elio, e così via. E osservando la luminosità possiamo anche capire\nquale è più abbondante. Quindi, per esempio, qui potete vedere che le linee dell'idrogeno sono più luminose, quindi possiamo dire che c'è più\nidrogeno rispetto all'elio. Questa si chiama analisi spettrale. E comunque, questo tipo\ndi spettro è chiamato spettro di emissione, perché è lo spettro che otteniamo, perché quei colori specifici\nsono emessi dagli atomi. Ma forse ti starai chiedendo, beh, esiste qualche altro tipo di spettro? Sì, se guardassi\nlo spettro che ottieni, diciamo, dal Sole, non lo vedresti. Invece, ciò che scoprirai è che\nvedrai un colore continuo e alcune linee verranno assorbite. Infatti, quelle linee specifiche che disegniamo qui\nnello spettro di emissione, quelle linee verranno effettivamente assorbite. E ci saranno altri\nelementi in quello spettro, e quindi ci\nsaranno anche altre linee. Ma le linee sembreranno assorbite, alcuni colori verranno assorbiti. E questo lo chiamiamo\nspettro di assorbimento. Questo è ciò che otterremo se guardiamo, ad esempio, lo spettro del Sole. Ma perché lo capiamo? Perché stiamo ottenendo qualcosa del genere? Bene vediamo. Quando guardi\nil Sole, ad esempio, il nucleo del Sole è estremamente caldo, molto caldo. E oggetti così caldi e densi tendono a emettere luce bianca. Tutti i colori non fanno così, emettono solo luce bianca, ok? Quindi se vedessimo solo\nquella particolare luce attraverso il prisma, allora dovremmo aspettarci solo tutti i colori dell'arcobaleno, giusto? Tuttavia, lo strato esterno è molto più freddo, quindi gli atomi qui\nassorbiranno la luce qui. Ora, se c'è idrogeno, per esempio, quali colori della luce, quali lunghezze d'onda della luce assorbirà? Assorbirà solo quelle\nlunghezze d'onda della luce i cui fotoni hanno energia appena sufficiente per dare loro queste transizioni, il che significa che nella sezione visibile assorbiranno questi\nspecifici colori di luce. E allo stesso modo, se ci sono\nelio e carbonio, tutti, ancora una volta, assorbiranno i\nloro caratteristici colori. Ed è per questo che\nmancheranno quei colori specifici, ed è per questo che\nvedremo delle linee scure qui. Ma aspetta un secondo. Una volta assorbiti, non dovrebbero anche rilasciarli di nuovo? Sì, rilasciano quei colori, ma quando guardi qui, quei colori verranno assorbiti\ndallo strato esterno e poi verranno rilasciati\nin tutta l'altra direzione. Verranno emessi\nnelle altre direzioni, ma verranno emessi in\ntutte le altre direzioni. Quindi, soprattutto in questa direzione,\nquei colori mancheranno, ed è per questo che ottieni\nlo spettro di assorbimento. Ma l’analisi è la stessa. Osservando quali colori vengono assorbiti, quali particolari lunghezze d'onda vengono assorbite, è possibile identificare quali\nelementi sono presenti, ad esempio, nell'atmosfera esterna qui.  In questo modo, ad esempio,\nindividuiamo gli elementi presenti nell'atmosfera di\ndiversi esopianeti. Quindi se ottieni uno spettro di assorbimento o uno spettro di emissione dipende in realtà\ndal tuo angolo di onda. Ma nonostante tutto, l'analisi\nrimane la stessa, ok? Ora ecco un bel riassunto che ho trovato sulla\npagina web dei telescopi qui, ok? Riassumendo tutto ciò che abbiamo visto, la luce che otteniamo\ndirettamente dalle fonti calde sarebbe uno spettro continuo. Se ci sono cose\nrelativamente più fredde, gas come le nebulose\no gli strati esterni, allora assorbiranno e quello che vedrai ora è\nlo spettro di assorbimento. Ma se l'angolo dell'onda è tale da vedere direttamente la luce proveniente dai gas che assorbono la luce, allora sarai in grado di\nvedere lo spettro di emissione."
}