{
    "source": "NpoN-H7i1pA",
    "youtubelink": "https://www.youtube.com/watch?v=NpoN-H7i1pA",
    "t_english": "- Hi, I'm Michelle, a professional learning specialist here at Khan Academy, and a former classroom teacher just like you, Meet Khanmigo, your AI-driven companion, who's revolutionizing teaching for a more engaging and efficient experience. Khanmigo has many exciting features that support teachers, and this video will showcase ways that you can use Khanmigo to create course-specific social studies content to enhance the learning experience for all of your students. Throughout this video, we'll explore ways Khanmigo can assist you with creating unique and engaging lesson plans and student-centered activities that get students excited about social studies while saving you time. Ready to see the teaching assistant you've always wanted? Let's take a look. This is Khanmigo's dashboard, brimming with a multitude of unique time-saving features, all tailored to elevate your teaching experience. Let's begin with the lesson hook feature. Igniting a love for social studies may be tough, but it's incredibly rewarding when successful. With Khanmigo's support, I'm set to create engaging lesson-starters that stir students' interest in history. Our next adventure is going to be the Great Awakening, and this will be for my ninth grade class. Khanmigo, could you please create some lesson hooks for me? These activities are terrific. The first one incorporates a debate. The next one includes my students creating a timeline of events, and then the last one has my students analyzing excerpts from diaries or letters from individuals who lived during that time. This will definitely get my students excited about this topic. Thanks, Khanmigo. All right, having sparked my students' curiosity in this subject, it's time to craft a compelling lesson with Khanmigo's Lesson Plan feature. This tool will assist in creating a detailed lesson plan, aligning with my curriculum and addressing my students' needs. Upon selecting the Lesson Plan button, Khanmigo invites me to detail the topic I'm preparing to teach. Once provided, a range of topics from Khanmigo's exceptional courses appear for selection. If my topic isn't listed, Khanmigo allows me to select my own content. Upon selecting the lesson plan button, Khanmigo invites me to detail the topic I'm preparing to teach. The Great Awakening. Once provided, a range of topics from Khanmigo's exceptional course library appears for selection. Also, if my topic isn't listed, Khanmigo invites me to select my own content. I'm going to go with the first one, the Great Awakening, and as soon as I find the topic that I want a lesson plan for, I select the button, and immediately Khanmigo gets to work, generating a well-structured detailed lesson plan, custom made for my curriculum and my students. Once crafted, I can review the objectives, the warmup activities, what we're doing for direct instruction, what we're doing for guided practice, independent practice, exit ticket questions. You name it, it's included. And if there's a part of the lesson I don't like, all I have to do is click on it, it'll highlight it, and Khanmigo gives me a couple of prompts to choose from. I can chat about it, I can make changes to it directly, or I can just ask Khanmigo to try something different. I like that much better. Thanks so much, Khanmigo. Another innovative feature is the Leveler, which enables me to adjust the complexity of text to match my students' reading abilities, fostering personalized instruction and catering to each student's needs. In my U.S. Civics class, we're exploring government branches, and I found an article about the judicial branch that would be perfect for my next lesson. However, some of my students grapple with reading comprehension, but you know what? I don't have to worry about that. I can use Khanmigo's leveler feature to tailor the text, ensuring it's digestible and that the concepts are clear for all of my students. I just have to include the topic and then copy and paste the original text in the box and let Khanmigo know what reading level I'd like this to be. I want this to be on a seventh-grade level, please, and then Khanmigo will rewrite it for me. Khanmigo rewrote the entire article for me at a seventh-grade level. Once the article's rewritten at the seventh-grade level, I have a few options. I can print the article or I can export it to Microsoft Word, a PDF, or I can save it to my Google Drive and upload it to my Google Classroom. Once my students complete the article, I'll utilize Khanmigo to generate discussion prompts. My aim is to ignite an engaging conversation that fuels curiosity, promotes involvement, and fosters an intellectual dialogue. I'm going to be doing this with my 11th grade civics class, and we are going to be discussing the judicial branch. With a simple click, Khanmigo crafts a variety of stimulating discussion starters, promising to inspire the rich discourse I desire for my students' learning journey. As a social studies teacher, I need to connect historical events and concepts to current events and students' personal experiences. This helps make the subject matter more relatable and engaging for them, enhancing their understanding and interest. Khanmigo's Make it Relevant feature allows me to do just that. I just have to let Khanmigo know my learning objective, and then I have to let Khanmigo know a little bit about my class. My students love sports. Now, Khanmigo, please make it relevant. I love this idea. Khanmigo has my students Supreme Court cases through a sports lens. They are going to love this. As you can see, integrating Khanmigo into your classroom routine empowers you to tailor Khanmigo's ideas and suggestions to your social studies curriculum while factoring in student needs, learning objectives, and creative resources. Khanmigo's Insights will not only enrich the learning experience for your students, but it will also free up your time, enabling you to concentrate on what truly matters most: your students. Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen, and to never miss exciting announcements about new, free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، \nیہاں خان اکیڈمی میں ایک پیشہ ورانہ سیکھنے کی ماہر، اور آپ کی طرح ایک سابقہ ​​کلاس روم\nٹیچر، آپ کے AI سے چلنے والے ساتھی خانمیگو سے ملو، جو\nزیادہ پرکشش اور موثر تجربے کے لیے تدریس میں انقلاب برپا کر رہا ہے۔ Khanmigo میں بہت ساری دلچسپ\nخصوصیات ہیں جو اساتذہ کو سپورٹ کرتی ہیں، اور یہ ویڈیو ان\nطریقوں کو ظاہر کرے گی جن سے آپ اپنے تمام طلباء کے لیے سیکھنے کے تجربے کو بڑھانے کے لیے کورس کے لیے مخصوص\nسماجی مطالعہ کا مواد بنانے کے لیے Khanmigo کو استعمال کر سکتے ہیں۔ \n اس پورے ویڈیو کے دوران، ہم ان طریقوں کی کھوج کریں گے جن سے Khanmigo\nمنفرد اور دل چسپ اسباق کے منصوبے بنانے میں آپ کی مدد کر سکتا ہے اور\nطلباء پر مبنی سرگرمیاں جو آپ کے وقت کی بچت کرتے ہوئے طلباء کو\nسماجی علوم کے بارے میں پرجوش کرتی ہیں۔ اس ٹیچنگ اسسٹنٹ کو دیکھنے کے لیے تیار ہیں جسے\nآپ ہمیشہ چاہتے ہیں؟ آئیے ایک نظر ڈالتے ہیں۔ یہ Khanmigo کا ڈیش بورڈ ہے، جو وقت بچانے کی بے شمار منفرد خصوصیات سے بھرا ہوا ہے\n، جو\nآپ کے تدریسی تجربے کو بلند کرنے کے لیے تیار کیا گیا ہے۔ آئیے سبق ہک کی خصوصیت کے ساتھ شروع کریں۔ سماجی علوم کے لیے محبت کو بھڑکانا\nمشکل ہو سکتا ہے، لیکن\nکامیاب ہونے پر یہ ناقابل یقین حد تک فائدہ مند ہے۔ خانمیگو کے تعاون کے ساتھ، میں دلچسپ اسباق تیار کرنے کے لیے تیار ہوں جو طلبہ کی تاریخ میں دلچسپی پیدا کریں۔ ہمارا اگلا ایڈونچر\nعظیم بیداری ہونے والا ہے، اور یہ میری نویں جماعت کی کلاس کے لیے ہوگا۔ خانمیگو، کیا آپ براہِ کرم\nمیرے لیے کچھ اسباق تیار کر سکتے ہیں؟ یہ سرگرمیاں لاجواب ہیں۔ پہلا ایک بحث کو شامل کرتا ہے۔ اگلے میں میرے طلباء شامل ہیں جو واقعات کی ایک ٹائم لائن بناتے ہیں، اور پھر آخری میں\nمیرے طلباء کو ڈائریوں کے اقتباسات یا ان\nافراد کے خطوط کا تجزیہ کرنا ہوتا ہے جو اس وقت کے دوران رہتے تھے۔ یہ یقینی طور پر میرے طلباء کو اس موضوع کے بارے میں پرجوش کرے گا۔ شکریہ، خانمیگو۔ ٹھیک ہے، اس موضوع میں\nمیرے طلباء کے تجسس کو ہوا دینے کے بعد، اب وقت آگیا ہے کہ\n خانمیگو کے لیسن پلان کی خصوصیت کے ساتھ ایک زبردست سبق تیار کیا جائے۔ یہ ٹول\nایک تفصیلی سبق کا منصوبہ بنانے، میرے نصاب کے مطابق کرنے اور میرے طلباء کی ضروریات کو پورا کرنے میں مدد کرے گا۔ سبق کی منصوبہ بندی کے بٹن کو منتخب کرنے پر، خانمیگو مجھے اس موضوع کی تفصیل کے لیے مدعو کرتا ہے جس کی میں پڑھانے کی تیاری کر رہا ہوں۔ فراہم کیے جانے کے بعد، خانمیگو کے غیر معمولی\nکورسز میں سے بہت سے موضوعات انتخاب کے لیے ظاہر ہوتے ہیں۔ اگر میرا موضوع درج نہیں ہے تو\nخانمیگو مجھے اپنا مواد خود منتخب کرنے کی اجازت دیتا ہے۔ سبق کی منصوبہ بندی کے بٹن کو منتخب کرنے پر، Khanmigo مجھے اس موضوع کی تفصیل کے لیے مدعو کرتا ہے جس کی میں پڑھانے کی تیاری کر رہا ہوں۔ عظیم بیداری۔ فراہم کرنے کے بعد، خانمیگو کی غیر معمولی کورس لائبریری سے موضوعات کی ایک رینج انتخاب کے لیے ظاہر ہوتی ہے۔ اس کے علاوہ، اگر میرا موضوع درج نہیں ہے، تو خانمیگو مجھے\nاپنا مواد منتخب کرنے کی دعوت دیتا ہے۔ میں سب سے پہلے کے ساتھ جانے والا ہوں،\nعظیم بیداری، اور جیسے ہی مجھے وہ موضوع مل جاتا ہے جس کے لیے میں سبق کا منصوبہ چاہتا ہوں،\nمیں بٹن کو منتخب کرتا ہوں، اور فوراً ہی خانمیگو کام کرنے لگتا ہے، جس سے ایک اچھی ساخت والا\nتفصیلی سبق تیار ہوتا ہے۔  منصوبہ، میرے نصاب اور میرے طلباء کے لیے اپنی مرضی کے مطابق بنایا گیا ہے۔\n ایک بار تیار ہونے کے بعد، میں مقاصد، وارم اپ سرگرمیوں، ہم براہ راست ہدایات کے لیے کیا کر رہے ہیں، گائیڈڈ پریکٹس کے لیے کیا کر رہے ہیں،\nآزاد پریکٹس، ایگزٹ ٹکٹ کے سوالات کا جائزہ لے سکتا ہوں۔ آپ اسے نام دیں، یہ شامل ہے۔ اور اگر سبق کا کوئی حصہ\nمجھے پسند نہیں ہے، تو مجھے صرف\nاس پر کلک کرنا ہے، یہ اسے نمایاں کرے گا، اور خانمیگو مجھے انتخاب کرنے کے لیے چند اشارے دیتا ہے۔\n میں اس کے بارے میں بات کر سکتا ہوں، میں\nاس میں براہ راست تبدیلیاں کر سکتا ہوں، یا میں خانمیگو سے\nکچھ مختلف کرنے کو کہہ سکتا ہوں۔ مجھے یہ بہت بہتر پسند ہے۔ بہت شکریہ، خانمیگو۔ ایک اور اختراعی خصوصیت لیولر ہے، جو مجھے\nمتن کی پیچیدگی کو اپنے طلباء کی پڑھنے کی صلاحیتوں سے مطابقت رکھنے، ذاتی نوعیت کی ہدایات کو فروغ دینے اور ہر طالب علم کی ضروریات کو پورا کرنے کے قابل بناتی ہے۔ میری U.S. Civics کلاس میں، ہم سرکاری شاخوں کو تلاش کر رہے ہیں، اور مجھے\nعدالتی شاخ کے بارے میں ایک مضمون ملا جو میرے اگلے سبق کے لیے بہترین ہوگا۔ تاہم، میرے کچھ طالب علم پڑھنے کی سمجھ میں مبتلا ہیں،\nلیکن آپ جانتے ہیں کیا؟ مجھے اس کے بارے میں فکر کرنے کی ضرورت نہیں ہے۔ میں خانمیگو کے لیولر\nفیچر کو متن کو تیار کرنے کے لیے استعمال کر سکتا ہوں، اس بات کو یقینی بناتا ہوں کہ یہ ہضم ہو\nاور یہ کہ میرے تمام طلباء کے لیے تصورات واضح ہوں۔ مجھے صرف اس\nموضوع کو شامل کرنا ہے اور پھر اصل متن کو باکس میں کاپی اور پیسٹ کرنا ہے اور خانمیگو کو بتانا ہے کہ میں پڑھنے کی کیا سطح چاہتا ہوں۔ میں چاہتا ہوں کہ یہ\nساتویں جماعت کی سطح پر ہو، براہ کرم، اور پھر خانمیگو اسے میرے لیے دوبارہ لکھے گا۔ خانمیگو نے ساتویں جماعت کی سطح پر میرے لیے پورا مضمون دوبارہ لکھا۔ \nساتویں جماعت کی سطح پر مضمون کے دوبارہ لکھے جانے کے بعد، میرے پاس چند اختیارات ہیں۔ میں آرٹیکل پرنٹ کر سکتا ہوں یا میں اسے\nMicrosoft Word، PDF میں ایکسپورٹ کر سکتا ہوں، یا میں اسے اپنی Google Drive میں محفوظ کر کے اپنے Google Classroom میں اپ لوڈ کر سکتا ہوں۔ ایک بار جب میرے طلباء مضمون مکمل کر لیں گے، میں\nبحث کے اشارے پیدا کرنے کے لیے Khanmigo کا استعمال کروں گا۔ میرا مقصد ایک پرکشش گفتگو کو بھڑکانا ہے\n جو تجسس کو بڑھاتا ہے،\nشمولیت کو فروغ دیتا ہے، اور ایک فکری مکالمے کو فروغ دیتا ہے۔ میں یہ\nاپنی 11ویں جماعت کی شہریت کی کلاس کے ساتھ کرنے جا رہا ہوں، اور ہم\nعدالتی شاخ پر بات کرنے جا رہے ہیں۔ ایک سادہ کلک کے ساتھ، Khanmigo مختلف قسم کے محرک\nبحث کے آغاز کو تیار کرتا ہے، جو اپنے طلباء کے سیکھنے کے سفر کے لیے میری خواہش کے بھرپور گفتگو کو متاثر کرنے کا وعدہ کرتا ہے۔\n سماجی علوم کے استاد کے طور پر، مجھے تاریخی\nواقعات اور تصورات کو موجودہ واقعات اور\nطلباء کے ذاتی تجربات سے جوڑنے کی ضرورت ہے۔ اس سے\n ان کے لیے موضوع کو مزید متعلقہ اور پرکشش بنانے میں مدد ملتی ہے، ان کی\nسمجھ اور دلچسپی میں اضافہ ہوتا ہے۔ خانمیگو کی اسے متعلقہ خصوصیت مجھے ایسا کرنے کی اجازت دیتی ہے۔ مجھے صرف خانمیگو کو\nاپنے سیکھنے کا مقصد بتانا ہے، اور پھر مجھے خانمیگو کو اپنی کلاس کے بارے میں تھوڑا سا بتانا ہے۔ میرے طالب علم کھیل کو پسند کرتے ہیں۔ اب، خانمیگو، براہ کرم اسے متعلقہ بنائیں۔ مجھے یہ خیال پسند ہے۔ خانمیگو کے پاس میرے طلباء کے\nسپریم کورٹ کے مقدمات کھیلوں کے عینک کے ذریعے ہیں۔ وہ اس سے محبت کرنے جا رہے ہیں۔ جیسا کہ آپ دیکھ سکتے ہیں، خانمیگو کو اپنے کلاس روم کے معمولات میں ضم کرنا آپ کو طالب علم کی\nضروریات، سیکھنے کے مقاصد، اور تخلیقی وسائل کو مدنظر رکھتے ہوئے اپنے سماجی علوم کے نصاب کے مطابق خانمیگو کے خیالات اور تجاویز کو تیار کرنے کی طاقت دیتا ہے۔ Khanmigo کی بصیرتیں نہ صرف آپ کے طلباء کے لیے سیکھنے کے تجربے کو بہتر بنائے گی، بلکہ یہ آپ کا وقت بھی خالی کرے گی، جس سے آپ اس بات پر توجہ مرکوز کر سکیں گے کہ واقعی سب سے اہم چیز: آپ کے طلباء۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ\nخانمیگو کلاس روم میں آپ کی اور آپ کے طلبہ کی مدد کیسے کر سکتا ہے، اپنی اسکرین پر موجود لنکس کو فالو کریں، اور خان اکیڈمی پر نئے، مفت کورس مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہونے کے لیے\n، سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola, soy Michelle, una especialista en aprendizaje profesional\naquí en Khan Academy y ex\nmaestra como tú. Conoce a Khanmigo, tu compañero impulsado por IA, que está revolucionando la\nenseñanza para ofrecer una experiencia más atractiva y eficiente. Khanmigo tiene muchas\ncaracterísticas interesantes que apoyan a los profesores, y este video mostrará\nformas en que puede usar Khanmigo para crear\ncontenido de estudios sociales específicos del curso para mejorar la experiencia de aprendizaje\nde todos sus estudiantes. A lo largo de este video, exploraremos las formas en que Khanmigo puede ayudarlo\na crear planes de lecciones únicos y atractivos y\nactividades centradas en los estudiantes que los entusiasmen\ncon los estudios sociales y, al mismo tiempo, le ahorren tiempo.  ¿ Listo para ver al\nasistente de enseñanza que siempre quisiste? Vamos a ver. Este es el panel de Khanmigo, repleto de una multitud de\nfunciones únicas para ahorrar tiempo, todas diseñadas para mejorar\nsu experiencia docente. Comencemos con la función de gancho de lección. Despertar el amor por los\nestudios sociales puede ser difícil, pero es increíblemente\ngratificante cuando se tiene éxito. Con el apoyo de Khanmigo, estoy preparado para crear lecciones interesantes que despierten el interés de los estudiantes por la historia. Nuestra próxima aventura\nserá el Gran Despertar, y esto será para mi clase de noveno grado. Khanmigo, ¿podrías\ncrear algunos ganchos de lecciones para mí? Estas actividades son geniales. El primero incorpora un debate. El siguiente incluye a mis alumnos creando una línea de tiempo de eventos, y luego en el último\nmis alumnos analizan extractos de diarios o\ncartas de personas que vivieron durante ese tiempo. Esto definitivamente hará que mis alumnos se entusiasmen con este tema. Gracias, Khanmigo. Muy bien, después de haber despertado la\ncuriosidad de mis alumnos sobre este tema, es hora\nde elaborar una lección convincente con la función Plan de lecciones de Khanmigo. Esta herramienta me ayudará a\ncrear un plan de lección detallado, alineándolo con mi plan de estudios y abordando las necesidades de mis alumnos. Al seleccionar el botón Plan de lección, Khanmigo me invita a detallar el tema que me estoy preparando para enseñar. Una vez proporcionado, aparece para su selección una variedad de temas de los cursos excepcionales de Khanmigo\n. Si mi tema no aparece en la lista,\nKhanmigo me permite seleccionar mi propio contenido. Al seleccionar el botón de plan de lección, Khanmigo me invita a detallar el tema que me estoy preparando para enseñar. El Gran Despertar. Una vez proporcionado, aparece para su selección una variedad de temas de la excepcional biblioteca de cursos de Khanmigo . Además, si mi tema no aparece en la lista, Khanmigo me invita a\nseleccionar mi propio contenido. Voy a ir con el\nprimero, el Gran Despertar, y tan pronto como encuentre el tema para el que quiero un plan de lección,\nselecciono el botón e inmediatamente Khanmigo se pone a trabajar, generando una\nlección detallada y bien estructurada.  plan, hecho a medida para mi\nplan de estudios y mis alumnos. Una vez elaborado, puedo revisar los objetivos, las actividades de calentamiento, lo que estamos haciendo para la instrucción directa, lo que estamos haciendo para la\npráctica guiada, la práctica independiente y las preguntas sobre el boleto de salida.  Lo que sea, está incluido. Y si hay una parte de\nla lección que no me gusta, todo lo que tengo que hacer es hacer clic\nen ella, la resaltará y Khanmigo me da un par\nde indicaciones para elegir. Puedo charlar sobre ello, puedo\nhacer cambios directamente o simplemente puedo pedirle a Khanmigo\nque pruebe algo diferente. Me gusta mucho más. Muchas gracias Khanmigo. Otra característica innovadora es Leveler, que me permite ajustar\nla complejidad del texto para que coincida con las habilidades de lectura de mis alumnos, fomentando la instrucción personalizada y atendiendo a las necesidades de cada estudiante. En mi clase de educación cívica de EE. UU., estamos explorando los poderes del gobierno y encontré un artículo\nsobre el poder judicial que sería perfecto para mi próxima lección. Sin embargo, algunos de mis alumnos luchan con la comprensión lectora,\npero ¿sabes qué? No tengo que preocuparme por eso. Puedo utilizar la función de nivelación de Khanmigo\npara adaptar el texto, asegurándome de que sea digerible\ny que los conceptos sean claros para todos mis alumnos. Solo tengo que incluir el\ntema y luego copiar y pegar el texto original en el cuadro y dejarle saber a Khanmigo qué nivel de lectura me gustaría que fuera. Quiero que esto sea del\nnivel de séptimo grado, por favor, y luego Khanmigo lo reescribirá por mí. Khanmigo reescribió todo el artículo para mí en un nivel de séptimo grado. Una vez reescrito el artículo\nen el nivel de séptimo grado, tengo algunas opciones. Puedo imprimir el artículo o puedo exportarlo a\nMicrosoft Word, un PDF, o puedo guardarlo en mi Google Drive y subirlo a mi Google Classroom. Una vez que mis alumnos completen el artículo, utilizaré Khanmigo para\ngenerar temas de discusión. Mi objetivo es iniciar una\nconversación interesante que alimente la curiosidad,\npromueva la participación y fomente el diálogo intelectual. Voy a hacer esto con\nmi clase de educación cívica de 11º grado y vamos a\ndiscutir el poder judicial. Con un simple clic, Khanmigo crea una variedad de estimulantes temas para\niniciar debates, que prometen inspirar el rico discurso que deseo para el\nviaje de aprendizaje de mis alumnos. Como profesora de estudios sociales, necesito conectar\nacontecimientos y conceptos históricos con acontecimientos actuales y\nexperiencias personales de los estudiantes. Esto ayuda a que el\ntema sea más identificable y atractivo para ellos, mejorando su\ncomprensión e interés. La función Make it Relevant de Khanmigo me permite hacer precisamente eso. Solo tengo que informarle a Khanmigo\nmi objetivo de aprendizaje, y luego tengo que informarle a Khanmigo un poco sobre mi clase. A mis alumnos les encantan los deportes. Ahora, Khanmigo, hazlo relevante. Me encanta esta idea. Khanmigo presenta los\ncasos de la Corte Suprema de mis alumnos a través de una lente deportiva.  Les va a encantar esto. Como puede ver, integrar Khanmigo en su rutina de clase le permite adaptar las ideas y sugerencias de Khanmigo a su plan de estudios de estudios sociales, teniendo en cuenta las \nnecesidades de los estudiantes, los objetivos de aprendizaje y los recursos creativos. Khanmigo's Insights no solo enriquecerá la experiencia de aprendizaje de sus estudiantes, sino que también le liberará tiempo, permitiéndole concentrarse en lo que realmente importa: sus estudiantes. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus estudiantes en el aula, siga los enlaces en su pantalla y, para no perderse nunca anuncios interesantes sobre materiales de cursos nuevos y gratuitos\nen Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- مرحبًا، أنا ميشيل، أخصائية تعلم محترفة\nهنا في أكاديمية خان، ومعلمة سابقة في الفصل الدراسي\nمثلك تمامًا، تعرف على خانميغو، رفيقك الذي يعتمد على الذكاء الاصطناعي، والذي أحدث ثورة في\nالتدريس من أجل تجربة أكثر جاذبية وكفاءة. يحتوي Khanmigo على العديد من\nالميزات المثيرة التي تدعم المعلمين، وسيعرض هذا الفيديو\nالطرق التي يمكنك من خلالها استخدام Khanmigo لإنشاء\nمحتوى دراسات اجتماعية خاص بالدورة التدريبية لتعزيز تجربة التعلم\nلجميع طلابك. خلال هذا الفيديو، سنستكشف الطرق التي يمكن أن يساعدك بها Khanmigo\nفي إنشاء خطط دروس فريدة وجذابة\nوأنشطة تتمحور حول الطلاب والتي تجعل الطلاب متحمسين\nللدراسات الاجتماعية مع توفير الوقت.  هل أنت مستعد لرؤية\nمساعد التدريس الذي طالما أردته؟ لنلقي نظرة. هذه هي لوحة تحكم Khanmigo، المليئة بالعديد من\nالميزات الفريدة لتوفير الوقت، وكلها مصممة للارتقاء\nبتجربة التدريس الخاصة بك. لنبدأ بميزة ربط الدرس. \nقد يكون إشعال حب الدراسات الاجتماعية أمرًا صعبًا، لكنه يكون مجزيًا بشكل لا يصدق\nعندما ينجح. بدعم من خانميغو، أنا على استعداد لإنشاء دروس مبتدئة جذابة تثير اهتمام الطلاب بالتاريخ. ستكون مغامرتنا التالية هي \"\nالصحوة الكبرى\"، وستكون هذه لصفي في الصف التاسع. خانميغو، هل يمكنك من فضلك\nإنشاء بعض روابط الدروس لي؟ هذه الأنشطة رائعة. الأول يتضمن مناقشة. يتضمن الإجراء التالي قيام طلابي بإنشاء جدول زمني للأحداث، ثم الإجراء الأخير الذي يقوم فيه\nطلابي بتحليل مقتطفات من مذكرات أو\nرسائل من أفراد عاشوا خلال تلك الفترة. وهذا بالتأكيد سيجعل طلابي متحمسين لهذا الموضوع. شكرا خانميجو. حسنًا، بعد أن أثارت\nفضول طلابي حول هذا الموضوع، فقد حان الوقت\nلصياغة درس مقنع باستخدام ميزة خطة الدرس الخاصة بـ Khanmigo. ستساعد هذه الأداة في\nإنشاء خطة درس مفصلة، تتماشى مع المنهج الدراسي الخاص بي وتلبي احتياجات طلابي. عند تحديد زر خطة الدرس، يدعوني خانميغو إلى تفصيل الموضوع الذي أستعد لتدريسه. بمجرد توفيرها، تظهر مجموعة من المواضيع من دورات Khanmigo الاستثنائية\nللاختيار منها. إذا لم يكن موضوعي مدرجًا، فإن\nKhanmigo يسمح لي باختيار المحتوى الخاص بي. عند تحديد زر خطة الدرس، يدعوني خانميغو إلى تفصيل الموضوع الذي أستعد لتدريسه. الصحوة الكبرى. بمجرد تقديمها، تظهر مجموعة من المواضيع من مكتبة الدورات التدريبية الاستثنائية لـ Khanmigo للاختيار منها. وأيضًا، إذا لم يكن موضوعي مدرجًا، فإن خانميغو يدعوني\nلاختيار المحتوى الخاص بي. سأختار الخيار الأول\n، الصحوة الكبرى، وبمجرد العثور على الموضوع الذي أريد خطة درس\nله، أقوم باختيار الزر، وعلى الفور يبدأ خانميغو في العمل، وينتج\nدرسًا تفصيليًا جيد التنظيم  خطة مخصصة\nلمنهاجي وطلابي. بمجرد صياغتها، يمكنني مراجعة الأهداف، وأنشطة الإحماء، وما نقوم به من أجل التعليمات المباشرة، وما نقوم به من أجل\nالتدريب الموجه، والتمرين المستقل، وأسئلة تذكرة الخروج. سمها ما شئت، لقد تم تضمينها. وإذا كان هناك جزء من\nالدرس لا يعجبني، فكل ما علي فعله هو النقر\nعليه، وسيقوم بتسليط الضوء عليه، ويعطيني Khanmigo بعض\nالمطالبات للاختيار من بينها. يمكنني الدردشة حول هذا الموضوع، أو\nإجراء تغييرات عليه مباشرةً، أو يمكنني فقط أن أطلب من خانميغو\nتجربة شيء مختلف. أعجبني هذا أكثر. شكرا جزيلا، خانميجو. ميزة مبتكرة أخرى هي Leveler، والتي تمكنني من ضبط مدى\nتعقيد النص ليتناسب مع قدرات القراءة لدى طلابي، وتعزيز التعليم الشخصي وتلبية احتياجات كل طالب. في صف التربية المدنية بالولايات المتحدة، كنا نستكشف الفروع الحكومية، ووجدت مقالًا\nعن السلطة القضائية سيكون مثاليًا لدرسي التالي. ومع ذلك، فإن بعض طلابي يواجهون صعوبة في فهم القراءة،\nلكن هل تعلم ماذا؟ لا داعي للقلق بشأن ذلك. يمكنني استخدام ميزة ضبط المستوى في Khanmigo\nلتخصيص النص، والتأكد من أنه سهل الفهم\nوأن المفاهيم واضحة لجميع طلابي.  كل ما علي فعله هو تضمين\nالموضوع ثم نسخ النص الأصلي ولصقه في المربع وإعلام خانميغو بمستوى القراءة الذي أرغب في الوصول إليه. أريد أن يكون هذا في\nمستوى الصف السابع، من فضلك، وبعد ذلك سيقوم خانميغو بإعادة كتابته لي. أعاد خانميغو كتابة المقال بأكمله لي في الصف السابع. بمجرد إعادة كتابة المقال\nفي مستوى الصف السابع، لدي بعض الخيارات. يمكنني طباعة المقالة أو تصديرها إلى\nMicrosoft Word، أو PDF، أو يمكنني حفظها على Google Drive وتحميله على Google Classroom. بمجرد أن يكمل طلابي المقالة، سأستخدم خانميغو\nلإنشاء مطالبات للمناقشة. هدفي هو إشعال\nمحادثة جذابة تغذي الفضول،\nوتعزز المشاركة، وتعزز الحوار الفكري. سأقوم بذلك مع\nصف التربية المدنية للصف الحادي عشر، وسوف\nنناقش الفرع القضائي. بنقرة بسيطة، يقوم Khanmigo بصياغة مجموعة متنوعة من\nالمناقشات المحفزة، والتي تعد بإلهام الخطاب الغني الذي أرغب فيه في\nرحلة التعلم لطلابي. كمدرس للدراسات الاجتماعية، أحتاج إلى ربط\nالأحداث والمفاهيم التاريخية بالأحداث الجارية\nوالتجارب الشخصية للطلاب. وهذا يساعد على جعل\nالموضوع أكثر ارتباطًا وجاذبية بالنسبة لهم، مما يعزز\nفهمهم واهتمامهم.  تتيح لي ميزة Make it Relevant في Khanmigo القيام بذلك.  كل ما علي فعله هو أن أخبر خانميغو\nبهدفي التعليمي، وبعد ذلك يجب أن أعلم خانميغو القليل عن صفي. طلابي يحبون الرياضة. الآن، خانميغو، من فضلك اجعل الأمر ذا صلة. أنا أحب هذه الفكرة. يرفع خانميغو\nقضايا طلابي إلى المحكمة العليا من خلال عدسة رياضية. سوف يحبون هذا كما ترون، فإن دمج Khanmigo في روتين الفصل الدراسي الخاص بك يمكّنك من تصميم أفكار واقتراحات Khanmigo لمناهج الدراسات الاجتماعية الخاصة بك مع الأخذ في الاعتبار\nاحتياجات الطلاب وأهداف التعلم والموارد الإبداعية. لن تعمل رؤى خانميغو على إثراء تجربة التعلم لطلابك فحسب، بل ستوفر أيضًا وقتك، مما يتيح لك التركيز على ما يهم حقًا: طلابك. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد حول كيف\nيمكن لـ Khanmigo دعمك أنت وطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك، وحتى لا تفوت أبدًا الإعلانات المثيرة حول مواد الدورة التدريبية الجديدة والمجانية\nفي Khan Academy، تأكد من الاشتراك.",
    "t_italian": "- Ciao, sono Michelle, una specialista dell'apprendimento professionale\nqui alla Khan Academy e un'ex\ninsegnante di classe proprio come te. Ti presento Khanmigo, il tuo compagno basato sull'intelligenza artificiale, che sta rivoluzionando l'\ninsegnamento per un'esperienza più coinvolgente ed efficiente. Khanmigo ha molte\nfunzionalità interessanti che supportano gli insegnanti e questo video mostrerà i\nmodi in cui puoi utilizzare Khanmigo per creare\ncontenuti di studi sociali specifici del corso per migliorare l'esperienza di apprendimento\nper tutti i tuoi studenti. In questo video esploreremo i modi in cui Khanmigo può aiutarti\na creare programmi di lezioni unici e coinvolgenti e\nattività incentrate sugli studenti che entusiasmano gli studenti\nper gli studi sociali facendoti risparmiare tempo. Pronto a vedere l'\nassistente didattico che hai sempre desiderato? Diamo un'occhiata. Questa è la dashboard di Khanmigo, ricca di una moltitudine di\nfunzionalità uniche per risparmiare tempo, tutte progettate su misura per migliorare\nla tua esperienza di insegnamento. Cominciamo con la funzione di hook della lezione. Accendere l'amore per gli\nstudi sociali può essere difficile, ma è incredibilmente\ngratificante quando si ha successo. Con il supporto di Khanmigo, sono pronto a creare lezioni di base coinvolgenti che stimolino l'interesse degli studenti per la storia. La nostra prossima avventura\nsarà il Grande Risveglio, e sarà per la mia classe di prima media. Khanmigo, potresti per favore\ncrearmi qualche riassunto della lezione? Queste attività sono fantastiche. Il primo prevede un dibattito. Il successivo prevede che i miei studenti creino una sequenza temporale di eventi, e poi l'ultimo\nprevede che i miei studenti analizzino estratti di diari o\nlettere di persone vissute in quel periodo. Ciò entusiasmerà sicuramente i miei studenti su questo argomento. Grazie, Khanmigo. Va bene, dopo aver suscitato la\ncuriosità dei miei studenti su questo argomento, è ora\ndi creare una lezione avvincente con la funzione Piano di lezione di Khanmigo. Questo strumento mi aiuterà a\ncreare un programma di lezione dettagliato, in linea con il mio curriculum e rispondendo alle esigenze dei miei studenti. Dopo aver selezionato il pulsante Programma di lezione, Khanmigo mi invita a dettagliare l'argomento che mi sto preparando a insegnare. Una volta forniti, vengono visualizzati per la selezione una serie di argomenti degli eccezionali\ncorsi di Khanmigo. Se il mio argomento non è elencato,\nKhanmigo mi consente di selezionare il mio contenuto. Dopo aver selezionato il pulsante del programma della lezione, Khanmigo mi invita a dettagliare l'argomento che mi sto preparando a insegnare. Il Grande Risveglio. Una volta forniti, viene visualizzata per la selezione una serie di argomenti dall'eccezionale libreria di corsi di Khanmigo . Inoltre, se il mio argomento non è elencato, Khanmigo mi invita a\nselezionare il mio contenuto. Partirò dal\nprimo, il Grande Risveglio, e non appena trovo l'argomento per il quale desidero un programma di lezione,\nseleziono il pulsante e immediatamente Khanmigo si mette al lavoro, generando una\nlezione dettagliata ben strutturata  piano, realizzato su misura per il mio\ncurriculum e per i miei studenti. Una volta realizzato, posso rivedere gli obiettivi, le attività di riscaldamento, cosa stiamo facendo per l'istruzione diretta, cosa stiamo facendo per la\npratica guidata, la pratica indipendente, le domande sui ticket di uscita.  Lo chiami, è incluso. E se c'è una parte\ndella lezione che non mi piace, tutto quello che devo fare è cliccarci\nsopra, la evidenzierà e Khanmigo mi darà un paio\ndi suggerimenti tra cui scegliere. Posso parlarne, posso\napportare modifiche direttamente o posso semplicemente chiedere a Khanmigo\ndi provare qualcosa di diverso. Mi piace molto di più. Grazie mille, Khanmigo. Un'altra caratteristica innovativa è il Livellatore, che mi consente di regolare\nla complessità del testo per adattarlo alle capacità di lettura dei miei studenti, favorendo un'istruzione personalizzata e soddisfacendo le esigenze di ciascuno studente. Nel mio corso di educazione civica negli Stati Uniti, stiamo esplorando i rami del governo e ho trovato un articolo\nsul ramo giudiziario che sarebbe perfetto per la mia prossima lezione. Tuttavia, alcuni dei miei studenti hanno difficoltà a comprendere la lettura,\nma sai una cosa? Non devo preoccuparmi di questo. Posso utilizzare la funzione livellatore di Khanmigo\nper personalizzare il testo, assicurandomi che sia digeribile\ne che i concetti siano chiari per tutti i miei studenti. Devo solo includere l'\nargomento, quindi copiare e incollare il testo originale nella casella e far sapere a Khanmigo quale livello di lettura vorrei che fosse. Voglio che sia a\nlivello di seconda media, per favore, e poi Khanmigo lo riscriverà per me. Khanmigo ha riscritto l'intero articolo per me a livello di seconda media. Una volta riscritto l'articolo\na livello di seconda media, ho alcune opzioni. Posso stampare l'articolo oppure esportarlo in\nMicrosoft Word, un PDF oppure salvarlo sul mio Google Drive e caricarlo sul mio Google Classroom. Una volta che i miei studenti avranno completato l'articolo, utilizzerò Khanmigo per\ngenerare spunti di discussione.  Il mio obiettivo è avviare una\nconversazione coinvolgente che alimenti la curiosità,\npromuova il coinvolgimento e favorisca un dialogo intellettuale. Lo farò con la\nmia classe di educazione civica dell'undicesimo grado e\ndiscuteremo del ramo giudiziario. Con un semplice clic, Khanmigo crea una serie di stimolanti\nspunti di discussione, promettendo di ispirare il ricco discorso che desidero per il\npercorso di apprendimento dei miei studenti. In qualità di insegnante di studi sociali, ho bisogno di collegare\neventi e concetti storici agli eventi attuali e alle\nesperienze personali degli studenti. Ciò aiuta a rendere l'\nargomento più riconoscibile e coinvolgente per loro, migliorando la loro\ncomprensione e interesse.  La funzione Make it Relevant di Khanmigo mi consente di fare proprio questo. Devo solo far\nsapere a Khanmigo il mio obiettivo di apprendimento, e poi devo far sapere a Khanmigo qualcosa sulla mia classe. I miei studenti amano lo sport. Ora, Khanmigo, per favore rendilo rilevante. Adoro questa idea. Khanmigo segue i\ncasi della Corte Suprema dei miei studenti attraverso una lente sportiva. Lo adoreranno. Come puoi vedere, l'integrazione di Khanmigo nella routine della tua classe ti consente di adattare le idee e i suggerimenti di Khanmigo al tuo curriculum di studi sociali, tenendo conto delle \nesigenze degli studenti, degli obiettivi di apprendimento e delle risorse creative. Khanmigo's Insights non solo arricchirà l'esperienza di apprendimento dei tuoi studenti, ma ti libererà anche tempo, permettendoti di concentrarti su ciò che conta davvero di più: i tuoi studenti. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo e, per non perdere mai annunci entusiasmanti sui nuovi materiali gratuiti dei corsi\nsu Khan Academy, assicurati di iscriverti."
}