{
    "source": "OnBXX4ooiuY",
    "youtubelink": "https://www.youtube.com/watch?v=OnBXX4ooiuY",
    "t_english": "- [Instructor] So let's imagine that we are in the ocean, and we're gonna think a little bit about fish. And we know that organisms, usually, are not just by themselves, that there's other organisms around. There might be other members of their species around, and there are very likely going to be other species around. What we're gonna focus on in this video is those interactions within a species and between species. So for example, let's say that this white species right over here likes to eat this yellow species for food. That is an interaction. It'll try to predate, to eat that yellow species. So that type of interaction that is between species, we call interspecific, interspecific interactions. And this particular interaction that we are seeing is one of predation. One species is using the other species for food. Now, that's not the only type of interaction just in this very simple picture. You could imagine there's only one little yellow fish here, and both of these white fish are hungry. They're going to need to compete to see who gets that yellow fish. So between these two fish, you could have another type of interaction, and that's competition. But this is competition between two members of the same species. So this is intra, intraspecific, specific interaction. In particular, it's competition. I could just write interaction, but I'm being more specific here that it's competition. And one way to think about it, when people say intramural sports, they're talking about playing people in your same school. That's what's going on here. You're competing against other fish in your same species. Now, you can also have competition between species. For example, maybe this blue fish right over here. Try to make this one look a little bit different. This blue fish also likes to eat this yellow fish species. So you have interspecific interaction between the blue species and this yellow fish, but you also now have interspecies, or interspecific interaction, or interspecific competition between this white species and this blue species. Now, competition is really interesting because you can imagine the more of a species that there is around, the more competition that they're going to give not just for other species but for each other. So usually, as population density goes up, the competition goes up, and though the resources that are available for any one individual might go down, so it can be a little bit of a check or in many cases, a very big check on the population or the population density. And now, you can imagine situations where one species is better at competing for resources than another species. Well, then it's going to start to become more and more common relative to that other species. And you can imagine an extreme situation where it outcompetes in every dimension, and at that point, you have what's called the competitive exclusion principle, where they're essentially in the same niche, and this white species would essentially take over that niche. But we also know that just because they're competing for resources, don't mean that both species or multiple species can't be in that same ecosystem. And this especially happens through something called resource partitioning. So let me give a very simple example here. Resource partitioning. Let's imagine creatures living in a forest. I'll draw one of the trees of that forest. And you might say, \"All right, there's multiple creatures who like living on trees. Maybe one of the species just overtakes the tree.\" But it turns out that different parts of that tree might be good for different creatures, wherein different creatures have different advantages in different parts of the tree. For example, the top of the tree might be sunnier and drier, and so there might be creatures that can outcompete in the sunny and dry part of the tree, while maybe the base of the tree down here, down here is more damp and wet and shady and not getting as much sun. Let me draw that in a, maybe I'll draw it in a brown color, right over here, not getting as much sun. And maybe there's a different species that could do well over here. And it's unlikely to just even have two species. If we're thinking about a tree, there could be 50 species that are living here, but they're living in different parts of the tree. And it isn't just about being in different parts of something. It could also be at different times. Maybe one species can outcompete at night and another species can outcompete in the daytime. That is also resource partitioning. But the big takeaway from this video is that organisms are not in isolation. They're interacting with other members of their same species and with other species. There could be extreme situations where one species can win out in every dimension, in which case the other species might not be able to stick around in that niche, but there's other situations, and this is very common, where species can share a resource because they can outcompete or they can thrive in different parts of that resource. They've essentially carved out their own niche using different parts of, in this example, this tree.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] تو آئیے تصور کریں\nکہ ہم سمندر میں ہیں، اور ہم\nمچھلی کے بارے میں تھوڑا سا سوچنے والے ہیں۔ اور ہم جانتے ہیں کہ حیاتیات، عام طور پر، صرف اپنے آپ سے نہیں ہوتے ہیں، کہ ارد گرد دوسرے جاندار بھی ہیں۔  ان کے \nآس پاس ان کی نسل کے دوسرے ارکان ہوسکتے ہیں، اور اس کے\nآس پاس دوسری نسلیں ہونے کا بہت امکان ہے۔ ہم اس ویڈیو میں جس چیز پر توجہ مرکوز کرنے والے ہیں وہ \nایک پرجاتیوں اور پرجاتیوں کے درمیان تعاملات ہیں۔ تو مثال کے طور پر، ہم یہ کہتے ہیں کہ یہ سفید\nنسل یہاں پر اس پیلی نسل کو کھانے کے لیے کھانا پسند کرتی ہے۔ یہ ایک تعامل ہے۔ یہ\nاس پیلے رنگ کی نسل کو کھانے کے لیے پیشگی تیار کرنے کی کوشش کرے گا۔ تو اس قسم کا تعامل\nجو پرجاتیوں کے درمیان ہوتا ہے، اسے ہم ایک دوسرے کے ساتھ تعامل کہتے ہیں۔ اور یہ خاص تعامل جو ہم دیکھ رہے ہیں وہ ایک شکار ہے۔ ایک نسل\nدوسری نسل کو کھانے کے لیے استعمال کر رہی ہے۔ اب، یہ صرف اس سادہ سی تصویر میں\nبات چیت کی واحد قسم نہیں ہے۔ آپ تصور کر سکتے ہیں کہ\nیہاں صرف ایک چھوٹی پیلی مچھلی ہے، اور یہ دونوں سفید مچھلیاں بھوکی ہیں۔ انہیں یہ دیکھنے کے لئے مقابلہ کرنے کی ضرورت ہوگی کہ وہ پیلی مچھلی کس کو ملتی ہے۔ تو ان دو مچھلیوں کے درمیان، آپ کا ایک اور\nقسم کا تعامل ہوسکتا ہے، اور وہ مقابلہ ہے۔ لیکن یہ ایک ہی نوع کے دو ارکان کے درمیان مقابلہ ہے۔ تو یہ انٹرا، انٹراسپیسیفک، مخصوص تعامل ہے۔ خاص طور پر، یہ مقابلہ ہے. میں صرف بات چیت لکھ سکتا ہوں، لیکن میں یہاں زیادہ مخصوص کر رہا ہوں\nکہ یہ مقابلہ ہے۔ اور اس کے بارے میں سوچنے کا ایک طریقہ، جب لوگ اندرونی کھیلوں کو کہتے ہیں، تو وہ\nآپ کے اسی اسکول میں لوگوں کو کھیلنے کے بارے میں بات کر رہے ہیں۔ یہاں یہی ہو رہا ہے۔ آپ\nاپنی اسی نوع کی دوسری مچھلیوں سے مقابلہ کر رہے ہیں۔ اب، آپ\nپرجاتیوں کے درمیان مقابلہ بھی کر سکتے ہیں۔ مثال کے طور پر، شاید یہ\nنیلی مچھلی یہاں پر۔ اس کو\nتھوڑا سا مختلف بنانے کی کوشش کریں۔ یہ نیلی مچھلی بھی\nاس پیلی مچھلی کی نسل کو کھانا پسند کرتی ہے۔ لہذا آپ کا نیلے رنگ کی نسلوں\nاور اس پیلی مچھلی کے درمیان باہمی تعامل ہے، لیکن اب آپ کے پاس اس سفید نسل اور اس نیلی پرجاتیوں کے درمیان ایک دوسرے سے متعلق، یا ایک دوسرے سے متعلق تعامل،\nیا ایک دوسرے سے متعلق مقابلہ ہے۔ \n اب، مقابلہ واقعی دلچسپ ہے کیونکہ آپ تصور کر سکتے ہیں کہ جتنی زیادہ پرجاتیوں کے آس\nپاس ہے، اتنا ہی زیادہ مقابلہ جو\nوہ نہ صرف دوسری نسلوں کے لیے\nبلکہ ایک دوسرے کے لیے بھی دے رہے ہیں۔ لہذا، عام طور پر، جیسے جیسے آبادی کی کثافت بڑھتی ہے، مقابلہ بڑھتا جاتا ہے، اور اگرچہ\n کسی ایک فرد کے لیے دستیاب وسائل کم ہو سکتے ہیں، اس لیے یہ تھوڑا سا چیک ہو سکتا ہے یا بہت سے معاملات میں، بہت بڑی جانچ پڑتال ہو سکتی ہے۔ آبادی یا\nآبادی کی کثافت۔ اور اب، آپ ان حالات کا تصور کر سکتے ہیں\nجہاں ایک پرجاتی دوسری نسل کے مقابلے وسائل کے لیے مقابلہ کرنے میں بہتر ہے۔\n ٹھیک ہے، پھر یہ اس دوسری پرجاتیوں کے نسبت زیادہ سے زیادہ عام ہونا شروع ہو جائے گا۔\n اور آپ ایک انتہائی صورت حال کا تصور کر سکتے ہیں جہاں یہ ہر جہت میں مقابلہ کرتا ہے، اور اس وقت، آپ کے پاس وہی ہے جسے مسابقتی اخراج کا اصول کہا جاتا ہے، جہاں وہ بنیادی طور پر\nایک ہی جگہ پر ہوتے ہیں، اور یہ سفید نسل بنیادی طور پر اس جگہ پر قبضہ کر لے گی۔ لیکن ہم یہ بھی جانتے ہیں کہ صرف اس\nوجہ سے کہ وہ وسائل کے لیے مقابلہ کر رہے ہیں، اس کا\nمطلب یہ نہیں ہے کہ دونوں انواع یا متعدد انواع ایک ہی\nماحولیاتی نظام میں نہیں ہو سکتیں۔ اور یہ خاص طور پر وسائل کی تقسیم نامی کسی چیز کے ذریعے ہوتا ہے۔\n تو میں یہاں ایک بہت ہی سادہ سی مثال دیتا ہوں۔ وسائل کی تقسیم۔ آئیے\nایک جنگل میں رہنے والی مخلوق کا تصور کریں۔ میں اس جنگل کے درختوں میں سے ایک درخت کھینچوں گا۔ اور آپ کہہ سکتے ہیں، \"ٹھیک ہے، ایسی\nمتعدد مخلوقات ہیں جو درختوں پر رہنا پسند کرتی ہیں۔ ہو سکتا ہے کہ ان میں سے کوئی ایک\nدرخت کو پیچھے چھوڑ دے۔\" لیکن معلوم ہوا کہ\nاس درخت کے مختلف حصے مختلف مخلوقات کے لیے اچھے ہو سکتے ہیں، جس میں\n درخت کے مختلف حصوں میں مختلف مخلوقات کے مختلف فائدے ہیں۔ مثال کے طور پر،\nدرخت کا اوپری حصہ زیادہ دھوپ اور خشک ہو سکتا ہے، اور اس لیے ایسی\nمخلوقات ہو سکتی ہیں جو درخت کے دھوپ اور خشک حصے میں مقابلہ کر سکتی ہیں، جبکہ ہو سکتا ہے کہ\nدرخت کی بنیاد یہاں نیچے، نیچے یہاں زیادہ گیلی اور گیلی ہو۔  اور سایہ دار اور اتنی دھوپ نہیں ملتی۔ مجھے اسے a میں کھینچنے دو، شاید میں اسے بھورے رنگ میں کھینچوں گا، یہیں پر، اتنا سورج نہیں ملے گا۔ اور ہو سکتا ہے کہ ایک مختلف پرجاتی ہے جو یہاں اچھی کارکردگی کا مظاہرہ کر سکتی ہے۔ اور اس کی صرف\nدو نسلیں ہونے کا امکان نہیں ہے۔ اگر ہم ایک درخت کے بارے میں سوچ رہے ہیں، تو وہاں 50 انواع ہو سکتی ہیں\nجو یہاں رہ رہی ہیں، لیکن وہ\nدرخت کے مختلف حصوں میں رہ رہی ہیں۔ اور یہ صرف کسی چیز کے مختلف حصوں میں ہونے کے بارے میں نہیں ہے۔ یہ مختلف اوقات میں بھی ہو سکتا ہے۔ ہوسکتا ہے کہ ایک نوع رات کے وقت مقابلہ کر سکے اور دوسری نسل\nدن کے وقت مقابلہ کر سکے۔ یہ بھی وسائل کی تقسیم ہے۔ لیکن اس ویڈیو سے بڑا فائدہ یہ ہے کہ حیاتیات تنہائی میں نہیں ہیں۔ وہ اپنی ایک ہی نوع کے دوسرے ممبروں\nاور دوسری پرجاتیوں کے ساتھ بات چیت کر رہے ہیں۔  ایسے انتہائی حالات ہوسکتے ہیں جہاں ایک نوع\nہر جہت میں جیت سکتی ہے، ایسی صورت میں دوسری نوع \nاس جگہ پر قائم نہیں رہ سکتی ہے، لیکن اس کے علاوہ بھی حالات ہیں،\nاور یہ بہت عام ہے، جہاں پرجاتی وسائل کا اشتراک کر سکتی ہیں کیونکہ  وہ مقابلہ کر سکتے ہیں یا وہ اس وسائل کے مختلف حصوں میں ترقی کر سکتے ہیں۔\n انہوں نے بنیادی طور پر اس درخت کے\n مختلف حصوں کا استعمال کرتے ہوئے اپنی جگہ بنائی ہے۔\n",
    "t_spanish": "- [Instructor] Entonces imaginemos\nque estamos en el océano y vamos a pensar un\npoco en los peces. Y sabemos que los organismos, por lo general, no existen solos, sino que hay otros organismos alrededor. Puede que haya otros miembros\nde su especie por ahí, y es muy probable que\nhaya otras especies por ahí.  En lo que nos centraremos en este vídeo son en esas interacciones dentro de\nuna especie y entre especies. Entonces, por ejemplo, digamos que a esta\nespecie blanca de aquí le gusta comerse esta especie amarilla como alimento. Esa es una interacción. Intentará depredar y\ncomerse esa especie amarilla. Entonces a ese tipo de interacción\nque es entre especies, le llamamos interacciones interespecíficas, interespecíficas. Y esta interacción particular que estamos viendo es de depredación. Una especie utiliza a la\notra como alimento. Ahora bien, ese no es el\núnico tipo de interacción en esta imagen tan simple. Podrías imaginar que aquí solo hay\nun pececito amarillo, y ambos peces blancos tienen hambre. Tendrán que competir para ver quién se queda con ese pez amarillo. Entonces, entre estos dos peces, podría haber otro\ntipo de interacción, y eso es competencia. Pero esto es competencia entre dos miembros de la misma especie. Entonces esta es una interacción intra, intraespecífica, específica. En particular, es competencia. Podría escribir simplemente interacción, pero estoy siendo más específico\naquí en cuanto a que se trata de competencia. Y una forma de pensarlo es que cuando la gente dice deportes intramuros, se refiere a jugar contra\npersonas de tu misma escuela. Eso es lo que está pasando aquí. Estás compitiendo contra otros\npeces de tu misma especie. Ahora también puede haber\ncompetencia entre especies. Por ejemplo, tal vez este\npescado azul de aquí. Intenta que este se vea\nun poco diferente. A este pez azul también le gusta\ncomer esta especie de pez amarillo. Entonces tenemos interacción interespecífica entre la especie azul\ny este pez amarillo, pero ahora también tenemos interacción interespecífica, o interacción interespecífica,\no competencia interespecífica entre esta especie blanca\ny esta especie azul. Ahora, la competencia es realmente interesante porque puedes imaginar que cuanto más especies\nhaya, más competencia\nhabrán no solo por otras especies\nsino entre sí. Por lo general, a medida que aumenta la densidad de población, aumenta la competencia y, aunque los recursos\ndisponibles para cualquier individuo pueden disminuir, puede ser un pequeño control o, en muchos casos, un control muy grande sobre la  población o\ndensidad de población. Y ahora podemos imaginar\nsituaciones en las que una especie compite mejor por\nlos recursos que otra especie. Bueno, entonces empezará a volverse cada vez más común en relación\ncon esas otras especies. Y puedes imaginar una situación extrema en la que compite en todas las dimensiones, y en ese punto, tienes lo que se llama el principio de exclusión competitiva, donde están esencialmente\nen el mismo nicho, y esta especie blanca esencialmente se apoderaría de ese nicho. Pero también sabemos que el hecho de que\ncompitan por los recursos no\nsignifica que ambas especies o varias especies no puedan\nestar en el mismo ecosistema. Y esto sucede especialmente a través de algo llamado\npartición de recursos. Así que déjame darte un ejemplo muy simple. Partición de recursos. Imaginemos criaturas que\nviven en un bosque. Dibujaré uno de los árboles de ese bosque. Y podrías decir: \"Muy bien,\nhay varias criaturas a las que les gusta vivir en los árboles. Tal vez una de las especies\nsimplemente supere al árbol\". Pero resulta que\ndiferentes partes de ese árbol podrían ser buenas para diferentes criaturas, donde diferentes criaturas\ntienen diferentes ventajas en diferentes partes del árbol. Por ejemplo, la copa del\nárbol podría ser más soleada y seca, por lo que podría haber\ncriaturas que puedan competir en la parte soleada y seca del árbol, mientras que tal vez la base\ndel árbol aquí abajo, aquí abajo, esté más húmeda y mojada.  y con sombra y sin recibir tanto sol. Déjame dibujarlo en un color marrón, tal vez por aquí, donde no reciba tanto sol. Y tal vez haya una especie diferente a la que le podría ir bien aquí. Y es poco probable que\ntenga siquiera dos especies. Si pensamos en un árbol, podría haber 50 especies\nque viven aquí, pero viven en\ndiferentes partes del árbol. Y no se trata sólo de estar en diferentes partes de algo. También podría ser en diferentes momentos. Tal vez una especie pueda competir durante la noche y otra especie pueda\ncompetir durante el día. Eso también es partición de recursos. Pero la gran conclusión de este vídeo es que los organismos no están aislados. Están interactuando con otros miembros de su misma especie\ny con otras especies. Podría haber situaciones extremas en las que una especie pueda ganar\nen todas las dimensiones, en cuyo caso las otras especies podrían no ser capaces de permanecer\nen ese nicho, pero hay otras situaciones,\ny esto es muy común, en las que las especies pueden compartir un recurso porque  pueden competir o prosperar en diferentes\npartes de ese recurso. Básicamente, han\ncreado su propio nicho utilizando diferentes partes de,\nen este ejemplo, este árbol.",
    "t_arabic": "- [المدرس] فلنتخيل\nأننا في المحيط، وسنفكر\nقليلاً في الأسماك. ونحن نعلم أن الكائنات الحية، عادةً، لا توجد بمفردها فحسب، بل توجد كائنات حية أخرى حولها. قد يكون هناك أعضاء آخرون\nمن جنسهم في الجوار، ومن المحتمل جدًا أن\nتكون هناك أنواع أخرى حولهم. ما سنركز عليه في هذا الفيديو هو تلك التفاعلات داخل\nالنوع الواحد وبين الأنواع. على سبيل المثال، لنفترض أن هذا\nالنوع الأبيض هنا يحب أكل هذا النوع الأصفر من أجل الطعام. هذا هو التفاعل. سيحاول أن\nيتغذى على تلك الأنواع الصفراء. لذا فإن هذا النوع من التفاعل\nبين الأنواع، نسميه التفاعلات بين الأنواع، والتفاعلات بين الأنواع. وهذا التفاعل المحدد الذي نشهده هو تفاعل افتراس. يستخدم أحد الأنواع\nالأنواع الأخرى من أجل الغذاء. الآن، هذا ليس\nالنوع الوحيد من التفاعل في هذه الصورة البسيطة جدًا. يمكنك أن تتخيل أن هناك\nسمكة صفراء صغيرة واحدة فقط هنا، وكلاهما جائعتان. سيتعين عليهم التنافس لمعرفة من سيحصل على تلك السمكة الصفراء. إذًا بين هاتين السمكتين، يمكن أن يكون لديك\nنوع آخر من التفاعل، وهو المنافسة. ولكن هذه منافسة بين عضوين من نفس النوع. إذن هذا هو التفاعل الداخلي، داخل النوع، والمحدد. على وجه الخصوص، إنها المنافسة. يمكنني فقط أن أكتب التفاعل، ولكنني أوضح\nهنا أنها منافسة. وإحدى طرق التفكير في الأمر، عندما يقول الناس الرياضات الجماعية، فإنهم يتحدثون عن لعب\nالأشخاص في نفس مدرستك. هذا ما يحدث هنا. أنت تتنافس ضد\nالأسماك الأخرى من نفس النوع الخاص بك. الآن، يمكنك أيضًا\nالتنافس بين الأنواع. على سبيل المثال، ربما هذه\nالسمكة الزرقاء هنا. حاول أن تجعل هذا يبدو\nمختلفًا بعض الشيء. تحب هذه السمكة الزرقاء أيضًا\nأكل هذا النوع من الأسماك الصفراء. إذًا لديك تفاعل بين الأنواع بين الأنواع الزرقاء\nوهذه السمكة الصفراء، ولكن لديك أيضًا الآن أنواع بين الأنواع، أو تفاعل بين الأنواع،\nأو منافسة بين الأنواع بين هذه الأنواع البيضاء\nوهذه الأنواع الزرقاء. الآن، المنافسة مثيرة للاهتمام حقًا لأنه يمكنك أن تتخيل أنه كلما زاد عدد الأنواع\nالموجودة حولها، زادت المنافسة التي\nسيقدمونها ليس فقط للأنواع الأخرى\nولكن أيضًا لبعضهم البعض. لذلك عادة، مع ارتفاع الكثافة السكانية، تزداد المنافسة، وعلى الرغم من أن الموارد\nالمتاحة لأي فرد قد تنخفض، لذلك يمكن أن يكون ذلك بمثابة فحص بسيط أو في كثير من الحالات، فحصًا كبيرًا جدًا على  السكان أو\nالكثافة السكانية. والآن، يمكنك أن تتخيل\nالمواقف التي يكون فيها أحد الأنواع أفضل في التنافس على\nالموارد من نوع آخر. حسنًا، سيبدأ الأمر في أن يصبح أكثر شيوعًا مقارنةً\nبالأنواع الأخرى. ويمكنك أن تتخيل موقفًا متطرفًا حيث تتفوق في المنافسة في كل البعد، وعند تلك النقطة، لديك ما يسمى بمبدأ الاستبعاد التنافسي، حيث يكونون في الأساس\nفي نفس المكان، وهذه الأنواع البيضاء ستسيطر بشكل أساسي على هذا المكان. لكننا نعلم أيضًا أن مجرد\nتنافسهم على الموارد، لا\nيعني أن كلا النوعين أو الأنواع المتعددة لا يمكن أن\nيكونوا في نفس النظام البيئي. ويحدث هذا بشكل خاص من خلال ما يسمى\nبتقسيم الموارد. لذلك اسمحوا لي أن أقدم مثالا بسيطا جدا هنا. تقسيم الموارد. دعونا نتخيل كائنات\nتعيش في الغابة. سأرسم إحدى أشجار تلك الغابة. وقد تقول: \"حسنًا،\nهناك العديد من المخلوقات التي تحب العيش على الأشجار. ربما يتفوق أحد الأنواع على\nالشجرة.\" ولكن اتضح أن\nالأجزاء المختلفة من تلك الشجرة قد تكون مفيدة لمخلوقات مختلفة، حيث تتمتع المخلوقات المختلفة\nبمزايا مختلفة في أجزاء مختلفة من الشجرة. على سبيل المثال، قد يكون الجزء العلوي من\nالشجرة أكثر إشراقًا وجفافًا، ولذلك قد تكون هناك\nكائنات يمكنها المنافسة في الجزء المشمس والجاف من الشجرة، بينما ربما تكون قاعدة\nالشجرة هنا، بالأسفل هنا أكثر رطوبة ورطوبة  ومظللة ولا تحصل على قدر كبير من الشمس. اسمحوا لي أن أرسم ذلك باللون البني، هنا، دون التعرض لأشعة الشمس. وربما هناك أنواع مختلفة يمكنها أن تحقق نتائج جيدة هنا. ومن غير المرجح أن يكون هناك\nنوعان فقط. إذا كنا نفكر في شجرة، فمن الممكن أن يكون هناك 50 نوعًا\nيعيشون هنا، لكنهم يعيشون في\nأجزاء مختلفة من الشجرة. ولا يتعلق الأمر فقط بالتواجد في أجزاء مختلفة من شيء ما. ويمكن أن يكون أيضا في أوقات مختلفة. ربما يستطيع أحد الأنواع أن يتفوق في المنافسة ليلاً ويمكن لنوع آخر أن\nيتفوق في المنافسة أثناء النهار. وهذا أيضًا تقسيم الموارد. لكن أهم ما نستخلصه من هذا الفيديو هو أن الكائنات الحية ليست في عزلة. إنهم يتفاعلون مع أعضاء آخرين من نفس النوع\nومع الأنواع الأخرى. يمكن أن تكون هناك مواقف متطرفة حيث يمكن لنوع واحد أن\nينتصر في كل البعد، وفي هذه الحالة قد لا تتمكن الأنواع الأخرى من\nالبقاء في ذلك المكان، ولكن هناك مواقف أخرى،\nوهذا أمر شائع جدًا، حيث يمكن للأنواع مشاركة الموارد لأن  يمكنهم التفوق في المنافسة أو يمكنهم الازدهار في\nأجزاء مختلفة من هذا المورد.  لقد قاموا بشكل أساسي\nبنحت مكانتهم الخاصة باستخدام أجزاء مختلفة من\nهذه الشجرة، في هذا المثال.",
    "t_italian": "- [Istruttore] Quindi immaginiamo\ndi essere nell'oceano e penseremo un\npo' ai pesci. E sappiamo che gli organismi, di solito, non esistono solo da soli, ma che ci sono altri organismi in giro. Potrebbero esserci altri membri\ndella loro specie in giro, e molto probabilmente ci\nsaranno altre specie in giro. Ciò su cui ci concentreremo in questo video sono le interazioni all'interno di\nuna specie e tra specie. Quindi, per esempio, diciamo che a questa\nspecie bianca qui piace mangiare questa specie gialla come cibo. Questa è un'interazione. Cercherà di predare, di\nmangiare quella specie gialla. Quindi quel tipo di interazione\nche è tra le specie, chiamiamo interazioni interspecifiche, interspecifiche. E questa particolare interazione a cui stiamo assistendo è di predazione. Una specie utilizza l'\naltra specie come cibo. Ora, questo non è l'\nunico tipo di interazione in questa immagine molto semplice. Potresti immaginare che ci sia solo\nun pesciolino giallo qui, ed entrambi questi pesci bianchi sono affamati. Dovranno competere per vedere chi prenderà quel pesce giallo. Quindi tra questi due pesci potresti avere un altro\ntipo di interazione, e questa è la competizione. Ma questa è competizione tra due membri della stessa specie. Quindi questa è un'interazione intra, intraspecifica e specifica. In particolare, è la concorrenza. Potrei semplicemente scrivere interazione, ma qui sono più specifico\ndicendo che si tratta di competizione. E un modo di pensarci è che quando la gente parla di sport intramurali, si riferisce a giocare contro\npersone della tua stessa scuola. Questo è quello che sta succedendo qui. Stai gareggiando contro altri\npesci della tua stessa specie. Ora puoi anche avere\ncompetizione tra specie. Per esempio, forse questo\npesce azzurro proprio qui. Prova a renderlo un\npo' diverso. Questo pesce azzurro ama anche\nmangiare questa specie di pesce giallo. Quindi c'è un'interazione interspecifica tra la specie blu\ne questo pesce giallo, ma ora ci sono anche interspecie, o interazione interspecifica,\no competizione interspecifica tra questa specie bianca\ne questa specie blu. Ora, la competizione è davvero interessante perché potete immaginare che più specie\nci sono in giro, maggiore sarà la competizione\n non solo per le altre specie\nma anche tra di loro. Quindi di solito, quando la densità della popolazione aumenta, la concorrenza aumenta, e anche se le risorse\ndisponibili per ciascun individuo potrebbero diminuire, può essere un piccolo controllo o, in molti casi, un controllo molto grande sul  popolazione o\nla densità di popolazione. E ora potete immaginare\nsituazioni in cui una specie è più brava a competere per\nle risorse rispetto a un’altra specie. Bene, allora inizierà a diventare sempre più comune rispetto\na quell'altra specie. E potete immaginare una situazione estrema in cui surclassa in ogni dimensione, e a quel punto si ha quello che viene chiamato il principio di esclusione competitiva, dove sono essenzialmente\nnella stessa nicchia, e questa specie bianca essenzialmente prenderebbe il controllo di quella nicchia. Ma sappiamo anche che solo\nperché sono in competizione per le risorse, non\nsignifica che entrambe le specie o più specie non possano\ntrovarsi nello stesso ecosistema. E questo avviene soprattutto attraverso qualcosa chiamato\npartizionamento delle risorse. Quindi lasciatemi fare un esempio molto semplice qui. Partizionamento delle risorse. Immaginiamo creature che\nvivono in una foresta. Disegnerò uno degli alberi di quella foresta. E potresti dire: \"Va bene,\nci sono molte creature a cui piace vivere sugli alberi. Forse una delle specie\nsupera l'albero\". Ma si scopre che\nparti diverse di quell'albero potrebbero essere buone per creature diverse, laddove creature diverse\nhanno vantaggi diversi in parti diverse dell'albero. Ad esempio, la cima\ndell'albero potrebbe essere più soleggiata e secca, e quindi potrebbero esserci\ncreature che possono competere nella parte soleggiata e secca dell'albero, mentre forse la base\ndell'albero quaggiù, quaggiù è più umida e bagnata  e ombreggiato e non prende tanto sole. Lasciatemelo disegnare in un, forse lo disegnerò in un colore marrone, proprio qui, dove non prende così tanto sole. E forse c'è una specie diversa che potrebbe fare bene da queste parti. Ed è improbabile che ci siano solo\ndue specie. Se pensiamo a un albero, potrebbero esserci 50 specie\nche vivono qui, ma vivono in\nparti diverse dell'albero. E non si tratta solo di trovarsi in parti diverse di qualcosa. Potrebbe anche avvenire in momenti diversi. Forse una specie può competere di notte e un’altra specie può\ncompetere di giorno. Anche questo è il partizionamento delle risorse. Ma la cosa più importante da questo video è che gli organismi non sono isolati. Interagiscono con altri membri della loro stessa specie\ne con altre specie. Potrebbero esserci situazioni estreme in cui una specie può vincere\nin ogni dimensione, nel qual caso le altre specie potrebbero non essere in grado di\nrestare in quella nicchia, ma ci sono altre situazioni,\ne questo è molto comune, in cui le specie possono condividere una risorsa perché  possono superare la concorrenza o prosperare in diverse\nparti di quella risorsa. Essenzialmente si sono\nritagliati la propria nicchia utilizzando diverse parti,\nin questo esempio, di questo albero."
}