{
    "source": "OsFO56QfKFg",
    "youtubelink": "https://www.youtube.com/watch?v=OsFO56QfKFg",
    "t_english": "- Hi everyone, nice to meet you. My name is Danielle Sullivan and I'm so excited to be the facilitator of this excellent math conversation today with my amazing colleagues. Today we wanna talk about math instruction, how it's changed, shifted since the pandemic, and how AI can bring new opportunities to make sure that we're putting the critical thinking, conceptual understanding and conversation, honestly, back in our math classrooms. We know y'all have a lot of different variety of challenges and hopefully this conversation will help meet you where you are and move your students forward. So I am going to now let the panel introduce themselves. Let's go ahead and start with Dina. - Hello everyone, I am Dina Neyman. I lead our district success team here at Khan Academy. But most importantly, I have been a math educator for a very, very long time, 25 years now, actually starting in middle school math. And I do love my middle school, but I've taught a little bit of everything. I will pass it to Iman. - Thanks Dina. Hi everybody, my name's Iman Howard. I'm the group manager for all of our STEM content here at Khan Academy. I am a lifelong learner and math and science educator, and I'm super excited to chat with everyone today. I'll pass it over to you Stacie. - Hi everyone, my name's Stacie Johnson and like Dina, I have also been a lifelong educator in math and like Iman in math and science, middle school, high school and elementary, I lead our professional learning team. So really excited to be here to talk with you today about math instruction and how we're reaching kids. - Great, and I totally forgot to talk about my background too. So I'm the hostess and yes, this is not only my literal background, yes, I'm actually my sister's in Arizona, but I support the Northeast. So I'm visiting in Arizona, which is kind of exciting. And I am a lifelong educator and I also taught special education and math in fifth and sixth grade, both in Washington DC and upstate New York. So first question to kick us all off, what is Khan Academy's approach to math instruction and how is that changing in this age of AI? And Iman, I want you to go ahead and kick us off. - Awesome, thank you so much. So when we're developing content for mathematics, we think about it with the aspects of rigor. So that's really breaking it down in three ways. First, we think about procedural fluency. So can you calculate with speed and accuracy? And then we get into conceptual understanding. So can you access concepts from a number of perspectives to see math as, you know, more than just, you know, excuse me, less discreet and more less procedure. And then finally we think about it with application. So can you use procedures and concepts flexibly and problem solving? And you know, any given standard might have one or a combination of these aspects. And sometimes that can feel very limiting when we're developing content. And so when it comes to AI, one of the things that really excites me is the opportunity to dig into more of the conceptual understanding, which comes with discourse. And so instead of a student just, you know, right or wrong, conceptual understanding comes in and we can figure out why the math is happening this way in a really individualized way. - So Dina, let's add to that. What are your thoughts? - You know, I think the discourse is really one of the biggest pieces that AI brings to math instruction and adds. As a classroom teacher, I always, my students always worked in groups. My classroom was never quiet. We were always loud and chattering about mathematics and doing projects and questioning our thinking and explaining our reasoning. And I think that, you know, in general, a lot of the technological influences in classrooms have pushed math instruction to become more procedural. Can you, you know, can you do this calculation? Can you solve this equation? Can you do the steps in a particular order? Not even necessarily, like, there are options, right? There are different paths that we can take to get to the right math answer. And students often have a very good reason and they think about things differently. And that adds to all of our reasoning and all of our math toolkits when we can hear how kids are thinking about math and the way that they're coming up with their next step or their strategy or why they approach a problem a certain way. And I think with AI, when students have to ask questions, when they have to be able to say, I don't understand this piece of an equation, it's not, I don't understand the whole concept, it's, I don't understand how to go from this step to the next, or they have to think more critically. And it really builds that conceptual knowledge. But that questioning I think is a really big part of that. - So Stacie, how are we at Khan Academy, helping teachers wrap their head around all of this? - Yeah, I mean, I think even before I think about how we're wrapping our head around it, as I think about discourse and conceptual understanding, one of the things that I'm most proud of with Khan Academy is where students are doing that. What are we talking about? What are we building conceptual understanding in? And the fact that at Khan Academy, we believe, we know that every student can achieve at grade level. And I think what's really important to say here is that all of our students have learning gaps. All of them are coming in with these holes, right? It's kind of this Swiss cheese understanding of mathematics and the way that we really build an implementation focused on not kind of dooming kids to work below grade level for the next year so that we're just perpetuating that gap. But putting them on grade level, knowing and believing that that's where they can achieve using AI to do some of that scaffolding. Because of course, the teacher is the best resource, of course, the teacher is where we should be leaning and students should always go to the teacher first, but the teacher can't talk to 35 kids at once or more, right? So while we're waiting for the teacher, AI can be there to support kids so they don't get stuck, they don't get to the point of frustration and the throw their hands up and quit, right? Because all that's doing is perpetuating those learning gaps and making the holes bigger. So I think that the most important thing to say here is how are we keeping students on grade level and how are we ensuring that that's where they're learning and they're progressing forward from there, we can simultaneously, go back and fill some of those holes while we continue to work with students on grade level. And as far as how we're getting teachers there, I think that's a step-by-step process, right? Our teachers have overflowing plates too much to do all the time, too many administrative tasks, too many things that don't have to do with actually teaching kids. So the question is, how are we listening to teachers about what training they need? How are we gathering information about what support they need? And then designing training programs in response to that, rather than just bringing them a can set of support and training and expecting that to make a difference. - Absolutely. And everyone, you can post questions in the chat. We have some guided questions that we had planned ahead of time, but I definitely wanna make sure that we have the ability to answer your questions. And I would love for you to all start talking and responding too in the chat if that's too overwhelming for you. You just wanna show up and listen, great. If you wanna interact, great. Like, there's a lot of different ways to be today, but I'd be curious, like Matthew just typed in personalized learning. Like what are y'all thinking? As you heard Dina, Iman and Stacie share about, you know, some of the challenges you're having. So you think about that, and we're gonna start really digging into this a little bit more knowing, right? Like mathematics is typically thought of a very concrete and objective subject. And as much as we talk about it, sometimes we don't see a lot of focus on the process and approach, and sometimes it's right and wrong. Does AI have the potential to influence that? Iman, what are your thoughts? - Absolutely. You know, a lot of our curriculum sometimes focuses on that procedural fluency. And so when you're in the classroom executing this, you ask a student a question, they can't get the answer right. And now all of a sudden we're the kid's saying, I'm not a math person, I got it wrong. And then the conversation ends and maybe they don't raise their hand again. However, when we introduce something like Conmigo and AI, not only if I got it wrong, it's not a shutdown, there's an opportunity to now say, well, let's have a conversation. Let's figure out why that happened. And now we're getting into that conceptual understanding. And you know, someone in the chat mentioned personalized learning. We're going to personalized learning. Many of us have been in classrooms where it's, the ratio was one to 35, and we have some students that are on grade level, a few two years behind and a few two years ahead. And so now we have this opportunity to meet everyone at their learning edge. Right or wrong, we have a way to personalize your instruction and get you to the level that we know you can meet, which is grade level. - Go ahead, Dina. - You know, it's personalized learning, but I feel like there has always been this, like, this desire and goal for secondary teachers to make small group learning a reality. And it's felt impossible. And it's felt so challenging because you're absolutely right. You've got 36 bodies in your classroom and you wanna work with this small group of like three or four that need attention. But what happens the second you sit down, all those hands go up, I need you, I need you, I've got a question. I don't know what to do next. And I think that that small group time, actually Lynn commented flexibility in teaching in the chat. And I think that AI gives us the possibility to do things that previously were so complicated and so difficult. I think that we can do that small group instruction because AI can interact and, you know, keep students progressing in their learning and keep them moving forward. And I think it actually gives our kids more time with the teacher in the way that they really need it. It's less of the teacher like standing up and delivering to a whole classroom at once, but more of the teacher being able to meet those needs right where they are, and really provides students with the instruction, the explanation and the guidance where and how they need it. - Yeah. So Dina, that makes me think about like my favorite part of being in the classroom. I don't know if y'all have seen, like, there was this YouTube video going around a few years ago was called My Favorite No, right? And it was about looking at the way that students had solved a problem and finding the wrong answers, but finding the beauty and the accuracy in those wrong answers. And my favorite part of teaching math was listening to students articulate the way that they approached a problem or how they were thinking about that, right? To their peers, to me, in those small group settings, and that's also one of the hardest things. How can you be there to listen to all the kids? How can you really be there to internalize what they're thinking? Because as math teachers, it's difficult to teach into a wrong answer. Yep. We can certainly teach into a misconception, right? So when I think about AI, one of the things that I wish I'd had in my classroom was this ability to go back and look at the transcripts or the conversations that a student is having with a chat bot to identify how are they processing this information? Are they stuck? And they're just saying, I don't know, I don't know. Or are they really trying to process this? And what types of questions are they asking? Because to me, if I can harness that information, if I can get that from my class as a whole, which I can't do by just walking around listening to everybody now can teach into the misconceptions of my class and really harness what they know to build on what they don't yet know. - So to bridge on what you just said and to kind of answer some of the questions that are coming in simultaneously, a couple people have asked about Khanmigo, does it just give students answers? Or if students are really, like, it's a one-on-one tutor, but if the students are really unmotivated, how is Khanmigo functioning to be that teacher when the teacher can't clone her or himself for 35 ways? Right? And how many y'all feel like you don't have enough time to teach math? Anybody? Anybody in the room? Exactly. Yeah. So Iman, do you wanna start talking about that? - Yeah, absolutely. So, you know, similar to what a good teacher would do is when a student gets an answer wrong, we don't just spit them the correct answer and walk away. We ask them a series of scaffolded questions based on the response that they gave us. And that's where you see that dialogue happen between Conmigo and students is that, hey, that's not quite right. Let's talk about where you misplaced that decimal. Let's go down and let's work together back and forth to get you to the right answer. And now that you got it, let me give you another one that you can try on your own. Right, similar to what you would do, I think about Conmigo as a teaching assistant, right? And so while I'm able to facilitate over here, it's small group, I know that my students over here aren't engaged. And when it comes to classroom management, I need my students engaged. - And yes. - Can I pick up, Cynthia, put a question in, and I think it builds on this, she said she's found that AI is helpful, but students aren't always motivated or sure of how to use the resource. And she asked, should instructors teach students how to use the AI resources, including teaching exercises using them? And I think absolutely, just like with any tool, just like with a graphing calculator, with, you know, with the way that we teach routines in our classroom, I absolutely think that we need to teach our students how to use AI, what the best practices are. I think it starts with modeling. If it were my classroom, I would start by pulling it up and doing a chat myself, asking questions and you know, showing students what it looks like. And I know we just released, oh goodness, Iman, you can probably even say, I think it was within the last like two weeks really. We released our AI for students course. Is that right? - We sure did. And I think that's a good call out because you know, we hear this term AI, AI, and it's so important to tell our students what is a large language model? What is this thing that's interacting? Does it know all the answers? What can it do? What can't it do? And so we do have a course, AI for Education, that y'all could check out to ensure that we know how to use this as a tool to enhance our learning, because that's what it is. - Absolutely. And speaking of tools and learning, we are learning that we did not set up this webinar in the most interactive way. So y'all we're doing the best we can. Ee see your questions, we see your comments, so we're gonna keep making sure that we answer everything. And this is a learning experience. So I don't know if you can see each other's responses, but we're gonna keep the conversation going. You keep talking to us, we'll bring, we'll highlight things. So Stacie, what are your thoughts on what things that Iman and Dina shared? - Yeah, I agree with all of that. There was a comment in the chat about teaching students to like, how do you really dig in, how do you actually coach students to ask better questions? And I think it's actually a question for us as, as adults, as the leaders in the room, as well as as students. And I think the important thing to say out loud is in, in the spirit of all of us learning that teachers and students are learning alongside of each other how to work this new technology, right? And for us to shift this mindset and that it's not a search engine. So one of the things we've seen be really successful is actually to practice asking the question to another person before you put it in to Conmigo or into a chatbot, right? Because the people think, and students particularly, they, they think, oh, there's a certain way I have to say this, right? We hear a lot about prompting or there's this particular language I have to use. And really it's conversational. So when, as a teacher, if you say something to the student like, well, well, what would you say to, to the kid next to you, right? Or what would you say to me? Okay, now just type that, that's a, it's kind of a mindset shift because we think it's this really formal process, but giving ourselves that coaching as well as our students is really important. And just keep it conversational. And if you don't like the answer, say, I'm not sure about that. Can you say it differently? Or, I don't like that answer. And pushing back very much in the same way that you would if you were having a conversation with another person. - And I think that could be an additional member of your group, right? If kids have to agree on what question to ask, oh my goodness, that really gets some great discourse going when they can only ask one and they have to figure out what the perfect next one is. - Yes. And John, we totally see you typing in there, like John's doing some really great things with his students that even if like there's correct answers, telling them that he's not only interested in the correct answer, but how they solved and what steps. But John did ask, how does AI also help students that have IEPs or 504s or other documentation disabilities or accommodations? And I would add how do y'all think it helps when students who might be shy or have some math trauma or really have really low math confidence? - So I will say my husband is an ESOL educator, English speakers of other languages in some states, I live in Florida, in some states we call that ELL, English learners. But my husband uses it, uses technology to, as a way to help students in his classroom think about questions before they have to ask them publicly, especially if they have that anxiety and they're just not sure. By taking a minute and having that opportunity to interact, it can give them a chance to feel more confident to know whether, you know, whether they're on the right track to get some feedback before they ask a question or, you know, if you think about when teachers are teaching, if there's a word and they don't know what it means, they can quickly type that in. They can quickly ask, plug that in and get an example or find out where this is applicable in real life, right? Because that's something that is so critical to making connections with the content. I think it gives relevance to our content. I think it gives students the opportunity to ask in a way that's not, that's not threatening or scary. It gives them the chance to really explore content safely. - Iman, what do you think about that? Yeah, I agree with everything you're saying, Dina. And you know, I've taught students who had IEPs and sometimes typing itself was the limitation. And one of the things that I really enjoy about Khanmigo is being able to speak into it, to actually ask your questions. And if you have headphones, Conmigo now has a voice. So this can be like a one-on-one thing where, hey, Conmigo, I need some help over here, and then I'm the only one that hears the answer. And that can be really critical to getting a student, to your point, Dina, to combat some of that math trauma and really make sure that they're getting their needs met. - Yeah, and I think, you know, just circling back to multilingual learners, also the idea that Khanmigo right now can converse and have that dialogue in the English and Spanish and Portuguese. So also being a safe space where students don't have to fall behind on math learning and content while they're simultaneously acquiring English confidence and proficiency. So, you know, an agreement with everything that that has been said, I think it's a safe space for students to test out their ideas without taking a risk that they may not be comfortable with yet. - Yeah, and I think one other way that it can really help is by helping teachers craft lessons to meet the needs of the students that they work with. And being able to help you adapt lessons more quickly, more efficiently than you ever have before. So being able to say, you know, I have students who really enjoy this topic or that theme, and being able to create lessons around it, being able to take content and anchor it on something. If students love hiking in the mountains, because I'm looking at Danielle's background, if students love to go hiking, let's have a conversation about hiking. And I just, I think that it also really equips teachers to be able to differentiate like we never have before. - So I wanna dig into that a little bit because there are some questions coming in around parameters around what happens if kids go off topic, but I also, I don't wanna get off topic myself, but I wanna, you started, you alluded to now some of the teacher tools. I think we spent a lot of time talking about how AI is focusing on the student conversation, but how do we help educators with, because we set the problems, right? You have one human with lots of other humans in the classroom with lots of needs, and especially post pandemic. We have seen so many learning gaps. But everyone on this, on this webinar, let's be real, we've had gaps for a long time, yes? In mathematics. Yeah. And I think everyone's really moving in the right direction, committed and even calling back to what Stacie said in the beginning, like the high expectations, believing all students can, making sure all students have equitable access to grade level content. So my question is, how can the tools for teachers also help solve this problem? Dina, do you wanna kick us off and then we'll? - Sure. Yeah, I think Amy asked a question. I wanna use Amy's question to kind of kick it off. Are there ways to set parameters with AI to keep students within the content area instead of an open forum? And I know that there was another question about how do I prevent AI from just giving the answers? And I think that's something that we have really been committed to at Khan Academy is to create Khanmigo so that AI is a safe space for students. We've built in moderation. Khanmigo won't give students the answer if they ask for it, it will clearly say, I can't give you the answer, but I can coach you. And it will, you know, it will be, it will keep them on track. If you are working on a math problem and you say, I wanna talk about the French Revolution, Khanmigo will say, that's fabulous, but this is not the place and time for that. And I think that's really great. It helps keep students focused in terms of the teacher tools. I think that's number one. Can you imagine if our kids just stayed focused the whole class period, how fabulous that would be? I say that as a middle school teacher, right? I taught middle school, so it was always like, you know, lots of movement, lots of activity, trying to keep them focused on me. So it starts there, it starts with helping keep students engaged, keeping them focused. And then I think it's also about, you know, as a classroom teacher, I used to look, I told you I've been a math educator forever, y'all. It's about not having to search through, I used to search through book after book after book, looking for the right lesson, the right resource, the right materials. And then, you know, then the internet came about. And you know, we had Google and we had all the things and then I just had 57,000 tabs open while I was looking for something to lesson plan with. I think this saves time because it gives me something high quality. I can make those adjustments quickly. I can make resources to meet the needs of my students that are specific to my students very, very quickly. And I can create really good, rich tasks, which again, I am all about the project problem-based teaching and being able to create those rich tasks quick. That's everything. - And I think not only creating the rich tasks, but how fast you can then differentiate, right? I mean, we used to spend hours making this great rich task for all the kids. Now we can do that in such a short period of time that I can also make four or five other versions of that that speak to the individual needs of small groups of my students or maybe even an individual student in literally just a few minutes, right? I could count 'em on one hand and now I have high quality resources for my students that are differentiated. - You have anything else to add Iman, on that topic? - No, I couldn't agree more. You know, when I think about some of the teacher tools, I was thinking to myself, well, which ones would I would've loved when I was teaching? And the refresh my knowledge tool is so critical because as a teacher, I think time was a commodity for me. I feel like I'd never had enough time and there'd be moments where, you know, I needed support with my lesson planning or one of my colleagues was out and I was told, hey, I need you to teach this eighth grade math course, but I'm teaching six. And so just having a tool just to quickly get me up to speed so that I don't have to have students fall further behind is just so critical. And so, you know, I just think about the ways in which I can just individualize my learning, but also as a teacher could keep me up to date what's needed for my students. - Yeah, so let's unpack that a little bit more because you're talking about the teacher tools. So Stacie, if you were in the classroom today, which AI feature would be your go-to? What would you have leaned on the most? - So this is always an interesting question 'cause people look at me kind of funny. I am absolutely in love with the rubric tool, which is not something we do in math classrooms, right? Who would math teacher use as a rubric? I use them all the time. And it was such an interesting learning curve for me because as I went through my teacher prep program, we did all of our rubrics based on ELA stuff and humanities, right? And when I started teaching, I got a few years into it and realized I needed students to have a better understanding of what they're being asked to do, how they needed to show that and how they should be able to verbalize or communicate that after the fact. And so because I was much more focused on process, I would use rubrics and it took me forever because there's no rubrics out there for solving systems of equations with rational numbers I to make all of them. So I just did one a couple weeks ago with Khanmigo. It took me less than five minutes and it was so explicit for kids and if I was in the classroom right now with that tool, it just totally shifts the onus of learning onto the student. They know what's expected. They are now focused on process rather than that letter grade that doesn't teach them anything, right? They're now really in that metacognitive state where they're thinking about what am I learning? How am I showing it and how am I communicating it? - Iman how about you? What's your fav? - My fave has to be the leveler. So the leveler tool which allows you to take any text and level it in different ways for different reading levels is one of my favorite tools because I used to have students who had IEPs and they would tell me like, one, Ms. Howard, I don't understand what this text says. Or the text that I'm giving feels like baby work. I would hear that all the time from my students. And so this idea that everyone can access the same information but it's tailored in a way that it's just for you, it's a game changer for me. And so that would be my number one. - And before Dina, I let you answer, I wanna piggyback off as a former special education teacher myself, there's actually an IEP creator tool. How many of you watching this have ever struggled with IEP goals and monitoring those goals? Anybody? Just kidding. Yes, that is. And then keeping students engaged and on track. So I was pushing Khanmigo to give me very specific measurable accountability outcomes for mathematical IEP goals. And when you push it and push it, it gives you exactly what you need. So that thing, if I had had that, it would've saved me hours of my life, hours. Dina, what about you? - Okay, so I have a middle school son who is a very curious individual and wants to know everything about everything. So my favorite is Ignite my Curiosity because he asked me questions about things I have no idea about. And I have learned that Khanmigo is my best friend when it comes to answering his questions about the way the world works and the way that things look in subject areas that are, you know, his world of science is big and huge and massive and even though mom is a math girl and I've got a lot of science, I definitely think that as a parent Ignite My Curiosity has saved me more than a few times. - Yes, I can see that I'm somebody who got in trouble at church school for asking where the dinosaurs were with Adam and Eve. I don't know if that relates to anybody but curiosity, it's important to continue to make sure that we build on curiosity for students. So there are some logistical questions coming in. Somebody was asking about time fitting everything in. Can y'all speak to how do we incorporate some of these tools? Like we're talking about the teacher tools can save time, but I wanna just shift back a little bit to the Khanmigo student facing tools and if actually can someone explain the difference between our courses plus Khanmigo? 'Cause I think, I don't know if we really started with that. So who wants to start off by just kind of giving people the lay of the land? - I can do it. - Thank you Dina. Sold! - We have courses on Khan Academy. We have, and believe it or not, we hear often, you know, Khan Academy, that's math and science. We actually also have ELA, we have social studies, we have life skills, we have college and career readiness, financial literacy, AI for educators, AI for students. We have art history, we have a lot of different courses and with all of our course content come different ways to learn. We offer videos, we offer guided readings. We offer exercises to practice what you've learned. So there's a whole different, there's a whole set of content that's just those courses that can be used in line with what you teach every day. So we have coursework that you can use, you can use our videos as a whole class, you can have students watch 'em individually. But then we also have the Khanmigo student tools, which are a really nice way to differentiate your instruction. One of my favorite pieces as a teacher, I was always super big on explicit vocabulary teaching, right? I even before Hattie said it was like one of those best practices, like explicit vocabulary teaching was always a big thing for me. And so I like that we have some vocabulary tools where students can practice their math vocab. I would use it, I think it can fit into your teaching in a lot of different ways. You can engage students with different types of warmups. You have content to give them practice, you have opportunities for them to get sets of practice problems where they can work and they have to explain their reasoning and Khanmigo will coach them. So I think when you ask how it fits within your teaching, I would say it depends on your teaching style, it depends on what you want to do. But we definitely have enough content to fit into a weekly routine. - Either of you wanna add anything else to that? - I think she locked it in. I agree with all that. And Khanmigo, it's a nice layer on top right? 'Cause it's there to support the whole way through. - So I wanna go back to what kind of future we're building mathematically with our students. And I'd love to know, and I love everyone watching this to think about the same thing. So say you had a magic wand, right? 'Cause obviously we have an amazing tool, but it's not a magic wand. What would be you change or what kind of future would you want to see moving forward when we think about mathematics instruction? - Yeah, I'll jump in here and say like, my magic wand would change the spirit with which we approach math instruction, especially with younger learners. Because you know, if you think about advanced mathematics and mathematicians' math, it really is a, to me it's a creative subject. It's about building understanding of the world. It's about exploring things that we don't yet know and understand. But we teach math as if there is no creativity often, right? And I think that AI can really support us with that shift where rather than thinking about things in one way, AI can help students with thinking about problems from a different perspective or with explaining it differently or a different approach. And as a teacher, that's really hard to do with 35 or more human beings in a room, right? So I think that's where AI can come in and support us with having those conversations with kids and really delving into the exploration. That to me is the true spirit of mathematics that we don't often have time to capitalize on. - Absolutely. I feel like if I had a magic wand, there would be no defining moment where somebody decided if they were good at math or bad at math, everyone would see themselves as a math person. And they would learn that when, you know, I make a mistake, it's not like a oh no, it's a let's have a conversation, that was fun. What are you thinking? And everyone would feel empowered to have these talks about how can we learn from misconceptions, how can we have math discourse? And what I love about AI is that it empowers us to do just that, that learning from errors is actually an opportunity. - How about you Dina? - I think the beauty of mathematics is in the way that it's such a part of all of our world. It's, you know, Einstein said, mathematics is the language with which God has written the universe. It's out there. It's everywhere that we look and everywhere that we see it. And it's a shame that for most students, it's boiled down to just a set of procedural equations and steps. And I think that, you know, just to agree with my amazing colleagues here, it opens up the world of what math really is and what it should be so that students can see, you know, maybe I'm not super great at geometry, but you know what, I love algebra. I love finding generalizations and figuring out how equations can work. Or maybe I'm not an algebra, I'm a geometry person. There are different ways to love math and to engage with it. And I think you can see yourself in that when you have the opportunity and when you're presented with math as being so much bigger than a series of steps. - And I agree with everyone, everything that you said and from supporting math educators really closely for, gosh, the last 10 years of my career, I also want to empower, my magic wand would be to empower every math educator like Iman said, to not feel like I'm a, even some elementary school teachers sometimes feel like they can't teach math or they shy away from math or they have math trauma themselves. I have math trauma. Any of you have math trauma? Like I know exactly when it happens. So it's knowing that you can, it's knowing that it's what's possible and finding the joy again. So I actually would love to talk a little bit about creativity, joy, which also links to boosting confidence. How can these tools help bring some of the happy back in our mathematical classrooms? Stacie, what do you think about that? How can we like enhance more creativity? - Yeah, I'm trying to figure out how to not repeat myself 'cause this is my magic wand question, right? I think it's about helping students to examine mathematics from another perspective, right? So in our traditional dynamic, we have a teacher who's teaching math and students are learning and sometimes they get the opportunity to verbalize back, but it tends to be kind of a two-way conversation, right? As much as we can bring in peer dialogue and have students talking about and exploring the ways that other people think about problems or the ways that other people approach a problem, that's incredibly valuable. But time is so limited. And so to me, whatever AI tool you're using, it could be about exploring mathematics in a more pictorial manner, right? Where we're looking at things graphically or playing with things graphically and visual images of it. Or it could just be about having that safe space to explore the how and the why behind my own thinking or my own so-called mistakes. Because to me, that's where the creativity and the learning comes out. It's almost more likely that you're going to explore the creative side and how you approach something when you do make a mistake, right? When I didn't get it right the first time and I have to go back in and examine my own process. And I think that's really where that having that AI chat support or having that dialogue can really help us to dig in there. - Absolutely. And like Stacie, like, you know, I view creativity as higher order thinking. So getting all out of that, do I understand it? Can I recall it? But can I analyze it? Can I create something new from this? Can I have a discussion about this? And that's what AI allows us to do. And so when I think of, when I tie that into what happens in a classroom where students are all at different levels, regardless of your level, we can now all engage in higher order thinking that meets us at our learning edge. And so that's something that I'm really excited about for this tool. - Actually. Can we talk a little bit more about meeting you at the Learning Edge? Can you expand on that? Because that's a thing where a lot of research is showing, right? It's called, I mean even John Hattie talks about the Goldilocks principle of learning, can't be too easy, too hard, it has to be just right, but the just right, it's different for everybody, the edge is different. - Exactly, it's different for everyone. And you know, I'm going back to this anecdote we've been using about being the one to 35 ratio between yourself and the kiddos is that every student has a different learning edge. So at what point have I pushed you to where we're not in frustration mode, we're still getting, you know, that learning that's happening, but it's also, it's not as rigorous, right? And so the idea here is that when I'm working with Conmigo, I might get something wrong, right? And then Khanmigo is gonna call out exactly where I got it wrong and the dialogue starts right there. Maybe I got it right. Khanmigo can then up the level, right? And then we can now work on something a little more rigorous. And it's really important for engagement, it's important for learning that that is happening, that each student is being met exactly where they need to be. And as one person, that's really difficult to do. But we have a teaching assistant that can help us out now. - Yes, absolutely. Dina, any final thoughts on either of the creativity or edge of learning? - I think with the edge of learning, I think that we're able to be responsive and adaptive faster than we ever have been. I think that, you know, for students sometimes you just need that one light bulb moment to understand a concept for it to make sense. And I think being able to have that moment happen and then being able to like, use that as a launchpad and accelerate so you're not stuck, you know, you're not stuck working below grade level or on rote skills for a long time where you're just, you keep practicing but you don't really need it anymore. I think it allows us to see when students have it and when they're ready to keep moving, it helps us get out of some of the muck, if you will. And really keep progress, keep students moving forward and keeping them engaged. And I think in terms of like the creativity, just as they're doing that, how do you like to learn? We were looking at, you know, at some different chats that had come in. One student asked and had Conmigo talk to them like a pirate for a little while because it kept them engaged. And so they were doing systems of equations from, you know, a pirate and it was, they were thrilled they were having a great time, but it was excellent work. They were asking solid questions and they were doing the math. That's fabulous, right? And I think that we are, it gives us the opportunity to, you know, to bring back the joy, to have fun with it. - Would you all believe me when if I told you I did dress up like a pirate once and when I was a teacher and did teach math that way. So now you can dress up a pirate and have math pirate problems. Sometimes you gotta do what you gotta do to keep students engaged, which I do just want, we're about rounding out the time, our time together. So I'd love to hear from y'all. What is your favorite math engagement technique and tool and how do you think it could be enhanced using the Conmigo tools? What's your favorite go-to, get your teacher hat back on. Let's dig deep y'all, what do you think? Oh, you're smiling Iman, I think you wanna go first. - All right, wait one more time. Danielle, go back with the question one more time. - What's your favorite engagement? What was your favorite engagement go-to in math with students? And how might AI help enhance that? - So it's funny 'cause this was probably the hardest thing I had to do, but the most important thing, and that was my lesson hooks, how can I make polynomials exciting? How can I make this photos set? This is something that kids relate to. And so I would oftentimes spend so much time about how am I gonna intro this lesson just to get the kids going with me. And one of the first features that we released with Conmigo was that was the lesson hooks. And so it was really nice to just really quickly grab something that I knew my students would like. I had a year when I was teaching in Philly where my kids were obsessed with the Philadelphia Eagles and being able to tie that into math instruction, it's a game changer. - Yeah. Dina, go. - My favorite was teaching initial parabolas and velocity using Galileo's work and being able to launch. We launched tennis balls, we launched water rockets, we did all sorts of stuff out in the field. I would've loved having either like Ignite My Curiosity or something so that they could dig deep into the history because I think the history is fascinating. Learning all about the mathematicians that gave us these great theorems and ideas that we use today. I think it could have just made that even more rich to learn different stories. And rather than me telling them a story, I still could tell the story, but they could tell the stories. What did you learn? What did you see? What do you think is interesting about this person? Now let's go get soaked and launch water rockets out on the field. - That's great. Stacie, what about you? - Well, we're getting specific here. So I had to dig deep for this one. I was a middle school math and science teacher. I taught both. And so my favorite thing was always to show students how math exists in the real world, not in isolation. And so my favorite way that I ever figured out to do that was teaching functions along with waves, sound waves, water waves, light waves, right? And looking at waves as functions and having students really do some deep analysis there. And it results in kids having this really thorough understanding not only of the science, but of the mathematics, that that really is inherent in that scientific understanding and theory. AI could have helped me a lot because it took me like years to get that unit and that set of instruction right. And I think having something that I could, you know, just brainstorm with that would keep me from flipping through all the books and all the web pages, but can just curate information faster so that I could make those real world connections of exactly how does math apply to the real world would've really been a game changer for me and allowed me to do much more of that with my students. - Exactly. And I'm gonna, Cynthia just typed in the chat, I know y'all can't see it, but Cynthia, I agree with you asking AI students how they feel about the greater topic and how they feel about what they just learned and helping them connect a little deeper. So my favorite strategy when I was a teacher, I was a fifth and sixth grade special education teacher, and I came to mathematics kicking and screaming because I had math trauma myself. So I approached it definitely as a creative piece as a teacher. And I would have make raps about things and literally dress up like a rap leprechaun and teach in an Irish accent. I did anything that I could to keep students engaged. And what I've found using tools that Khanmigo's offering, there is a poem tool that you actually can, teachers can summarize a lesson in poetry, students can summarize lessons using poems. And I think that is a really cool literacy connection and just empowering students to think about mathematics as that creative art form. Like y'all talking about linear equations and polynomials and I see little polynomials dressed up in hats and, you know, it just, it really appeals to bringing mathematics to life. So we are, it is a Friday. Y'all have been wonderful. We're so happy that you are here joining us. We have posted links in the chat and for signing up, you are going to get a copy of the recording as well as a plethora. Yes, I use some mathematical terms. Is that a mathematical term? I hope it is, a plethora. It's also just a big word of resources. There is a YouTube playlist where you can see exactly what we're talking about. We wanted to keep y'all focused on us and the conversation instead of seeing someone's screen trying something different here. So you're gonna get all the resources if you wanna learn more, you can also check out, there's a couple links that we put in the chat, but we'll be giving you all this information in an email with the recording. So in conclusion, what's one last thought you'd love to leave thinking about the intersection of mathematics and AI? Final thoughts, y'all? - I think I would just say that there's a lot to learn and we all have a lot to learn about what it looks like to bring AI into the classroom. But for right now, I, you know, as much as we could just dip a toe into the water and try one thing and learn alongside our students, to me, this is about empowerment. This is about making our teachers' lives better, giving them more time back with their students or their families. Like in the evenings when I used to be at school all the time, like just trying one thing and being willing to take that risk and to learn something alongside of our students, I think is, is really the challenge in front of all of us. - Thank you. Iman, what do you think? Final thoughts? - My final thoughts is that every person's a math person and having a tool like Khanmigo gives you the power to see just that no matter where you are, if you're below grade level, if you're at grade level or maybe you're a couple of grade levels ahead, there's an opportunity for you to stay engaged, to have a discourse and to be creative. - And Dina? - I would say, I think that, you know, we have been, we have been struggling with mathematics becoming so much more procedural, so much more rote, and we see our students decreased engagement as a result of that. They don't see the application of math, they don't see how it impacts their lives. And I think this is our moment. I agree with Stacie wholeheartedly. We're all learning, we're all figuring this out together. But join us. Come figure this out with us. Come have conversations with us, let's talk about it because we wanna talk about it because we want our kids to see the math that we all love. And I think this is our chance to get it back. ♪ Bringing happy back in our math classes ♪ ♪ That's a fact ♪ That's my final note, literally on a note, thank you so much for joining us. We appreciate you. We appreciate the conversation. We are gonna figure out a way to export this chat and send that to you. Please share this with your friends, please like Dina said, join us. We're gonna have more of these conversations. Tell us what you liked, what you didn't like. We're always open to feedback. We're learning too. We're educators, y'all. And we love talking to educators because you are so forgiving with all the things. So thank you for joining us. We appreciate you and until we see you again, bye everybody. - [Narrator] Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen and to never miss exciting announcements about new free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو سب، آپ سے مل کر خوشی ہوئی۔ میرا نام ڈینیئل سلیوان ہے اور میں آج اپنے حیرت انگیز ساتھیوں کے ساتھ ریاضی کی اس بہترین گفتگو کا سہولت کار بننے پر بہت پرجوش ہوں۔ آج ہم\nریاضی کی ہدایات کے بارے میں بات کرنا چاہتے ہیں، یہ کیسے بدلا ہے،\nوبائی مرض کے بعد سے کیسے بدلا ہے، اور AI کس طرح نئے مواقع لا سکتا ہے اس بات کو\nیقینی بنانے کے لیے کہ ہم تنقیدی سوچ، تصوراتی تفہیم اور گفتگو کو ایمانداری سے اپنے ریاضی کے کلاس رومز میں واپس لا رہے ہیں۔ ہم جانتے ہیں کہ آپ کو بہت سے\nمختلف قسم کے چیلنجز کا سامنا ہے اور امید ہے کہ یہ\nگفتگو آپ کو جہاں آپ ہیں وہاں سے ملنے اور\nاپنے طلباء کو آگے بڑھانے میں مدد کرے گی۔ تو اب میں\nپینل کو اپنا تعارف کروانے جا رہا ہوں۔ آئیے آگے بڑھیں اور دینا کے ساتھ شروع کریں۔ - سب کو ہیلو، میں ڈینا نیمان ہوں۔ میں یہاں خان اکیڈمی میں اپنی ضلعی کامیابی کی ٹیم کی قیادت کرتا ہوں۔\n لیکن سب سے اہم بات یہ ہے کہ میں\n ایک بہت، بہت طویل عرصے سے، 25 سال سے ریاضی کا معلم ہوں، اصل میں\nمڈل اسکول کی ریاضی سے شروع ہو رہا ہوں۔ اور میں اپنے مڈل اسکول سے محبت کرتا ہوں، لیکن میں نے سب کچھ تھوڑا سا سکھایا ہے۔\n میں اسے ایمان تک پہنچا دوں گا۔ - شکریہ دینا۔ سب کو ہیلو، میرا نام ایمان ہاورڈ ہے۔ میں یہاں خان اکیڈمی میں ہمارے تمام STEM مواد کا گروپ مینیجر ہوں۔ میں زندگی بھر سیکھنے والا اور\nریاضی اور سائنس کا معلم ہوں، اور میں\nآج سب کے ساتھ بات چیت کرنے کے لیے بہت پرجوش ہوں۔ میں اسے سٹیسی کے حوالے کر دوں گا۔ - سب کو ہیلو، میرا نام سٹیسی جانسن ہے اور دینا کی طرح، میں بھی\nریاضی میں زندگی بھر معلم رہا ہوں اور ایمان کی طرح ریاضی اور سائنس، مڈل اسکول، ہائی اسکول اور ایلیمنٹری میں، میں اپنی\nپیشہ ورانہ سیکھنے والی ٹیم کی قیادت کرتا ہوں۔ آج یہاں آپ کے ساتھ ریاضی کی تعلیم اور ہم بچوں تک کیسے پہنچ رہے ہیں کے بارے میں بات کرنے کے لیے بہت پرجوش ہوں۔ - بہت اچھا، اور میں اپنے پس منظر کے بارے میں بھی بات کرنا بالکل بھول گیا۔ تو میں میزبان ہوں اور ہاں، یہ نہ صرف\nمیرا لفظی پس منظر ہے، ہاں، میں دراصل ایریزونا میں میری بہن ہوں، لیکن میں شمال مشرق کی حمایت کرتا ہوں۔ تو میں ایریزونا کا دورہ کر رہا ہوں،\nجو کہ ایک طرح کا دلچسپ ہے۔ اور میں تاحیات معلم ہوں اور میں نے خصوصی\nتعلیم اور ریاضی بھی پانچویں اور چھٹی جماعت میں پڑھائی، دونوں\nواشنگٹن ڈی سی اور نیو یارک کے اوپری حصے میں۔ تو پہلا سوال یہ ہے کہ ہم سب کو لات مارنے کے لیے، خان اکیڈمی کا\nریاضی کی تعلیم کے لیے کیا طریقہ کار ہے اور\nAI کے اس دور میں یہ کیسے بدل رہا ہے؟ اور ایمان، میں چاہتا ہوں کہ تم\nآگے بڑھو اور ہمیں لات مارو۔ - بہت اچھا، آپ کا بہت شکریہ. لہذا جب ہم\nریاضی کے لیے مواد تیار کر رہے ہوتے ہیں، تو ہم اس کے بارے میں\nسختی کے پہلوؤں کے ساتھ سوچتے ہیں۔ تو یہ واقعی\nاسے تین طریقوں سے توڑ رہا ہے۔ سب سے پہلے، ہم طریقہ کار کی روانی کے بارے میں سوچتے ہیں۔ تو کیا آپ\nرفتار اور درستگی کے ساتھ حساب لگا سکتے ہیں؟ اور پھر ہم تصوراتی تفہیم میں آجاتے ہیں۔\n تو کیا آپ\n ریاضی کو دیکھنے کے لیے متعدد زاویوں سے تصورات تک رسائی حاصل کر سکتے ہیں، جیسا کہ آپ جانتے ہیں،\nبس، آپ جانتے ہیں، معاف کیجئے گا، کم عقلمند\nاور زیادہ کم طریقہ کار۔ اور پھر آخر کار ہم\nدرخواست کے ساتھ اس کے بارے میں سوچتے ہیں۔ تو کیا آپ طریقہ کار اور تصورات کو لچکدار طریقے سے استعمال کر سکتے ہیں اور مسئلہ حل کر سکتے ہیں؟ اور آپ جانتے ہیں، کسی بھی\nمعیار میں ان پہلوؤں کا ایک یا مجموعہ ہو سکتا ہے۔ اور بعض اوقات یہ\nبہت محدود محسوس ہوتا ہے جب ہم مواد تیار کر رہے ہوتے ہیں۔ اور اس لیے جب\nAI کی بات آتی ہے، تو ان چیزوں میں سے ایک جو مجھے واقعی پرجوش کرتی ہے وہ ہے\nمزید تصوراتی تفہیم کو کھودنے کا موقع،\nجو گفتگو کے ساتھ آتا ہے۔ اور اس لیے صرف ایک طالب علم کے بجائے\n، آپ جانتے ہیں، صحیح یا غلط، تصوراتی\nتفہیم آتی ہے اور ہم یہ اندازہ لگا سکتے ہیں کہ\nریاضی واقعی انفرادی طور پر اس طرح کیوں ہو رہا ہے۔ - تو دینا، چلو اس میں اضافہ کرتے ہیں۔ آپ کے کیا خیالات ہیں؟ - آپ جانتے ہیں، میرے خیال میں\nگفتگو واقعی ان سب سے بڑے ٹکڑوں میں سے ایک ہے جسے AI ریاضی کی ہدایات میں لاتا ہے اور شامل کرتا ہے۔ ایک کلاس روم ٹیچر کے طور پر، میں ہمیشہ، میرے طلباء نے ہمیشہ گروپوں میں کام کیا۔ میرا کلاس روم کبھی پرسکون نہیں تھا۔ ہم\nریاضی اور پروجیکٹس کے بارے میں ہمیشہ اونچی آواز میں چہچہاتے اور\nہماری سوچ پر سوال اٹھاتے اور اپنے استدلال کی وضاحت کرتے۔ اور مجھے لگتا ہے کہ، آپ\nجانتے ہیں، عام طور پر، کلاس رومز میں بہت سے تکنیکی اثرات نے\n ریاضی کی ہدایات کو\nمزید طریقہ کار بننے پر مجبور کیا ہے۔ کیا آپ جانتے ہیں، کیا\nآپ یہ حساب کر سکتے ہیں؟  کیا آپ اس مساوات کو حل کر سکتے ہیں؟  کیا آپ\nایک خاص ترتیب میں اقدامات کر سکتے ہیں؟ یہاں تک کہ ضروری نہیں، جیسے،\nاختیارات موجود ہیں، ٹھیک ہے؟  ریاضی کا صحیح جواب \nحاصل کرنے کے لیے ہم مختلف راستے اختیار کر سکتے ہیں۔ اور طلباء کے پاس اکثر بہت اچھی وجہ ہوتی ہے اور وہ چیزوں کے بارے میں مختلف سوچتے ہیں۔ اور یہ ہمارے تمام استدلال اور ہمارے تمام ریاضی\nٹول کٹس میں اضافہ کرتا ہے جب ہم یہ سن سکتے ہیں کہ بچے ریاضی کے بارے میں کس طرح سوچ رہے ہیں اور جس طرح سے وہ\nاپنا اگلا مرحلہ یا اپنی حکمت عملی کے ساتھ آ رہے ہیں یا وہ کسی\nمسئلے سے کسی خاص طریقے سے کیوں رجوع کرتے ہیں۔ اور میں سوچتا ہوں کہ AI کے ساتھ، جب\nطلباء کو سوالات پوچھنے ہوتے ہیں، جب انہیں یہ کہنے کے قابل ہونا ہوتا ہے، میں مساوات کے اس ٹکڑے کو نہیں سمجھتا،\nایسا نہیں ہے، میں\nپورے تصور کو نہیں سمجھتا، یہ ہے، میں نہیں سمجھتا  یہ سمجھ میں نہیں آتا کہ\nاس مرحلے سے اگلے مرحلے تک کیسے جانا ہے، یا انہیں مزید تنقیدی طور پر سوچنا ہوگا۔ اور یہ واقعی اس تصوراتی علم کی تعمیر کرتا ہے۔\n لیکن یہ سوال میرے خیال میں\nاس کا واقعی ایک بڑا حصہ ہے۔ - تو اسٹیسی، ہم خان اکیڈمی میں کیسے ہیں، اساتذہ کو اس\nسب کے گرد اپنا سر سمیٹنے میں مدد کر رہے ہیں؟ - ہاں، میرا مطلب ہے، میں سوچتا ہوں کہ میں اس کے بارے میں سوچنے سے پہلے ہی سوچتا ہوں کہ ہم اس کے\nگرد کس طرح اپنا سر لپیٹ رہے ہیں، جیسا کہ میں گفتگو اور تصوراتی تفہیم کے بارے میں سوچتا ہوں، خان اکیڈمی کے ساتھ جس\nچیز پر مجھے سب سے زیادہ فخر ہے وہ ہے\n جہاں طلباء  ایسا کرنا ہم کیا بات کر رہے ہیں؟ ہم کس چیز\nمیں تصوراتی تفہیم کی تعمیر کر رہے ہیں؟ اور حقیقت یہ ہے کہ\nخان اکیڈمی میں، ہمیں یقین ہے، ہم جانتے ہیں کہ ہر طالب علم\nگریڈ لیول پر حاصل کر سکتا ہے۔ اور میں سمجھتا ہوں کہ\nیہاں جو کہنا واقعی اہم ہے وہ یہ ہے کہ ہمارے تمام طلباء کے سیکھنے میں خلاء ہے۔  یہ سب\nان سوراخوں کے ساتھ اندر آ رہے ہیں، ٹھیک ہے؟ یہ ریاضی کے بارے میں سوئس\nپنیر کی اس طرح کی سمجھ ہے اور جس طرح سے ہم واقعی ایک ایسا\nعمل تیار کرتے ہیں جس پر توجہ مرکوز کرتے ہوئے بچوں کو\nاگلے سال گریڈ لیول سے نیچے کام کرنے پر توجہ دی جائے تاکہ ہم صرف اس فرق کو برقرار رکھ سکیں۔ لیکن انہیں گریڈ لیول پر رکھنا، یہ جاننا اور یقین کرنا کہ\nوہ AI کا استعمال کرتے ہوئے اس میں سے کچھ کو حاصل کر سکتے ہیں۔ کیونکہ بلاشبہ،\nاستاد بہترین ذریعہ ہے، بلاشبہ، استاد وہ ہے\nجہاں ہمیں جھکنا چاہیے اور طلبہ کو ہمیشہ\nاستاد کے پاس جانا چاہیے، لیکن استاد\n35 بچوں سے ایک ساتھ یا زیادہ بات نہیں کر سکتا، ٹھیک ہے؟ لہذا جب ہم استاد کا انتظار کر رہے ہیں، AI بچوں کی مدد کے لیے وہاں موجود ہو سکتا ہے\nتاکہ وہ پھنس نہ جائیں، وہ مایوسی کے مقام پر نہ پہنچیں اور اپنے\nہاتھ اوپر پھینک کر چھوڑ دیں، ٹھیک ہے؟ کیونکہ جو کچھ کر رہا ہے وہ\nان سیکھنے کے خلا کو برقرار رکھتا ہے اور سوراخوں کو بڑا بنا رہا ہے۔ تو میں سمجھتا ہوں کہ\nیہاں کہنے کی سب سے اہم بات یہ ہے کہ ہم طلباء کو گریڈ کی سطح پر کیسے رکھ رہے ہیں اور ہم یہ کیسے یقینی بنا رہے ہیں کہ وہیں سے\nوہ سیکھ رہے ہیں اور وہ\nوہاں سے آگے بڑھ رہے ہیں، ہم بیک وقت واپس جا کر کچھ بھر سکتے ہیں۔  ان سوراخوں میں سے\nجب کہ ہم طلباء کے ساتھ گریڈ کی سطح پر کام کرتے رہتے ہیں۔ اور جہاں تک ہم\nوہاں اساتذہ کو کیسے حاصل کر رہے ہیں، میرے خیال میں یہ ایک مرحلہ وار عمل ہے، ٹھیک ہے؟ ہمارے اساتذہ کے پاس\n ہر وقت کرنے کے لیے بہت زیادہ پلیٹیں ہوتی ہیں، بہت\nسارے انتظامی کام ہوتے ہیں، بہت ساری چیزیں جن کا اصل میں بچوں کو پڑھانے سے کوئی تعلق نہیں ہوتا ہے۔ تو سوال یہ ہے کہ\nہم اساتذہ کو کس طرح سن رہے ہیں کہ انہیں کس تربیت کی ضرورت ہے؟ ہم اس بارے میں معلومات کیسے جمع کر رہے ہیں کہ انہیں کس مدد کی ضرورت ہے؟ اور پھر\nاس کے جواب میں تربیتی پروگراموں کو ڈیزائن کرنا، بجائے اس کے کہ\nان کو مدد اور تربیت کا ایک سیٹ لایا جائے اور\nاس سے فرق پڑے گا۔ - بالکل اور ہر کوئی، آپ چیٹ میں سوالات پوسٹ کر سکتے ہیں۔\n ہمارے پاس کچھ رہنمائی والے سوالات ہیں\nجن کی ہم نے وقت سے پہلے منصوبہ بندی کی تھی، لیکن میں یقینی طور پر اس بات کو یقینی بنانا چاہتا ہوں کہ ہمارے پاس\nآپ کے سوالات کے جواب دینے کی صلاحیت ہے۔ اور میں پسند کروں گا کہ\nآپ سب بات کرنا شروع کریں اور چیٹ میں بھی جواب دیں اگر یہ آپ کے لیے بہت زیادہ ہے۔ آپ صرف دکھانا اور سننا چاہتے ہیں، بہت اچھا۔ اگر آپ بات چیت کرنا چاہتے ہیں تو، بہت اچھا. جیسے،\nآج ہونے کے بہت سے مختلف طریقے ہیں، لیکن میں متجسس ہوں گا، جیسے میتھیو نے ابھی\nذاتی نوعیت کی تعلیم میں ٹائپ کیا ہے۔ جیسے آپ سب کیا سوچ رہے ہیں؟ جیسا کہ آپ نے سنا، ڈینا، ایمان اور سٹیسی آپ کو کچھ چیلنجز کا سامنا ہے، آپ جانتے ہیں۔ تو آپ اس کے بارے میں سوچتے ہیں، اور ہم واقعی\nاس میں تھوڑا سا مزید جاننا شروع کر دیں گے، ٹھیک ہے؟ ریاضی کی طرح عام طور پر\nایک بہت ہی ٹھوس اور معروضی مضمون کے بارے میں سوچا جاتا ہے۔ اور جتنا ہم اس کے بارے میں بات کرتے ہیں، بعض اوقات ہم عمل اور نقطہ نظر پر زیادہ توجہ نہیں دیتے، اور بعض اوقات یہ صحیح اور غلط ہوتا ہے۔  کیا AI میں\nاس پر اثر انداز ہونے کی صلاحیت ہے؟ ایمان، آپ کے کیا خیالات ہیں؟ - بالکل آپ جانتے ہیں، ہمارا بہت سے\nنصاب بعض اوقات اس طریقہ کار کی روانی پر توجہ مرکوز کرتا ہے۔ اور اس لیے جب آپ\nکلاس روم میں ہوتے ہیں تو آپ اس پر عمل کرتے ہیں، آپ ایک طالب علم سے سوال پوچھتے ہیں، وہ صحیح جواب نہیں دے پاتے۔ اور اب اچانک\nہم بچے کہہ رہے ہیں، میں ریاضی کا آدمی نہیں ہوں، میں نے اسے غلط سمجھا۔ اور پھر بات چیت ختم ہو جاتی ہے اور شاید وہ\nدوبارہ ہاتھ نہیں اٹھاتے۔ تاہم، جب ہم\nConmigo اور AI جیسی کوئی چیز متعارف کراتے ہیں ، نہ صرف یہ کہ اگر میں نے اسے\nغلط سمجھا ہو، یہ بند نہیں ہے، اب یہ کہنے کا موقع ہے، اچھا، چلو بات چیت کرتے ہیں۔ آئیے معلوم کریں کہ ایسا کیوں ہوا۔ اور اب ہم\nاس تصوراتی سمجھ میں آ رہے ہیں۔ اور آپ جانتے ہیں،\nچیٹ میں کسی نے ذاتی نوعیت کی تعلیم کا ذکر کیا۔ ہم ذاتی نوعیت کی تعلیم حاصل کرنے جا رہے ہیں۔ ہم میں سے بہت سے ایسے\nکلاس رومز میں رہے ہیں جہاں یہ تناسب ایک سے 35 تھا، اور ہمارے پاس کچھ طلباء ایسے ہیں جو\nگریڈ لیول پر ہیں، کچھ دو سال پیچھے\nاور کچھ دو سال آگے۔ اور اس لیے اب ہمارے پاس یہ موقع ہے کہ ہر ایک سے ان کے سیکھنے کے کنارے پر ملیں۔ صحیح یا غلط، ہمارے پاس آپ کی ہدایات کو ذاتی نوعیت کا بنانے اور آپ کو اس سطح تک پہنچانے کا ایک طریقہ ہے\nجس سے ہم جانتے ہیں کہ آپ مل سکتے ہیں، جو کہ گریڈ کی سطح ہے۔ - آگے بڑھو، دینا۔ - آپ جانتے ہیں، یہ ذاتی نوعیت کی تعلیم ہے، لیکن مجھے لگتا ہے کہ\n \nثانوی اساتذہ کے لیے چھوٹے گروپ کی تعلیم کو حقیقت بنانے کے لیے ہمیشہ سے یہی خواہش اور مقصد رہا ہے۔ اور یہ ناممکن محسوس ہوتا ہے۔ اور یہ بہت مشکل محسوس ہوا کیونکہ آپ بالکل درست ہیں۔ آپ کے کلاس روم میں 36 لاشیں ہیں اور آپ تین یا چار جیسے اس چھوٹے گروپ کے ساتھ کام کرنا چاہتے ہیں\n جس پر توجہ کی ضرورت ہے۔ لیکن کیا ہوتا ہے جب آپ بیٹھتے ہیں، وہ سب ہاتھ اوپر جاتے ہیں، مجھے آپ کی ضرورت ہے، مجھے آپ کی ضرورت ہے، میرے پاس ایک سوال ہے۔ مجھے نہیں معلوم کہ آگے کیا کرنا ہے۔ اور مجھے لگتا ہے کہ اس چھوٹے گروپ کا وقت، اصل میں لن نے چیٹ میں پڑھانے میں لچک پر تبصرہ کیا۔ اور میں سمجھتا ہوں کہ AI ہمیں ایسے\nکام کرنے کا موقع فراہم کرتا ہے جو پہلے بہت\nپیچیدہ اور بہت مشکل تھے۔ میں سمجھتا ہوں کہ ہم اس\nچھوٹے گروپ کی ہدایات کر سکتے ہیں کیونکہ AI بات چیت کر سکتا ہے اور، آپ جانتے ہیں، طلباء کو\nان کی تعلیم میں ترقی کرتے رہیں اور انہیں آگے بڑھتے رہیں۔ اور مجھے لگتا ہے کہ یہ\nہمارے بچوں کو استاد کے ساتھ اس طرح زیادہ وقت دیتا ہے \nجس طرح انہیں واقعی ضرورت ہوتی ہے۔  ایک ساتھ کھڑے ہوکر پورے کلاس روم میں پہنچانے جیسے استاد کم ہیں، \n لیکن زیادہ استاد\nان ضروریات کو صحیح طریقے سے پورا کرنے کے قابل ہیں جہاں وہ ہیں، اور\nواقعی طلباء کو ہدایات، وضاحت اور رہنمائی فراہم کرتے ہیں کہ\nوہ کہاں اور کیسے  اس کی ضرورت ہے - ہاں. تو دینا، یہ مجھے \nکلاس روم میں رہنے کے اپنے پسندیدہ حصے کی طرح سوچنے پر مجبور کرتا ہے۔ مجھے نہیں معلوم کہ کیا آپ سب نے دیکھا ہے، جیسے کہ کچھ سال پہلے یہ یوٹیوب ویڈیو چل رہی تھی جسے \nمیرا پسندیدہ نہیں کہا جاتا تھا، ٹھیک ہے؟ اور یہ اس بات کو دیکھنے کے بارے میں تھا کہ طالب علموں نے کسی مسئلے کو کیسے حل کیا ہے اور غلط جوابات تلاش کیے ہیں،\nلیکن ان غلط جوابات میں خوبصورتی اور درستگی تلاش کرنا ہے۔ اور ریاضی پڑھانے کا میرا پسندیدہ حصہ\n طالب علموں کو اس طرح بیان کرتے ہوئے سن رہا تھا کہ وہ کسی مسئلے سے رجوع کرتے ہیں یا وہ\nاس کے بارے میں کیسے سوچ رہے ہیں، ٹھیک ہے؟ ان کے ساتھیوں کے لیے، میرے لیے،\nان چھوٹے گروپ سیٹنگز میں، اور یہ سب سے مشکل چیزوں میں سے ایک ہے۔ آپ\nتمام بچوں کو سننے کے لیے وہاں کیسے ہو سکتے ہیں؟  وہ جو سوچ رہے ہیں اسے اندرونی بنانے کے لیے آپ واقعی وہاں کیسے ہو سکتے ہیں ؟ کیونکہ ریاضی کے اساتذہ کے طور پر، غلط جواب میں پڑھانا مشکل ہے۔ جی ہاں  ہم یقینی طور پر\nایک غلط فہمی میں سکھا سکتے ہیں، ٹھیک ہے؟ لہذا جب میں AI کے بارے میں سوچتا ہوں، تو ان\nچیزوں میں سے ایک جو میری خواہش ہے کہ میں اپنے کلاس روم میں ہوتا وہ یہ تھی کہ میں\n واپس جا کر ٹرانسکرپٹس یا گفتگو کو دیکھ سکتا ہوں\nجو ایک طالب علم چیٹ بوٹ کے ساتھ کر رہا ہے تاکہ یہ شناخت کیا جا سکے کہ وہ کیسے پروسیس کر رہے ہیں۔  یہ معلومات؟ کیا وہ پھنس گئے ہیں؟ اور وہ صرف یہ کہہ رہے ہیں، میں\nنہیں جانتا، میں نہیں جانتا۔ یا وہ واقعی اس پر کارروائی کرنے کی کوشش کر رہے ہیں؟ اور وہ کس قسم کے\nسوالات پوچھ رہے ہیں؟ کیونکہ میرے نزدیک، اگر میں\nاس معلومات کو بروئے کار لا سکتا ہوں، اگر میں اسے اپنی پوری کلاس سے حاصل کر سکتا ہوں،\nجو میں اب ہر کسی کی بات سن کر گھوم پھر کر نہیں کر سکتا، تو وہ\n میری کلاس کی غلط فہمیوں کو دور کر سکتا ہے اور واقعی اس کا فائدہ اٹھا سکتا ہے کہ\nوہ کیا ہیں۔  اس پر تعمیر کرنا جانتے ہیں جو وہ ابھی تک نہیں جانتے ہیں۔ - تو جو کچھ آپ نے ابھی کہا ہے اس پر پل باندھنے کے لیے اور ایک ساتھ آنے والے\nکچھ سوالات کے جوابات دینے کے لیے، ایک جوڑے نے خانمیگو کے بارے میں پوچھا ہے، کیا یہ صرف طلبہ کو جواب دیتا ہے؟ یا اگر طالب علم واقعی ہیں،\nجیسے، یہ ون آن ون ٹیوٹر ہے، لیکن اگر طالب علم\nواقعی غیر متحرک ہیں، تو خانمیگو اس استاد کے طور پر کیسے کام کر رہا ہے جب استاد\n 35 طریقوں سے اس کا کلون نہیں بنا سکتا؟ ٹھیک ہے؟ اور آپ کتنے لوگ محسوس کرتے ہیں\nکہ آپ کے پاس ریاضی پڑھانے کے لیے کافی وقت نہیں ہے؟ کوئی؟  کمرے میں کوئی ہے؟ بالکل۔  ہاں۔ تو ایمان، کیا آپ\nاس کے بارے میں بات کرنا چاہتے ہیں؟ - جی ہاں، بالکل. لہذا، آپ جانتے ہیں، ایک اچھا استاد کیا\nکرے گا جب کسی طالب علم کو غلط جواب ملتا ہے، ہم\nاسے صرف صحیح جواب نہیں تھوکتے اور وہاں سے چلے جاتے ہیں۔ ہم ان سے سوالوں کا ایک سلسلہ پوچھتے ہیں جو \nجواب انہوں نے ہمیں دیا تھا۔ اور یہ وہ جگہ ہے جہاں آپ\nدیکھتے ہیں کہ کونمیگو اور طلباء کے درمیان مکالمہ ہوتا ہے، ارے، یہ بالکل ٹھیک نہیں ہے۔ آئیے اس بارے میں بات کرتے ہیں کہ آپ نے\nاس اعشاریہ کو کہاں غلط جگہ دی۔ آئیے نیچے چلتے ہیں اور آپ کو صحیح جواب تک پہنچانے کے لیے آگے پیچھے مل کر کام کرتے ہیں۔ اور اب جب کہ آپ کو مل گیا،\nمیں آپ کو ایک اور دیتا ہوں جسے آپ خود آزما سکتے ہیں۔ ٹھیک ہے، جیسا کہ آپ\nکریں گے، میں Conmigo کے بارے میں بطور ٹیچنگ اسسٹنٹ سوچتا ہوں، ٹھیک ہے؟ اور اس لیے جب میں\nیہاں سہولت فراہم کرنے کے قابل ہوں، یہ ایک چھوٹا گروپ ہے، میں جانتا ہوں کہ یہاں پر میرے طلبہ مصروف نہیں ہیں۔ اور جب کلاس روم کے انتظام کی بات آتی ہے تو مجھے اپنے طلباء کی مصروفیت کی ضرورت ہوتی ہے۔ - اور ہاں۔\n- کیا میں اٹھا سکتا ہوں، سنتھیا، ایک سوال ڈالیں، اور مجھے لگتا ہے کہ یہ اس پر استوار ہے،\nاس نے کہا کہ اس نے پایا ہے کہ AI مددگار ہے، لیکن\nطلباء ہمیشہ حوصلہ افزائی یا یقین نہیں رکھتے کہ وسائل کو کیسے استعمال کیا جائے۔ اور اس نے پوچھا، کیا\nانسٹرکٹرز کو طالب علموں کو AI وسائل کو استعمال کرنے کا طریقہ سکھانا چاہیے، بشمول ان کا استعمال کرتے ہوئے تدریسی مشقیں؟ اور میں بالکل سوچتا ہوں، بالکل\nکسی بھی ٹول کی طرح، بالکل اسی طرح جیسے گرافنگ کیلکولیٹر کے ساتھ،\nآپ جانتے ہیں، جس طرح سے ہم اپنے کلاس روم میں معمولات سکھاتے ہیں،\nمیں بالکل سوچتا ہوں کہ ہمیں اپنے طلباء کو یہ سکھانے کی ضرورت ہے کہ\nAI کا استعمال کیسے کریں، کیا  بہترین عمل ہیں. میرے خیال میں اس کی شروعات ماڈلنگ سے ہوتی ہے۔ اگر یہ میرا کلاس روم ہوتا، تو میں\nاسے کھینچ کر اور خود چیٹ کرنے سے شروع کرتا، سوالات پوچھتا اور آپ جانتے ہیں،\nطلباء کو دکھاتا کہ یہ کیسا لگتا ہے۔ اور میں جانتا ہوں کہ ہم نے ابھی\nریلیز کیا ہے، اوہ نیکی، ایمان، آپ شاید یہ بھی کہہ سکتے ہیں، مجھے لگتا ہے کہ یہ\nپچھلے دو ہفتوں کی طرح تھا۔ ہم نے طلباء کے کورس کے لیے اپنا AI جاری کیا۔  کیا یہ صحیح ہے؟ - ہم نے یقینی طور پر کیا. اور مجھے لگتا ہے کہ یہ ایک اچھی کال ہے کیونکہ آپ جانتے ہیں، ہم\nیہ اصطلاح AI، AI سنتے ہیں، اور اپنے طلباء کو یہ بتانا بہت ضروری ہے کہ زبان کا ایک بڑا ماڈل کیا ہے؟ یہ کیا چیز ہے جو بات چیت کر رہی ہے؟ کیا یہ تمام\nجوابات جانتا ہے؟  یہ کیا کرسکتا ہے؟ یہ کیا نہیں کر سکتا؟ اور اس لیے ہمارے پاس ایک\nکورس ہے، AI فار ایجوکیشن، جسے آپ سب اس بات کو یقینی بنانے کے لیے چیک کر سکتے ہیں کہ ہم جانتے ہیں کہ اسے اپنے سیکھنے کو بڑھانے کے لیے ایک ٹول کے طور پر کیسے استعمال کرنا ہے، \nکیونکہ یہ وہی ہے۔ - بالکل اور ٹولز اور سیکھنے کی بات کرتے ہوئے،\nہم سیکھ رہے ہیں کہ ہم نے\nاس ویبینار کو سب سے زیادہ انٹرایکٹو طریقے سے ترتیب نہیں دیا۔ تو آپ سب ہم اپنی پوری کوشش کر رہے ہیں۔ ای آپ کے سوالات دیکھیں،\nہم آپ کے تبصرے دیکھتے ہیں، لہذا ہم اس بات کو\nیقینی بناتے رہیں گے کہ ہم ہر چیز کا جواب دیں۔ اور یہ ایک سیکھنے کا تجربہ ہے۔ لہذا میں نہیں جانتا کہ آپ\nایک دوسرے کے جوابات دیکھ سکتے ہیں، لیکن ہم\nبات چیت کو جاری رکھیں گے۔ آپ ہم سے بات کرتے رہیں، ہم\nلائیں گے، چیزیں اجاگر کریں گے۔ تو سٹیسی،\n ایمان اور دینا نے کن چیزوں کے بارے میں آپ کا کیا خیال ہے؟ - ہاں، میں اس سب سے متفق ہوں۔ \nطالب علموں کو پسند کرنا سکھانے کے بارے میں چیٹ میں ایک تبصرہ تھا، آپ واقعی میں کیسے کھوجتے ہیں، آپ اصل میں\nطالب علموں کو بہتر سوالات پوچھنے کی تربیت کیسے دیتے ہیں؟ اور میں سمجھتا ہوں کہ یہ\nہمارے لیے بحیثیت بڑوں، کمرے میں قائدین کے\nساتھ ساتھ طلبہ کے لیے بھی ایک سوال ہے۔ اور میں سمجھتا ہوں کہ\nاونچی آواز میں کہنا ضروری ہے، ہم سب کے سیکھنے کے جذبے میں\nکہ اساتذہ اور طلباء\nایک دوسرے کے ساتھ مل کر سیکھ رہے ہیں کہ اس نئی ٹیکنالوجی کو کیسے کام کرنا ہے، ٹھیک ہے؟ اور ہمارے لیے اس ذہنیت کو بدلنا ہے اور یہ کہ یہ سرچ انجن نہیں ہے۔ تو ایک چیز جو ہم نے\nواقعی کامیاب ہوتی دیکھی ہے وہ دراصل کسی\nدوسرے شخص سے سوال پوچھنے کی مشق کرنا ہے اس سے پہلے کہ آپ اسے کونمیگو\nیا چیٹ بوٹ میں ڈالیں، ٹھیک ہے؟ کیونکہ لوگ سوچتے ہیں، اور خاص طور پر طلباء،\nوہ سوچتے ہیں، اوہ، مجھے یہ کہنے کا ایک خاص طریقہ ہے،\nٹھیک ہے؟ ہم اشارہ کرنے کے بارے میں بہت کچھ سنتے ہیں یا یہ خاص\nزبان ہے جو مجھے استعمال کرنی ہے۔ اور واقعی یہ بات چیت ہے۔ تو جب، ایک استاد کے طور پر،\nاگر آپ طالب علم سے کچھ کہتے ہیں، جیسے، اچھا،\nاچھا، آپ اپنے ساتھ والے بچے کو کیا کہیں گے، ٹھیک ہے؟ یا آپ مجھے کیا کہیں گے؟ ٹھیک ہے، اب صرف\nاسے ٹائپ کریں، یہ ایک قسم کی ذہنیت کی تبدیلی ہے کیونکہ ہم\nسمجھتے ہیں کہ یہ واقعی رسمی عمل ہے، لیکن خود کو\nیہ کوچنگ دینا اور ساتھ ہی ساتھ ہمارے طلباء واقعی اہم ہے۔ اور بس اسے بات چیت میں رکھیں۔ اور اگر آپ کو جواب پسند نہیں ہے تو کہیے، مجھے اس کے بارے میں یقین نہیں ہے۔ کیا آپ اسے مختلف طریقے سے کہہ سکتے ہیں؟ یا، مجھے وہ جواب پسند نہیں ہے۔ اور اسی طرح پیچھے دھکیلنا جیسے آپ کسی\n دوسرے شخص کے ساتھ بات چیت کر رہے ہوتے۔ - اور مجھے لگتا ہے کہ یہ\n آپ کے گروپ کا ایک اضافی ممبر ہوسکتا ہے، ٹھیک ہے؟ اگر بچوں کو اس بات پر متفق ہونا ہے کہ کون سا\nسوال پوچھنا ہے، اوہ میرے خدا، یہ واقعی\nایک زبردست گفتگو کرتا ہے جب وہ صرف ایک ہی پوچھ سکتے ہیں اور انہیں یہ جاننا ہوگا کہ\nاگلا کون سا سوال ہے۔ - جی ہاں۔ اور جان، ہم مکمل طور پر\nآپ کو وہاں ٹائپ کرتے ہوئے دیکھتے ہیں، جیسے جان\nاپنے طلباء کے ساتھ کچھ واقعی زبردست کام کر رہے ہیں کہ چاہے\nصحیح جوابات ہوں، انہیں یہ بتانا کہ وہ نہ صرف\nصحیح جواب میں دلچسپی رکھتا ہے، بلکہ انہوں نے کیسے حل کیا اور کیا اقدامات کئے۔ لیکن جان نے پوچھا،\nAI ان طلباء کی بھی کس طرح مدد کرتا ہے جن کے پاس IEPs یا 504s یا دیگر دستاویزات کی\nمعذوری یا رہائش ہے؟ اور میں یہ شامل کروں گا کہ\nآپ سب کے خیال میں اس سے کس طرح مدد ملتی ہے جب وہ طلباء جو شرما سکتے ہیں یا کچھ ریاضی کے صدمے کا شکار ہیں یا واقعی میں ریاضی کا بہت کم اعتماد رکھتے ہیں؟ - تو میں کہوں گا کہ میرے شوہر\nایک ESOL معلم ہیں، کچھ ریاستوں میں دوسری زبانوں کے انگریزی بولنے والے ہیں،\n میں فلوریڈا میں رہتا ہوں، کچھ ریاستوں میں ہم اسے ELL، انگریزی سیکھنے والے کہتے ہیں۔ لیکن میرے شوہر\nاسے استعمال کرتے ہیں، ٹیکنالوجی کا استعمال کرتے ہیں، اس طرح کہ وہ\nاپنے کلاس روم میں طالب علموں کو \nعوامی طور پر پوچھنے سے پہلے سوالات کے بارے میں سوچنے میں مدد کریں، خاص طور پر اگر انہیں یہ پریشانی ہے اور انہیں یقین نہیں ہے۔ ایک منٹ نکال کر اور بات چیت کرنے کا موقع ملنے سے، یہ انہیں یہ جاننے کا\nزیادہ پر اعتماد محسوس کرنے کا موقع فراہم کر سکتا ہے کہ آیا، آپ جانتے ہیں، آیا وہ سوال پوچھنے سے پہلے\nکچھ رائے حاصل کرنے کے لیے صحیح راستے پر ہیں یا، آپ جانتے ہیں،  اگر آپ اس بارے میں سوچتے ہیں کہ\nاساتذہ کب پڑھا رہے ہیں، اگر کوئی لفظ ہے اور وہ\nنہیں جانتے کہ اس کا کیا مطلب ہے، تو وہ جلدی سے اسے ٹائپ کر سکتے ہیں۔ وہ جلدی سے پوچھ سکتے ہیں، اسے پلگ ان کر سکتے ہیں\nاور ایک مثال حاصل کر سکتے ہیں یا معلوم کر سکتے ہیں کہ یہ کہاں\nلاگو ہوتا ہے۔  حقیقی زندگی، ٹھیک ہے؟ کیونکہ یہ وہ چیز ہے\nجو مواد کے ساتھ کنکشن بنانے کے لیے بہت اہم ہے۔ میرے خیال میں یہ ہمارے مواد سے مطابقت رکھتا ہے۔ میرے خیال میں یہ طالب علموں کو اس\nطرح سے پوچھنے کا موقع فراہم کرتا ہے جو کہ نہیں، یہ\nدھمکی آمیز یا خوفناک نہیں ہے۔ یہ انہیں واقعی محفوظ طریقے سے مواد کو دریافت کرنے کا موقع فراہم کرتا ہے۔ - ایمان، تم اس کے بارے میں کیا سوچتے ہو؟ ہاں، میں آپ کی ہر بات سے متفق ہوں،\nدینا۔ اور آپ جانتے ہیں، میں نے ایسے\nطالب علموں کو پڑھایا ہے جن کے پاس IEPs تھے اور بعض اوقات ٹائپنگ\nخود ہی ایک حد ہوتی تھی۔ اور\nخانمیگو کے بارے میں جن چیزوں سے میں واقعی لطف اندوز ہوں ان میں سے ایک اس میں بات کرنے کے قابل ہونا،\nدرحقیقت آپ کے سوالات پوچھنا ہے۔ اور اگر آپ کے پاس ہیڈ فون ہے تو،\nکونمیگو کے پاس اب آواز ہے۔ تو یہ ون آن ون چیز کی طرح ہو سکتا ہے\nجہاں، ارے، کونمیگو، مجھے یہاں کچھ مدد کی ضرورت ہے، اور پھر میں صرف وہی ہوں\nجو جواب سنتا ہے۔ اور یہ\nایک طالب علم کو حاصل کرنے کے لیے، آپ کی بات کے لیے، ڈینا،\nریاضی کے اس صدمے کا مقابلہ کرنے کے لیے اور واقعی اس بات کو یقینی بنانے کے لیے بہت اہم ہو سکتا ہے کہ\nوہ اپنی ضروریات پوری کر رہے ہیں۔ - ہاں، اور مجھے لگتا ہے، آپ\nجانتے ہیں، صرف کثیر لسانی سیکھنے والوں کے پاس واپس جا رہے ہیں، یہ خیال بھی کہ خانمیگو ابھی بات کر سکتے ہیں اور انگریزی اور ہسپانوی اور پرتگالی میں وہ مکالمہ کر سکتے ہیں۔  اسی طرح ایک محفوظ جگہ بھی ہے جہاں\nطلباء کو ریاضی کی تعلیم اور مواد میں پیچھے نہیں پڑنا پڑتا ہے جبکہ وہ\nبیک وقت انگریزی پر اعتماد اور مہارت حاصل کر رہے ہوتے ہیں۔ تو، آپ جانتے ہیں،\nہر اس چیز کے ساتھ ایک معاہدہ جو کہا گیا ہے، میرے\nخیال میں طلباء کے لیے یہ ایک محفوظ جگہ ہے کہ وہ اپنے\nخیالات کو بغیر کسی خطرے کے اپنے خیالات کی جانچ کریں جس سے وہ ابھی تک آرام سے نہیں ہیں۔ - ہاں، اور مجھے لگتا ہے کہ ایک اور طریقہ جس سے یہ واقعی مدد کر سکتا ہے وہ ہے\nاساتذہ کو اسباق تیار کرنے میں مدد کرنا تاکہ وہ طلباء کی ضروریات کو پورا کر سکیں\nجن کے ساتھ وہ کام کرتے ہیں۔ اور\nاسباق کو زیادہ تیزی سے ڈھالنے میں آپ کی مدد کرنے کے قابل ہونا، پہلے سے کہیں زیادہ مؤثر طریقے سے۔\n تو یہ کہنے کے قابل ہونا،\nآپ جانتے ہیں، میرے پاس ایسے طلباء ہیں جو واقعی اس موضوع یا اس تھیم سے لطف اندوز ہوتے ہیں، اور\nاس کے ارد گرد اسباق پیدا کرنے کے قابل، مواد لینے اور\nاسے کسی چیز پر اینکر کرنے کے قابل ہونا۔ اگر طلباء کو پہاڑوں میں پیدل سفر کرنا پسند ہے، کیونکہ میں\nڈینیئل کا پس منظر دیکھ رہا ہوں، اگر طلباء کو پیدل سفر کرنا پسند ہے، تو آئیے پیدل سفر کے بارے میں بات کریں۔ اور میں صرف، میں سمجھتا ہوں کہ یہ\nواقعی اساتذہ کو بھی ایسا فرق کرنے کے قابل بناتا ہے\nجیسا کہ ہمارے پاس پہلے کبھی نہیں تھا۔ - لہذا میں اس میں تھوڑا سا کھوج لگانا چاہتا ہوں کیونکہ کچھ سوالات ہیں جو\nپیرامیٹرز کے ارد گرد آتے ہیں اگر بچے موضوع سے ہٹ جاتے ہیں تو کیا ہوتا ہے، لیکن میں بھی، میں\nخود موضوع سے ہٹنا نہیں چاہتا، لیکن میں چاہتا ہوں، آپ نے شروع کیا، آپ اب اساتذہ کے کچھ ٹولز کی طرف اشارہ کیا گیا ہے۔ میرے خیال میں ہم نے اس\nبارے میں بات کرنے میں کافی وقت صرف کیا کہ کس طرح AI طالب علم کی گفتگو پر توجہ مرکوز کر رہا ہے،\n لیکن ہم اساتذہ کی مدد کیسے کرتے ہیں، کیونکہ ہم مسائل کو طے کرتے ہیں، ٹھیک ہے؟ آپ کے پاس کلاس روم میں بہت سے دوسرے انسانوں کے ساتھ ایک انسان ہے جس کی \nبہت سی ضروریات ہیں، اور خاص طور پر وبائی امراض کے بعد۔ ہم نے سیکھنے کے بہت سارے خلا دیکھے ہیں۔ لیکن اس پر ہر کوئی،\nاس ویبینار پر، آئیے حقیقی بنیں، ہمارے پاس کافی عرصے سے خلاء ہے، ہاں؟ ریاضی میں۔  ہاں۔ اور میں سمجھتا ہوں کہ ہر کوئی واقعی\nصحیح سمت میں گامزن ہے، پرعزم ہے اور یہاں تک کہ سٹیسی نے شروع میں کہی گئی باتوں کو واپس بلا رہا ہے، بہت زیادہ توقعات کی طرح،\nتمام طلباء پر یقین کرتے ہوئے، یہ یقینی بناتے ہوئے کہ تمام طلباء کو\n گریڈ لیول کے مواد تک مساوی رسائی حاصل ہے۔ تو میرا سوال یہ ہے کہ\nاساتذہ کے اوزار بھی اس مسئلے کو حل کرنے میں کس طرح مدد کر سکتے ہیں؟ دینا، کیا آپ ہمیں لات مارنا چاہتے ہیں\nاور پھر ہم کریں گے؟ - ضرور. ہاں، مجھے لگتا ہے کہ امی نے ایک سوال پوچھا ہے۔ میں ایمی کے سوال کا استعمال کرنا چاہتا ہوں  کیا\n AI کے ساتھ پیرامیٹرز سیٹ کرنے کے طریقے ہیں تاکہ طلباء کو اوپن فورم کے\nبجائے مواد کے علاقے میں رکھا جا سکے ؟ اور میں جانتا ہوں کہ ایک\nاور سوال تھا کہ میں AI کو\nصرف جوابات دینے سے کیسے روک سکتا ہوں؟ اور میں سمجھتا ہوں کہ یہ وہ چیز ہے\nجس کے لیے ہم نے خان اکیڈمی میں واقعتاً عہد کیا ہے کہ خانمیگو کو بنایا جائے تاکہ AI\nطلباء کے لیے ایک محفوظ جگہ ہو۔ ہم نے اعتدال میں بنایا ہے۔ خانمیگو طالب علموں کو جواب نہیں دے گا\nاگر وہ اس سے پوچھیں گے، یہ واضح طور پر کہے گا، میں\nآپ کو جواب نہیں دے سکتا، لیکن میں آپ کو تربیت دے سکتا ہوں۔ اور یہ ہوگا، آپ جانتے ہیں، یہ ہوگا، یہ انہیں ٹریک پر رکھے گا۔ اگر آپ ریاضی کے کسی مسئلے پر کام کر رہے ہیں اور آپ کہتے ہیں، میں\nفرانسیسی انقلاب کے بارے میں بات کرنا چاہتا ہوں، خانمیگو کہے گا، یہ شاندار ہے، لیکن یہ\nاس کے لیے جگہ اور وقت نہیں ہے۔ اور مجھے لگتا ہے کہ یہ واقعی بہت اچھا ہے۔ یہ طلباء کو اساتذہ کے اوزار کے لحاظ سے توجہ مرکوز رکھنے میں مدد کرتا ہے۔ میرے خیال میں یہ نمبر ایک ہے۔ کیا آپ تصور کر سکتے ہیں کہ اگر ہمارے بچے\nپوری کلاس کی مدت میں صرف توجہ مرکوز رکھیں، تو یہ کتنا شاندار ہوگا؟ میں یہ کہتا ہوں کہ ایک مڈل\nاسکول ٹیچر کے طور پر، ٹھیک ہے؟ میں نے مڈل اسکول کو پڑھایا، تو\nیہ ہمیشہ ایسا ہی ہوتا تھا، آپ جانتے ہیں، بہت ساری نقل و حرکت، بہت ساری سرگرمی، ان کو مجھ پر مرکوز رکھنے کی کوشش کرنا۔ تو یہ وہیں سے شروع ہوتا ہے، یہ طلباء کو\nمشغول رکھنے، انہیں مرکوز رکھنے میں مدد کے ساتھ شروع ہوتا ہے۔ اور پھر مجھے لگتا ہے کہ یہ اس کے\nبارے میں بھی ہے، آپ جانتے ہیں، ایک کلاس روم ٹیچر کے طور پر، میں دیکھتا تھا، میں نے آپ کو بتایا کہ میں\nہمیشہ سے ریاضی کا معلم رہا ہوں، آپ سب۔ یہ تلاش کرنے کی ضرورت نہیں ہے،\nمیں کتاب کے بعد ایک کتاب کے ذریعے تلاش کرتا تھا، صحیح سبق، صحیح وسائل، صحیح مواد کی تلاش میں۔ اور پھر، آپ جانتے ہیں، پھر\nانٹرنیٹ آیا۔ اور آپ جانتے ہیں، ہمارے پاس گوگل تھا\nاور ہمارے پاس تمام چیزیں تھیں اور پھر میرے پاس صرف 57,000\nٹیبز کھلے تھے جب میں سبق کی منصوبہ بندی کے لیے کچھ تلاش کر رہا تھا۔ میرے خیال میں اس سے وقت کی بچت ہوتی ہے کیونکہ یہ مجھے\nاعلیٰ معیار کی چیز دیتا ہے۔ میں وہ ایڈجسٹمنٹ جلدی کر سکتا ہوں۔ میں اپنے طلباء کی ضروریات کو پورا کرنے کے لئے وسائل بنا سکتا ہوں\n جو میرے طلباء کے لئے مخصوص ہیں،\nبہت جلد۔ اور میں واقعی اچھے،\nبھرپور ٹاسک بنا سکتا ہوں، جو کہ ایک بار پھر، میں پروجیکٹ کے\nمسئلے پر مبنی تدریس اور\nان بھرپور کاموں کو تیزی سے تخلیق کرنے کے قابل ہوں۔ یہ سب کچھ ہے۔ - اور میں سوچتا ہوں کہ نہ صرف\nبھرپور کاموں کو تخلیق کرنا، بلکہ اس کے بعد آپ کتنی تیزی سے\nفرق کر سکتے ہیں، ٹھیک ہے؟ میرا مطلب ہے، ہم تمام بچوں کے لیے\nاس عظیم کام کو بنانے میں گھنٹوں صرف کرتے تھے۔ اب ہم اتنے مختصر وقت میں یہ کر سکتے ہیں\n کہ میں اس کے چار یا پانچ دوسرے ورژن بھی بنا سکتا ہوں جو \nمیرے طلباء کے چھوٹے گروپوں یا شاید ایک انفرادی\nطالب علم کی انفرادی ضروریات کو لفظی طور پر صرف چند منٹوں میں پورا کر سکتا ہوں، ٹھیک ہے۔  ? میں ان کو ایک طرف شمار کر سکتا ہوں اور اب میرے پاس\nاپنے طلباء کے لیے اعلیٰ معیار کے وسائل ہیں جو مختلف ہیں۔ - آپ کے پاس\nاس موضوع پر ایمان کو شامل کرنے کے لیے کچھ اور ہے؟ - نہیں، میں اس سے زیادہ اتفاق نہیں کر سکتا۔ آپ جانتے ہیں، جب میں\nٹیچر ٹولز میں سے کچھ کے بارے میں سوچتا ہوں، تو میں اپنے آپ سے سوچ رہا تھا، ٹھیک ہے، \nجب میں پڑھا رہا ہوں تو میں کن کو پسند کروں گا؟ اور میرے علم کو تازہ کرنے کا\nآلہ بہت اہم ہے کیونکہ ایک استاد کے طور پر، میں سمجھتا ہوں کہ\nوقت میرے لیے ایک شے ہے۔ مجھے ایسا لگتا ہے کہ میرے پاس کبھی بھی کافی وقت نہیں ہوگا اور ایسے لمحات ہوں گے جب، آپ جانتے ہیں، مجھے اپنے سبق کی منصوبہ بندی میں مدد کی ضرورت تھی یا میرا کوئی ساتھی باہر تھا اور مجھے کہا گیا، ارے، مجھے آپ کی اس آٹھویں جماعت کو پڑھانے کی ضرورت ہے۔  ریاضی کا کورس، لیکن میں چھ پڑھا رہا ہوں۔ اور اس لیے مجھے تیز رفتاری سے آگے بڑھانے کے لیے صرف ایک ٹول کا ہونا ضروری ہے تاکہ\n مجھے\nطلبہ کو مزید پیچھے نہ پڑنا پڑے۔ اور اس طرح، آپ جانتے ہیں، میں صرف ان طریقوں کے بارے میں سوچتا ہوں\nجن سے میں اپنی تعلیم کو انفرادی بنا سکتا ہوں، بلکہ ایک استاد کے طور پر بھی\nمجھے تازہ ترین رکھ سکتا ہوں جو میرے طلباء کے لیے ضروری ہے۔ - ہاں، تو آئیے\nاسے تھوڑا سا مزید کھولتے ہیں کیونکہ آپ\nٹیچر ٹولز کے بارے میں بات کر رہے ہیں۔ تو Stacie، اگر آپ\nآج کلاس روم میں ہوتے، تو کون سی AI خصوصیت آپ کے پاس جاتی؟ آپ سب سے زیادہ کس چیز پر انحصار کرتے؟ - تو یہ ہمیشہ ایک\nدلچسپ سوال ہوتا ہے کیونکہ لوگ مجھے مضحکہ خیز نظر آتے ہیں۔ میں\nروبرک ٹول سے بالکل پیار کر رہا ہوں، جو کچھ ایسا نہیں ہے جو ہم\nریاضی کے کلاس رومز میں کرتے ہیں، ٹھیک ہے؟ ریاضی کے استاد کو روبرک کے طور پر کون استعمال کرے گا؟ میں انہیں ہر وقت استعمال کرتا ہوں۔ اور یہ\nمیرے لیے سیکھنے کا ایک دلچسپ وکر تھا کیونکہ جب میں\nاپنے ٹیچر پریپ پروگرام سے گزر رہا تھا، تو ہم نے\nELA کے مواد اور ہیومینٹیز پر مبنی اپنی تمام روبرکس کی، ٹھیک ہے؟ اور جب میں نے پڑھانا شروع کیا تو\nمجھے اس میں کچھ سال گزر گئے اور مجھے احساس ہوا کہ مجھے طلباء کو اس بات کی بہتر سمجھ حاصل کرنے کی ضرورت ہے کہ وہ کیا کرنے کے لیے کہا جا رہا ہے،\nانہیں یہ کیسے ظاہر کرنے کی ضرورت ہے اور انہیں زبانی یا بات چیت کرنے کے قابل کیسے ہونا چاہیے۔  حقیقت کے بعد. اور اس لیے چونکہ میں\nعمل پر زیادہ توجہ مرکوز کرتا تھا، میں روبرک استعمال کروں گا اور اس نے مجھے ہمیشہ کے لیے لے لیا کیونکہ\n عقلی نمبروں کے ساتھ مساوات کے نظام کو حل کرنے کے لیے کوئی روبرک موجود نہیں ہے جس سے\nمیں ان سب کو بناؤں۔ تو میں نے\nخانمیگو کے ساتھ صرف ایک دو ہفتے پہلے کیا تھا۔ اس میں مجھے پانچ منٹ سے بھی کم وقت لگا اور یہ بچوں کے لیے بہت واضح تھا اور اگر میں ابھی اس ٹول کے ساتھ کلاس روم میں تھا، تو\n یہ مکمل طور پر سیکھنے کی ذمہ داری طالب علم پر منتقل کر دیتا ہے۔ وہ جانتے ہیں کہ کیا توقع ہے۔ وہ اب\n اس لیٹر گریڈ کے بجائے عمل پر توجہ مرکوز کر رہے ہیں جو\nانہیں کچھ نہیں سکھاتا، ٹھیک ہے؟ وہ اب واقعی\nاس میٹاکوگنیٹو حالت میں ہیں جہاں وہ سوچ رہے ہیں کہ\nمیں کیا سیکھ رہا ہوں؟ میں اسے کیسے دکھا رہا ہوں اور\nمیں اس سے کیسے رابطہ کر رہا ہوں؟ - ایمان تمہارا کیا حال ہے؟  آپ کا پسندیدہ کیا ہے؟ - میرا پسندیدہ لیولر ہونا ہے۔ لہذا لیولر ٹول جو\nآپ کو کسی بھی متن کو لینے اور پڑھنے کی مختلف سطحوں کے لیے اسے مختلف طریقوں سے برابر کرنے کی اجازت دیتا ہے وہ \nمیرے پسندیدہ ٹولز میں سے ایک ہے کیونکہ میرے پاس ایسے\nطالب علم ہوتے تھے جن کے پاس IEPs ہوتے تھے اور وہ مجھے بتاتے تھے،\nایک، محترمہ ہاورڈ، میں۔  سمجھ نہیں آرہا کہ یہ عبارت کیا کہتی ہے۔ یا جو متن میں دے رہا ہوں وہ\nبچوں کے کام کی طرح محسوس ہوتا ہے۔ میں\nاپنے طلباء سے ہر وقت یہ سنتا رہتا۔ اور اس طرح یہ خیال کہ\nہر کوئی ایک جیسی معلومات تک رسائی حاصل کر سکتا ہے لیکن یہ اس\nطرح سے تیار کیا گیا ہے کہ یہ صرف آپ کے لیے ہے، یہ میرے لیے گیم چینجر ہے۔ اور اس طرح یہ میرا نمبر ایک ہوگا۔ - اور دینا سے پہلے، میں آپ کو\nجواب دینے دیتا ہوں، میں خود ایک سابق اسپیشل\nایجوکیشن ٹیچر کے طور پر پگی بیک کرنا چاہتا ہوں، اصل میں ایک IEP تخلیق کار ٹول ہے۔  یہ دیکھنے والے آپ میں سے کتنے لوگوں نے\nکبھی IEP کے اہداف کے ساتھ جدوجہد کی ہے اور ان اہداف کی نگرانی کی ہے؟ کوئی؟  صرف مذاق کر رہا ہوں۔ ہاں وہ ہے۔ اور پھر طلباء کو\nمشغول اور ٹریک پر رکھنا۔ لہٰذا میں خانمیگو پر دباؤ ڈال رہا تھا کہ وہ مجھے ریاضی کے IEP اہداف کے لیے انتہائی مخصوص\nپیمائش کے قابل احتساب نتائج فراہم کرے۔ اور جب آپ اسے دھکا دیتے ہیں اور اسے دھکا دیتے ہیں، تو یہ آپ کو بالکل وہی دیتا ہے جس کی آپ کو ضرورت ہے۔ تو وہ چیز، اگر میرے پاس\nوہ ہوتی، تو اس نے میری زندگی کے گھنٹوں، گھنٹے بچائے ہوتے۔ دینا، تمہارا کیا ہے؟ - ٹھیک ہے، تو میرا ایک\nمڈل اسکول کا بیٹا ہے جو ایک بہت ہی متجسس فرد ہے اور\nہر چیز کے بارے میں سب کچھ جاننا چاہتا ہے۔ تو میرا پسندیدہ Ignite my Curiosity ہے کیونکہ اس نے مجھ سے ان چیزوں کے بارے میں سوالات پوچھے جن کے بارے میں مجھے کوئی علم نہیں ہے۔ اور میں نے سیکھا ہے کہ خانمیگو میرا سب سے اچھا\nدوست ہے جب \nدنیا کے کام کرنے کے طریقے کے بارے میں اس کے سوالات کے جوابات دینے کی بات آتی ہے اور چیزیں\nمضامین کے شعبوں میں کس طرح نظر آتی ہیں، آپ جانتے ہیں، اس کی سائنس کی دنیا\nبڑی اور بہت بڑی اور وسیع ہے اور یہاں تک کہ  اگرچہ ماں ایک ریاضی کی لڑکی ہے اور میں نے بہت ساری\nسائنس حاصل کی ہے، میں یقینی طور پر سوچتی ہوں کہ بطور والدین Ignite\nMy Curiosity نے مجھے کئی بار سے زیادہ بچایا ہے۔ - ہاں، میں دیکھ سکتا ہوں کہ میں کوئی ایسا شخص ہوں جو\nچرچ کے اسکول میں یہ پوچھنے پر مصیبت میں پڑ گیا تھا کہ \nآدم اور حوا کے ساتھ ڈائنوسار کہاں تھے۔ میں نہیں جانتا کہ کیا اس کا تعلق تجسس کے علاوہ کسی سے ہے، اس بات کو \nیقینی بنانا جاری رکھنا ضروری ہے کہ ہم طلباء کے لیے تجسس پیدا کریں۔ تو کچھ لاجسٹک\nسوالات آ رہے ہیں۔ کوئی پوچھ رہا تھا کہ\nہر چیز کو درست کرنے کا وقت ہے۔ جیسا کہ ہم ٹیچر ٹولز کے بارے میں بات کر رہے ہیں جو\nوقت کی بچت کر سکتے ہیں، لیکن میں تھوڑا سا پیچھے ہٹنا چاہتا ہوں کہ خانمیگو کے طالب علم کو ٹولز کا سامنا کرنا پڑتا ہے اور کیا واقعی کوئی\n ہمارے کورسز اور خانمیگو کے درمیان فرق کی وضاحت کر سکتا ہے؟ 'کیونکہ مجھے لگتا ہے، مجھے نہیں معلوم کہ کیا\nہم نے واقعی اس کے ساتھ شروعات کی ہے۔ تو کون صرف لوگوں کو زمین کی جگہ دے کر شروعات کرنا چاہتا ہے؟ - میں کر سکتا ہوں۔\n- شکریہ دینا۔ فروخت! - ہمارے پاس خان اکیڈمی کے کورسز ہیں۔ ہمارے پاس ہے، اور مانیں یا نہ مانیں، ہم اکثر سنتے ہیں،\nآپ جانتے ہیں، خان اکیڈمی، یہ ریاضی اور سائنس ہے۔ ہمارے پاس دراصل ELA بھی ہے،\nہمارے پاس سماجی علوم ہیں، ہمارے پاس زندگی کی مہارتیں ہیں، ہمارے پاس کالج اور کیریئر کی تیاری ہے، مالی\nخواندگی ہے، اساتذہ کے لیے AI، طلباء کے لیے AI ہے۔ ہمارے پاس آرٹ کی تاریخ ہے، ہمارے پاس\nبہت سے مختلف کورسز ہیں اور ہمارے تمام کورس کے مواد کے ساتھ سیکھنے کے مختلف طریقے آتے ہیں۔ ہم ویڈیوز پیش کرتے ہیں، ہم گائیڈ ریڈنگ پیش کرتے ہیں۔ \nآپ نے جو کچھ سیکھا ہے اس پر عمل کرنے کے لیے ہم مشقیں پیش کرتے ہیں۔ تو ایک بالکل مختلف ہے،\nمواد کا ایک پورا مجموعہ ہے جو صرف وہ کورسز ہیں\nجو آپ ہر روز پڑھائی جانے والی چیزوں کے مطابق استعمال کیے جا سکتے ہیں۔ لہذا ہمارے پاس کورس ورک ہے جسے آپ استعمال کر سکتے ہیں، آپ ہماری ویڈیوز کو پوری کلاس کے طور پر استعمال کر سکتے ہیں، آپ طالب علموں سے\nانہیں انفرادی طور پر دیکھ سکتے ہیں۔ لیکن پھر ہمارے پاس\nKhanmigo اسٹوڈنٹ ٹولز بھی ہیں، جو آپ کی ہدایات میں فرق کرنے کا واقعی ایک اچھا طریقہ ہے۔ ایک استاد کے طور پر میرے پسندیدہ ٹکڑوں میں سے ایک، میں ہمیشہ واضح الفاظ کی تعلیم میں بہت بڑا تھا، ٹھیک ہے؟ میں اس سے پہلے کہ ہیٹی نے کہا کہ یہ ان بہترین طریقوں میں سے ایک کی طرح تھا، جیسے کہ\nواضح الفاظ کی تعلیم میرے لیے ہمیشہ ایک بڑی چیز تھی۔ اور اس لیے مجھے پسند ہے کہ ہمارے\nپاس الفاظ کے کچھ ٹولز ہیں جہاں طلباء\nاپنے ریاضی کے الفاظ پر عمل کر سکتے ہیں۔ میں اسے استعمال کروں گا، میرے خیال میں یہ\nآپ کی تعلیم میں بہت سے مختلف طریقوں سے فٹ ہو سکتا ہے۔ آپ طالب علموں کو\nمختلف قسم کے وارم اپ کے ساتھ مشغول کر سکتے ہیں۔ آپ کے پاس انہیں پریکٹس کرنے کے لیے مواد ہے، آپ کے پاس\nان کے لیے پریکٹس کے مسائل کے سیٹ حاصل کرنے کے مواقع ہیں جہاں وہ کام کر سکتے ہیں اور انھیں اپنے استدلال کی وضاحت کرنی ہوگی اور خانمیگو ان کی کوچنگ کریں گے۔ تو میرا خیال ہے کہ جب آپ پوچھیں گے کہ\nیہ آپ کی تعلیم میں کیسے فٹ بیٹھتا ہے، تو میں کہوں گا کہ یہ\nآپ کے پڑھانے کے انداز پر منحصر ہے، یہ اس بات پر منحصر ہے کہ آپ کیا کرنا چاہتے ہیں۔ لیکن ہمارے پاس یقینی طور پر ہفتہ وار روٹین میں فٹ ہونے کے لیے کافی مواد موجود ہے۔ - آپ میں سے کوئی بھی\nاس میں کچھ اور شامل کرنا چاہتے ہیں؟ - مجھے لگتا ہے کہ اس نے اسے بند کر دیا ہے۔ میں اس سب سے متفق ہوں۔ اور خانمیگو، یہ اوپر\nدائیں طرف ایک اچھی پرت ہے؟ 'کیونکہ یہ\nپورے راستے میں مدد کرنے کے لئے ہے۔ - لہذا میں واپس جانا چاہتا ہوں کہ ہم اپنے طلباء کے ساتھ ریاضی سے کس قسم کا مستقبل بنا رہے ہیں۔\n اور میں جاننا پسند کروں گا، اور میں\nاس چیز کو دیکھنے والے ہر ایک سے اسی چیز کے بارے میں سوچنا پسند کرتا ہوں۔ تو کہتے ہیں کہ آپ کے پاس جادو کی چھڑی تھی، ٹھیک ہے؟ 'کیونکہ ظاہر ہے کہ ہمارے پاس ایک حیرت انگیز ٹول ہے، لیکن یہ جادو کی چھڑی نہیں ہے۔  جب ہم ریاضی کی تعلیم کے بارے میں سوچیں گے تو آپ کیا بدلیں گے یا آپ کس قسم کا مستقبل آگے بڑھتے دیکھنا چاہیں گے ؟ - ہاں، میں یہاں چھلانگ لگاؤں گا اور کہوں گا کہ، میری جادو کی چھڑی اس روح کو بدل دے گی جس کے ساتھ ہم\nریاضی کی تعلیم حاصل کرتے ہیں، خاص طور پر کم عمر سیکھنے والوں کے ساتھ۔ کیونکہ آپ جانتے ہیں، اگر آپ\nجدید ریاضی اور ریاضی دانوں کی ریاضی کے بارے میں سوچتے ہیں، تو یہ واقعی ایک ہے، میرے نزدیک یہ ایک تخلیقی مضمون ہے۔ یہ دنیا کی تفہیم کی تعمیر کے بارے میں ہے۔\n یہ ان چیزوں کی کھوج کے بارے میں ہے جو ہم ابھی تک نہیں جانتے اور نہیں سمجھتے ہیں۔ لیکن ہم ریاضی اس طرح پڑھاتے ہیں جیسے\nاکثر تخلیقی صلاحیت نہیں ہوتی، ٹھیک ہے؟ اور میں سمجھتا ہوں کہ AI واقعی\nاس تبدیلی میں ہماری مدد کر سکتا ہے جہاں\nچیزوں کے بارے میں ایک طرح سے سوچنے کے بجائے، AI طالب علموں کو مسائل کے بارے میں\nمختلف نقطہ نظر سے سوچنے یا اسے مختلف طریقے سے سمجھانے\nیا مختلف نقطہ نظر سے مدد کر سکتا ہے۔ اور بطور استاد،\n ایک کمرے میں 35 یا اس سے زیادہ انسانوں کے ساتھ ایسا کرنا واقعی مشکل ہے، ٹھیک ہے؟ لہذا میں سمجھتا ہوں کہ وہیں پر AI آ سکتا ہے اور\nبچوں کے ساتھ ان باتوں کو کرنے اور واقعی تلاش کرنے میں ہماری مدد کر سکتا ہے۔ یہ میرے نزدیک\nریاضی کی اصل روح ہے جس سے فائدہ اٹھانے کے لیے ہمارے پاس اکثر وقت نہیں ہوتا ہے۔\n - بالکل مجھے ایسا لگتا ہے کہ اگر میرے پاس جادو کی چھڑی ہوتی، تو کوئی واضح لمحہ نہیں ہوتا جہاں کوئی فیصلہ کرے کہ\nوہ ریاضی میں اچھا ہے یا ریاضی میں برا، ہر کوئی\nخود کو ریاضی کے فرد کے طور پر دیکھے گا۔ اور وہ یہ سیکھیں گے کہ جب،\nآپ جانتے ہیں، میں غلطی کرتا ہوں، یہ اوہ نہیں، ایسا نہیں ہے، چلو\nبات چیت کرتے ہیں، یہ مزہ تھا۔ تم کیا سوچ رہے ہو؟ اور ہر کوئی ان باتوں سے بااختیار محسوس کرے گا کہ ہم غلط فہمیوں سے کیسے سیکھ سکتے ہیں، ہم ریاضی کی گفتگو کیسے کر سکتے ہیں؟ اور مجھے AI کے بارے میں جو چیز پسند ہے وہ یہ ہے کہ\nیہ ہمیں صرف اتنا کرنے کی طاقت دیتا ہے کہ غلطیوں سے سیکھنا\nدراصل ایک موقع ہے۔ - آپ کا کیا حال ہے دینا؟\n- میرے خیال میں ریاضی کی خوبصورتی اس\nطرح ہے کہ یہ ہماری پوری دنیا کا ایک حصہ ہے۔ یہ، آپ جانتے ہیں، آئن سٹائن نے کہا، ریاضی وہ زبان ہے جس سے خدا نے کائنات کو لکھا ہے۔ یہ وہاں سے باہر ہے۔ یہ ہر جگہ ہے جہاں ہم دیکھتے ہیں\nاور ہر جگہ جہاں ہم اسے دیکھتے ہیں۔ اور یہ شرم کی بات ہے کہ زیادہ تر طالب علموں کے لیے، یہ صرف طریقہ کار کی مساوات اور اقدامات کے ایک سیٹ پر ابالا جاتا ہے۔ اور مجھے لگتا ہے کہ، آپ جانتے ہیں، یہاں پر اپنے حیرت انگیز ساتھیوں سے اتفاق کرنے کے لیے، اس سے دنیا کھل جاتی ہے کہ\nریاضی واقعی کیا ہے اور اسے کیا ہونا چاہیے تاکہ\nطلبہ دیکھ سکیں، آپ جانتے ہیں، شاید میں جیومیٹری میں بہت اچھا نہیں ہوں۔ لیکن آپ جانتے ہیں کہ مجھے الجبرا پسند ہے۔ مجھے عمومیات تلاش کرنا اور یہ معلوم کرنا پسند ہے کہ مساوات کیسے کام کر سکتی ہیں۔ یا شاید میں الجبرا نہیں ہوں،\nمیں جیومیٹری کا آدمی ہوں۔ \nریاضی سے محبت کرنے اور اس کے ساتھ مشغول ہونے کے مختلف طریقے ہیں۔ اور مجھے لگتا ہے کہ آپ\nخود کو اس میں دیکھ سکتے ہیں جب آپ کے پاس موقع ہوتا ہے اور جب آپ کو\nریاضی کے ساتھ پیش کیا جاتا ہے جیسے قدموں کی ایک سیریز سے بہت بڑا ہے۔ - اور میں سب سے اتفاق کرتا ہوں،\nجو کچھ آپ نے کہا ہے اور ریاضی کے اساتذہ کی\nبہت قریب سے حمایت کرنے سے، میرے کیریئر کے آخری 10 سالوں میں\n، میں بھی بااختیار بنانا چاہتا ہوں، میری جادو کی چھڑی\nہر ریاضی کے معلم کو بااختیار بنانا ہوگی جیسا کہ ایمان نے کہا،  یہ محسوس نہ کرنا کہ میں ایک ہوں، یہاں تک کہ بعض ابتدائی اسکول کے\nاساتذہ کو بھی بعض اوقات ایسا لگتا ہے کہ وہ ریاضی نہیں پڑھ سکتے یا\nوہ ریاضی سے کتراتے ہیں یا انہیں خود ریاضی کا صدمہ ہے۔ مجھے ریاضی کا صدمہ ہے۔ آپ میں سے کسی کو ریاضی کا صدمہ ہے؟ جیسا کہ میں بالکل جانتا ہوں کہ یہ کب ہوتا ہے۔ تو یہ جاننا ہے کہ آپ کر سکتے ہیں، یہ جاننا ہے کہ یہ ممکن ہے\nاور خوشی کو دوبارہ تلاش کرنا۔ لہذا میں اصل میں تخلیقی صلاحیتوں، خوشی کے\nبارے میں تھوڑی سی بات کرنا پسند کروں گا، جو\nاعتماد کو بڑھانے سے بھی منسلک ہے۔ یہ ٹولز ہمارے ریاضی کے کلاس رومز میں کچھ خوشیوں کو واپس لانے میں کس طرح مدد کر سکتے ہیں \n؟ Stacie، آپ اس کے بارے میں کیا سوچتے ہیں؟ ہم کس طرح زیادہ تخلیقی صلاحیتوں کو بڑھانا پسند کر سکتے ہیں؟ - ہاں، میں یہ جاننے کی کوشش کر رہا ہوں کہ\nاپنے آپ کو کیسے دہرایا نہ جائے کیونکہ یہ میرا جادو کی\nچھڑی کا سوال ہے، ٹھیک ہے؟ میرے خیال میں یہ طالب علموں کو ریاضی کو\nدوسرے نقطہ نظر سے جانچنے میں مدد کرنے کے بارے میں ہے، ٹھیک ہے؟ تو ہمارے روایتی حرکیات میں، ہمارے پاس ایک استاد ہے جو ریاضی پڑھا رہا ہے اور طلباء سیکھ رہے ہیں اور بعض اوقات انہیں\nزبانی بات کرنے کا موقع ملتا ہے، لیکن یہ\nدو طرفہ گفتگو کی طرح ہوتا ہے، ٹھیک ہے؟ جتنا ہم ہم مرتبہ مکالمے میں لا سکتے ہیں اور طلباء سے ان طریقوں کے بارے میں بات کرنے اور ان طریقوں کی کھوج کر سکتے ہیں جن کے بارے میں دوسرے لوگ مسائل کے بارے میں سوچتے ہیں یا ان طریقوں سے جن سے دوسرے\nلوگ کسی مسئلے سے رجوع کرتے ہیں، یہ ناقابل یقین حد تک قیمتی ہے۔ لیکن وقت بہت محدود ہے۔ اور اس طرح میرے نزدیک، آپ جو بھی\nAI ٹول استعمال کر رہے ہیں، یہ\nریاضی کو زیادہ تصویری انداز میں دریافت کرنے کے بارے میں ہو سکتا ہے، ٹھیک ہے؟ جہاں ہم چیزوں کو گرافیکل طور پر دیکھ رہے ہیں یا چیزوں کے ساتھ گرافی کے ساتھ کھیل رہے ہیں\nاور اس کی بصری تصاویر۔ یا یہ صرف\n \nمیری اپنی سوچ یا میری اپنی نام نہاد غلطیوں کے پیچھے کیسے اور کیوں ہے یہ دریافت کرنے کے لئے اس محفوظ جگہ کے بارے میں ہوسکتا ہے۔ کیونکہ میرے نزدیک، وہیں سے تخلیقی صلاحیتیں اور سیکھنے کا عمل سامنے آتا ہے۔ اس بات کا امکان زیادہ ہے کہ آپ تخلیقی پہلو کو تلاش کرنے جا رہے ہیں اور\nجب آپ غلطی کرتے ہیں تو آپ کسی چیز تک کیسے پہنچتے ہیں، ٹھیک ہے؟ جب مجھے پہلی بار صحیح نہیں ملا اور مجھے واپس جا کر\nاپنے عمل کا جائزہ لینا پڑے گا۔ اور مجھے لگتا ہے کہ\nواقعی یہ وہ جگہ ہے جہاں AI چیٹ سپورٹ ہونا یا اس ڈائیلاگ کا ہونا واقعی ہمیں وہاں کھودنے میں مدد کر سکتا ہے۔ - بالکل اور اسٹیسی کی طرح، آپ جانتے ہیں، میں تخلیقی صلاحیتوں کو\nاعلیٰ ترتیب کی سوچ کے طور پر دیکھتا ہوں۔ تو اس سے باہر نکلنا،\nکیا میں اسے سمجھتا ہوں؟ کیا میں اسے یاد کر سکتا ہوں؟ لیکن کیا میں اس کا تجزیہ کر سکتا ہوں؟ کیا میں اس سے کچھ نیا بنا سکتا ہوں؟ کیا میں اس پر بحث کر سکتا ہوں؟ اور یہ وہی ہے جو AI ہمیں کرنے کی اجازت دیتا ہے۔ اور اس طرح جب میں سوچتا ہوں،\nجب میں اس کو کلاس روم میں کیا ہوتا ہے جہاں طلباء\nمختلف سطحوں پر ہوتے ہیں، آپ کی سطح سے قطع نظر، اب ہم\nسب اعلیٰ سوچ میں مشغول ہو سکتے ہیں جو\nہمارے سیکھنے کے کنارے پر ہم سے ملتی ہے۔ اور تو یہ وہ چیز ہے جس کے بارے میں میں اس ٹول کے لیے بہت پرجوش ہوں۔ - اصل میں.  کیا ہم آپ سے لرننگ ایج پر ملنے کے بارے میں کچھ اور بات کر سکتے ہیں؟  کیا آپ اس پر توسیع کر سکتے ہیں؟ کیونکہ یہ ایک ایسی چیز ہے جہاں بہت ساری تحقیق دکھائی دے رہی ہے، ٹھیک ہے؟ اسے کہا جاتا ہے، میرا مطلب ہے کہ\nجان ہیٹی بھی گولڈی لاکس کے سیکھنے کے اصول کے بارے میں بات کرتا ہے، بہت آسان، بہت مشکل نہیں ہوسکتا، اسے بالکل صحیح ہونا چاہیے، لیکن بالکل صحیح، یہ ہر ایک کے لیے مختلف ہے، کنارے مختلف ہے۔ - بالکل، یہ سب کے لیے مختلف ہے۔ اور آپ جانتے ہیں، میں اس قصے کی طرف واپس جا رہا ہوں جو ہم\n اپنے اور بچوں کے درمیان ایک سے 35 کے تناسب کے بارے میں استعمال کر رہے ہیں کہ ہر طالب علم کی\nسیکھنے کا کنارہ مختلف ہوتا ہے۔ تو\nمیں نے آپ کو کس مقام پر دھکیل دیا ہے جہاں ہم مایوسی کے موڈ میں نہیں ہیں،\nہم اب بھی حاصل کر رہے ہیں، آپ جانتے ہیں، وہ سیکھنا جو ہو رہا ہے، لیکن یہ بھی ہے، یہ\nاتنا سخت نہیں ہے، ٹھیک ہے؟ اور اس لیے یہاں خیال یہ ہے کہ\nجب میں Conmigo کے ساتھ کام کر رہا ہوں، تو مجھے کچھ غلط ہو سکتا ہے، ٹھیک ہے؟ اور پھر خانمیگو\nبالکل وہی بات کرنے والا ہے جہاں میں نے غلط کہا اور\nمکالمہ وہیں سے شروع ہوتا ہے۔ شاید میں نے ٹھیک سمجھا۔ Khanmigo پھر سطح کو اوپر کر سکتے ہیں، ٹھیک ہے؟ اور پھر اب ہم کچھ زیادہ سختی سے کام کر سکتے ہیں۔ اور یہ مصروفیت کے لیے واقعی اہم ہے،\nیہ سیکھنے کے لیے ضروری ہے کہ ایسا ہو رہا ہے، کہ ہر طالب علم کو بالکل وہی جگہ مل رہی ہے جہاں اسے ہونے کی ضرورت ہے۔ اور ایک شخص کے طور پر، ایسا\nکرنا واقعی مشکل ہے۔ لیکن ہمارے پاس ایک تدریسی معاون ہے\nجو اب ہماری مدد کر سکتا ہے۔ - ہاں ضرور۔ دینا،\nتخلیقی صلاحیتوں یا سیکھنے کے کنارے میں سے کسی کے بارے میں کوئی حتمی خیالات؟ - مجھے لگتا ہے کہ سیکھنے کے کنارے کے ساتھ،\nمجھے لگتا ہے کہ ہم پہلے سے کہیں زیادہ تیزی سے جوابدہ اور موافقت پذیر ہونے کے قابل ہیں۔\n مجھے لگتا ہے کہ، آپ جانتے ہیں، طلباء کے لیے\nبعض اوقات آپ کو صرف ایک لائٹ بلب لمحے کی ضرورت ہوتی ہے تاکہ کسی\nتصور کو سمجھ سکیں۔ اور مجھے لگتا ہے کہ\nاس لمحے کو حاصل کرنے کے قابل ہونا اور پھر اسے پسند کرنے کے قابل ہونا،\nاسے لانچ پیڈ کے طور پر استعمال کرنا اور تیز کرنا تاکہ آپ\nپھنس نہ جائیں، آپ جانتے ہیں، آپ گریڈ لیول سے نیچے کام کرنے یا لمبے عرصے تک روٹ اسکلز پر نہیں پھنسے ہوئے ہیں۔  وہ وقت جہاں آپ صرف ہیں، آپ مشق کرتے رہتے ہیں لیکن آپ کو واقعی اس کی مزید ضرورت نہیں ہے۔ میرے خیال میں یہ ہمیں یہ دیکھنے کی اجازت دیتا ہے کہ\nطلباء کے پاس کب ہے اور جب وہ آگے بڑھنے کے لیے تیار ہیں، اگر آپ چاہیں تو اس سے ہمیں کچھ گندگی سے نکلنے میں مدد ملتی ہے۔\n اور واقعی ترقی کو جاری رکھیں، طلباء کو آگے بڑھتے رہیں\nاور انہیں مصروف رکھیں۔ اور میں سوچتا ہوں کہ\nتخلیقی صلاحیتوں کی طرح، جس طرح وہ ایسا کر رہے ہیں،\nآپ کیسے سیکھنا پسند کرتے ہیں؟ آپ کو معلوم ہے کہ ہم کچھ مختلف چیٹس کو دیکھ رہے تھے جو آئی تھیں۔ ایک طالب علم نے پوچھا اور کونیگو نے ان سے تھوڑی دیر کے لیے سمندری ڈاکو کی طرح بات کی کیونکہ\nاس نے انھیں مصروف رکھا۔ اور اس طرح وہ ایک سمندری ڈاکو سے مساوات کے نظام کر رہے تھے\n اور یہ تھا، وہ بہت خوش تھے کہ وہ\nبہت اچھا وقت گزار رہے ہیں، لیکن یہ بہت اچھا کام تھا۔ وہ ٹھوس سوالات پوچھ رہے تھے اور وہ ریاضی کر رہے تھے۔ یہ شاندار ہے، ٹھیک ہے؟ اور مجھے لگتا ہے کہ ہم ہیں، یہ\nہمیں موقع فراہم کرتا ہے، آپ جانتے ہیں،\nخوشی کو واپس لانے کا، اس کے ساتھ لطف اندوز ہونے کا۔ - کیا آپ سب مجھ پر یقین کریں گے جب\nمیں نے آپ کو بتایا کہ میں نے ایک بار سمندری ڈاکو کی طرح تیار کیا تھا اور\nجب میں ایک استاد تھا اور اس طرح ریاضی پڑھاتا تھا۔ لہذا اب آپ سمندری ڈاکو تیار کر سکتے ہیں اور ریاضی کے قزاقوں کے مسائل کا سامنا کر سکتے ہیں۔ کبھی کبھی آپ کو وہی کرنا پڑتا ہے جو آپ کو طلباء کو مصروف رکھنے کے لیے کرنا پڑتا ہے،\nجو میں صرف چاہتا ہوں، ہم\nاپنے وقت کو ایک ساتھ گزارنے کے بارے میں ہیں۔ تو میں آپ سب سے سننا پسند کروں گا۔ آپ کی پسندیدہ ریاضی کی\nمشغولیت کی تکنیک اور ٹول کیا ہے اور آپ کے خیال میں کونمیگو ٹولز کا استعمال کرتے ہوئے اسے کیسے بہتر بنایا جا سکتا ہے؟ آپ کا پسندیدہ کام کیا ہے،\nاپنے استاد کی ٹوپی کو دوبارہ پہنائیں۔ آئیے گہرائی میں کھودتے ہیں، آپ کا کیا خیال ہے؟ اوہ، تم ایمان مسکرا رہی ہو، مجھے\nلگتا ہے تم پہلے جانا چاہتی ہو۔ - ٹھیک ہے، ایک بار اور انتظار کرو. ڈینیئل،\nایک بار پھر سوال کے ساتھ واپس جائیں۔ - آپ کی پسندیدہ مصروفیت کیا ہے؟ طلباء کے ساتھ ریاضی میں آپ کی پسندیدہ مصروفیت کیا تھی؟ اور AI اس کو بڑھانے میں کس طرح مدد کر سکتا ہے؟ - تو یہ مضحکہ خیز ہے 'کیونکہ یہ شاید سب سے مشکل کام تھا جو مجھے کرنا تھا، لیکن سب سے اہم چیز، اور وہ میرے اسباق کے ہکس تھے، میں کثیر ناموں کو کیسے دلچسپ بنا سکتا ہوں؟ میں یہ فوٹو سیٹ کیسے بنا سکتا ہوں؟ یہ ایسی چیز ہے جس سے بچوں کا تعلق ہے۔ اور اس لیے میں اکثر اس\nبارے میں بہت زیادہ وقت صرف کرتا ہوں کہ میں اس سبق کو کیسے متعارف کراؤں گا تاکہ بچوں کو میرے ساتھ لے جایا جا سکے۔ اور پہلی\nخصوصیات میں سے ایک جو ہم نے Conmigo کے ساتھ جاری کی تھی وہ\nتھی سبق کے ہکس۔ اور اس لیے یہ واقعی بہت اچھا لگا کہ واقعی میں جلدی سے کسی ایسی چیز کو پکڑو جو میں جانتا تھا کہ میرے طلباء پسند کریں گے۔ میرے پاس ایک سال تھا جب میں فلی میں پڑھا رہا تھا جہاں میرے بچے فلاڈیلفیا ایگلز کے جنون میں مبتلا تھے\n اور اس کو\nریاضی کی ہدایات میں جوڑنے کے قابل تھے، یہ ایک گیم چینجر ہے۔ - ہاں.  دینا، جاؤ۔  -\n گیلیلیو کے کام کا استعمال کرتے ہوئے اور لانچ کرنے کے قابل ہونا میرا پسندیدہ ابتدائی پیرابولاس اور رفتار سکھانا تھا۔ ہم نے ٹینس گیندیں شروع کیں،\nہم نے واٹر راکٹ لانچ کیے، ہم نے میدان میں ہر طرح کا سامان کیا۔\n مجھے یا تو\nIgnite My Curiosity یا کوئی اور چیز پسند ہوگی تاکہ وہ\nتاریخ کی گہرائی میں کھود سکیں کیونکہ میرے خیال میں\nتاریخ دلچسپ ہے۔  ان ریاضی دانوں کے بارے میں سب کچھ سیکھنا جنہوں نے ہمیں یہ عظیم نظریات اور نظریات دیے جو ہم آج استعمال کرتے ہیں۔ مجھے لگتا ہے کہ\n مختلف کہانیاں سیکھنے سے یہ اور بھی امیر بنا سکتا تھا۔ اور بجائے اس کے کہ میں انہیں کہانی سناؤں، میں پھر بھی کہانی سنا سکتا تھا، لیکن وہ کہانیاں سنا سکتے تھے۔ تم نے کیا سیکھا؟  آپ نے کیا دیکھا؟ آپ کے خیال میں\nاس شخص کے بارے میں کیا دلچسپ ہے؟ اب ہم بھیگتے ہیں اور میدان میں پانی کے راکٹ چھوڑتے ہیں۔ - یہ بہت اچھا ہے.  سٹیسی، آپ کے بارے میں کیا خیال ہے؟ - ٹھیک ہے، ہم یہاں مخصوص ہو رہے ہیں. تو مجھے اس کے لیے گہری کھدائی کرنی پڑی۔ میں مڈل اسکول میں\nریاضی اور سائنس کا استاد تھا۔ میں نے دونوں کو پڑھایا۔ اور اس لیے میری پسندیدہ چیز\nہمیشہ طالب علموں کو یہ بتانا تھی کہ ریاضی کس طرح حقیقی دنیا میں موجود ہے،\nتنہائی میں نہیں۔ اور اس طرح میرا پسندیدہ طریقہ جس کا\nمیں نے کبھی سوچا وہ\nلہروں، آواز کی لہروں، پانی کی لہروں،\nروشنی کی لہروں کے ساتھ فنکشنز سکھانا تھا، ٹھیک ہے؟ اور لہروں کو فنکشن کے طور پر دیکھنا اور طلباء کا\nوہاں واقعی کچھ گہرا تجزیہ کرنا۔ اور اس کا نتیجہ یہ نکلتا ہے کہ بچوں کو\n نہ صرف سائنس بلکہ ریاضی کے بارے میں یہ واقعی مکمل سمجھ آتی ہے\nکہ یہ واقعی اس سائنسی\nسمجھ اور نظریہ میں شامل ہے۔ AI میری بہت مدد کر سکتا تھا کیونکہ اس\nیونٹ اور ہدایات کے اس سیٹ کو درست کرنے میں مجھے برسوں لگے۔ اور مجھے لگتا ہے کہ کچھ ایسا ہونا\nجو میں کر سکتا ہوں، آپ جانتے ہیں، اس کے ساتھ صرف دماغی طوفان\nمجھے تمام کتابوں\nاور تمام ویب صفحات کو پلٹنے سے روکے گا، لیکن صرف معلومات کو تیزی سے درست کر سکتا ہوں تاکہ میں ان حقیقی\nدنیا کے کنکشن کو بالکل درست طریقے سے بنا سکوں۔  حقیقی دنیا پر ریاضی کا اطلاق\nواقعی میرے لیے گیم چینجر ثابت ہوتا اور\nمجھے اپنے طلباء کے ساتھ اس میں سے بہت کچھ کرنے کی اجازت ہوتی۔ - بالکل اور میں جا رہا ہوں، سنتھیا نے\nابھی چیٹ میں ٹائپ کیا ہے، میں جانتا ہوں کہ آپ اسے نہیں دیکھ پائیں گے، لیکن سنتھیا، میں\nآپ سے AI طلباء سے یہ پوچھنے سے اتفاق کرتا ہوں کہ وہ بڑے موضوع کے بارے میں کیسا محسوس کرتے ہیں اور جو کچھ انہوں نے ابھی سیکھا ہے اس کے بارے میں وہ کیسا محسوس کرتے ہیں۔\n اور انہیں تھوڑا گہرا جڑنے میں مدد کرنا۔ لہذا میری پسندیدہ حکمت عملی جب\nمیں ایک استاد تھا، میں پانچویں اور چھٹی جماعت کا خصوصی تعلیم کا استاد تھا، اور میں ریاضی میں\nلات مارتا اور چیختا چلاتا تھا کیونکہ مجھے خود ریاضی کا صدمہ تھا۔ لہذا میں نے ایک استاد کے طور پر ایک تخلیقی ٹکڑا کے طور پر یقینی طور پر اس سے رابطہ کیا. اور میں چیزوں کے بارے میں ریپس بناتا اور لفظی طور پر\nریپ لیپریچون کی طرح تیار ہوتا اور آئرش لہجے میں پڑھاتا ہوتا۔ میں نے طالب علموں کو مصروف رکھنے کے لیے کچھ بھی کیا جو میں کر سکتا تھا۔\n اور\nخانمیگو کے پیش کردہ ٹولز کا استعمال کرتے ہوئے میں نے جو کچھ پایا ہے، وہاں ایک نظم کا ٹول ہے\nجو آپ اصل میں کر سکتے ہیں، اساتذہ شاعری میں سبق کا خلاصہ کر سکتے ہیں، طلباء نظموں کا استعمال کر کے سبق کا خلاصہ کر سکتے ہیں۔\n اور میں سمجھتا ہوں کہ یہ واقعی ایک\nزبردست خواندگی کا تعلق ہے اور طلباء کو\nریاضی کے بارے میں اس تخلیقی فن کی شکل کے طور پر سوچنے کی طاقت دیتا ہے۔ جیسا کہ آپ سب لکیری\nمساوات اور کثیر الثانیات کے بارے میں بات کر رہے ہیں اور میں نے چھوٹی کثیر ناموں کو\nٹوپیوں میں ملبوس دیکھا ہے اور، آپ جانتے ہیں، بس، یہ واقعی ریاضی کو زندہ کرنے کے لیے اپیل کرتا ہے۔ تو ہم ہیں، یہ جمعہ ہے۔ آپ سب شاندار رہے ہیں۔ ہمیں بہت خوشی ہے کہ آپ\nیہاں ہمارے ساتھ شامل ہو رہے ہیں۔ ہم نے چیٹ میں لنکس پوسٹ کیے ہیں اور سائن اپ کرنے کے لیے، آپ کو\n ریکارڈنگ کی ایک کاپی کے ساتھ ساتھ بہت کچھ ملے گا۔ ہاں، میں کچھ ریاضی کی اصطلاحات استعمال کرتا ہوں۔  کیا یہ ریاضیاتی اصطلاح ہے؟ مجھے امید ہے کہ یہ بہت زیادہ ہے۔ یہ وسائل کا بھی صرف ایک بڑا لفظ ہے۔ ایک YouTube پلے لسٹ ہے جہاں آپ بالکل وہی دیکھ سکتے ہیں\nجس کے بارے میں ہم بات کر رہے ہیں۔  ہم یہاں کسی کی سکرین کو کچھ مختلف کرنے کی کوشش کرتے ہوئے دیکھنے کے بجائے آپ سب کی توجہ ہم پر اور گفتگو پر مرکوز رکھنا چاہتے تھے۔ \n لہذا\nاگر آپ مزید جاننا چاہتے ہیں تو آپ کو تمام وسائل مل جائیں گے، آپ چیک بھی کر سکتے ہیں،\nکچھ لنکس ہیں جو ہم نے چیٹ میں ڈالے ہیں، لیکن\nہم آپ کو یہ تمام معلومات ریکارڈنگ کے ساتھ ایک ای میل میں دیں گے۔\n تو آخر میں،\nایک آخری سوچ کیا ہے کہ آپ ریاضی اور AI کے تقاطع کے بارے میں سوچنا چھوڑنا پسند کریں گے ؟ حتمی خیالات، آپ سب؟ - میرا خیال ہے کہ میں صرف اتنا کہوں گا\nکہ سیکھنے کے لیے بہت کچھ ہے اور ہم سب کے پاس اس بارے میں جاننے کے لیے بہت کچھ ہے کہ\n AI کو کلاس روم میں لانا کیسا لگتا ہے۔ لیکن ابھی کے لیے، میں، آپ کو معلوم ہے، جتنا ہم صرف ایک پیر کو پانی میں ڈبو کر ایک چیز آزما سکتے ہیں اور اپنے طلباء کے ساتھ سیکھ سکتے ہیں، میرے نزدیک، یہ بااختیار بنانے کے بارے میں ہے۔ یہ ہمارے\nاساتذہ کی زندگیوں کو بہتر بنانے، انہیں\nاپنے طلباء یا ان کے خاندانوں کے ساتھ زیادہ وقت دینے کے بارے میں ہے۔ شام کی طرح جب میں ہر وقت اسکول میں ہوتا تھا،\nجیسے صرف ایک چیز کی کوشش کرنا اور اس خطرے کو لینے اور\nاپنے طلباء کے ساتھ کچھ سیکھنے کے لیے تیار ہونا، میرے خیال میں واقعی\nہم سب کے سامنے ایک چیلنج ہے۔  . - آپ کا شکریہ. ایمان، کیا خیال ہے؟  حتمی خیالات؟ - میرے آخری خیالات یہ ہیں کہ\nہر شخص ریاضی کا فرد ہے اور خانمیگو جیسا ٹول رکھنے سے\nآپ کو یہ دیکھنے کی طاقت ملتی ہے کہ \nآپ کہیں بھی ہوں، اگر آپ گریڈ لیول سے نیچے ہیں، اگر\nآپ گریڈ لیول پر ہیں یا شاید آپ'\nآگے کچھ گریڈ لیولز ہیں، \nآپ کے لیے مصروف رہنے، گفتگو کرنے اور تخلیقی ہونے کا ایک موقع ہے۔ - اور دینا؟ - میں کہوں گا، مجھے لگتا ہے کہ، آپ جانتے ہیں، ہم رہے ہیں، ہم ریاضی کے\nبہت زیادہ طریقہ کار، اتنا زیادہ روٹ بننے کے ساتھ جدوجہد کر رہے ہیں، اور ہم دیکھتے ہیں کہ اس کے نتیجے میں ہمارے طلباء کی\nمصروفیت میں کمی آئی ہے۔ وہ ریاضی کے اطلاق کو نہیں دیکھتے،\nوہ یہ نہیں دیکھتے کہ اس کا ان کی زندگیوں پر کیا اثر پڑتا ہے۔ اور مجھے لگتا ہے کہ یہ ہمارا لمحہ ہے۔ میں پورے دل سے سٹیسی سے متفق ہوں۔ ہم سب سیکھ رہے ہیں، ہم سب\nمل کر اس کا پتہ لگا رہے ہیں۔ لیکن ہمارے ساتھ شامل ہوں۔ ہمارے ساتھ اس کا پتہ لگائیں۔ آؤ\nہمارے ساتھ بات چیت کریں، آئیے اس کے بارے میں بات کریں کیونکہ ہم اس کے بارے میں بات کرنا چاہتے ہیں کیونکہ ہم چاہتے ہیں کہ ہمارے بچے وہ\nریاضی دیکھیں جو ہم سب کو پسند ہے۔ اور مجھے لگتا ہے کہ\nاسے واپس حاصل کرنے کا یہ ہمارا موقع ہے۔ ♪\nہماری ریاضی کی کلاسوں میں خوشی کو واپس لانا ♪ ♪ یہ ایک حقیقت ہے ♪ یہ میرا آخری نوٹ ہے،\nلفظی طور پر ایک نوٹ پر، ہمارے ساتھ شامل ہونے کے لیے آپ کا بہت بہت شکریہ۔ ہم آپ کی تعریف کرتے ہیں۔ ہم گفتگو کی تعریف کرتے ہیں۔ ہم\nاس چیٹ کو برآمد کرنے اور آپ کو بھیجنے کا ایک طریقہ تلاش کرنے والے ہیں۔ براہ کرم اسے اپنے دوستوں کے ساتھ شیئر کریں، براہ کرم دینا نے کہا، ہمارے ساتھ شامل ہوں۔ ہم\nان میں سے مزید گفتگو کرنے والے ہیں۔ ہمیں بتائیں کہ آپ کو کیا پسند ہے،\nآپ کو کیا پسند نہیں ہے۔ ہم فیڈ بیک کے لیے ہمیشہ کھلے ہیں۔ ہم بھی سیکھ رہے ہیں۔ ہم معلم ہیں، آپ سب۔ اور ہمیں اساتذہ سے بات کرنا پسند ہے کیونکہ آپ تمام چیزوں کے ساتھ بہت معاف کرنے والے ہیں۔\n تو ہمارے ساتھ شامل ہونے کا شکریہ۔ ہم آپ کی تعریف کرتے ہیں اور جب تک ہم\nآپ کو دوبارہ نہیں دیکھتے، سب کو الوداع۔ - [راوی]\nاس ویڈیو کو دیکھنے اور ہماری\nتدریس اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ\nخانمیگو کلاس روم میں آپ اور آپ کے طلبہ کی مدد کیسے کر سکتا ہے، اپنی اسکرین پر موجود لنکس کو فالو کریں اور\n خان اکیڈمی پر نئے مفت کورس مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں، سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola a todos, encantado de conocerlos. Mi nombre es Danielle Sullivan y estoy muy emocionada de ser la facilitadora de esta excelente conversación sobre matemáticas hoy con mis increíbles colegas. Hoy queremos hablar\nsobre la enseñanza de matemáticas, cómo ha cambiado, cómo ha cambiado\ndesde la pandemia y cómo la IA puede brindar nuevas\noportunidades para garantizar que volvamos a poner el pensamiento crítico, la comprensión conceptual y la conversación en nuestras aulas de matemáticas. Sabemos que todos ustedes tienen una gran\nvariedad de desafíos y esperamos que esta\nconversación los ayude a encontrarse donde se encuentran y hacer que\nsus estudiantes avancen. Así que ahora voy a dejar que el\npanel se presente. Sigamos adelante y comencemos con Dina. - Hola a todos, soy Dina Neyman. Dirijo el equipo de éxito de nuestro distrito\naquí en Khan Academy. Pero lo más importante es que\nhe sido educador de matemáticas durante muchísimo tiempo, ya 25 años, y de hecho\ncomencé en matemáticas en la escuela secundaria. Y amo mi escuela secundaria, pero he enseñado un\npoco de todo.  Se lo pasaré a Iman. - Gracias Dina. Hola a todos, mi nombre es Iman Howard. Soy el administrador de grupo de todo nuestro contenido STEM aquí en Khan Academy. Soy un aprendiz permanente y un\neducador en matemáticas y ciencias, y estoy muy emocionado de\nconversar con todos hoy. Te lo pasaré Stacie. - Hola a todos, mi nombre es Stacie Johnson y, al igual que Dina, también he sido\neducadora permanente en matemáticas y, al igual que Iman en matemáticas y ciencias, escuela intermedia, secundaria y primaria, dirijo nuestro\nequipo de aprendizaje profesional. Estoy muy emocionado de estar aquí para hablar con ustedes hoy sobre la enseñanza de matemáticas y cómo llegamos a los niños. - Genial, y también me olvidé por completo de hablar sobre mis antecedentes. Así que soy la anfitriona y sí, estos no son solo\nmis antecedentes literales, sí, en realidad soy de mi hermana en Arizona, pero apoyo al Noreste. Así que estoy de visita en Arizona,\nlo cual es algo emocionante. Y soy un educador de toda la vida y también enseñé\neducación especial y matemáticas en quinto y sexto grado, tanto en\nWashington DC como en el norte del estado de Nueva York. Entonces, la primera pregunta para comenzar: ¿ cuál es el enfoque de Khan Academy respecto\nde la enseñanza de matemáticas y cómo está cambiando eso\nen esta era de la IA? E Iman, quiero que\nsigas adelante y nos eches. - Grandioso, muchas gracias. Entonces, cuando desarrollamos\ncontenido para matemáticas, lo pensamos desde\nel punto de vista del rigor. Entonces eso realmente\nlo divide en tres maneras. Primero, pensamos en la fluidez procesal. Entonces, ¿puedes calcular\ncon rapidez y precisión? Y luego llegamos a la\ncomprensión conceptual. Entonces, ¿puedes acceder a conceptos\ndesde varias perspectivas para ver las matemáticas como, ya sabes, algo\nmás que, ya sabes, perdón, menos discreto\ny menos procedimiento? Y finalmente pensamos\nen ello con la aplicación. Entonces, ¿puede utilizar procedimientos y conceptos de manera flexible y resolver problemas? Y ya sabes, cualquier\nestándar determinado puede tener uno o una combinación de estos aspectos. Y a veces eso puede resultar\nmuy limitante cuando desarrollamos contenido. Entonces, cuando se trata de\nIA, una de las cosas que realmente me entusiasma es la\noportunidad de profundizar más en la comprensión conceptual\nque viene con el discurso. Y así, en lugar de que un estudiante\nsimplemente, ya sabes, tenga razón o no,\nllega la comprensión conceptual y podemos descubrir por qué las\nmatemáticas suceden de esta manera de una manera realmente individualizada. - Entonces Dina, agreguemos algo más.  ¿ Cuáles son tus pensamientos? - Sabes, creo que el\ndiscurso es realmente una de las piezas más importantes que la IA aporta y agrega a la instrucción matemática. Como docente de aula, yo siempre, mis alumnos siempre trabajaban en grupos. Mi salón de clases nunca estuvo en silencio. Siempre estábamos hablando ruidosamente\nsobre matemáticas, haciendo proyectos,\ncuestionando nuestro pensamiento y explicando nuestro razonamiento. Y creo que,\nen general, muchas de las influencias tecnológicas\nen las aulas han hecho que la enseñanza de matemáticas se\nvuelva más procedimental.  ¿ Puedes, ya sabes, puedes\nhacer este cálculo?  ¿ Puedes resolver esta ecuación?  ¿ Puedes hacer los pasos\nen un orden particular? Ni siquiera necesariamente,\nhay opciones, ¿verdad? Hay diferentes caminos\nque podemos tomar para llegar a la respuesta matemática correcta. Y los estudiantes a menudo tienen una muy buena razón y piensan sobre las cosas de manera diferente. Y eso se suma a todo nuestro razonamiento y a todas nuestras\nherramientas matemáticas cuando podemos escuchar cómo los niños piensan sobre las matemáticas y la forma en que\nidean el siguiente paso o su estrategia o por qué abordan un\nproblema de cierta manera. Y creo que con la IA, cuando los\nestudiantes tienen que hacer preguntas, cuando tienen que poder decir, no entiendo esta parte\nde la ecuación, no es, no entiendo el\nconcepto completo, es que no entiendo el concepto completo. No entienden cómo pasar\nde un paso al siguiente o tienen que pensar de forma más crítica. Y realmente construye ese\nconocimiento conceptual. Pero creo que ese cuestionamiento\nes una gran parte de eso. - Entonces, Stacie, ¿cómo estamos en Khan Academy ayudando a los profesores a\ncomprender todo esto? - Sí, quiero decir, creo que incluso antes de pensar en cómo lo estamos entendiendo,\n mientras pienso en el discurso y la comprensión conceptual,\nuna de las cosas de las que estoy más orgulloso\nde Khan Academy es dónde están los estudiantes.  haciendo eso.  ¿De qué estamos hablando?  ¿En qué estamos construyendo la\ncomprensión conceptual? Y el hecho de que en\nKhan Academy creemos que sabemos que cada estudiante\npuede alcanzar el nivel de su grado. Y creo que lo que es realmente\nimportante decir aquí es que todos nuestros estudiantes tienen brechas de aprendizaje. Todos vienen\ncon estos agujeros, ¿verdad? Es una especie de\ncomprensión de las matemáticas como un queso suizo y la forma en que realmente construimos una\nimplementación enfocada en no condenar a los niños a trabajar por debajo del\nnivel de grado durante el próximo año, de modo que simplemente estemos perpetuando esa brecha. Pero ponerlos al nivel de su grado, sabiendo y creyendo que ahí es\ndonde pueden lograr el uso de la IA para hacer parte de ese andamiaje. Porque, por supuesto, el\nmaestro es el mejor recurso, por supuesto, el maestro es\ndonde deberíamos apoyarnos y los estudiantes siempre deben\nacudir al maestro primero, pero el maestro no puede\nhablar con 35 niños a la vez o más, ¿verdad? Entonces, mientras esperamos al maestro, la IA puede estar ahí para apoyar a\nlos niños para que no se queden estancados, no lleguen al punto de frustrarse y levantar las\nmanos y renunciar, ¿verdad? Porque lo único que eso hace es\nperpetuar esas brechas de aprendizaje y agrandar los agujeros. Así que creo que lo más\nimportante que podemos decir aquí es cómo mantenemos a los estudiantes en el nivel de grado y cómo garantizamos que ahí\nes donde aprenden y progresan a partir\nde ahí; simultáneamente podemos regresar y llenar algunos  de esos huecos\nmientras continuamos trabajando con los estudiantes a nivel de grado. Y en cuanto a cómo\nconseguir que los maestros lleguen allí, creo que es un proceso paso a paso, ¿verdad? Nuestros maestros tienen\ndemasiadas cosas que hacer todo el tiempo,\ndemasiadas tareas administrativas, demasiadas cosas que no tienen que ver con enseñar a los niños. Entonces la pregunta es: ¿cómo\nescuchamos a los docentes acerca de la capacitación que necesitan?  ¿ Cómo recopilamos información sobre el apoyo que necesitan? Y luego diseñar\nprogramas de capacitación en respuesta a eso, en lugar de simplemente brindarles\nun conjunto de apoyo y capacitación y esperar que\neso marque la diferencia. - Absolutamente. Y todos pueden publicar\npreguntas en el chat. Tenemos algunas preguntas guiadas\nque habíamos planeado con anticipación, pero definitivamente quiero asegurarme de que tengamos la capacidad\nde responder sus preguntas. Y me encantaría que\ntodos comenzaran a hablar y responder también en el chat si eso les resulta demasiado abrumador. Sólo quieres aparecer y escuchar, genial. Si quieres interactuar, genial. Hay muchas\nmaneras diferentes de ser hoy en día, pero tendría curiosidad, como si Matthew acabara de escribir\naprendizaje personalizado.  ¿ Qué están pensando? Como escuchó a Dina, Iman y Stacie compartir algunos de los desafíos que está enfrentando. Entonces, piensa en eso y comenzaremos a\nprofundizar un poco más en esto, ¿ verdad? Al igual que las matemáticas, normalmente se\npiensa en una materia muy concreta y objetiva. Y por mucho que hablemos de ello, a veces no vemos mucho enfoque en el proceso y el enfoque, y a veces está bien o mal.  ¿ Tiene la IA el potencial\nde influir en eso? Imán, ¿qué piensas? - Absolutamente.  Ya sabes, gran parte de nuestro\nplan de estudios a veces se centra en esa fluidez procesal. Entonces, cuando estás en el\naula ejecutando esto, le haces una pregunta a un estudiante y no puede obtener la respuesta correcta. Y ahora, de repente,\nel niño dice: \" No soy una persona de matemáticas, lo entendí mal\". Y luego termina la conversación y tal vez no vuelvan a\nlevantar la mano. Sin embargo, cuando presentamos\nalgo como Conmigo y AI, no solo si me\nequivoqué, no es un cierre, sino que ahora existe la oportunidad de decir, bueno, tengamos una conversación. Averigüemos por qué sucedió eso. Y ahora estamos entrando en\nesa comprensión conceptual. Y ya sabes, alguien\nen el chat mencionó el aprendizaje personalizado. Vamos al aprendizaje personalizado. Muchos de nosotros hemos estado en\naulas donde la proporción era de uno a 35, y tenemos algunos estudiantes\nque están al nivel de grado, unos dos años por detrás\ny unos dos años por delante. Y ahora tenemos esta oportunidad de conocer a todos en su punto de aprendizaje. Bien o mal, tenemos una manera de personalizar su instrucción y llevarlo al nivel\nque sabemos que puede alcanzar, que es el nivel de grado. - Adelante, Dina. - Ya sabes, es aprendizaje personalizado, pero siento que\nsiempre ha existido este deseo y objetivo\npor parte de los profesores de secundaria de hacer realidad el aprendizaje en grupos pequeños. Y se siente imposible. Y se siente muy desafiante porque tienes toda la razón. Tienes 36 cuerpos en tu salón de clases y quieres trabajar con este\npequeño grupo de tres o cuatro que necesitan atención. Pero, ¿qué pasa en el momento en que te sientas, todas esas manos se levantan? Te necesito, te necesito, tengo una pregunta. No sé qué hacer a continuación. Y creo que en ese momento en el grupo pequeño, Lynn comentó en el chat la flexibilidad en la enseñanza. Y creo que la IA nos da\nla posibilidad de hacer cosas que antes eran tan\ncomplicadas y difíciles. Creo que podemos impartir esa\ninstrucción en grupos pequeños porque la IA puede interactuar y, ya sabes, hacer que los estudiantes\nprogresen en su aprendizaje y sigan avanzando. Y creo que en realidad les\nda a nuestros hijos más tiempo con el maestro en la forma\nque realmente lo necesitan. No se trata tanto de que el maestro se ponga de pie y entregue a\ntodo un salón de clases a la vez, sino más bien de que el maestro sea\ncapaz de satisfacer esas necesidades justo donde están, y\nrealmente brinde a los estudiantes la instrucción, la explicación y la orientación dónde\ny cómo  necesito. - Sí. Entonces, Dina, eso me hace pensar en mi parte favorita de\nestar en el salón de clases. No sé si habéis visto un vídeo de YouTube que circulaba hace unos años y que se\nllamaba Mi favorito no, ¿verdad? Y se trataba de observar la forma en que los estudiantes habían resuelto un problema y encontrar las respuestas incorrectas,\npero encontrar la belleza y la precisión en esas respuestas incorrectas. Y mi parte favorita de\nenseñar matemáticas fue escuchar a los estudiantes articular la forma en que abordaban un problema o cómo pensaban\nal respecto, ¿verdad? Para sus compañeros, para mí, en\nesos entornos de grupos pequeños, y esa también es una de las cosas más difíciles.  ¿ Cómo puedes estar ahí para\nescuchar a todos los niños?  ¿ Cómo puedes realmente estar ahí para internalizar lo que están pensando? Porque como profesores de matemáticas, es difícil enseñar una respuesta incorrecta. Sí.  Ciertamente podemos enseñar\na comprender un concepto erróneo, ¿verdad? Entonces, cuando pienso en\nIA, una de las cosas que desearía haber tenido en mi\nsalón de clases era esta capacidad de regresar y mirar las transcripciones o las conversaciones\nque un estudiante está teniendo con un chat bot para identificar cómo están procesando.  ¿esta informacion?  ¿ Están estancados? Y simplemente dicen,\nno lo sé, no lo sé.  ¿ O realmente están intentando procesar esto?  ¿ Y qué tipo de\npreguntas hacen? Porque para mí, si puedo\naprovechar esa información, si puedo obtenerla de toda mi clase,\nlo cual no puedo hacer simplemente caminando escuchando\na todos, ahora puedo enseñar sobre los conceptos erróneos de mi clase y realmente aprovechar lo\nque  saben aprovechar lo que aún no saben. - Entonces, para unir lo que acaba de decir y responder\nalgunas de las preguntas que surgen simultáneamente, un par de personas han preguntado sobre Khanmigo, ¿ solo les da respuestas a los estudiantes? O si los estudiantes son realmente\nun tutor individual, pero si los estudiantes\nestán realmente desmotivados, ¿ cómo funciona Khanmigo para ser ese maestro cuando el maestro\nno puede clonarse a sí mismo de 35 maneras?  ¿ Bien?  ¿ Y cuántos de ustedes sienten\nque no tienen suficiente tiempo para enseñar matemáticas?  ¿ Cualquiera?  ¿Alguien en la habitación? Exactamente.  Sí. Entonces Iman, ¿quieres\nempezar a hablar de eso? - Si absolutamente. Entonces, ya sabes, similar a lo que haría un buen maestro\nes que cuando un estudiante obtiene una respuesta incorrecta, no\nsimplemente le escupimos la respuesta correcta y nos marchamos. Les hacemos una serie de preguntas estructuradas\nbasadas en la respuesta que nos dieron. Y ahí es donde se\nve que el diálogo entre Conmigo y los estudiantes es que, oye, eso no está del todo bien. Hablemos de dónde\nextraviaste ese decimal. Bajemos y trabajemos juntos de un lado a otro para llegar a la respuesta correcta. Y ahora que lo tienes,\ndéjame darte otro que puedes probar por tu cuenta. Bien, similar a lo que\nharías tú, pienso en Conmigo como asistente de enseñanza, ¿no? Y aunque puedo\nfacilitar aquí, es un grupo pequeño, sé que mis estudiantes aquí no están comprometidos. Y cuando se trata de la gestión del aula, necesito que mis alumnos participen. - Y si.\n- ¿Puedo contestar, Cynthia? Haz una pregunta. Creo que se basa en\nesto. Dijo que descubrió que la IA es útil, pero los\nestudiantes no siempre están motivados o seguros de cómo usar el recurso. Y preguntó: ¿deberían los\ninstructores enseñar a los estudiantes cómo utilizar los recursos de IA, incluida la enseñanza de ejercicios para utilizarlos? Y creo absolutamente,\ncomo con cualquier herramienta, como con una calculadora gráfica,\ncon, ya sabes, con la forma en que enseñamos rutinas en nuestro\nsalón de clases, creo absolutamente que debemos enseñar a nuestros\nestudiantes cómo usar la IA, qué  las mejores prácticas son. Creo que comienza con el modelaje. Si fuera mi salón de clases,\ncomenzaría por abrirlo y charlar yo mismo, hacer preguntas y, ya sabes, mostrarles a los\nestudiantes cómo se ve. Y sé que acabamos de\nlanzar, oh Dios, Iman, probablemente incluso puedas decir, creo que fue en las\núltimas dos semanas, en realidad. Lanzamos nuestro curso de IA para estudiantes.  ¿ Está bien? - Seguro que lo hicimos. Y creo que es un buen aviso porque, ya sabes,\nescuchamos este término IA, IA, y es muy importante decirles a nuestros estudiantes qué es un modelo de lenguaje grande.  ¿ Qué es esto que está interactuando?  ¿ Sabe todas las\nrespuestas?  ¿Qué puede hacer?  ¿ Qué no puede hacer? Y por eso tenemos un\ncurso, IA para la educación, que todos pueden consultar para asegurarse de que sabemos cómo usarlo como una herramienta para mejorar nuestro aprendizaje,\nporque eso es lo que es. - Absolutamente. Y hablando de herramientas y\naprendizaje, estamos aprendiendo que no configuramos\neste seminario web de la manera más interactiva. Así que estamos haciendo lo mejor que podemos. Vemos sus preguntas,\nvemos sus comentarios, así que seguiremos\nasegurándonos de responder todo. Y esta es una experiencia de aprendizaje. Así que no sé si pueden\nver las respuestas de los demás, pero vamos a mantener\nla conversación. Sigue hablando con nosotros,\ntraeremos, resaltaremos cosas. Entonces, Stacie, ¿qué\npiensas sobre las cosas que compartieron Iman y Dina? - Sí, estoy de acuerdo con todo eso. Hubo un comentario en el\nchat sobre enseñar a los estudiantes a dar me gusta, ¿cómo se profundiza realmente, cómo se entrena a los\nestudiantes para que hagan mejores preguntas? Y creo que en realidad es una\npregunta para nosotros como adultos, como líderes en la sala,\nasí como como estudiantes. Y creo que lo importante que hay que\ndecir en voz alta es, en el espíritu de todos\nnosotros, aprender que los profesores y los estudiantes están aprendiendo\njuntos cómo utilizar esta nueva tecnología, ¿verdad? Y que cambiemos esta mentalidad y que no sea un motor de búsqueda. Entonces, una de las cosas que hemos\nvisto que es realmente exitosa es practicar hacer\nla pregunta a otra persona antes de enviarla a Conmigo\no a un chatbot, ¿verdad? Porque la gente piensa, y los estudiantes en particular,\nellos piensan, oh, hay una cierta manera en que\ntengo que decir esto, ¿verdad? Escuchamos mucho sobre indicaciones o hay un\nlenguaje particular que tengo que usar. Y realmente es conversacional. Entonces, cuando, como maestro, le\ndices algo al estudiante como, bueno,\nbueno, ¿qué le dirías al niño que está a tu lado, verdad?  ¿ O qué me dirías? Bien, ahora simplemente escriba\neso, es una especie de cambio de mentalidad porque\ncreemos que es un proceso realmente formal , pero brindarnos\nese entrenamiento a nosotros mismos y a nuestros estudiantes es realmente importante. Y simplemente mantenlo conversacional. Y si no le gusta la respuesta, diga: No estoy seguro de eso.  ¿ Puedes decirlo de otra manera? O no me gusta esa respuesta. Y retroceder de la misma manera que lo haría si\nestuviera conversando con otra persona. - Y creo que ese podría\nser un miembro adicional de tu grupo, ¿verdad? Si los niños tienen que ponerse de acuerdo\nsobre qué pregunta hacer, Dios mío, eso realmente\ngenera un gran discurso cuando solo pueden hacer una y tienen que descubrir\ncuál es la siguiente perfecta. - Sí. Y John,\nte vemos escribiendo allí, como si John estuviera haciendo\ncosas realmente geniales con sus alumnos que, incluso si hay\nrespuestas correctas, les dice que no solo está interesado\nen la respuesta correcta, sino también en cómo resolvieron y qué pasos. Pero John preguntó, ¿cómo\nayuda la IA también a los estudiantes que tienen IEP o 504 u otras\ndiscapacidades o adaptaciones de documentación? Y yo agregaría: ¿cómo\ncreen que ayuda que los estudiantes que puedan ser tímidos o tengan algún trauma matemático o realmente tengan muy poca confianza en las matemáticas? - Entonces diré que mi esposo\nes un educador de ESOL, habla inglés de otros\nidiomas en algunos estados, yo vivo en Florida, en algunos estados lo llamamos ELL, estudiantes de inglés. Pero mi esposo\nlo usa, usa la tecnología para ayudar a los estudiantes\nen su salón de clases a pensar en preguntas antes de tener que\nhacerlas públicamente, especialmente si tienen esa ansiedad y simplemente no están seguros. Al tomarse un minuto y tener esa oportunidad de interactuar, puede darles la oportunidad\nde sentirse más seguros de saber si están en el\ncamino correcto para recibir comentarios antes de hacer una pregunta o, ya sabes,  Si piensas en\ncuando los profesores están enseñando, si hay una palabra y\nno saben lo que significa, pueden escribirla rápidamente. Pueden preguntar rápidamente,\nconectarla y obtener un ejemplo o descubrir dónde se\naplica.  la vida real, ¿verdad? Porque eso es algo\nfundamental para establecer conexiones con el contenido. Creo que le da relevancia a nuestro contenido. Creo que les da a los estudiantes la\noportunidad de preguntar de una manera que no sea\namenazante o aterradora. Les da la oportunidad de explorar realmente el contenido de forma segura. - Imán, ¿qué opinas de eso? Sí, estoy de acuerdo con todo lo que\ndices, Dina. Y ya sabes, he enseñado a\nestudiantes que tenían IEP y, a veces, escribir\nsolo era la limitación. Y una de las cosas que\nrealmente disfruto de Khanmigo es poder hablar y\nhacer preguntas. Y si tienes auriculares,\nConmigo ahora tiene voz. Entonces, esto puede ser una reunión uno a uno\nen la que, oye, Conmigo, necesito ayuda aquí y luego seré el único\nque escuchará la respuesta. Y eso puede ser realmente\nfundamental para lograr que un estudiante, Dina, combata\nparte de ese trauma matemático y realmente se asegure de que\nsatisfagan sus necesidades. - Sí, y creo, ya\nsabes, volviendo a los estudiantes multilingües, también la idea de que Khanmigo ahora mismo puede conversar y tener ese diálogo en inglés , español y portugués. Por lo tanto, también es un espacio seguro donde los\nestudiantes no tienen que quedarse atrás en el aprendizaje y el contenido de matemáticas mientras\nsimultáneamente adquieren confianza y dominio del inglés. Entonces, de acuerdo\ncon todo lo que se ha dicho,\ncreo que es un espacio seguro para que los estudiantes prueben sus\nideas sin correr riesgos con los que quizás no se sientan cómodos todavía. - Sí, y creo que otra forma en la que realmente puede ayudar es\nayudar a los profesores a elaborar lecciones que satisfagan las necesidades de los\nestudiantes con los que trabajan. Y poder ayudarlo a\nadaptar las lecciones de manera más rápida y eficiente que\nnunca. Entonces, poder decir, ya\nsabes, tengo estudiantes que realmente disfrutan de este o aquel tema, y ​​poder crear\nlecciones en torno a él, poder tomar contenido y\nanclarlo en algo. Si a los estudiantes les encanta hacer caminatas en las montañas, porque estoy mirando los\nantecedentes de Danielle, si a los estudiantes les encanta hacer caminatas, tengamos una conversación sobre caminatas. Y simplemente creo que\ntambién equipa a los profesores para que puedan diferenciarse\ncomo nunca antes lo habíamos hecho. - Así que quiero profundizar un poco en eso porque hay algunas preguntas que\nsurgen en torno a los parámetros sobre lo que sucede si los niños se salen del tema, pero también, no quiero\nsalirme del tema yo mismo, pero quiero, tú empezaste, tú.  Se aludió ahora a algunas de las herramientas docentes. Creo que pasamos mucho\ntiempo hablando sobre cómo la IA se centra en\nla conversación de los estudiantes, pero ¿cómo ayudamos a los educadores, porque nosotros planteamos los problemas, verdad? Tienes un ser humano con muchos otros humanos en el\naula con muchas necesidades, especialmente después de una pandemia. Hemos visto tantas lagunas de aprendizaje. Pero todos en\neste seminario web, seamos realistas, hemos tenido lagunas durante mucho tiempo, ¿no? En matemáticas.  Sí. Y creo que todos realmente se están\nmoviendo en la dirección correcta, comprometidos e incluso recordando lo que Stacie dijo al principio, como las altas expectativas,\ncreer que todos los estudiantes pueden y asegurarse de que todos los estudiantes\ntengan acceso equitativo al contenido de su grado. Entonces mi pregunta es, ¿cómo\npueden las herramientas para profesores ayudar también a resolver este problema? Dina, ¿quieres\necharnos y luego lo haremos? - Seguro. Sí, creo que Amy hizo una pregunta. Quiero usar la pregunta de Amy\npara comenzar.  ¿ Hay formas de establecer parámetros con IA para mantener a los estudiantes dentro\ndel área de contenido en lugar de en un foro abierto? Y sé que hubo\notra pregunta sobre ¿ cómo evito que la IA\nsimplemente dé las respuestas? Y creo que algo con lo\nque realmente nos hemos comprometido en Khan Academy es crear Khanmigo para que la IA\nsea un espacio seguro para los estudiantes. Hemos construido con moderación. Khanmigo no les dará a los estudiantes\nla respuesta si la solicitan, dirá claramente:\nNo puedo darte la respuesta, pero puedo entrenarte. Y lo será, ya sabes, lo será, los mantendrá encaminados. Si estás trabajando en un problema de matemáticas y dices, quiero hablar\nsobre la Revolución Francesa, Khanmigo dirá, eso es fabuloso, pero este no es el\nlugar ni el momento para eso. Y creo que eso es realmente genial. Ayuda a mantener a los estudiantes enfocados en términos de las herramientas del maestro. Creo que ese es el número uno.  ¿ Te imaginas si nuestros hijos se\nmantuvieran concentrados durante toda la clase, qué fabuloso sería?  Lo digo como\nprofesor de secundaria, ¿verdad? Enseñé en la escuela secundaria, así que\nsiempre fue como, ya sabes, mucho movimiento, mucha actividad, tratando de mantenerlos enfocados en mí. Entonces todo comienza ahí, comienza ayudando a mantener a los estudiantes\ninteresados, manteniéndolos enfocados. Y luego creo que\ntambién se trata de, ya saben, como profesor de aula, solía mirar, les dije que he sido\neducador de matemáticas desde siempre, todos ustedes.  Se trata de no tener que\nbuscar, yo solía buscar libro tras libro, buscando la lección adecuada, el recurso adecuado, los materiales adecuados. Y luego, ya sabes,\nsurgió Internet. Y ya sabes, teníamos Google\ny teníamos todas las cosas y luego tenía 57.000\npestañas abiertas mientras buscaba algo con lo que planificar la lección. Creo que esto ahorra tiempo porque me da\nalgo de alta calidad. Puedo hacer esos ajustes rápidamente. Puedo crear recursos para satisfacer\nlas necesidades de mis alumnos que son específicos de mis\nalumnos muy, muy rápidamente. Y puedo crear tareas realmente buenas y\nricas, lo cual, nuevamente, me refiero a la\nenseñanza basada en problemas del proyecto y a poder crear\nesas tareas ricas rápidamente. Eso es todo. - Y no solo pienso en\ncrear tareas ricas, sino en qué tan rápido puedes\ndiferenciarlas, ¿verdad? Quiero decir, solíamos pasar\nhoras haciendo esta gran y rica tarea para todos los niños. Ahora podemos hacer eso en\nun período de tiempo tan corto que también puedo hacer otras cuatro o cinco versiones que respondan a las necesidades individuales de\npequeños grupos de mis estudiantes o tal vez incluso de un\nestudiante individual en literalmente solo unos minutos, ¿verdad?  ? Podría contarlos con una mano y ahora tengo recursos diferenciados de alta calidad\npara mis alumnos . - ¿Tienes algo más que\nagregar Iman, sobre ese tema? - No, no podría estar más de acuerdo. Sabes, cuando pienso en\nalgunas de las herramientas para profesores, pienso: bueno, ¿ cuáles me hubieran\nencantado cuando enseñaba? Y la herramienta para actualizar mis conocimientos\nes muy importante porque, como profesora, creo que\nel tiempo era una mercancía para mí. Siento que nunca había tenido suficiente tiempo y había momentos en los que, ya sabes, necesitaba apoyo con la planificación de mis lecciones o uno de mis colegas estaba fuera y me decía, oye, necesito que enseñes este octavo grado.  curso de matemáticas, pero estoy enseñando seis.  Por eso, es fundamental tener una herramienta que me permita ponerme\nal día rápidamente y no tener que hacer que los\nestudiantes se atrasen aún más. Entonces, ya sabes, solo pienso en las\nformas en que puedo individualizar mi aprendizaje, pero también como maestro\npodría mantenerme actualizado sobre lo que mis alumnos necesitan. - Sí, analicemos\neso un poco más porque estás hablando\nde las herramientas para profesores. Entonces, Stacie, si estuvieras\nen el aula hoy, ¿a qué función de IA recurrirías?  ¿En qué te hubieras apoyado más? - Esta siempre es una\npregunta interesante porque la gente me mira un poco rara. Estoy absolutamente enamorada\nde la herramienta de rúbrica, que no es algo que hacemos\nen las aulas de matemáticas, ¿verdad?  ¿ Quién usaría el profesor de matemáticas como rúbrica? Los utilizo todo el tiempo. Y fue una\ncurva de aprendizaje muy interesante para mí porque a medida que avanzaba en\nmi programa de preparación docente, hicimos todas nuestras rúbricas\nbasadas en temas de ELA y humanidades, ¿verdad? Y cuando comencé a enseñar,\nestuve algunos años en ello y me di cuenta de que necesitaba que los estudiantes comprendieran mejor lo que se les pedía que hicieran,\ncómo debían demostrarlo y cómo debían poder verbalizarlo o comunicarlo.  después del hecho. Entonces, como estaba mucho\nmás concentrado en el proceso, usaba rúbricas y me tomó una eternidad porque no existen rúbricas\npara resolver sistemas de ecuaciones con\nnúmeros racionales y hacerlas todas. Así que hice uno\nhace un par de semanas con Khanmigo. Me tomó menos de cinco minutos y fue tan explícito para los niños que si estuviera en el aula\nen este momento con esa herramienta, simplemente trasladaría totalmente la responsabilidad del aprendizaje al estudiante. Saben lo que se espera. Ahora se centran\nen el proceso en lugar de en esa calificación con letras que no\nles enseña nada, ¿verdad? Ahora están realmente en\nese estado metacognitivo en el que piensan\nen ¿qué estoy aprendiendo?  ¿ Cómo lo muestro y\ncómo lo comunico? - Iman ¿y tú?  ¿Cuál es tu favorito? - Mi favorito tiene que ser el nivelador. Entonces, la herramienta de nivelación que\nle permite tomar cualquier texto y nivelarlo de diferentes maneras para diferentes niveles de lectura\nes una de mis herramientas favoritas porque solía tener\nestudiantes que tenían IEP y me decían,\nuno, Sra. Howard, yo  No entiendo lo que dice este texto. O el texto que estoy dando\nparece un trabajo infantil. Escuchaba eso todo el\ntiempo de mis alumnos. Entonces, esta idea de que\ntodos puedan acceder a la misma información pero diseñada\nde manera que sea solo para ti, es un punto de inflexión para mí. Y ese sería mi número uno. - Y antes de Dina, te dejo\nresponder, yo también quiero trabajar como ex\nmaestra de educación especial, en realidad hay una herramienta para crear IEP.  ¿ Cuántos de los que ven\nesto alguna vez han tenido dificultades con los objetivos del IEP y con el seguimiento de esos objetivos?  ¿ Cualquiera?  Es una broma.  Si eso es. Y luego mantener a los estudiantes\ninteresados ​​y encaminados. Así que estaba presionando a Khanmigo para que me diera\nresultados de responsabilidad medibles y muy específicos para los objetivos matemáticos del IEP. Y cuando lo presionas y lo presionas, te brinda exactamente lo que necesitas. Entonces esa cosa, si hubiera tenido\neso, me habría ahorrado horas de mi vida, horas. Dina, ¿y tú? - Bien, tengo un\nhijo de secundaria que es una persona muy curiosa y quiere saber\ntodo sobre todo. Entonces mi favorito es Ignite my Curiosity porque me hizo preguntas sobre cosas de las que no tengo idea. Y he aprendido que Khanmigo es mi mejor\namigo cuando se trata de responder sus preguntas\nsobre cómo funciona el mundo y cómo se ven las cosas\nen áreas temáticas que son, ya sabes, su mundo de la ciencia\nes grande, enorme, masivo e incluso  Aunque mamá es una chica de matemáticas y yo tengo muchas\nciencias, definitivamente creo que, como madre, Ignite\nMy Curiosity me ha salvado más de una vez. - Sí, puedo ver que soy alguien que se metió en problemas en la\nescuela de la iglesia por preguntar dónde estaban los dinosaurios\ncon Adán y Eva.  No sé si eso se relaciona con alguien más que con la curiosidad. Es importante\ncontinuar asegurándonos de aprovechar la curiosidad de los estudiantes. Así que están\nsurgiendo algunas preguntas logísticas. Alguien preguntó sobre\nel tiempo para adaptar todo. ¿ Pueden hablarnos sobre cómo incorporamos algunas de estas herramientas? Como si estuviéramos hablando de que las\nherramientas para profesores pueden ahorrar tiempo, pero quiero retroceder un poco a las herramientas de Khanmigo para estudiantes y, si realmente, ¿alguien puede\nexplicar la diferencia entre nuestros cursos y Khanmigo? Porque creo que no sé\nsi realmente empezamos con eso. Entonces, ¿quién quiere comenzar simplemente dándole a la gente la configuración del terreno? - Puedo hacerlo.\n- Gracias Dina.  ¡ Vendido! - Tenemos cursos en Khan Academy.  Lo hemos hecho, y lo creas o no, escuchamos a menudo, ya\nsabes, Khan Academy, eso es matemáticas y ciencias.  De hecho, también tenemos ELA,\ntenemos estudios sociales, tenemos habilidades para la vida, tenemos preparación universitaria y profesional,\neducación financiera, IA para educadores, IA para estudiantes. Tenemos historia del arte, tenemos\nmuchos cursos diferentes y con todo el contenido de nuestros cursos surgen diferentes formas de aprender. Ofrecemos videos, ofrecemos lecturas guiadas. Ofrecemos ejercicios para\npracticar lo aprendido. Entonces, hay algo completamente diferente,\nhay un conjunto completo de contenido que son solo esos cursos\nque se pueden usar de acuerdo con lo que se enseña todos los días. Tenemos trabajos de curso que puedes usar, puedes usar nuestros videos con toda la clase, puedes hacer que los estudiantes\nlos vean individualmente. Pero también tenemos las\nherramientas para estudiantes de Khanmigo, que son una forma realmente agradable de diferenciar su instrucción. Una de mis piezas favoritas como profesora. Siempre me gustó mucho la enseñanza de vocabulario explícito, ¿verdad? Incluso antes de Hattie dije que era como una de esas mejores prácticas, como que la\nenseñanza de vocabulario explícito siempre fue algo importante para mí.  Por eso me gusta que\ntengamos algunas herramientas de vocabulario donde los estudiantes pueden\npracticar su vocabulario de matemáticas. Yo lo usaría, creo que\npuede encajar en tu enseñanza de muchas maneras diferentes. Puede involucrar a los estudiantes con\ndiferentes tipos de calentamientos. Tienes contenido para darles práctica, tienes oportunidades\npara que obtengan conjuntos de problemas de práctica en los que puedan trabajar y tienen que explicar su razonamiento y Khanmigo los entrenará. Entonces, creo que cuando preguntas cómo\nencaja esto en tu enseñanza, diría que depende\nde tu estilo de enseñanza, depende de lo que quieras hacer. Pero definitivamente tenemos suficiente contenido para encajar en una rutina semanal. - ¿Alguno de ustedes quiere agregar\nalgo más a eso? - Creo que ella lo encerró. Estoy de acuerdo con todo eso. Y Khanmigo, ¿es una\nbonita capa arriba a la derecha? Porque está ahí para apoyarte en\ntodo momento. - Entonces quiero volver a qué tipo de futuro estamos construyendo\nmatemáticamente con nuestros estudiantes. Y me encantaría saberlo, y me\nencantaría que todos los que vean esto piensen en lo mismo. Entonces digamos que tienes una varita mágica, ¿verdad? Porque obviamente tenemos una herramienta asombrosa, pero no es una varita mágica.  ¿ Qué cambiarías o qué tipo de futuro te gustaría ver cuando pensamos en la enseñanza de matemáticas? - Sí, entraré aquí y diré que mi varita mágica cambiaría el espíritu con el que\nabordamos la enseñanza de matemáticas, especialmente con los estudiantes más jóvenes. Porque ya sabes, si piensas\nen las matemáticas avanzadas y las matemáticas de los matemáticos, para mí es realmente una materia creativa.  Se trata de construir\ncomprensión del mundo.  Se trata de explorar cosas que aún no conocemos ni entendemos. Pero a menudo enseñamos matemáticas como si\nno hubiera creatividad, ¿verdad? Y creo que la IA realmente puede\nayudarnos con ese cambio en el que, en lugar de pensar las\ncosas de una manera, la IA puede ayudar a los estudiantes a pensar en los problemas\ndesde una perspectiva diferente o a explicarlos de manera diferente\no con un enfoque diferente. Y como profesor, eso es\nmuy difícil de hacer con 35 o más seres humanos en una sala, ¿verdad? Entonces creo que ahí es donde la IA puede entrar y ayudarnos a tener\nesas conversaciones con los niños y profundizar realmente en la exploración. Para mí, ese es el verdadero\nespíritu de las matemáticas que a menudo no tenemos\ntiempo para aprovechar. - Absolutamente. Siento que si tuviera una varita mágica, no habría un momento decisivo en el que alguien decidiera\nsi era bueno o malo en matemáticas, todos se\nverían a sí mismos como una persona matemática. Y aprenderían que cuando,\nya sabes, cometo un error, no es como decir oh no, es tener una\nconversación, eso fue divertido.  ¿ Qué estás pensando? Y todos se sentirían capacitados para tener estas charlas sobre cómo podemos aprender de los conceptos erróneos, cómo podemos tener un discurso matemático. Y lo que me encanta de la IA es\nque nos permite hacer precisamente eso, que aprender de los errores\nes en realidad una oportunidad. - ¿Y tú Dina?\n- Creo que la belleza de las matemáticas está en la\nforma en que son parte de nuestro mundo.  Es que , ya sabes, dijo Einstein, las matemáticas son el lenguaje con el que Dios ha escrito el universo. Está ahí afuera. Está en todos lados donde miramos\ny en todos lados donde lo vemos. Y es una pena que, para la mayoría de los estudiantes, se reduzca a sólo un conjunto de ecuaciones y pasos procedimentales. Y creo que, ya sabes, estar de acuerdo con mis increíbles colegas aquí, abre el mundo\nde lo que realmente son las matemáticas y lo que deberían ser para que\nlos estudiantes puedan ver, ya sabes, tal vez no soy muy bueno en geometría.  , pero sabes qué, me encanta el álgebra. Me encanta encontrar generalizaciones y descubrir cómo pueden funcionar las ecuaciones. O tal vez no soy una persona de álgebra,\nsoy una persona de geometría. Hay diferentes maneras de\namar las matemáticas y de involucrarse con ellas. Y creo que puedes verte a\nti mismo en eso cuando tienes la oportunidad y cuando se te presentan las\nmatemáticas como algo mucho más grande que una serie de pasos. - Y estoy de acuerdo con todos, en\ntodo lo que dijiste y en apoyar\nmuy de cerca a los educadores de matemáticas durante, Dios, los últimos 10 años de mi\ncarrera, también quiero empoderar, mi varita mágica sería\nempoderar a cada educador de matemáticas como dijo Iman,  Para no sentirme como si fuera un estudiante, incluso algunos maestros de escuela primaria\na veces sienten que no pueden enseñar matemáticas o que\nevitan las matemáticas o que ellos mismos tienen un trauma matemático. Tengo un trauma matemático.  ¿ Alguno de ustedes tiene un trauma matemático? Como si supiera exactamente cuándo sucede. Entonces es saber que se puede, es saber que es lo que es posible\ny encontrar la alegría nuevamente.  De hecho, me encantaría\nhablar un poco sobre la creatividad y la alegría, que también se\nvinculan con el aumento de la confianza.  ¿ Cómo pueden estas herramientas ayudar a que algunos de los felices regresen a nuestras\naulas de matemáticas? Stacie, ¿qué opinas de eso?  ¿ Cómo podemos potenciar más la creatividad? - Sí, estoy tratando de\ndescubrir cómo no repetirme porque esta es mi\npregunta sobre la varita mágica, ¿verdad? Creo que se trata de ayudar a los estudiantes a examinar las matemáticas desde\notra perspectiva, ¿no? Entonces, en nuestra dinámica tradicional, tenemos un maestro que enseña matemáticas y los estudiantes aprenden y, a veces, tienen la\noportunidad de verbalizar, pero tiende a ser una especie de\nconversación bidireccional, ¿verdad? Por mucho que podamos fomentar el diálogo entre pares y hacer que los estudiantes hablen y exploren las formas en que otras personas piensan sobre los problemas o las formas en que otras\npersonas abordan un problema, eso es increíblemente valioso. Pero el tiempo es muy limitado. Entonces, para mí, cualquier\nherramienta de inteligencia artificial que estés usando, podría tratarse de explorar las\nmatemáticas de una manera más pictórica, ¿verdad? Donde miramos cosas gráficamente o jugamos con cosas gráficamente\ne imágenes visuales de ellas. O podría tratarse simplemente de\ntener ese espacio seguro para explorar el cómo y el\npor qué detrás de mi propio pensamiento o de mis propios supuestos errores. Porque para mí ahí es donde surge la creatividad y el aprendizaje. Es casi más probable que explores el lado creativo y cómo abordas\nalgo cuando cometes un error, ¿verdad? Cuando no lo hice bien la primera vez y tengo que volver a\nexaminar mi propio proceso. Y creo que ahí es\ndonde realmente tener ese soporte de chat de IA o tener ese diálogo realmente puede ayudarnos a profundizar allí. - Absolutamente. Y al igual que Stacie, veo la creatividad\ncomo un pensamiento de orden superior. Entonces, sacando todo el provecho de\neso, ¿lo entiendo?  ¿ Puedo recordarlo?  ¿ Pero puedo analizarlo?  ¿ Puedo crear algo nuevo a partir de esto?  ¿ Puedo tener una discusión sobre esto? Y eso es lo que la IA nos permite hacer. Y entonces, cuando pienso,\ncuando relaciono eso con lo que sucede en un salón de clases donde todos los estudiantes están en\ndiferentes niveles, independientemente de su nivel, ahora\ntodos podemos involucrarnos en un pensamiento de orden superior que nos alcanza\nen nuestro borde de aprendizaje. Y eso es algo que me entusiasma mucho de esta herramienta. - De hecho.  ¿ Podemos hablar un poco más sobre conocerte en Learning Edge?  ¿Se puede ampliar al respecto? Porque eso es algo que muestran muchas investigaciones, ¿verdad?  Se llama, quiero decir, incluso\nJohn Hattie habla sobre el principio de aprendizaje Ricitos de Oro, no puede ser demasiado fácil ni demasiado difícil, tiene que ser lo correcto, pero lo correcto, es diferente para todos, el borde es diferente. - Exacto, es diferente para cada uno. Y sabes, vuelvo a esta anécdota que hemos estado\nusando acerca de que la proporción de uno a 35 entre tú y los niños es que cada estudiante tiene una\nventaja de aprendizaje diferente. Entonces, ¿en qué punto\nlos he empujado a donde no estamos en\nmodo de frustración, todavía estamos obteniendo, ya sabes, ese aprendizaje que está sucediendo, pero también,\nno es tan riguroso, verdad? Entonces, la idea aquí es que\ncuando trabajo con Conmigo, podría equivocarme en algo, ¿verdad? Y luego Khanmigo\ndirá exactamente dónde me equivoqué y el\ndiálogo comienza ahí mismo. Quizás lo hice bien. Khanmigo entonces puede subir de nivel, ¿verdad? Y ahora podemos trabajar en algo un poco más riguroso. Y es realmente importante para\nla participación, es importante para saber que eso está sucediendo, que cada estudiante se encuentra exactamente donde debe estar. Y como una sola persona, eso es\nrealmente difícil de hacer. Pero tenemos un asistente de enseñanza\nque puede ayudarnos ahora. - Si, absolutamente. Dina, ¿alguna idea final\nsobre la creatividad o la ventaja del aprendizaje? - Creo que con la ventaja del\naprendizaje, creo que podemos responder y adaptarnos más rápido\nque nunca. Creo que, ya sabes, los\nestudiantes a veces solo necesitan ese momento de iluminación para\ncomprender un concepto y que tenga sentido. Y creo que poder\ntener ese momento y luego poder\nusarlo como plataforma de lanzamiento y acelerar para\nno quedar atrapado, ya sabes, no estar atrapado trabajando por debajo del nivel de grado o en habilidades de memoria durante mucho tiempo.  momento en el que simplemente sigues practicando pero ya no lo necesitas. Creo que nos permite\nver cuándo los estudiantes lo tienen y cuándo están listos para seguir moviéndose, nos ayuda a salir de algo\nde basura, por así decirlo. Y realmente mantener el progreso, hacer que los estudiantes sigan avanzando\ny manteniéndolos comprometidos. Y creo que en términos\nde creatividad, justo cuando lo hacen, ¿\ncómo te gusta aprender? Estábamos viendo, ya sabes, algunos chats diferentes que habían llegado. Un estudiante preguntó e hizo que Conmigo les hablara como un pirata por un rato porque\nlos mantenía interesados. Y entonces estaban haciendo sistemas\nde ecuaciones de, ya sabes, un pirata y estaban encantados de estar\npasando un buen rato, pero fue un trabajo excelente. Estaban haciendo preguntas sólidas y estaban haciendo los cálculos. Eso es fabuloso, ¿verdad? Y creo que lo somos,\nnos da la oportunidad de, ya sabes, recuperar la\nalegría, divertirnos con ella. - ¿Me creerían todos\nsi les dijera que una vez me vestí como un pirata y\ncuando era profesora y enseñaba matemáticas de esa manera? Así que ahora puedes disfrazarte de pirata y tener problemas matemáticos de piratas. A veces tienes que hacer lo que tienes que hacer para mantener a los estudiantes interesados,\nlo cual es lo que quiero, estamos para completar\nel tiempo, nuestro tiempo juntos. Así que me encantaría saber de todos ustedes.  ¿ Cuál es su\ntécnica y herramienta de participación matemática favorita y cómo cree que podría mejorarse utilizando las herramientas de Conmigo?  ¿ Cuál es tu opción favorita?\nVuelve a ponerte el sombrero de maestro. Profundicemos todos ustedes, ¿qué piensan? Oh, estás sonriendo Iman,\ncreo que quieres ir primero. - Está bien, espera una vez más. Danielle, vuelve con la\npregunta una vez más. - ¿Cuál es tu compromiso favorito?  ¿ Cuál fue tu actividad favorita de participación en matemáticas con los estudiantes?  ¿ Y cómo podría la IA ayudar a mejorar eso? - Entonces es gracioso porque esto fue probablemente lo más difícil que tuve que hacer, pero lo más importante, y esos fueron los ganchos de mi lección, ¿ cómo puedo hacer que los polinomios sean interesantes?  ¿ Cómo puedo configurar estas fotos? Esto es algo con lo que los niños se identifican.  Por eso, a menudo pasaba\nmucho tiempo pensando en cómo voy a presentar esta lección solo para que los niños sigan conmigo. Y una de las primeras\ncaracterísticas que lanzamos con Conmigo\nfueron los ganchos de lecciones. Y fue realmente agradable tomar rápidamente algo que sabía que les gustaría a mis alumnos. Tuve un año cuando enseñaba en Filadelfia donde mis hijos estaban obsesionados\ncon los Philadelphia Eagles y poder vincular eso\ncon la instrucción de matemáticas, es un cambio de juego. - Sí.  Dina, vete.\n- Mi favorito fue enseñar parábolas iniciales y velocidad usando el trabajo de Galileo y poder lanzar. Lanzamos pelotas de tenis,\nlanzamos cohetes de agua, hicimos todo tipo de\ncosas en el campo. Me hubiera encantado tener\nIgnite My Curiosity o algo así para que\npudieran profundizar en la historia porque creo que la\nhistoria es fascinante. Aprendiendo todo sobre los matemáticos que nos dieron estos grandes teoremas e ideas que usamos hoy. Creo que podría haberlo\nhecho aún más rico aprender diferentes historias. Y en lugar de que yo les cuente una historia, yo todavía podría contar la historia, pero ellos podrían contar las historias.  ¿ Qué aprendiste?  ¿Qué viste?  ¿ Qué crees que es\ninteresante acerca de esta persona? Ahora vamos a mojarnos y lanzar cohetes de agua al campo. - Genial.  Stacie, ¿y tú? - Bueno, nos estamos poniendo específicos aquí. Así que tuve que profundizar mucho para encontrar este. Yo era\nprofesora de matemáticas y ciencias en la escuela secundaria. Enseñé ambos.  Por eso, lo que más me gustó\nsiempre fue mostrarles a los estudiantes cómo existen las matemáticas en el\nmundo real, no de forma aislada. Y mi forma favorita de\nhacerlo fue enseñar\nfunciones junto con ondas, ondas sonoras, ondas de agua,\nondas de luz, ¿verdad? Y observar las ondas como funciones y hacer que los estudiantes realmente\nhagan un análisis profundo allí. Y esto da como resultado que los niños\ntengan una comprensión realmente profunda no solo de la ciencia, sino también de las matemáticas,\nque eso realmente es inherente a esa\ncomprensión y teoría científica. La IA podría haberme ayudado mucho porque me llevó\naños lograr que esa unidad y ese conjunto de instrucciones fueran correctos. Y creo que tener algo con lo\nque podría simplemente hacer una lluvia de ideas\nme impediría hojear todos los libros\ny todas las páginas web, pero podría seleccionar información más rápido para poder hacer esas\nconexiones del mundo real sobre exactamente cómo funciona.  La aplicación de las matemáticas al\nmundo real realmente habría cambiado las reglas del juego para mí y\nme habría permitido hacer mucho más de eso con mis alumnos. - Exactamente. Y lo haré, Cynthia\nacaba de escribir en el chat, sé que no pueden verlo, pero Cynthia, estoy de acuerdo con que\npreguntes a los estudiantes de IA cómo se sienten acerca del tema general y cómo se sienten acerca de\nlo que acaban de aprender. y ayudarlos a conectarse un poco más profundamente. Entonces, mi estrategia favorita cuando\nera maestra, era maestra de educación especial de quinto y sexto grado, y llegué a las matemáticas\npataleando y gritando porque yo misma tenía un trauma matemático. Así que lo abordé definitivamente como una pieza creativa como profesora. Y habría hecho raps sobre cosas y literalmente me habría disfrazado\ncomo un duende del rap y habría enseñado con acento irlandés. Hice todo lo que pude\npara mantener a los estudiantes interesados. Y lo que descubrí usando\nlas herramientas que ofrece Khanmigo es que hay una herramienta de poemas\nque realmente se puede hacer: los profesores pueden resumir una lección de poesía y los estudiantes pueden resumir\nlecciones usando poemas. Y creo que es una\nconexión de alfabetización realmente interesante y simplemente capacita a los estudiantes\npara pensar en las matemáticas como esa forma de arte creativo. Como si estuvieran hablando de\necuaciones lineales y polinomios y veo pequeños polinomios\nvestidos con sombreros y, ya saben, realmente atrae darle vida a las matemáticas. Así estamos, es viernes. Habéis sido maravillosos. Estamos muy felices de que\nestés aquí uniéndote a nosotros. Hemos publicado enlaces en el chat y, al registrarse,\nobtendrá una copia de la grabación, así como una gran cantidad. Sí, uso algunos términos matemáticos.  ¿Es ese un término matemático? Espero que lo sea, una plétora. También es solo una gran palabra de recursos. Hay una lista de reproducción de YouTube donde puedes ver exactamente\nde qué estamos hablando. Queríamos mantenerlos a todos enfocados en nosotros y en la conversación en lugar de ver la pantalla de alguien\nintentando algo diferente aquí. Así que obtendrás todos los\nrecursos si quieres aprender más, también puedes\nconsultar, hay un par de enlaces que ponemos en el chat, pero\nte daremos toda esta información en un correo electrónico\ncon la grabación. En conclusión, ¿cuál es el\núltimo pensamiento que te gustaría dejar pensando en la intersección de las matemáticas y la IA?  ¿ Pensamientos finales, todos ustedes? - Creo que simplemente diría\nque hay mucho que aprender y todos tenemos mucho que\naprender sobre cómo es llevar la IA al aula. Pero por ahora, ya sabes, por mucho que podamos simplemente sumergir un dedo del pie en el agua e intentar una cosa y aprender junto a nuestros estudiantes, para mí, esto se trata de empoderamiento.  Se trata de \nmejorar la vida de nuestros profesores, dándoles más tiempo para dedicar a\nsus alumnos o sus familias. Como por las tardes, cuando solía estar en la escuela todo el tiempo,\nsimplemente probar una cosa y estar dispuesto a correr ese riesgo y aprender algo\njunto con nuestros estudiantes, creo que es realmente el\ndesafío que tenemos por delante.  . - Gracias. Imán, ¿qué opinas?  ¿Pensamientos finales? - Mi pensamiento final es que\ncada persona es una persona de matemáticas y tener una herramienta como\nKhanmigo te da el poder de ver eso sin importar\ndónde estés, si estás por debajo del nivel de grado, si\nestás en el nivel de grado o tal vez.  Estás a un par\nde niveles de grado por delante, tienes la oportunidad\nde mantenerte comprometido, tener un discurso y ser creativo. - ¿Y Dina? - Yo diría que creo que hemos estado luchando para que las matemáticas se vuelvan\nmucho más procedimentales, mucho más memorísticas, y vemos que nuestros estudiantes\ndisminuyen su participación como resultado de eso.  No ven la aplicación\nde las matemáticas, no ven cómo impactan sus vidas. Y creo que este es nuestro momento. Estoy totalmente de acuerdo con Stacie. Todos estamos aprendiendo, todos estamos\ndescubriendo esto juntos. Pero únete a nosotros. Ven a resolver esto con nosotros. Ven a conversar\ncon nosotros, hablemos de ello porque queremos hablar de ello porque queremos que nuestros hijos\nvean las matemáticas que todos amamos. Y creo que esta es nuestra\noportunidad de recuperarlo. ♪ Devolver la felicidad\na nuestras clases de matemáticas ♪ ♪ Eso es un hecho ♪ Esa es mi nota final,\nliteralmente en una nota, muchas gracias por acompañarnos. Te apreciamos. Agradecemos la conversación. Descubriremos\nuna manera de exportar este chat y enviárselo. Por favor comparte esto con tus amigos, como dijo Dina, únete a nosotros. Tendremos más\nde estas conversaciones. Cuéntanos qué te gustó y\nqué no te gustó. Siempre estamos abiertos a recibir comentarios. Nosotros también estamos aprendiendo. Somos educadores, todos ustedes. Y nos encanta hablar con los educadores porque son muy indulgentes\ncon todo. Así que gracias por acompañarnos. Os apreciamos y hasta que\nos volvamos a ver, adiós a todos. - [Narrador] Gracias\npor ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus alumnos en el aula, siga los enlaces en su pantalla y, para no perderse nunca\nanuncios interesantes sobre nuevos materiales de cursos gratuitos en Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- مرحباً بالجميع، تشرفت بلقائكم. اسمي دانييل سوليفان وأنا متحمس جدًا لكوني ميسر هذه المحادثة الرياضية الممتازة اليوم مع زملائي الرائعين. نريد اليوم أن نتحدث\nعن تعليم الرياضيات، وكيف تغير وتغير\nمنذ الوباء، وكيف يمكن للذكاء الاصطناعي أن يوفر\nفرصًا جديدة للتأكد من أننا نعيد التفكير النقدي والفهم المفاهيمي والمحادثة، بصراحة، إلى فصول الرياضيات لدينا. نحن نعلم أن لديكم جميعًا الكثير\nمن التحديات المتنوعة ونأمل أن تساعدكم هذه\nالمحادثة في الوصول إلى مكانكم الحالي ودفع\nطلابكم إلى الأمام. لذا سأدع الآن\nاللجنة تقدم نفسها. دعونا نمضي قدمًا ونبدأ مع دينا. - مرحباً بالجميع، أنا دينا نيمان. أنا أقود فريق النجاح في منطقتنا\nهنا في أكاديمية خان. ولكن الأهم من ذلك، أنني\nكنت مدرسًا للرياضيات لفترة طويلة جدًا، 25 عامًا حتى الآن،\nوبدأت بالفعل في الرياضيات في المدرسة الإعدادية. وأنا أحب مدرستي المتوسطة، ولكني قمت بتدريس\nالقليل من كل شيء. سأمررها إلى إيمان. - شكرا دينا. مرحباً بالجميع، اسمي إيمان هوارد. أنا مدير المجموعة لجميع محتويات العلوم والتكنولوجيا والهندسة والرياضيات هنا في أكاديمية خان. أنا أتعلم مدى الحياة\nوأعلم الرياضيات والعلوم، وأنا متحمس للغاية\nللدردشة مع الجميع اليوم. سأمررها لك ستيسي. - مرحبًا بالجميع، اسمي ستيسي جونسون، ومثل دينا، عملت أيضًا\nكمعلمة للرياضيات مدى الحياة ومثل إيمان في الرياضيات والعلوم، والمدارس الإعدادية والثانوية والابتدائية، أقود\nفريق التعلم المهني لدينا. متحمس جدًا لوجودي هنا للتحدث معكم اليوم حول تعليم الرياضيات وكيف نصل إلى الأطفال. - عظيم، ونسيت تمامًا أن أتحدث عن خلفيتي أيضًا. لذا فأنا المضيفة ونعم، هذه ليست\nخلفيتي الحرفية فقط، نعم، أنا في الواقع أختي في أريزونا، لكنني أؤيد الشمال الشرقي. لذلك سأزور ولاية أريزونا،\nوهو أمر مثير نوعًا ما. وأنا معلمة مدى الحياة وقمت أيضًا بتدريس\nالتربية الخاصة والرياضيات في الصف الخامس والسادس، في كل من\nواشنطن العاصمة وشمال ولاية نيويورك. إذن السؤال الأول الذي يجب أن نبدأه جميعًا، ما هو نهج أكاديمية خان\nلتعليم الرياضيات وكيف يتغير ذلك\nفي عصر الذكاء الاصطناعي هذا؟ وإيمان، أريدك أن\nتمضي قدمًا وتطردنا. - رائع، شكرا جزيلا لك. لذلك عندما نقوم بتطوير\nمحتوى للرياضيات، فإننا نفكر في الأمر من خلال\nجوانب الدقة. وهذا يعني تقسيمها بالفعل\nبثلاث طرق. أولاً، نفكر في الطلاقة الإجرائية. فهل يمكنك الحساب\nبسرعة ودقة؟ ومن ثم ندخل في\nالفهم المفاهيمي. لذا، هل يمكنك الوصول إلى المفاهيم\nمن عدد من وجهات النظر لرؤية الرياضيات، كما تعلمون،\nأكثر من مجرد، كما تعلمون، معذرةً، أقل تكتمًا\nوإجراءات أقل. ثم أخيرًا نفكر\nفي الأمر من خلال التطبيق. فهل يمكنك استخدام الإجراءات والمفاهيم بمرونة وحل المشكلات؟ وكما تعلمون،\nقد يحتوي أي معيار معين على واحد أو مجموعة من هذه الجوانب. وفي بعض الأحيان قد يبدو ذلك\nمقيدًا للغاية عندما نقوم بتطوير المحتوى. ولذا عندما يتعلق الأمر\nبالذكاء الاصطناعي، فإن أحد الأشياء التي تثيرني حقًا هو\nفرصة التعمق في المزيد من الفهم المفاهيمي،\nالذي يأتي مع الخطاب. وهكذا بدلًا من أن يقوم الطالب\nفقط، كما تعلمون، بالصواب أو الخطأ،\nيأتي الفهم المفاهيمي ويمكننا معرفة سبب\nحدوث الرياضيات بهذه الطريقة بطريقة فردية حقًا. - لذلك دينا، دعونا نضيف إلى ذلك. ما رأيك؟ - كما تعلم، أعتقد أن\nالخطاب هو حقًا أحد أكبر الأجزاء التي يجلبها الذكاء الاصطناعي إلى تعليم الرياضيات ويضيفها. كمدرس في الفصل الدراسي، كنت دائمًا أعمل طلابي دائمًا في مجموعات. لم يكن فصلي الدراسي هادئًا أبدًا. كنا دائمًا نتحدث بصوت عالٍ\nونتحدث عن الرياضيات ونقوم بالمشاريع\nونتساءل عن تفكيرنا ونشرح منطقنا. وأعتقد،\nبشكل عام، أن الكثير من التأثيرات التكنولوجية\nفي الفصول الدراسية دفعت تعليم الرياضيات إلى أن\nيصبح أكثر إجرائية.  هل يمكنك، كما تعلم، أن\nتقوم بهذه العملية الحسابية؟  هل تستطيع حل هذه المعادلة؟  هل يمكنك تنفيذ الخطوات\nبترتيب معين؟ ليس بالضرورة أن تكون\nهناك خيارات، أليس كذلك؟ هناك مسارات مختلفة\nيمكننا اتباعها للوصول إلى الإجابة الرياضية الصحيحة. وغالبًا ما يكون لدى الطلاب سبب وجيه للغاية ويفكرون في الأشياء بشكل مختلف. وهذا يضيف إلى كل تفكيرنا وجميع أدوات الرياضيات لدينا\nعندما نتمكن من سماع كيف يفكر الأطفال في الرياضيات والطريقة التي يتوصلون بها\nإلى خطوتهم التالية أو إستراتيجيتهم أو لماذا يتعاملون مع\nالمشكلة بطريقة معينة. وأعتقد أنه مع الذكاء الاصطناعي، عندما\nيتعين على الطلاب طرح الأسئلة، عندما يتعين عليهم أن يكونوا قادرين على القول، أنا لا أفهم هذا الجزء\nمن المعادلة، فهذا ليس، أنا لا أفهم\nالمفهوم بأكمله، إنه، أنا لا أفهم.  لا يفهمون كيفية الانتقال\nمن هذه الخطوة إلى الخطوة التالية، أو عليهم أن يفكروا بشكل نقدي أكثر. وهي في الحقيقة تبني تلك\nالمعرفة المفاهيمية. لكن هذا التساؤل أعتقد\nأنه جزء كبير من ذلك. - إذن ستيسي، كيف حالنا في أكاديمية خان، حيث نساعد المعلمين على فهم\nكل هذا؟ - نعم، أعني، أعتقد حتى قبل أن أفكر في كيفية فهمنا\nللأمر، عندما أفكر في الخطاب والفهم المفاهيمي،\nأحد الأشياء التي أفتخر بها كثيرًا في\nأكاديمية خان هو المكان الذي يتواجد فيه الطلاب  افعل ذلك. عن ماذا نتحدث؟  في ماذا نبني\nالفهم المفاهيمي؟ وحقيقة أننا في\nأكاديمية خان نعتقد أننا نعلم أن كل طالب\nيمكنه تحقيق إنجازاته على مستوى الصف الدراسي. وأعتقد أن ما\nيهم حقًا قوله هنا هو أن جميع طلابنا لديهم فجوات في التعلم. كلهم يأتون\nبهذه الثقوب، أليس كذلك؟ إنه نوع من\nفهم الجبن السويسري للرياضيات والطريقة التي نبني بها\nتطبيقًا يركز على عدم الحكم على الأطفال بالعمل تحت\nمستوى الصف الدراسي للعام المقبل بحيث نقوم فقط بإدامة هذه الفجوة. لكن وضعهم في مستوى الصف الدراسي، مع العلم والاعتقاد بأن هذا هو\nالمكان الذي يمكنهم تحقيقه باستخدام الذكاء الاصطناعي للقيام ببعض تلك السقالات. لأن\nالمعلم هو أفضل مورد بالطبع، المعلم هو\nالمكان الذي يجب أن نتكئ فيه ويجب على الطلاب دائمًا\nالذهاب إلى المعلم أولاً، لكن المعلم لا يمكنه\nالتحدث إلى 35 طفلًا في وقت واحد أو أكثر، أليس كذلك؟ لذا بينما ننتظر المعلم، يمكن أن يكون الذكاء الاصطناعي موجودًا لدعم\nالأطفال حتى لا يتعثروا، ولا يصلوا إلى نقطة الإحباط ويرفعون\nأيديهم وينسحبون، أليس كذلك؟ لأن كل ما يفعله هو\nإدامة فجوات التعلم هذه وجعل الفجوات أكبر. لذلك أعتقد أن\nأهم شيء يجب قوله هنا هو كيف نحافظ على الطلاب في مستوى الصف وكيف نضمن أن\nهذا هو المكان الذي يتعلمون فيه وأنهم يتقدمون\nللأمام من هناك، ويمكننا في نفس الوقت، العودة وملء بعض  من تلك الثغرات\nبينما نواصل العمل مع الطلاب على مستوى الصف الدراسي. وفيما يتعلق بكيفية\nتعيين المعلمين هناك، أعتقد أن هذه عملية خطوة بخطوة، أليس كذلك؟ لدى مدرسينا\nلوحات مكتظة بالكثير مما يتعين عليهم القيام به طوال الوقت، والعديد من\nالمهام الإدارية، والعديد من الأشياء التي لا علاقة لها بتدريس الأطفال فعليًا. لذا فإن السؤال هو، كيف\nنستمع إلى المعلمين حول التدريب الذي يحتاجون إليه؟ كيف نقوم بجمع المعلومات حول الدعم الذي يحتاجونه؟ ومن ثم تصميم\nبرامج تدريبية استجابةً لذلك، بدلاً من تقديم مجموعة\nمن الدعم والتدريب لهم وتوقع أن\nيحدث ذلك فرقًا. - قطعاً. والجميع، يمكنك نشر\nالأسئلة في الدردشة. لدينا بعض الأسئلة الإرشادية\nالتي خططنا لها مسبقًا، ولكنني بالتأكيد أريد التأكد من أن لدينا القدرة\nعلى الإجابة على أسئلتك. وأود أن\nتبدأوا جميعًا في التحدث والرد أيضًا في الدردشة إذا كان ذلك مرهقًا بالنسبة لكم. أنت فقط تريد أن تظهر وتستمع، عظيم. إذا كنت تريد التفاعل، عظيم. هناك الكثير من\nالطرق المختلفة التي يمكن أن تكون عليها اليوم، ولكنني سأكون فضوليًا، مثل ماثيو الذي كتب للتو\nفي التعلم المخصص. مثل ما تفكرون جميعا؟ كما سمعتم دينا وإيمان وستيسي يتحدثون عن بعض التحديات التي تواجهونها. لذا فكر في ذلك، وسنبدأ في\nالتنقيب في هذا الأمر بمزيد من المعرفة، أليس كذلك؟ مثل الرياضيات، يُنظر إليها عادة على أنها\n موضوع ملموس وموضوعي للغاية. وبقدر ما نتحدث عنه، أحيانًا لا نرى الكثير من التركيز على العملية والنهج، وأحيانًا يكون الأمر صحيحًا أو خاطئًا. هل لدى الذكاء الاصطناعي القدرة\nعلى التأثير على ذلك؟ ايمان ما هي أفكارك؟ - قطعاً.  كما تعلمون، يركز الكثير من\nمناهجنا الدراسية أحيانًا على تلك الطلاقة الإجرائية. ولذا عندما تكون في\nالفصل الدراسي تنفذ هذا، تسأل أحد الطلاب سؤالاً، ولا يمكنهم الحصول على الإجابة الصحيحة. والآن فجأة\nأصبح الطفل يقول، أنا لست متخصصًا في الرياضيات، لقد فهمت الأمر بشكل خاطئ. وبعد ذلك تنتهي المحادثة وربما لا\nيرفعون أيديهم مرة أخرى. ومع ذلك، عندما نقدم\nشيئًا مثل Conmigo وAI، ليس فقط إذا فهمت الأمر\nبشكل خاطئ، فهذا لا يعني إيقاف التشغيل، بل هناك فرصة لنقول الآن، حسنًا، دعونا نجري محادثة. دعونا معرفة لماذا حدث ذلك. والآن نحن ندخل في\nهذا الفهم المفاهيمي. وكما تعلمون، ذكر أحد الأشخاص\nفي الدردشة التعلم الشخصي. نحن ذاهبون إلى التعلم الشخصي.  لقد كان العديد منا في\nالفصول الدراسية حيث كانت النسبة 1 إلى 35، ولدينا بعض الطلاب\nفي مستوى الصف الدراسي، متأخرين ببضع سنوات عنهم\nوبضعة أعوام للأمام. والآن لدينا هذه الفرصة لمقابلة الجميع في مرحلة التعلم الخاصة بهم. سواء أكان ذلك صحيحًا أم خطأ، فلدينا طريقة لتخصيص تعليماتك وإيصالك إلى المستوى\nالذي نعلم أنه يمكنك تحقيقه، وهو مستوى الصف الدراسي. - تفضلي دينا. - كما تعلمون، إنه تعليم شخصي، لكنني أشعر أنه كان هناك\nدائمًا مثل هذه الرغبة والهدف\nلدى معلمي المرحلة الثانوية لجعل التعلم في مجموعات صغيرة حقيقة واقعة. وشعرت أنه مستحيل.  وقد شعرت بالتحدي الشديد لأنك على حق تمامًا. لديك 36 جثة في الفصل الدراسي الخاص بك وتريد العمل مع هذه\nالمجموعة الصغيرة المكونة من ثلاثة أو أربعة أشخاص والتي تحتاج إلى الاهتمام. لكن ماذا يحدث في اللحظة التي تجلس فيها، ترتفع كل تلك الأيدي، أحتاجك، أحتاجك، لدي سؤال. لا أعرف ماذا أفعل بعد ذلك. وأعتقد أن ذلك الوقت الذي قضيته في مجموعة صغيرة، في الواقع علقت لين على المرونة في التدريس في الدردشة. وأعتقد أن الذكاء الاصطناعي يمنحنا\nإمكانية القيام بأشياء كانت في السابق\nمعقدة للغاية وصعبة للغاية. أعتقد أنه يمكننا القيام بذلك\nالتدريس الجماعي الصغير لأن الذكاء الاصطناعي يمكن أن يتفاعل، كما تعلمون، يحافظ على\nتقدم الطلاب في تعلمهم ويحافظ على تقدمهم للأمام. وأعتقد أنه\nيمنح أطفالنا المزيد من الوقت مع المعلم بالطريقة\nالتي يحتاجون إليها حقًا. لا يتعلق الأمر بالمعلم مثل الوقوف والتوصيل إلى\nالفصل الدراسي بأكمله في وقت واحد، بل يتعلق الأمر\nبقدرة المعلم على تلبية هذه الاحتياجات في مكانها الصحيح، \nويوفر للطلاب حقًا التعليمات والشرح والتوجيه أين\nوكيف  في حاجة إليها. - نعم. دينا، هذا يجعلني أفكر في الجزء المفضل لدي من\nالتواجد في الفصل الدراسي. لا أعلم إذا كنتم قد رأيتم جميعًا، مثلًا، كان هناك مقطع فيديو على YouTube منتشر منذ بضع سنوات مضت وكان\nيسمى \"المفضل لدي\"، لا، أليس كذلك؟ وكان الأمر يتعلق بالنظر إلى الطريقة التي حل بها الطلاب مشكلة ما والعثور على الإجابات الخاطئة،\nولكن العثور على الجمال والدقة في تلك الإجابات الخاطئة.  وكان الجزء المفضل لدي من\nتدريس الرياضيات هو الاستماع للطلاب وهم يتحدثون بوضوح عن الطريقة التي تناولوا بها المشكلة أو كيف كانوا يفكرون\nفي ذلك، أليس كذلك؟ بالنسبة لأقرانهم، وبالنسبة لي، في\nتلك المجموعات الصغيرة، وهذا أيضًا أحد أصعب الأمور. كيف يمكنك أن تكون هناك\nللاستماع إلى جميع الأطفال؟ كيف يمكنك أن تكون هناك لاستيعاب ما يفكرون فيه؟ لأنه كمعلمي الرياضيات، من الصعب تدريس إجابة خاطئة. نعم.  يمكننا بالتأكيد تعليم\nفكرة خاطئة، أليس كذلك؟ لذلك عندما أفكر في\nالذكاء الاصطناعي، فإن أحد الأشياء التي كنت أتمنى لو كانت لدي في\nالفصل الدراسي هو القدرة على العودة وإلقاء نظرة على النصوص أو المحادثات\nالتي يجريها الطالب مع روبوت الدردشة لتحديد كيفية معالجتها  هذه المعلومة؟ هل هم عالقون؟  وهم يقولون فقط،\nلا أعرف، لا أعرف. أم أنهم يحاولون حقًا معالجة هذا؟  وما هي أنواع\nالأسئلة التي يطرحونها؟ لأنه بالنسبة لي، إذا كان بإمكاني\nتسخير هذه المعلومات، إذا كان بإمكاني الحصول عليها من صفي\nككل، وهو ما لا أستطيع فعله بمجرد التجول والاستماع\nإلى الجميع، فيمكنني الآن تدريس المفاهيم الخاطئة في صفي والاستفادة حقًا مما\nلديهم  يعرفون البناء على ما لا يعرفونه بعد. - إذن للربط بين ما قلته للتو والإجابة على\nبعض الأسئلة التي تأتي في وقت واحد، سأل بعض الأشخاص عن خانميغو، هل يمنح الطلاب إجابات فقط؟ أو إذا كان الطلاب حقًا،\nمثل، مدرسًا فرديًا، ولكن إذا كان الطلاب\nغير متحمسين حقًا، فكيف يعمل خانميجو ليكون ذلك المعلم عندما\nلا يستطيع المعلم استنساخها أو استنساخ نفسه بـ 35 طريقة؟ يمين؟ وكم منكم تشعرون\nأنه ليس لديكم الوقت الكافي لتدريس الرياضيات؟ اي شخص؟  هل يوجد أحد في الغرفة؟ بالضبط.  نعم. إذن إيمان، هل تريدين أن\nتبدأي بالحديث عن ذلك؟ - نعم على الاطلاق. لذا، كما تعلمون، مثلما يفعل المعلم الجيد\nعندما يحصل الطالب على إجابة خاطئة، فإننا لا نكتفي\nبإبداء الإجابة الصحيحة ونرحل. نطرح عليهم سلسلة من الأسئلة الداعمة\nبناءً على الرد الذي قدموه لنا. وهذا هو المكان الذي\nترى فيه أن الحوار يحدث بين Conmigo والطلاب، وهذا ليس صحيحًا تمامًا. دعونا نتحدث عن المكان الذي\nوضعت فيه هذا العلامة العشرية في غير محله. هيا بنا ننزل ونعمل معًا ذهابًا وإيابًا لنصل إلى الإجابة الصحيحة. والآن بعد أن حصلت عليه،\nاسمحوا لي أن أقدم لك واحدة أخرى يمكنك تجربتها بنفسك. حسنًا، مثلما\nستفعل، أفكر في Conmigo كمساعد تدريس، أليس كذلك؟ وبينما أنا قادر\nعلى التيسير هنا، إنها مجموعة صغيرة، أعلم أن طلابي هنا غير منخرطين. وعندما يتعلق الأمر بإدارة الفصل الدراسي، فأنا بحاجة إلى إشراك طلابي. - ونعم.\n- هل يمكنني التقاط سينثيا، وطرح سؤال، وأعتقد أنه يعتمد على\nهذا، قالت إنها وجدت أن الذكاء الاصطناعي مفيد، لكن\nالطلاب ليسوا دائمًا متحفزين أو متأكدين من كيفية استخدام المورد. وتساءلت، هل يجب على\nالمعلمين تعليم الطلاب كيفية استخدام موارد الذكاء الاصطناعي، بما في ذلك تدريس التمارين باستخدامها؟ وأعتقد بالتأكيد، تمامًا\nكما هو الحال مع أي أداة، تمامًا كما هو الحال مع الآلة الحاسبة الرسومية،\nبالطريقة التي نعلم بها الإجراءات الروتينية في\nالفصل الدراسي، أعتقد تمامًا أننا بحاجة إلى تعليم\nطلابنا كيفية استخدام الذكاء الاصطناعي، ماذا  أفضل الممارسات هي. أعتقد أن الأمر يبدأ بالنمذجة. لو كان هذا هو الفصل الدراسي الخاص بي،\nكنت سأبدأ بسحبه وإجراء محادثة بنفسي، وطرح الأسئلة، كما تعلمون، وأظهر\nللطلاب كيف يبدو الأمر. وأنا أعلم أننا\nأطلقنا سراحنا للتو، يا إلهي، يمكنك القول، يا إلهي، أعتقد أنه كان خلال\nالأسبوعين الأخيرين تقريبًا. لقد أصدرنا دورة الذكاء الاصطناعي للطلاب.  هل هذا صحيح؟ - لقد فعلنا بالتأكيد. وأعتقد أن هذه دعوة جيدة لأننا\nنسمع هذا المصطلح AI، AI، ومن المهم جدًا أن نخبر طلابنا ما هو نموذج اللغة الكبير؟ ما هو هذا الشيء الذي يتفاعل؟  هل يعرف كل\nالإجابات؟  ماذا يمكن أن تفعل؟ ما الذي لا يستطيع فعله؟ ولذا لدينا\nدورة تدريبية، الذكاء الاصطناعي للتعليم، يمكنكم الاطلاع عليها للتأكد من أننا نعرف كيفية استخدامها كأداة لتعزيز تعلمنا،\nلأن هذا هو الحال. - قطعاً. وبالحديث عن الأدوات والتعلم\n، فإننا نعلم أننا لم نقم بإعداد\nهذه الندوة عبر الإنترنت بالطريقة الأكثر تفاعلية. لذلك نحن نبذل قصارى جهدنا. نرى أسئلتك،\nونرى تعليقاتك، لذلك سنستمر في التأكد من\nأننا نجيب على كل شيء. وهذه تجربة تعليمية. لذلك لا أعرف إذا كان بإمكانكم\nرؤية ردود بعضكم البعض، لكننا\nسنواصل المحادثة. استمر في التحدث إلينا،\nوسنحضرك، وسنسلط الضوء على الأشياء. إذن ستيسي، ما هي\nأفكارك حول الأشياء التي شاركتها إيمان ودينا؟ - نعم، أنا أتفق مع كل ذلك. كان هناك تعليق في\nالدردشة حول تعليم الطلاب الإعجاب، وكيف يمكنك التعمق في الأمر، وكيف تدرب\nالطلاب فعليًا على طرح أسئلة أفضل؟ وأعتقد أنه في الواقع\nسؤال موجه إلينا كبالغين، كقادة في الغرفة،\nوكذلك كطلاب. وأعتقد أن\nالشيء المهم الذي يجب أن نقوله بصوت عالٍ هو أن نتعلم جميعًا\nأن المعلمين والطلاب يتعلمون\nجنبًا إلى جنب كيفية العمل بهذه التكنولوجيا الجديدة، أليس كذلك؟ وعلينا أن نغير هذه العقلية وأنها ليست محرك بحث. لذا، أحد الأشياء التي\nرأيناها ناجحة حقًا هو التدرب على طرح\nالسؤال على شخص آخر قبل طرحه في Conmigo\nأو في برنامج الدردشة الآلي، أليس كذلك؟ لأن الناس يفكرون، والطلاب على وجه الخصوص،\nيعتقدون أن هناك طريقة معينة\nيجب أن أقول بها هذا، أليس كذلك؟ نسمع كثيرًا عن المطالبة أو أن هناك\nلغة معينة يجب أن أستخدمها.  وهي في الواقع محادثة. إذن، عندما تكون معلمًا،\nإذا قلت شيئًا للطالب مثل، حسنًا،\nحسنًا، ماذا ستقول للطفل المجاور لك، أليس كذلك؟ أو ماذا ستقول لي؟ حسنًا، الآن فقط اكتب\nذلك، إنه نوع من التحول في العقلية لأننا\nنعتقد أنها عملية رسمية حقًا ، ولكن منح أنفسنا\nهذا التدريب وكذلك طلابنا هو أمر مهم حقًا. واحتفظ بها في المحادثة. وإذا لم يعجبك الجواب فقل لست متأكداً من ذلك.  هل يمكنك قول ذلك بشكل مختلف؟ أو أنا لا أحب هذا الجواب. والرد كثيرًا بنفس الطريقة التي تفعلها إذا كنت\nتجري محادثة مع شخص آخر. - وأعتقد أنه يمكن أن\nيكون عضوا إضافيا في مجموعتك، أليس كذلك؟ إذا كان على الأطفال أن يتفقوا\nعلى السؤال الذي يجب أن يطرحوه، يا إلهي، فإن ذلك\nيؤدي حقًا إلى إثارة بعض الخطابات الرائعة عندما يمكنهم طرح سؤال واحد فقط وعليهم معرفة السؤال\nالتالي المثالي. - نعم. وجون،\nنراك تكتب هناك تمامًا، كما لو كان جون يفعل بعض\nالأشياء الرائعة حقًا مع طلابه، حتى لو كانت هناك\nإجابات صحيحة، يخبرهم أنه ليس مهتمًا فقط\nبالإجابة الصحيحة، ولكن أيضًا بكيفية حلها وما هي الخطوات. لكن جون تساءل، كيف\nيساعد الذكاء الاصطناعي أيضًا الطلاب الذين لديهم برنامج IEPs أو 504 أو أي\nإعاقات أو تسهيلات أخرى في التوثيق؟ وأود أن أضيف كيف\nتعتقدون أنه من المفيد أن يكون الطلاب خجولين أو لديهم بعض الصدمات في الرياضيات أو لديهم ثقة منخفضة في الرياضيات حقًا؟ - لذلك سأقول إن زوجي\nهو معلم اللغة الإنجليزية كلغة ثانية (ESOL)، ويتحدث الإنجليزية\nبلغات أخرى في بعض الولايات، وأنا أعيش في فلوريدا، وفي بعض الولايات نسمي ذلك متعلمي اللغة الإنجليزية. لكن زوجي\nيستخدمها، ويستخدم التكنولوجيا، كوسيلة لمساعدة الطلاب\nفي فصله الدراسي على التفكير في الأسئلة قبل أن يضطروا إلى\nطرحها علنًا، خاصة إذا كان لديهم هذا القلق ولم يكونوا متأكدين. من خلال تخصيص دقيقة وإتاحة هذه الفرصة للتفاعل، يمكن أن يمنحهم ذلك فرصة\nللشعور بمزيد من الثقة لمعرفة ما إذا كانوا على\nالمسار الصحيح للحصول على بعض التعليقات قبل طرح سؤال أو، كما تعلمون،  إذا فكرت في\nالوقت الذي يقوم فيه المعلمون بالتدريس، وإذا كانت هناك كلمة\nولا يعرفون معناها، فيمكنهم كتابة ذلك بسرعة. ويمكنهم طرح ذلك بسرعة، وتوصيل\nذلك والحصول على مثال أو معرفة أين يمكن\nتطبيق ذلك في  الحياة الحقيقية، أليس كذلك؟ لأن هذا أمر بالغ\nالأهمية لإجراء اتصالات مع المحتوى. أعتقد أنه يعطي أهمية للمحتوى لدينا. أعتقد أنه يمنح الطلاب\nالفرصة للسؤال بطريقة ليست\nمهددة أو مخيفة. إنه يمنحهم الفرصة لاستكشاف المحتوى بأمان. - إيمان، ما رأيك في ذلك؟ نعم، أنا أتفق مع كل ما\nتقوله، دينا. وكما تعلمون، لقد قمت بتدريس\nالطلاب الذين لديهم برامج IEPs وفي بعض الأحيان كانت الكتابة بحد\nذاتها هي القيد. وأحد الأشياء التي أستمتع بها\nحقًا في خانميغو هي القدرة على التحدث فيها،\nوطرح أسئلتك فعليًا. وإذا كان لديك سماعات رأس، أصبح\nلدى Conmigo الآن صوت. لذلك يمكن أن يكون هذا بمثابة\nشيء فردي حيث، مرحبًا، Conmigo، أحتاج إلى بعض المساعدة هنا، وبعد ذلك أكون الشخص الوحيد\nالذي يسمع الإجابة. ويمكن أن يكون هذا أمرًا بالغ\nالأهمية لجعل الطالبة، في وجهة نظرك، دينا، تتغلب على\nبعض من تلك الصدمات الرياضية وتتأكد حقًا من\nتلبية احتياجاتها. - نعم، وأعتقد، كما\nتعلمون، بالعودة إلى المتعلمين متعددي اللغات، أيضًا فكرة أن خانميغو يمكنه الآن التحدث وإجراء هذا الحوار باللغات الإنجليزية والإسبانية والبرتغالية. لذا فهي أيضًا مساحة آمنة حيث\nلا يضطر الطلاب إلى التخلف عن تعلم الرياضيات والمحتوى بينما\nيكتسبون في نفس الوقت الثقة والكفاءة في اللغة الإنجليزية. لذا، كما تعلمون، الاتفاق\nعلى كل ما قيل،\nأعتقد أنه مساحة آمنة للطلاب لاختبار\nأفكارهم دون المخاطرة التي قد لا يشعرون بالارتياح تجاهها بعد. - نعم، وأعتقد أن إحدى الطرق الأخرى التي يمكن أن تساعد حقًا هي\nمساعدة المعلمين على صياغة الدروس لتلبية احتياجات\nالطلاب الذين يعملون معهم. والقدرة على مساعدتك في\nتكييف الدروس بسرعة أكبر، وبكفاءة أكبر من أي وقت\nمضى. إذن، أستطيع أن أقول،\nكما تعلمون، لدي طلاب يستمتعون حقًا بهذا الموضوع أو ذلك الموضوع، ويكونون قادرين على إنشاء\nدروس حوله، ويكونون قادرين على أخذ المحتوى\nوتثبيته على شيء ما. إذا كان الطلاب يحبون المشي لمسافات طويلة في الجبال، لأنني أنظر إلى\nخلفية دانييل، وإذا كان الطلاب يحبون المشي لمسافات طويلة، فلنجري محادثة حول المشي لمسافات طويلة. وأنا أعتقد أنه\nأيضًا يزود المعلمين حقًا بالقدرة على التمييز\nكما لم يحدث من قبل. - لذا أريد أن أتعمق في ذلك قليلاً لأن هناك بعض الأسئلة\nالتي ترد حول المعلمات حول ما يحدث إذا خرج الأطفال عن الموضوع، لكنني أيضًا، لا أريد\nالخروج عن الموضوع بنفسي، ولكن أريد، لقد بدأت، أنت  ألمح الآن إلى بعض أدوات المعلم. أعتقد أننا أمضينا الكثير\nمن الوقت في الحديث عن كيفية تركيز الذكاء الاصطناعي على\nمحادثة الطلاب، ولكن كيف نساعد المعلمين في ذلك، لأننا نحدد المشكلات، أليس كذلك؟ لديك إنسان واحد مع الكثير من البشر الآخرين في\nالفصل الدراسي ولهم الكثير من الاحتياجات، وخاصة بعد الوباء.  لقد رأينا الكثير من فجوات التعلم. لكن الجميع في هذا، في\nهذه الندوة عبر الإنترنت، لنكن واقعيين، لقد كانت لدينا فجوات لفترة طويلة، أليس كذلك؟ في الرياضيات.  نعم. وأعتقد أن الجميع\nيتحركون حقًا في الاتجاه الصحيح، ملتزمون بل ويعودون إلى ما قالته ستيسي في البداية، مثل التوقعات العالية،\nوالاعتقاد بأن جميع الطلاب يستطيعون ذلك، والتأكد من حصول جميع الطلاب\nعلى وصول عادل إلى محتوى مستوى الصف الدراسي. لذا فإن سؤالي هو، كيف\nيمكن للأدوات المخصصة للمعلمين أن تساعد أيضًا في حل هذه المشكلة؟ دينا، هل تريدين\nطردنا ثم نفعل ذلك؟ - بالتأكيد. نعم، أعتقد أن أيمي طرحت سؤالا. أريد استخدام سؤال أيمي\nلبدء الأمر نوعًا ما. هل هناك طرق لتعيين المعلمات باستخدام الذكاء الاصطناعي لإبقاء الطلاب داخل\nمنطقة المحتوى بدلاً من المنتدى المفتوح؟ وأنا أعلم أنه كان هناك\nسؤال آخر حول كيف أمنع الذكاء الاصطناعي من\nمجرد تقديم الإجابات؟ وأعتقد أن هذا الشيء\nالذي التزمنا به حقًا في أكاديمية خان هو إنشاء خانميغو بحيث يكون الذكاء الاصطناعي\nمكانًا آمنًا للطلاب.  لقد بنينا باعتدال. لن يعطي خانميغو\nالإجابة للطلاب إذا طلبوا ذلك، وسيقول بوضوح،\nلا أستطيع أن أعطيك الإجابة، لكن يمكنني تدريبك. وسوف، كما تعلمون، سوف يبقيهم على المسار الصحيح. إذا كنت تعمل على حل مسألة رياضية وقلت، أريد أن أتحدث\nعن الثورة الفرنسية، سيقول خانميغو، هذا رائع، لكن هذا ليس\nالمكان والزمان المناسبين لذلك. وأعتقد أن هذا رائع حقًا. يساعد في الحفاظ على تركيز الطلاب فيما يتعلق بأدوات المعلم. أعتقد أن هذا هو رقم واحد. هل يمكنك أن تتخيل لو\nاستمر أطفالنا في التركيز طوال فترة الفصل الدراسي، كم سيكون ذلك رائعًا؟ أقول ذلك\nكمدرس في المدرسة المتوسطة، أليس كذلك؟  لقد قمت بالتدريس في المدرسة الإعدادية، لذلك\nكان الأمر دائمًا، كما تعلمون، الكثير من الحركة والكثير من النشاط، محاولًا إبقاءهم يركزون علي. لذلك يبدأ الأمر هناك، يبدأ بالمساعدة في الحفاظ على\nمشاركة الطلاب والحفاظ على تركيزهم. وبعد ذلك أعتقد أن الأمر\nيتعلق أيضًا، كما تعلمون، بصفتي مدرسًا للفصل الدراسي، اعتدت أن أقول لكم إنني كنت\nمدرسًا للرياضيات إلى الأبد. يتعلق الأمر بعدم الاضطرار إلى\nالبحث، فقد كنت أبحث في كتاب تلو الآخر عن كتاب تلو الآخر، وأبحث عن الدرس المناسب، والمصدر المناسب، والمواد المناسبة.  وبعد ذلك، كما تعلمون،\nظهر الإنترنت. وكما تعلمون، كان لدينا Google\nوكان لدينا كل الأشياء، وبعد ذلك كان لدي 57000\nعلامة تبويب مفتوحة بينما كنت أبحث عن شيء لتخطيط الدرس به. أعتقد أن هذا يوفر الوقت لأنه يمنحني\nشيئًا عالي الجودة. يمكنني إجراء تلك التعديلات بسرعة. يمكنني إنشاء موارد لتلبية\nاحتياجات طلابي الخاصة بهم\nبسرعة كبيرة جدًا. ويمكنني إنشاء\nمهام جيدة وغنية حقًا، ومرة ​​أخرى، أركز على\nالتدريس القائم على حل المشكلات في المشروع والقدرة على إنشاء\nتلك المهام الغنية بسرعة. هذا كل شئ. - وأعتقد أن الأمر لا يقتصر على\nإنشاء المهام الغنية فحسب، بل ما مدى سرعة\nالتمييز بينها، أليس كذلك؟ أعني أننا كنا نقضي\nساعات في إنجاز هذه المهمة الغنية والعظيمة لجميع الأطفال. الآن يمكننا أن نفعل ذلك في مثل هذه\nالفترة القصيرة من الوقت حيث يمكنني أيضًا إنشاء أربع أو خمس إصدارات أخرى من ذلك تتحدث عن الاحتياجات الفردية\nلمجموعات صغيرة من طلابي أو ربما حتى\nطالب فردي في بضع دقائق فقط، أليس كذلك  ؟ يمكنني عدهم من جهة، والآن لدي موارد عالية الجودة\n ومتميزة لطلابي. - هل لديك أي شيء آخر\nتضيفه إيمان، حول هذا الموضوع؟ - لا، لا أستطيع أن أتفق أكثر من ذلك.  كما تعلمون، عندما أفكر في\nبعض أدوات المعلم، كنت أفكر في نفسي، حسنًا، ما هي الأدوات التي كنت\nسأحبها عندما كنت أقوم بالتدريس؟ ويعد تحديث\nأداة معرفتي أمرًا بالغ الأهمية لأنني كمعلم، أعتقد أن\nالوقت كان سلعة بالنسبة لي. أشعر أنه لم يكن لدي ما يكفي من الوقت، وستكون هناك لحظات أحتاج فيها إلى الدعم في التخطيط لدروسي أو كان أحد زملائي خارج المنزل وقيل لي، مهلاً، أحتاجك لتدريس هذا الصف الثامن  دورة الرياضيات، ولكنني أقوم بتدريس ستة. ولذا فإن مجرد الحصول على أداة تساعدني على\nتسريع وتيرة العمل حتى لا أضطر إلى\nجعل الطلاب يتخلفون عن الركب هو أمر بالغ الأهمية. ولذا، كما تعلمون، أفكر فقط في\nالطرق التي يمكنني من خلالها تخصيص تعلمي، ولكن أيضًا كمعلم\nيمكن أن يبقيني على اطلاع دائم بما هو مطلوب لطلابي. - نعم، فلنوضح\nالأمر أكثر قليلًا لأنك تتحدث\nعن أدوات المعلم. إذن ستيسي، إذا كنت\nفي الفصل الدراسي اليوم، ما هي ميزة الذكاء الاصطناعي التي ستختارها؟ ما الذي كنت ستعتمد عليه أكثر؟ - إذن هذا دائمًا\nسؤال مثير للاهتمام لأن الناس ينظرون إليّ بطريقة مضحكة. أنا بالتأكيد\nأحب أداة التقييم، وهي ليست شيئًا نفعله\nفي فصول الرياضيات، أليس كذلك؟ من سيستخدمه مدرس الرياضيات كنموذج تقييم؟ أنا استخدامها في كل وقت. لقد كان\nمنحنى تعليميًا مثيرًا للاهتمام بالنسبة لي لأنه أثناء اجتياز\nبرنامج الإعداد للمعلم، قمنا بإعداد جميع معايير التقييم الخاصة بنا\nاستنادًا إلى مواد ELA والعلوم الإنسانية، أليس كذلك؟ وعندما بدأت التدريس،\nأمضيت بضع سنوات في ذلك وأدركت أنني بحاجة إلى أن يكون لدى الطلاب فهم أفضل لما يُطلب منهم القيام به،\nوكيف يحتاجون إلى إظهار ذلك وكيف يجب أن يكونوا قادرين على التعبير اللفظي أو إيصال ذلك  بعد الحقيقة. ولأنني كنت\nأكثر تركيزًا على العملية، كنت أستخدم نماذج التقييم وقد استغرق الأمر مني وقتًا طويلاً لأنه لا توجد معايير لحل\nأنظمة المعادلات ذات\nالأعداد النسبية، لذا قمت بإنشائها جميعًا.  لقد قمت بذلك\nمنذ بضعة أسابيع مع خانميجو. استغرق الأمر مني أقل من خمس دقائق وكان واضحًا جدًا للأطفال، وإذا كنت في الفصل الدراسي\nالآن باستخدام هذه الأداة، فهذا ينقل عبء التعلم تمامًا إلى الطالب. وهم يعرفون ما هو متوقع. إنهم يركزون الآن\nعلى العملية بدلاً من ذلك الصف الحرفي الذي لا\nيعلمهم أي شيء، أليس كذلك؟ إنهم الآن في\nحالة ما وراء المعرفية حيث يفكرون\nفيما أتعلمه؟ كيف أعرضه وكيف\nأقوم بتوصيله؟ - ايمان ماذا عنك؟  ما هو المفضل لديك؟ - يجب أن يكون المفضل لدي هو المستوى. لذا فإن أداة التسوية التي\nتسمح لك بأخذ أي نص وتسويته بطرق مختلفة لمستويات قراءة مختلفة\nهي إحدى أدواتي المفضلة لأنه كان لدي\nطلاب لديهم برامج التعليم الفردي وكانوا يقولون لي،\nأولاً، السيدة هوارد، أنا  لا أفهم ما يقوله هذا النص. أو النص الذي أقدمه\nيبدو وكأنه عمل طفل. كنت أسمع ذلك طوال\nالوقت من طلابي. ولذلك فإن فكرة أن\nالجميع يمكنهم الوصول إلى نفس المعلومات ولكن مصممة\nبطريقة تناسبك أنت فقط، قد غيرت قواعد اللعبة بالنسبة لي. وهذا سيكون رقم واحد بالنسبة لي. - وقبل دينا، أسمح لك\nبالإجابة، أريد أن أعود \nبنفسي كمعلمة سابقة للتعليم الخاص، هناك في الواقع أداة لإنشاء برنامج التعليم الفردي (IEP). كم منكم يشاهد\nهذا وقد عانى من أي وقت مضى مع أهداف برنامج التعليم الفردي (IEP) ومراقبة تلك الأهداف؟ اي شخص؟  أنا فقط أمزح. نعم هذا هو. ومن ثم إبقاء الطلاب\nمنخرطين وعلى المسار الصحيح. لذلك كنت أدفع خانميجو ليعطيني\nنتائج مساءلة محددة للغاية وقابلة للقياس لأهداف برنامج التعليم الفردي الرياضية. وعندما تدفعه وتدفعه، فإنه يمنحك ما تحتاجه بالضبط. لذلك هذا الشيء، لو كان لدي\nذلك، لكان قد أنقذني ساعات من حياتي، ساعات. دينا ماذا عنك؟ - حسنًا، لدي\nابن في المدرسة الإعدادية وهو شخص فضولي للغاية ويريد أن يعرف\nكل شيء عن كل شيء. لذلك المفضل لدي هو إشعال فضولي لأنه سألني أسئلة عن أشياء ليس لدي أي فكرة عنها. ولقد تعلمت أن خانميغو هو أفضل\nصديق لي عندما يتعلق الأمر بالإجابة على أسئلته\nحول الطريقة التي يعمل بها العالم والطريقة التي تبدو بها الأشياء\nفي مجالات المواضيع التي، كما تعلمون، عالمه العلمي\nكبير وضخم وضخم وحتى  على الرغم من أن أمي مهتمة بالرياضيات ولدي الكثير من\nالعلوم، إلا أنني أعتقد بالتأكيد أن برنامج Ignite\nMy Curiosity كوالد قد أنقذني أكثر من عدة مرات. - نعم، أستطيع أن أرى أنني شخص وقع في مشكلة في\nمدرسة الكنيسة عندما سألني أين\nكانت الديناصورات مع آدم وحواء. لا أعرف إذا كان هذا يتعلق بأي شخص غير الفضول، فمن المهم\nالاستمرار في التأكد من أننا نبني على فضول الطلاب. إذن هناك بعض\nالأسئلة اللوجستية القادمة. كان أحدهم يسأل عن\nالوقت المناسب لكل شيء. هل يمكنكم التحدث عن كيفية دمج بعض هذه الأدوات؟ كما لو كنا نتحدث عن\nأدوات المعلم التي يمكن أن توفر الوقت، لكني أريد العودة قليلًا إلى أدوات مواجهة الطالب في خانميغو، وإذا كان بإمكان أي شخص أن\nيشرح الفرق بين دوراتنا بالإضافة إلى خانميغو؟ لأنني أعتقد أنني لا أعرف\nإذا كنا قد بدأنا بذلك حقًا. إذًا من يريد أن يبدأ بمجرد منح الناس فرصة الأرض؟ - أستطيع أن أفعل ذلك.\n- شكرا دينا. مُباع! - لدينا دورات في أكاديمية خان. لدينا، وصدق أو لا تصدق، نسمع كثيرًا، كما\nتعلمون، أكاديمية خان، هذه هي الرياضيات والعلوم. لدينا أيضًا ELA،\nولدينا دراسات اجتماعية، ولدينا مهارات حياتية، ولدينا استعداد جامعي ومهني، ومحو\nالأمية المالية، والذكاء الاصطناعي للمعلمين، والذكاء الاصطناعي للطلاب. لدينا تاريخ فني، ولدينا\nالكثير من الدورات التدريبية المختلفة ومع كل محتوى الدورة لدينا تأتي طرق مختلفة للتعلم. نحن نقدم مقاطع فيديو، ونقدم قراءات موجهة. نحن نقدم تمارين\nلممارسة ما تعلمته. لذا، هناك شيء مختلف تمامًا،\nهناك مجموعة كاملة من المحتوى وهي مجرد تلك الدورات التدريبية\nالتي يمكن استخدامها بما يتماشى مع ما تقوم بتدريسه كل يوم. لذلك لدينا مقررات دراسية يمكنك استخدامها، ويمكنك استخدام مقاطع الفيديو الخاصة بنا كفصل دراسي كامل، ويمكنك جعل الطلاب\nيشاهدونها بشكل فردي. ولكن لدينا أيضًا\nأدوات الطلاب في خانميغو، والتي تعد طريقة رائعة حقًا لتمييز تعليماتك. إحدى القطع المفضلة لدي كمدرس، كنت دائمًا كبيرًا جدًا في تدريس المفردات الصريحة، أليس كذلك؟ حتى قبل أن تقول هاتي إنها كانت بمثابة واحدة من أفضل الممارسات، مثل\nتدريس المفردات الصريحة كان دائمًا أمرًا كبيرًا بالنسبة لي. ولذلك أحب أن يكون لدينا\nبعض أدوات المفردات التي يمكن للطلاب من خلالها\nممارسة مفرداتهم في الرياضيات. سأستخدمه، وأعتقد أنه\nيمكن أن يتناسب مع تدريسك بعدة طرق مختلفة. يمكنك إشراك الطلاب في\nأنواع مختلفة من عمليات الإحماء. لديك محتوى لمنحهم التدريب، ولديك فرص\nلهم للحصول على مجموعات من المسائل التدريبية حيث يمكنهم العمل وعليهم شرح أسبابهم وسيقوم خانميغو بتدريبهم. لذلك أعتقد أنه عندما تسأل كيف\nيتناسب ذلك مع تدريسك، أود أن أقول إن ذلك يعتمد\nعلى أسلوب التدريس الخاص بك، ويعتمد على ما تريد القيام به. ولكن لدينا بالتأكيد ما يكفي من المحتوى ليناسب الروتين الأسبوعي. - هل يريد أي منكما إضافة\nأي شيء آخر إلى ذلك؟ - أعتقد أنها أغلقته. وأنا أتفق مع كل ذلك. وKhanmigo، إنها\nطبقة جميلة في الأعلى، أليس كذلك؟ لأنه موجود لدعم\nالطريق بأكمله. - لذا أريد العودة إلى نوع المستقبل الذي نبنيه\nرياضيًا مع طلابنا. وأود أن أعرف، وأحب\nكل من يشاهد هذا أن يفكر في نفس الشيء. لنفترض أن لديك عصا سحرية، أليس كذلك؟ لأنه من الواضح أن لدينا أداة مذهلة، لكنها ليست عصا سحرية. ما الذي ستغيره أو ما هو نوع المستقبل الذي ترغب في رؤيته للمضي قدمًا عندما نفكر في تعليم الرياضيات؟ - نعم، سأتدخل هنا وأقول، إن عصاي السحرية ستغير الروح التي نتعامل بها مع\nتعليم الرياضيات، خاصة مع المتعلمين الصغار. لأنه كما تعلمون، إذا فكرتم\nفي الرياضيات المتقدمة ورياضيات علماء الرياضيات، فهي في الحقيقة موضوع إبداعي بالنسبة لي. يتعلق الأمر ببناء\nفهم للعالم. يتعلق الأمر باستكشاف الأشياء التي لم نعرفها أو نفهمها بعد. لكننا نعلم الرياضيات كما لو أنه\nلا يوجد إبداع في كثير من الأحيان، أليس كذلك؟ وأعتقد أن الذكاء الاصطناعي يمكن أن\nيدعمنا حقًا في هذا التحول حيث بدلاً من التفكير\nفي الأشياء بطريقة واحدة، يمكن للذكاء الاصطناعي أن يساعد الطلاب في التفكير في المشكلات\nمن منظور مختلف أو في شرحها بشكل مختلف\nأو نهج مختلف. وكمعلم، من\nالصعب فعل ذلك بوجود 35 شخصًا أو أكثر في الغرفة، أليس كذلك؟ لذلك أعتقد أن هذا هو المكان الذي يمكن أن يأتي فيه الذكاء الاصطناعي ويدعمنا في إجراء\nتلك المحادثات مع الأطفال والتعمق في الاستكشاف. بالنسبة لي، هذه هي\nالروح الحقيقية للرياضيات التي لا يتوفر لدينا\nالوقت للاستفادة منها. - قطعاً. أشعر أنه لو كان لدي عصا سحرية، فلن تكون هناك لحظة حاسمة يقرر فيها شخص ما ما\nإذا كان جيدًا في الرياضيات أو سيئًا في الرياضيات،\nفسيرى الجميع أنفسهم كشخص رياضيات. وسوف يتعلمون أنه عندما\nأرتكب خطأً، لا يكون الأمر مثل أوه لا، بل دعونا نجري\nمحادثة، كان ذلك ممتعًا. بماذا تفكر؟  وسيشعر الجميع بالقدرة على إجراء هذه المحادثات حول كيف يمكننا التعلم من المفاهيم الخاطئة، وكيف يمكننا الحصول على خطاب رياضي؟ وما أحبه في الذكاء الاصطناعي هو\nأنه يمكّننا من القيام بذلك، وأن التعلم من الأخطاء\nهو في الواقع فرصة. - ماذا عنك دينا؟\n- أعتقد أن جمال الرياضيات يكمن في كونها\nجزءًا من عالمنا بأكمله. قال أينشتاين، كما تعلمون، الرياضيات هي اللغة التي كتب الله بها الكون. انها هناك. إنه في كل مكان ننظر إليه\nوفي كل مكان نراه. ومن المؤسف أنه بالنسبة لمعظم الطلاب، يتم اختزال الأمر في مجرد مجموعة من المعادلات والخطوات الإجرائية. وأعتقد، كما تعلمون، أن مجرد الاتفاق مع زملائي الرائعين هنا، يفتح عالمًا\nلماهية الرياضيات حقًا وما ينبغي أن تكون عليه حتى\nيتمكن الطلاب من رؤية، كما تعلمون، ربما لست رائعًا في الهندسة لكن هل تعلم أنني أحب الجبر. أحب العثور على التعميمات ومعرفة كيفية عمل المعادلات. أو ربما أنا لست متخصصًا في الجبر،\nأنا متخصص في الهندسة. هناك طرق مختلفة\nلحب الرياضيات والتعامل معها. وأعتقد أنه يمكنك أن ترى\nنفسك في ذلك عندما تتاح لك الفرصة وعندما يتم تقديم\nالرياضيات لك على أنها أكبر بكثير من مجرد سلسلة من الخطوات. - وأنا أتفق مع الجميع، في\nكل ما قلته ومن خلال دعم معلمي الرياضيات عن\nكثب، يا إلهي، في السنوات العشر الأخيرة من\nمسيرتي المهنية، أريد أيضًا التمكين، عصاي السحرية ستكون\nتمكين كل معلم رياضيات كما قالت إيمان،  حتى لا أشعر بأنني كذلك، حتى أن بعض معلمي المدارس الابتدائية\nيشعرون أحيانًا أنهم لا يستطيعون تدريس الرياضيات أو\nأنهم يخجلون من الرياضيات أو أنهم يعانون من صدمة رياضية. لدي صدمة الرياضيات.  هل يعاني أي منكم من صدمة الرياضيات؟ وكأنني أعرف بالضبط متى يحدث ذلك. لذا، فهي معرفة أنك تستطيع، ومعرفة أن هذا هو الممكن،\nوالعثور على المتعة مرة أخرى. لذا أود في الواقع\nأن أتحدث قليلاً عن الإبداع والفرح، والذي\nيرتبط أيضًا بتعزيز الثقة. كيف يمكن لهذه الأدوات أن تساعد في إعادة بعض السعادة إلى\nفصول الرياضيات لدينا؟ ستيسي، ما رأيك في ذلك؟ كيف يمكننا أن نحب تعزيز المزيد من الإبداع؟ - نعم، أحاول أن أعرف\nكيف لا أكرر نفسي لأن هذا هو\nسؤالي السحري، أليس كذلك؟ أعتقد أن الأمر يتعلق بمساعدة الطلاب على فحص الرياضيات من\nمنظور آخر، أليس كذلك؟ إذًا في ديناميكيتنا التقليدية، لدينا معلم يقوم بتدريس الرياضيات والطلاب يتعلمون وأحيانًا تتاح لهم\nالفرصة للرد لفظيًا، لكن الأمر يميل إلى أن يكون نوعًا من\nالمحادثة المتبادلة، أليس كذلك؟ وبقدر ما يمكننا جلب حوار بين الأقران وجعل الطلاب يتحدثون ويستكشفون الطرق التي يفكر بها الآخرون بشأن المشكلات أو الطرق التي\nيتعامل بها الآخرون مع المشكلة، فإن هذا أمر ذو قيمة لا تصدق. لكن الوقت محدود للغاية. وبالنسبة لي، مهما كانت\nأداة الذكاء الاصطناعي التي تستخدمها، فقد يكون الأمر يتعلق باستكشاف\nالرياضيات بطريقة أكثر تصويرية، أليس كذلك؟ حيث ننظر إلى الأشياء بيانياً أو نلعب بالأشياء بيانياً\nوصوراً مرئية لها. أو يمكن أن يتعلق الأمر فقط\nبالحصول على تلك المساحة الآمنة لاستكشاف الكيفية\nوالسبب وراء تفكيري أو ما يسمى بأخطائي. لأنه بالنسبة لي، هذا هو المكان الذي يظهر فيه الإبداع والتعلم.  من الأرجح أنك ستستكشف الجانب الإبداعي وكيف تتعامل مع\nشيء ما عندما ترتكب خطأ، أليس كذلك؟ عندما لم أقم بالأمر بشكل صحيح في المرة الأولى وكان علي أن أعود\nوأفحص عمليتي الخاصة. وأعتقد أن هذا هو\nالمكان الذي يمكن أن يساعدنا فيه دعم الدردشة بالذكاء الاصطناعي أو إجراء هذا الحوار حقًا في التعمق هناك. - قطعاً. ومثل ستيسي، كما تعلمون، أرى الإبداع\nباعتباره تفكيرًا عالي المستوى. لذا، بعد أن استخرجت كل\nذلك، هل أفهم ذلك؟  هل يمكنني أن أذكر ذلك؟ لكن هل يمكنني تحليله؟  هل يمكنني خلق شيء جديد من هذا؟  هل يمكنني إجراء مناقشة حول هذا؟ وهذا ما يسمح لنا الذكاء الاصطناعي بفعله. ولذا عندما أفكر في ذلك،\nعندما أربط ذلك بما يحدث في الفصل الدراسي حيث يكون الطلاب جميعًا في\nمستويات مختلفة، بغض النظر عن مستواك، يمكننا الآن\nجميعًا الانخراط في تفكير عالي المستوى يقابلنا\nفي حافة التعلم لدينا. وهذا شيء أنا متحمس جدًا له لهذه الأداة. - في الحقيقة.  هل يمكننا التحدث أكثر قليلاً عن مقابلتك في Learning Edge؟  هل تستطيع التمديد؟ لأن هذا هو الشيء الذي تظهره الكثير من الأبحاث، أليس كذلك؟ يطلق عليه، أعني أنه حتى\nجون هاتي يتحدث عن مبدأ المعتدل في التعلم، لا يمكن أن يكون سهلاً للغاية أو صعبًا للغاية، يجب أن يكون صحيحًا تمامًا، ولكن الصحيح تمامًا، فهو مختلف بالنسبة للجميع، الحافة مختلفة. - بالضبط، الأمر مختلف بالنسبة للجميع.  وكما تعلمون، سأعود إلى هذه الحكاية التي كنا\nنستخدمها حول كون نسبة واحد إلى 35 بينك وبين الأطفال هي أن كل طالب لديه\nميزة تعليمية مختلفة. إذًا، في أي نقطة\nدفعتكم إلى حيث لا نكون في\nوضع الإحباط، ما زلنا نتلقى، كما تعلمون، هذا التعلم الذي يحدث، ولكنه أيضًا،\nليس بنفس الصرامة، أليس كذلك؟ وبالتالي فإن الفكرة هنا هي أنه\nعندما أعمل مع Conmigo، قد أخطئ في شيء ما، أليس كذلك؟ ومن ثم سيخبر خانميغو\n أين أخطأت بالضبط وسيبدأ\nالحوار هناك. ربما فهمت الأمر بشكل صحيح. يمكن لـKhanmigo بعد ذلك رفع المستوى، أليس كذلك؟ ومن ثم يمكننا الآن العمل على شيء أكثر صرامة. وهو أمر مهم حقًا\nللمشاركة، ومن المهم معرفة أن هذا يحدث، وأن كل طالب يتم مقابلته بالضبط حيث يجب أن يكون. وكشخص واحد، من\nالصعب حقًا القيام بذلك. ولكن لدينا مدرس مساعد\nيمكنه مساعدتنا الآن. - نعم بالتاكيد. دينا، هل لديك أي أفكار نهائية\nحول الإبداع أو حافة التعلم؟ - أعتقد أنه مع حافة\nالتعلم، أعتقد أننا قادرون على الاستجابة والتكيف بشكل أسرع\nمن أي وقت مضى. أعتقد أنه، كما تعلمون، بالنسبة\nللطلاب في بعض الأحيان، تحتاج فقط إلى تلك اللحظة الضوئية\nلفهم مفهوم ما حتى يصبح منطقيًا. وأعتقد أن القدرة على\nتحقيق تلك اللحظة ومن ثم القدرة على\nاستخدام ذلك كنقطة انطلاق والتسريع حتى\nلا تكون عالقًا، كما تعلمون، لست عالقًا في العمل تحت مستوى الصف الدراسي أو في مهارات روتينية لفترة طويلة  في الوقت الذي تكون فيه فقط، تستمر في التدرب ولكنك لا تحتاج إليه حقًا بعد الآن. أعتقد أنها تسمح لنا\nبمعرفة متى يمتلكها الطلاب ومتى يكونون مستعدين لمواصلة التحرك، فهي تساعدنا على الخروج من بعض\nالوحل، إذا صح التعبير. وحافظ حقًا على التقدم، وحافظ على تقدم الطلاب للأمام\nواجعلهم منخرطين. وأعتقد أنه فيما يتعلق\nبالإبداع، تمامًا كما يفعلون ذلك،\nكيف تحب أن تتعلم؟ كنا ننظر، كما تعلمون، إلى بعض الدردشات المختلفة التي جاءت. سأل أحد الطلاب وجعل Conmigo يتحدث معهم مثل القراصنة لبعض الوقت لأن\nذلك أبقاهم منخرطين. ولذا كانوا يقومون بأنظمة\nالمعادلات من قرصان، كما تعلمون، وكانوا سعداء لأنهم\nقضوا وقتًا ممتعًا، لكنه كان عملاً ممتازًا.  لقد كانوا يطرحون أسئلة قوية ويقومون بالحسابات. هذا رائع، أليس كذلك؟ وأعتقد أننا كذلك، فهو\nيمنحنا الفرصة، كما تعلمون، لاستعادة\nالفرحة والاستمتاع بها. - هل ستصدقونني جميعًا عندما\nأخبرتكم أنني ارتديت ملابس القراصنة ذات مرة وعندما\nكنت مدرسًا وقمت بتدريس الرياضيات بهذه الطريقة. حتى الآن يمكنك تلبيس القرصان ولديك مشاكل القراصنة الرياضيات. في بعض الأحيان عليك أن تفعل ما يجب عليك فعله للحفاظ على تفاعل الطلاب،\nوهو ما أريده فقط، فنحن بصدد تقريب\nالوقت، وقتنا معًا. لذلك أحب أن أسمع منكم جميعا. ما هي تقنية وأداة المشاركة الرياضية المفضلة لديك\n وكيف تعتقد أنه يمكن تحسينها باستخدام أدوات Conmigo؟ ما هو الشيء المفضل لديك،\nاحصل على قبعة المعلم الخاصة بك مرة أخرى. دعونا نحفر بعمق، ما رأيك؟ أوه، أنت تبتسمين يا إيمان،\nأعتقد أنك تريدين الذهاب أولاً. - حسنًا، انتظر مرة أخرى. دانييل، ارجعي\nبالسؤال مرة أخرى. - ما هي خطوبتك المفضلة؟ ما هي مشاركتك المفضلة في الرياضيات مع الطلاب؟ وكيف يمكن للذكاء الاصطناعي أن يساعد في تعزيز ذلك؟ - إنه أمر مضحك لأن هذا ربما كان أصعب شيء كان علي القيام به، ولكن الشيء الأكثر أهمية، وكان هذا هو الدرس الذي جذبني، كيف يمكنني أن أجعل كثيرات الحدود مثيرة؟ كيف يمكنني جعل هذه الصور مجموعة؟ هذا شيء يرتبط به الأطفال. ولذا فإنني في كثير من الأحيان\nأقضي الكثير من الوقت في كيفية تقديم هذا الدرس فقط لجعل الأطفال يرافقونني. وكانت إحدى\nالميزات الأولى التي أطلقناها مع Conmigo هي\nربط الدروس. ولذا كان من الرائع حقًا أن أحصل بسرعة على شيء كنت أعلم أن طلابي سيحبونه.  لقد أمضيت عامًا عندما كنت أقوم بالتدريس في فيلادلفيا حيث كان أطفالي مهووسين\nبفريق فيلادلفيا إيجلز والقدرة على ربط ذلك\nبتعليم الرياضيات، وهو ما يغير قواعد اللعبة. - نعم.  دينا، اذهب.\n- كان المفضل لدي هو تعليم القطع المكافئة الأولية والسرعة باستخدام عمل غاليليو والقدرة على الإطلاق. أطلقنا كرات التنس،\nوأطلقنا صواريخ مائية، وقمنا بكل أنواع\nالأشياء في الميدان. كنت أرغب في الحصول على إما\nمثل Ignite My Curiosity أو شيء من هذا القبيل حتى\nيتمكنوا من التعمق في التاريخ لأنني أعتقد أن\nالتاريخ رائع. تعلم كل شيء عن علماء الرياضيات الذين قدموا لنا هذه النظريات والأفكار العظيمة التي نستخدمها اليوم. أعتقد أنه كان من الممكن أن\nيجعل الأمر أكثر ثراءً لتعلم قصص مختلفة. وبدلاً من أن أروي لهم قصة، ما زال بإمكاني أن أروي القصة، لكنهم يستطيعون أن يرووا القصص. ماذا تعلمت؟  ماذا رأيت؟ ما الذي تعتقد أنه\nمثير للاهتمام حول هذا الشخص؟ الآن دعونا نتبلل ونطلق صواريخ المياه على أرض الملعب. - ذلك رائع.  ستيسي، ماذا عنك؟ - حسنا، نحن الحصول على محددة هنا. لذلك كان علي أن أحفر بعمق من أجل هذا. كنت\nمدرسًا للرياضيات والعلوم في المدرسة المتوسطة. لقد علمت كلاهما. ولذا كان الشيء المفضل لدي\nدائمًا هو أن أظهر للطلاب كيف توجد الرياضيات في\nالعالم الحقيقي، وليس في عزلة. لذا فإن طريقتي المفضلة التي\nاكتشفتها للقيام بذلك هي تدريس\nالوظائف جنبًا إلى جنب مع الموجات، والموجات الصوتية، وموجات الماء،\nوموجات الضوء، أليس كذلك؟ والنظر إلى الموجات كوظائف وجعل الطلاب\nيقومون ببعض التحليلات العميقة هناك. وينتج عن ذلك أن\nلدى الأطفال هذا الفهم الشامل ليس فقط للعلوم، بل للرياضيات،\nوهذا حقًا متأصل في هذا\nالفهم العلمي والنظرية. كان من الممكن أن يساعدني الذكاء الاصطناعي كثيرًا، لأن الأمر استغرق مني\nعدة سنوات حتى أتمكن من الحصول على هذه الوحدة ومجموعة التعليمات بشكل صحيح. وأعتقد أن وجود شيء\nيمكنني، كما تعلمون، مجرد التفكير فيه من\nشأنه أن يمنعني من التقليب عبر جميع الكتب\nوجميع صفحات الويب، ولكن يمكنني فقط تنظيم المعلومات بشكل أسرع حتى أتمكن من إنشاء تلك\nالروابط في العالم الحقيقي حول كيفية القيام بذلك بالضبط  إن تطبيق الرياضيات على\nالعالم الحقيقي كان من شأنه أن يغير قواعد اللعبة بالنسبة لي\nويسمح لي بالقيام بالمزيد من ذلك مع طلابي. - بالضبط. وسأقوم، سينثيا\nكتبت للتو في الدردشة، أعلم أنكم جميعًا لا تستطيعون رؤيتها، لكن سينثيا، أتفق معك في\nسؤال طلاب الذكاء الاصطناعي عن شعورهم تجاه الموضوع الأكبر وكيف يشعرون تجاه\nما تعلموه للتو ومساعدتهم على التواصل بشكل أعمق قليلاً. لذا استراتيجيتي المفضلة عندما\nكنت معلمًا، كنت مدرسًا للتعليم الخاص للصف الخامس والسادس، وقد جئت إلى الرياضيات وأنا\nأركل وأصرخ لأنني كنت أعاني من صدمة الرياضيات. لذلك تعاملت معها بالتأكيد كقطعة إبداعية كمدرس. وكنت سأغني موسيقى الراب عن الأشياء وأرتدي حرفيًا ملابس\nمثل متشيطن الراب وأقوم بالتدريس باللهجة الأيرلندية.  لقد فعلت كل ما بوسعي\nلإبقاء الطلاب منخرطين. وما وجدته باستخدام\nالأدوات التي يقدمها خانميجو، هناك أداة قصيدة يمكنك\nفعلًا، يستطيع المعلمون تلخيص درس في الشعر، ويمكن للطلاب تلخيص\nالدروس باستخدام القصائد. وأعتقد أن هذا\nاتصال رائع حقًا بالقراءة والكتابة وتمكين الطلاب\nمن التفكير في الرياضيات باعتبارها شكلاً من أشكال الفن الإبداعي. مثلما تتحدثون جميعًا عن\nالمعادلات الخطية ومتعددات الحدود وأرى كثيرات الحدود الصغيرة\nترتدي القبعات، كما تعلمون، إنه حقًا جذاب لإضفاء الحياة على الرياضيات. لذلك نحن، إنه يوم الجمعة. لقد كنتم رائعين. نحن سعداء جدًا\nبانضمامك إلينا هنا.  لقد قمنا بنشر روابط في الدردشة وللتسجيل، سوف\nتحصل على نسخة من التسجيل بالإضافة إلى عدد كبير. نعم، أستخدم بعض المصطلحات الرياضية.  هل هذا مصطلح رياضي؟ أتمنى أن يكون الأمر كذلك، عدد كبير. إنها أيضًا مجرد كلمة كبيرة من الموارد. توجد قائمة تشغيل على YouTube حيث يمكنك رؤية\nما نتحدث عنه بالضبط. أردنا أن نحافظ على تركيزكم علينا وعلى المحادثة بدلاً من رؤية شاشة شخص ما وهو\nيحاول شيئًا مختلفًا هنا. لذلك، ستحصل على جميع\nالموارد إذا كنت تريد معرفة المزيد، ويمكنك أيضًا التحقق من ذلك،\nهناك بعض الروابط التي وضعناها في الدردشة، ولكننا\nسنقدم لك كل هذه المعلومات في رسالة بريد إلكتروني\nمع التسجيل. لذا في الختام، ما هي\nالفكرة الأخيرة التي ترغب في تركها عند التفكير في التقاطع بين الرياضيات والذكاء الاصطناعي؟ الأفكار النهائية ، لكم جميعا؟ - أعتقد أنني أود أن أقول\nإن هناك الكثير لنتعلمه، ولدينا جميعًا الكثير\nلنتعلمه حول كيفية إدخال الذكاء الاصطناعي إلى الفصل الدراسي. لكن في الوقت الحالي، كما تعلمون، بقدر ما يمكننا أن نغمس إصبعنا في الماء ونجرب شيئًا واحدًا ونتعلمه جنبًا إلى جنب مع طلابنا، بالنسبة لي، يتعلق الأمر بالتمكين. يتعلق الأمر بجعل\nحياة معلمينا أفضل، ومنحهم مزيدًا من الوقت\nمع طلابهم أو أسرهم. كما هو الحال في الأمسيات عندما كنت أتواجد في المدرسة طوال الوقت،\nمثل مجرد تجربة شيء واحد والاستعداد لتحمل هذه المخاطرة وتعلم شيء ما\nجنبًا إلى جنب مع طلابنا، أعتقد أن هذا هو\nالتحدي الذي يواجهنا جميعًا حقًا  . - شكرًا لك. ايمان ما رأيك؟  افكار اخيرة؟ - أفكاري الأخيرة هي أن\nكل شخص متخصص في الرياضيات وأن امتلاك أداة مثل\nKhanmigo يمنحك القدرة على رؤية ذلك بغض النظر عن\nمكان وجودك، إذا كنت أقل من مستوى الصف الدراسي، أو إذا\nكنت في مستوى الصف الدراسي أو ربما كنت كذلك.  إذا كنت في\nمرحلتين دراسيتين أمامك، فهناك فرصة\nلك للبقاء منخرطًا، وإجراء خطاب، والإبداع. - ودينا؟ - أود أن أقول، أعتقد أننا، كما تعلمون، كنا نكافح من أجل أن تصبح الرياضيات أكثر\nإجرائية بكثير، وأكثر عنادًا بكثير، ونرى\nانخفاض مشاركة طلابنا نتيجة لذلك. إنهم لا يرون تطبيق\nالرياضيات، ولا يرون كيف تؤثر على حياتهم. وأعتقد أن هذه هي لحظتنا. وأنا أتفق مع ستاسي بكل إخلاص. نحن جميعًا نتعلم، وكلنا\nنكتشف ذلك معًا. لكن انضم إلينا. تعالوا اكتشفوا هذا معنا. تعالوا لإجراء محادثات\nمعنا، دعونا نتحدث عن ذلك لأننا نريد أن نتحدث عنه لأننا نريد لأطفالنا أن\nيروا الرياضيات التي نحبها جميعًا. وأعتقد أن هذه هي\nفرصتنا لاستعادتها. ♪ إعادة السعادة\nإلى دروس الرياضيات لدينا ♪ ♪ هذه حقيقة ♪ هذه ملاحظتي الأخيرة،\nحرفيًا في ملاحظة، شكرًا جزيلاً لك على انضمامك إلينا. نحن نقدر لكم. نحن نقدر المحادثة. سنكتشف\nطريقة لتصدير هذه الدردشة وإرسالها إليك. من فضلك شارك هذا مع أصدقائك، من فضلك كما قالت دينا، انضم إلينا. سيكون لدينا المزيد\nمن هذه المحادثات. أخبرنا بما أعجبك\nوما لم يعجبك. نحن دائما منفتحون على ردود الفعل. نحن نتعلم أيضا. نحن معلمون، جميعكم. ونحن نحب التحدث إلى المعلمين لأنك متسامح جدًا\nمع كل الأشياء. لذا شكرا لانضمامك إلينا. نحن نقدر لك وحتى\nنراكم مرة أخرى، وداعا للجميع. - [الراوي] شكرًا لك\nعلى مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التدريس والتعلم لدينا. لمعرفة المزيد حول كيف\nيمكن لـ Khanmigo دعمك أنت وطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك، وحتى لا تفوت أبدًا\nالإعلانات المثيرة حول مواد الدورة التدريبية المجانية الجديدة في Khan Academy، تأكد من الاشتراك.",
    "t_italian": "- Ciao a tutti, piacere di conoscervi. Mi chiamo Danielle Sullivan e sono così entusiasta di essere la facilitatrice di questa eccellente conversazione di matematica oggi con i miei fantastici colleghi. Oggi vogliamo parlare\ndell'insegnamento della matematica, di come è cambiato, si è spostato\ndopo la pandemia, e di come l'intelligenza artificiale può offrire nuove\nopportunità per garantire che stiamo reintroducendo il pensiero critico, la comprensione concettuale e la conversazione, onestamente, nelle nostre aule di matematica. Sappiamo che avete tutti una\nvarietà di sfide diverse e speriamo che questa\nconversazione vi aiuti a raggiungere il punto in cui vi trovate e a far\navanzare i vostri studenti. Quindi ora lascerò che il\npanel si presenti. Andiamo avanti e iniziamo con Dina. - Ciao a tutti, sono Dina Neyman. Dirigo il nostro team di successo distrettuale\nqui alla Khan Academy. Ma, cosa più importante,\ninsegno matematica da molto, molto tempo, ormai da 25 anni,\niniziando in realtà con la matematica della scuola media. E adoro la mia scuola media, ma ho insegnato un\npo' di tutto.  Lo passerò a Iman. - Grazie Dina. Ciao a tutti, mi chiamo Iman Howard. Sono il responsabile del gruppo per tutti i nostri contenuti STEM qui alla Khan Academy. Sono uno studente permanente e un\ninsegnante di matematica e scienze e sono davvero entusiasta di\nchattare con tutti oggi. Te lo passo, Stacie. - Ciao a tutti, mi chiamo Stacie Johnson e, come Dina, sono stata anche\nun'insegnante di matematica per tutta la vita e, come Iman in matematica e scienze, alle scuole medie, superiori ed elementari, guido il nostro\nteam di apprendimento professionale.  Sono davvero entusiasta di essere qui per parlare con voi oggi dell'insegnamento della matematica e di come stiamo raggiungendo i bambini. - Fantastico, e mi sono completamente dimenticato di parlare anche del mio background. Quindi sono la padrona di casa e sì, questo non è solo il\nmio background letterale, sì, in realtà sono di mia sorella in Arizona, ma sostengo il Nordest. Quindi andrò in Arizona,\nil che è piuttosto emozionante. E sono un educatore permanente e ho anche insegnato\neducazione speciale e matematica in quinta e sesta elementare, sia a\nWashington DC che nello stato di New York. Quindi la prima domanda per darci il via è: qual è l'approccio della Khan Academy\nall'insegnamento della matematica e come sta cambiando\nnell'era dell'intelligenza artificiale? E Iman, voglio che tu\nvada avanti e ci dia il via. - Fantastico, grazie mille. Quindi, quando sviluppiamo\ncontenuti per la matematica, ci pensiamo con\naspetti di rigore. Quindi questo\nlo suddivide davvero in tre modi. Innanzitutto, pensiamo alla fluidità procedurale. Quindi puoi calcolare\ncon velocità e precisione? E poi entriamo nella\ncomprensione concettuale. Quindi puoi accedere ai concetti\nda una serie di prospettive per vedere la matematica come, sai,\npiù che semplicemente, sai, scusami, meno discreta\ne più meno procedurale. E poi finalmente ci pensiamo\ncon l'applicazione. Quindi puoi utilizzare procedure e concetti in modo flessibile e risolvere i problemi? E si sa, ogni\nstandard potrebbe avere uno o una combinazione di questi aspetti. E a volte questo può sembrare\nmolto limitante quando sviluppiamo contenuti. Quindi, quando si tratta di\nintelligenza artificiale, una delle cose che mi entusiasma davvero è l'\nopportunità di approfondire la comprensione concettuale\nche deriva dal discorso. E così invece di uno studente\nsolo, sai, giusto o sbagliato,\narriva la comprensione concettuale e possiamo capire perché i\ncalcoli stanno accadendo in questo modo in un modo davvero individualizzato. - Quindi Dina, aggiungiamolo. Quali sono i tuoi pensieri? - Sai, penso che il\ndiscorso sia davvero uno dei pezzi più grandi che l'intelligenza artificiale porta e aggiunge all'insegnamento della matematica. Come insegnante di classe, i miei studenti hanno sempre lavorato in gruppi.  La mia classe non è mai stata silenziosa. Eravamo sempre rumorosi e\nchiacchieravamo di matematica, facevamo progetti e\nmettevamo in discussione il nostro pensiero e spiegavamo il nostro ragionamento. E penso che,\nin generale, molte influenze tecnologiche\nnelle classi abbiano spinto l' insegnamento della matematica a\ndiventare più procedurale. Puoi, sai, puoi\nfare questo calcolo? Puoi risolvere questa equazione? Puoi eseguire i passaggi\nin un ordine particolare? Non necessariamente ci\nsono opzioni, giusto? Esistono diversi percorsi\nche possiamo intraprendere per arrivare alla risposta matematica giusta. E gli studenti spesso hanno ottime ragioni e pensano alle cose in modo diverso. E questo si aggiunge a tutti i nostri ragionamenti e a tutti i nostri\nstrumenti matematici quando possiamo sentire come i bambini pensano alla matematica e il modo in cui\nescogitano il passo successivo o la loro strategia o perché affrontano un\nproblema in un certo modo. E penso che con l'intelligenza artificiale, quando\ngli studenti devono fare domande, quando devono essere in grado di dire, non capisco questo pezzo\ndi un'equazione, non è, non capisco l'\nintero concetto, è, non lo so.  Non capiscono come passare\nda questo passaggio a quello successivo, altrimenti dovranno pensare in modo più critico.  E costruisce davvero quella\nconoscenza concettuale. Ma penso che queste domande\nsiano una parte davvero importante. - Allora Stacie, come facciamo alla Khan Academy ad aiutare gli insegnanti a capire\ntutto questo? - Sì, voglio dire, penso che anche prima di pensare a come lo stiamo\naffrontando, mentre penso al discorso e alla comprensione concettuale,\nuna delle cose di cui sono più orgoglioso\ndella Khan Academy è dove si trovano gli studenti  facendo questo. Di cosa stiamo parlando?  In cosa stiamo costruendo la\ncomprensione concettuale? E il fatto che alla\nKhan Academy, crediamo, sappiamo che ogni studente\npuò ottenere risultati a livello scolastico. E penso che ciò che è veramente\nimportante da dire qui è che tutti i nostri studenti hanno lacune di apprendimento. Stanno arrivando tutti\ncon questi buchi, giusto? È una specie di comprensione svizzera\n della matematica e del modo in cui costruiamo davvero\nun'implementazione incentrata sul non condannare i bambini a lavorare al di sotto del\nlivello scolastico per il prossimo anno, in modo da perpetuare quel divario. Ma mettendoli a livello scolastico, sapendo e credendo che è\nlì che possono ottenere risultati utilizzando l'intelligenza artificiale per realizzare alcune di quelle impalcature. Perché ovviamente l'\ninsegnante è la migliore risorsa, ovviamente l'insegnante è il\npunto a cui dovremmo appoggiarci e gli studenti dovrebbero sempre\nandare prima dall'insegnante, ma l'insegnante non può\nparlare con 35 bambini o più contemporaneamente, giusto? Quindi, mentre aspettiamo l'insegnante, l' intelligenza artificiale può essere lì per supportare i\nbambini in modo che non rimangano bloccati, non arrivino al punto di frustrazione e alzino le\nmani e smettano, giusto? Perché tutto ciò che sta facendo è\nperpetuare quelle lacune di apprendimento e allargare i buchi. Quindi penso che la\ncosa più importante da dire qui sia come manteniamo gli studenti al livello scolastico e come possiamo garantire che\nsia lì che imparano e che\nprogrediscono da lì, possiamo contemporaneamente tornare indietro e riempire alcuni  di quei buchi\nmentre continuiamo a lavorare con gli studenti a livello scolastico. E per quanto riguarda il modo in cui riusciremo a\nportare gli insegnanti lì, penso che sia un processo passo dopo passo, giusto? I nostri insegnanti hanno\ntroppe cose da fare tutto il tempo,\ntroppi compiti amministrativi, troppe cose che non hanno a che fare con l'insegnamento vero e proprio ai bambini. Quindi la domanda è: come\nascoltiamo gli insegnanti riguardo alla formazione di cui hanno bisogno? Come raccogliamo informazioni sul supporto di cui hanno bisogno? E poi progettare\nprogrammi di formazione in risposta a ciò, piuttosto che limitarsi a fornire\nloro una serie di supporto e formazione aspettandosi\nche facciano la differenza. - Assolutamente. E tutti, potete postare\ndomande nella chat. Abbiamo alcune domande guidate\nche avevamo pianificato in anticipo, ma voglio assolutamente assicurarmi di avere la capacità\ndi rispondere alle tue domande. E mi piacerebbe che\niniziaste tutti a parlare e a rispondere anche nella chat se questo è troppo travolgente per voi. Vuoi solo presentarti e ascoltare, fantastico. Se vuoi interagire, bene. Ad esempio, ci sono molti\nmodi diversi di essere oggi, ma sarei curioso, come se Matthew avesse appena digitato \"\napprendimento personalizzato\". Tipo, cosa state pensando? Come hai sentito Dina, Iman e Stacie condividere alcune delle sfide che stai affrontando. Quindi pensaci e inizieremo a\nscavare un po' più a fondo in questo , giusto?  La matematica è tipicamente\nconsiderata una materia molto concreta e oggettiva. E per quanto ne parliamo, a volte non vediamo molta attenzione al processo e all'approccio, e a volte è giusto e sbagliato.  L’ intelligenza artificiale ha il potenziale\nper influenzarlo? Iman, quali sono i tuoi pensieri? - Assolutamente. Sapete, gran parte del nostro\ncurriculum a volte si concentra sulla fluidità procedurale. E così quando sei in\nclasse a eseguire questa operazione, fai una domanda a uno studente, non riescono a dare la risposta giusta. E ora all'improvviso\nsiamo i ragazzi a dire: \" Non sono un esperto di matematica, ho sbagliato\". E poi la conversazione finisce e forse non\nalzano più la mano. Tuttavia, quando introduciamo\nqualcosa come Conmigo e l'intelligenza artificiale, non solo se ho\nsbagliato, non si tratta di un arresto, ma ora c'è l'opportunità di dire, beh, facciamo una conversazione. Scopriamo perché è successo. E ora stiamo entrando in\nquella comprensione concettuale. E si sa, qualcuno\nnella chat ha menzionato l' apprendimento personalizzato. Andremo all'apprendimento personalizzato. Molti di noi sono stati in\nclassi in cui il rapporto era di uno a 35, e abbiamo alcuni studenti\nche sono a livello scolastico, alcuni due anni indietro\ne alcuni due anni avanti. E così ora abbiamo l'opportunità di incontrare tutti coloro che sono al limite dell'apprendimento. Giusto o sbagliato, abbiamo un modo per personalizzare le tue istruzioni e portarti al livello\nche sappiamo che puoi raggiungere, ovvero il livello scolastico. - Vai avanti, Dina. - Sai, è un apprendimento personalizzato, ma sento che ci sia\nsempre stato questo desiderio e questo obiettivo\nda parte degli insegnanti della scuola secondaria di rendere l'apprendimento in piccoli gruppi una realtà. E sembra impossibile. Ed è stato così impegnativo perché hai assolutamente ragione. Hai 36 cadaveri nella tua classe e vuoi lavorare con questo\npiccolo gruppo di tre o quattro persone che necessitano di attenzione. Ma cosa succede nel momento in cui ti siedi, tutte quelle mani si alzano, ho bisogno di te, ho bisogno di te, ho una domanda. Non so cosa fare dopo. E penso che quel tempo in piccoli gruppi, in realtà Lynn abbia commentato la flessibilità nell'insegnamento nella chat. E penso che l’intelligenza artificiale ci dia\nla possibilità di fare cose che prima erano così\ncomplicate e difficili. Penso che possiamo fare\nistruzioni in piccoli gruppi perché l'intelligenza artificiale può interagire e, sai, far\nprogredire gli studenti nel loro apprendimento e farli andare avanti. E penso che in realtà\ndia ai nostri figli più tempo con l'insegnante nel modo\nin cui ne hanno davvero bisogno. Non si tratta tanto dell'insegnante che si alza e spiega in\nun'intera classe in una volta sola, ma piuttosto dell'insegnante che è\nin grado di soddisfare quei bisogni proprio dove si trovano e\nfornisce davvero agli studenti l'istruzione, la spiegazione e la guida dove\ne come  bisogno di essa. - Sì. Quindi Dina, questo mi fa pensare alla mia parte preferita dell'essere\nin classe. Non so se avete visto, ad esempio, che qualche anno fa girava questo video su YouTube che si \nchiamava My Favorite No, giusto? E si trattava di osservare il modo in cui gli studenti avevano risolto un problema e trovare le risposte sbagliate,\nma anche trovare la bellezza e l'accuratezza in quelle risposte sbagliate. E la mia parte preferita\ndell'insegnamento della matematica era ascoltare gli studenti esprimere il modo in cui affrontavano un problema o come pensavano\na riguardo, giusto? Ai loro coetanei, a me, in\nquei piccoli gruppi, e anche questa è una delle cose più difficili. Come puoi essere lì per\nascoltare tutti i bambini? Come puoi essere davvero lì per interiorizzare ciò che stanno pensando? Perché come insegnanti di matematica è difficile insegnare una risposta sbagliata. Sì.  Possiamo certamente insegnare\nun malinteso, giusto? Quindi, quando penso\nall'intelligenza artificiale, una delle cose che avrei voluto avere nella mia\nclasse era questa capacità di tornare indietro e guardare le trascrizioni o le conversazioni\nche uno studente sta avendo con un chat bot per identificare come vengono elaborate  questa informazione? Sono bloccati? E dicono solo: non lo so, non lo\nso. O stanno davvero cercando di elaborare questo? E che tipo di\ndomande fanno? Perché per me, se riesco a\nsfruttare queste informazioni, se riesco a ottenerle dalla mia classe\nnel suo complesso, cosa che non posso fare semplicemente andando in giro ad ascoltare\ntutti, ora posso insegnare le idee sbagliate della mia classe e sfruttare davvero ciò che\nloro  sapere per costruire su ciò che ancora non sanno. - Quindi, per collegare ciò che hai appena detto e per rispondere ad\nalcune delle domande che arrivano contemporaneamente, un paio di persone hanno chiesto di Khanmigo, dà solo risposte agli studenti? O se gli studenti sono davvero,\ntipo, un tutor individuale, ma se gli studenti\nsono davvero immotivati, come funziona Khanmigo per essere quell'insegnante quando l'insegnante\nnon può clonare se stesso per 35 modi? Giusto? E quanti avete la sensazione di\nnon avere abbastanza tempo per insegnare matematica? Nessuno?  C'è qualcuno nella stanza? Esattamente.  Sì. Allora Iman, vuoi\niniziare a parlarne? - Sì, assolutamente. Quindi, sai, in modo simile a ciò che farebbe un buon insegnante\nquando uno studente sbaglia una risposta, non\ngli sputiamo semplicemente la risposta corretta e ce ne andiamo. Chiediamo loro una serie di domande strutturate\nin base alla risposta che ci hanno dato. Ed è lì che\nvedi che il dialogo che avviene tra Conmigo e gli studenti è che, ehi, non è del tutto giusto. Parliamo di dove hai\nsmarrito quel decimale. Andiamo giù e lavoriamo insieme avanti e indietro per portarti alla risposta giusta. E ora che l'hai capito,\nlascia che te ne dia un altro che puoi provare da solo. Giusto, simile a quello che\nfaresti tu, penso a Conmigo come assistente didattico, giusto? E così, anche se sono in grado\ndi facilitare qui, si tratta di un piccolo gruppo, so che i miei studenti qui non sono impegnati. E quando si tratta di gestione della classe, ho bisogno che i miei studenti siano coinvolti. - E sì.\n- Posso rispondere, Cynthia, fare una domanda, e penso che si basi su\nquesto, ha detto che ha scoperto che l'intelligenza artificiale è utile, ma\ngli studenti non sono sempre motivati o sicuri di come utilizzare la risorsa. E ha chiesto:\ngli istruttori dovrebbero insegnare agli studenti come utilizzare le risorse dell'intelligenza artificiale, compresi gli esercizi didattici che le utilizzano? E penso assolutamente, proprio\ncome con qualsiasi strumento, proprio come con una calcolatrice grafica,\ncon il modo in cui insegniamo le routine in\nclasse, penso assolutamente che dobbiamo insegnare ai nostri\nstudenti come usare l'intelligenza artificiale, cosa  le migliori pratiche sono. Penso che tutto inizi con la modellistica. Se fosse la mia classe,\ninizierei col tirarla su e fare una chiacchierata io stesso, facendo domande e, sai, mostrando\nagli studenti come appare. E so che abbiamo appena\npubblicato, oh mio Dio, Iman, probabilmente puoi anche dire, penso che sia stato nelle\nultime due settimane in realtà. Abbiamo rilasciato il nostro corso AI per studenti. È giusto? - Sicuramente l'abbiamo fatto. E penso che sia una buona chiamata perché sai,\nsentiamo questo termine AI, AI, ed è così importante dire ai nostri studenti cos'è un grande modello linguistico? Cos'è questa cosa che interagisce? Conosce tutte le\nrisposte?  Cosa può fare? Cosa non può fare? E quindi abbiamo un\ncorso, AI for Education, a cui tutti potreste dare un'occhiata per assicurarvi di sapere come usarlo come strumento per migliorare il nostro apprendimento,\nperché è di questo che si tratta. - Assolutamente. E parlando di strumenti e\napprendimento, stiamo imparando che non abbiamo organizzato\nquesto webinar nel modo più interattivo. Quindi stiamo facendo del nostro meglio. Vediamo le tue domande,\nvediamo i tuoi commenti, quindi continueremo ad\nassicurarci di rispondere a tutto. E questa è un'esperienza di apprendimento. Quindi non so se potete\nvedere le rispettive risposte, ma\ncontinueremo la conversazione. Continua a parlarci, noi\nporteremo, metteremo in evidenza le cose. Allora Stacie, cosa ne\npensi delle cose che Iman e Dina hanno condiviso? - Sì, sono d'accordo su tutto. C'era un commento nella\nchat su come insegnare agli studenti ad apprezzare, come approfondire davvero, come insegnare effettivamente agli\nstudenti a porre domande migliori? E penso che in realtà sia una\ndomanda che riguarda noi, come adulti, come leader nella stanza,\ncosì come come studenti. E penso che la\ncosa importante da dire ad alta voce sia, nello spirito di tutti\nnoi, imparare che insegnanti e studenti stanno imparando\ninsieme come utilizzare questa nuova tecnologia, giusto? E per noi cambiare questa mentalità e capire che non è un motore di ricerca. Quindi una delle cose che abbiamo\nvisto avere davvero successo è proprio esercitarsi a porre\nla domanda a un'altra persona prima di inserirla in Conmigo\no in un chatbot, giusto? Perché la gente pensa, e gli studenti in particolare,\npensano, oh, c'è un certo modo in cui\ndevo dirlo, giusto? Si sente spesso parlare di suggerimenti o c'è questo\nlinguaggio particolare che devo usare. Ed è davvero colloquiale. Quindi quando, come insegnante,\nse dici qualcosa allo studente come, beh,\nbeh, cosa diresti al ragazzo accanto a te, giusto? Oppure cosa mi diresti? Ok, ora\nscrivilo, è una specie di cambiamento di mentalità perché\npensiamo che sia un processo davvero formale , ma dare a noi stessi\nquel coaching così come ai nostri studenti è davvero importante. E mantienilo colloquiale. E se non ti piace la risposta, dì, non ne sono sicuro. Puoi dirlo diversamente? Oppure non mi piace quella risposta. E respingerti nello stesso modo in cui faresti se stessi\nconversando con un'altra persona. - E penso che potrebbe\nessere un membro in più del tuo gruppo, giusto? Se i ragazzi devono mettersi d'accordo\nsu quale domanda porre, oh mio Dio, il\ndiscorso diventa davvero fantastico quando possono farne solo una e devono capire\nquale sia la prossima domanda perfetta. - SÌ. E John,\nti vediamo assolutamente scrivere lì, come se John stesse facendo delle\ncose davvero fantastiche con i suoi studenti che, anche se come se ci fossero\nrisposte corrette, dicendo loro che non è interessato solo\nalla risposta corretta, ma a come hanno risolto e quali passaggi. Ma John si è chiesto: in che modo\nl'intelligenza artificiale aiuta anche gli studenti che hanno IEP o 504 o altre\ndisabilità o sistemazioni relative alla documentazione? E vorrei aggiungere come\npensate che sia d'aiuto quando gli studenti che potrebbero essere timidi o avere qualche trauma in matematica o avere davvero una scarsa sicurezza in matematica? - Quindi dirò che mio marito\nè un educatore ESOL, parla inglese di altre\nlingue in alcuni stati, vivo in Florida, in alcuni stati lo chiamiamo ELL, studenti di inglese. Ma mio marito\nla usa, usa la tecnologia, come un modo per aiutare gli studenti\ndella sua classe a pensare alle domande prima di\ndoverle porre pubblicamente, soprattutto se hanno quell'ansia e semplicemente non sono sicuri. Prendersi un minuto e avere l'opportunità di interagire, può dare loro la possibilità\ndi sentirsi più sicuri di sapere se sono sulla\nstrada giusta per ottenere un feedback prima di fare una domanda o, sai,  se pensi a\nquando gli insegnanti insegnano, se c'è una parola e\nnon sanno cosa significa, possono digitarla rapidamente. Possono chiedere rapidamente,\ncollegarla e ottenere un esempio o scoprire dove è\napplicabile in  vita reale, vero? Perché è qualcosa di\ncosì fondamentale per stabilire connessioni con il contenuto. Penso che dia rilevanza ai nostri contenuti. Penso che dia agli studenti l'\nopportunità di chiedere in un modo che non sia\nminaccioso o spaventoso. Dà loro la possibilità di esplorare davvero i contenuti in sicurezza. - Iman, cosa ne pensi? Sì, sono d'accordo con tutto quello che\ndici, Dina. E sai, ho insegnato a\nstudenti che avevano IEP e talvolta la digitazione\nstessa era il limite. E una delle cose che mi\npiace davvero di Khanmigo è la possibilità di parlarne,\ndi porre effettivamente le tue domande. E se hai le cuffie,\nConmigo ora ha una voce. Quindi può essere come una cosa uno contro uno\nin cui, ehi, Conmigo, ho bisogno di aiuto qui, e poi sono l'unico\nche sente la risposta. E questo può essere davvero\nfondamentale per convincere uno studente, secondo te, Dina, a combattere\nparte di quel trauma matematico e ad assicurarsi davvero che i\nsuoi bisogni siano soddisfatti. - Sì, e penso,\ntornando agli studenti multilingue, anche l'idea che Khanmigo in questo momento possa conversare e avere quel dialogo in inglese , spagnolo e portoghese. Quindi è anche uno spazio sicuro in cui gli\nstudenti non devono rimanere indietro nell'apprendimento e nei contenuti della matematica mentre allo\nstesso tempo acquisiscono sicurezza e competenza in inglese. Quindi, sai, un accordo\ncon tutto ciò che è stato detto,\npenso che sia uno spazio sicuro per gli studenti per testare le loro\nidee senza correre il rischio con cui potrebbero non sentirsi ancora a proprio agio. - Sì, e penso che un altro modo in cui può davvero aiutare è\naiutare gli insegnanti a creare lezioni per soddisfare le esigenze degli\nstudenti con cui lavorano. Ed essere in grado di aiutarti ad\nadattare le lezioni in modo più rapido ed efficiente di quanto\ntu abbia mai fatto prima. Quindi posso dire,\nsai, che ho studenti a cui piace davvero questo argomento o quel tema, e sono in grado di creare\nlezioni attorno ad esso, sono in grado di prendere contenuti e\nancorarli a qualcosa. Se gli studenti amano fare escursioni in montagna, perché sto osservando il\nbackground di Danielle, se gli studenti amano fare escursioni, parliamo dell'escursionismo. E penso solo che questo\nfornisca davvero agli insegnanti gli strumenti per essere in grado di differenziarsi\ncome non abbiamo mai fatto prima. - Quindi voglio approfondire un po' l'argomento perché ci sono alcune domande che\nemergono sui parametri su cosa succede se i bambini vanno fuori tema, ma anche io, non voglio\nandare fuori tema anch'io, ma voglio che tu abbia iniziato, tu  ho accennato ora ad alcuni degli strumenti dell'insegnante. Penso che abbiamo passato molto\ntempo a parlare di come l'intelligenza artificiale si sta concentrando sulla\nconversazione degli studenti, ma come aiutiamo gli educatori, perché fissiamo i problemi, giusto? C'è un essere umano con molti altri umani in\nclasse con molti bisogni, soprattutto dopo la pandemia. Abbiamo visto così tante lacune di apprendimento. Ma tutti in\nquesto webinar, siamo onesti, abbiamo delle lacune da molto tempo, vero? In matematica.  Sì. E penso che tutti si stiano davvero\nmuovendo nella giusta direzione, impegnati e persino richiamando ciò che Stacie ha detto all'inizio, come le grandi aspettative,\ncredendo che tutti gli studenti possano farlo, assicurandosi che tutti gli studenti\nabbiano equo accesso ai contenuti di livello scolastico. Quindi la mia domanda è: in che modo\ngli strumenti per gli insegnanti possono aiutare a risolvere questo problema? Dina, vuoi darci il via\ne poi lo faremo? - Sicuro. Sì, penso che Amy abbia fatto una domanda. Voglio usare la domanda di Amy\nper dare il via alla cosa. Esistono modi per impostare parametri con l'intelligenza artificiale per mantenere gli studenti nell'area dei\ncontenuti anziché in un forum aperto? E so che c'era\nun'altra domanda su come posso impedire all'IA di\nfornire semplicemente le risposte? E penso che quello su\ncui ci siamo davvero impegnati alla Khan Academy sia creare Khanmigo in modo che l'intelligenza artificiale\nsia uno spazio sicuro per gli studenti. Abbiamo costruito con moderazione. Khanmigo non darà\nla risposta agli studenti se la chiedono, dirà chiaramente, non\nposso darti la risposta, ma posso istruirti. E lo farà, lo sai, lo farà, li manterrà sulla buona strada. Se stai lavorando su un problema di matematica e dici, voglio parlare\ndella Rivoluzione francese, Khanmigo dirà, è favoloso, ma questo non è né il\nluogo né il momento per una cosa del genere. E penso che sia davvero fantastico. Aiuta a mantenere gli studenti concentrati in termini di strumenti dell'insegnante. Penso che sia il numero uno. Riesci a immaginare se i nostri bambini\nrimanessero concentrati per tutto il periodo della lezione, quanto sarebbe favoloso?  Lo dico da\ninsegnante di scuola media, giusto? Ho insegnato alle scuole medie, quindi\nc'era sempre, sai, molto movimento, molta attività, cercando di mantenerli concentrati su di me. Quindi si inizia da lì, si inizia con l'aiutare a mantenere gli studenti\nimpegnati, mantenendoli concentrati. E poi penso che\nriguardi anche, come insegnante di classe, guardavo, vi avevo detto che sono stato un\ninsegnante di matematica da sempre, voi tutti.  Si tratta di non dover\ncercare, ero solito cercare libro dopo libro dopo libro, cercando la lezione giusta, la risorsa giusta, i materiali giusti. E poi, sai, poi è\nnato Internet. E sai, avevamo Google\ne avevamo tutto e poi avevo appena 57.000\nschede aperte mentre cercavo qualcosa con cui pianificare la lezione. Penso che questo faccia risparmiare tempo perché mi dà\nqualcosa di alta qualità. Posso apportare rapidamente tali modifiche. Posso creare risorse per soddisfare\nle esigenze specifiche dei miei\nstudenti molto, molto rapidamente. E posso creare compiti davvero buoni e\nricchi, che ancora una volta mi occupo\ndell'insegnamento basato sui problemi del progetto e della capacità di creare\nrapidamente quei compiti ricchi. Questo è tutto. - E penso non solo alla\ncreazione di compiti ricchi, ma alla velocità con cui puoi poi\ndifferenziarli, giusto? Voglio dire, passavamo\nore a realizzare questo fantastico compito per tutti i bambini. Ora possiamo farlo in\nun periodo di tempo così breve che posso anche realizzarne altre quattro o cinque versioni che rispondano alle esigenze individuali di\npiccoli gruppi di miei studenti o forse anche di un singolo\nstudente letteralmente in pochi minuti, giusto  ? Potrei contarli sulle dita di una mano e ora dispongo di risorse differenziate e di alta qualità\nper i miei studenti . - Hai qualcos'altro\nda aggiungere Iman, su quell'argomento? - No, non potrei essere più d'accordo. Sai, quando penso ad\nalcuni degli strumenti dell'insegnante, pensavo tra me e me, beh, quali avrei\namato quando insegnavo? E aggiornare il mio\nstrumento di conoscenza è così fondamentale perché come insegnante, penso che\nil tempo fosse una merce per me. Mi sento come se non avessi mai avuto abbastanza tempo e ci sarebbero stati momenti in cui, sai, avevo bisogno di supporto con la pianificazione delle lezioni o uno dei miei colleghi era fuori e mi è stato detto, ehi, ho bisogno che tu insegni a questa terza media  corso di matematica, ma ne insegno sei. E quindi avere semplicemente uno strumento che\nmi metta rapidamente al passo in modo da non dover far rimanere\ngli studenti ulteriormente indietro è davvero fondamentale. E quindi, sai, penso solo ai\nmodi in cui posso personalizzare il mio apprendimento, ma anche come insegnante\npotrei tenermi aggiornato su ciò di cui hanno bisogno i miei studenti. - Sì, quindi analizziamolo\nun po' di più perché stai parlando\ndegli strumenti dell'insegnante. Quindi Stacie, se fossi\nin classe oggi, quale funzionalità di intelligenza artificiale preferiresti?  Su cosa ti saresti appoggiato di più? - Quindi questa è sempre una\ndomanda interessante perché la gente mi guarda in modo strano. Sono assolutamente innamorato\ndello strumento delle rubriche, che non è qualcosa che facciamo\nnelle aule di matematica, giusto? Chi utilizzerebbe l’insegnante di matematica come rubrica?  Li uso sempre. Ed è stata una\ncurva di apprendimento davvero interessante per me perché mentre seguivo il\nprogramma di preparazione degli insegnanti, abbiamo fatto tutte le nostre rubriche\nbasate su argomenti ELA e discipline umanistiche, giusto? E quando ho iniziato a insegnare,\nho trascorso qualche anno e ho capito che avevo bisogno che gli studenti comprendessero meglio ciò che viene loro chiesto di fare,\ncome devono mostrarlo e come dovrebbero essere in grado di verbalizzarlo o comunicarlo.  dopo il fatto. E quindi, poiché ero molto\npiù concentrato sul processo, usavo le rubriche e ci ho messo un'eternità perché non ci sono rubriche\nlà fuori per risolvere sistemi di equazioni con\nnumeri razionali per realizzarle tutte. Quindi ne ho fatto uno un paio di\nsettimane fa con Khanmigo. Mi ci sono voluti meno di cinque minuti ed era così esplicito per i bambini e se fossi in classe in\nquesto momento con quello strumento, trasferirebbe totalmente l'onere dell'apprendimento sullo studente. Sanno cosa ci si aspetta. Ora si concentrano\nsul processo piuttosto che sul voto in lettere che non\ninsegna loro nulla, giusto? Ora sono davvero in\nquello stato metacognitivo in cui pensano a\ncosa sto imparando? Come lo mostro e\ncome lo comunico? - Iman, e tu?  Qual è il tuo preferito? - Il mio preferito è il livellatore. Quindi lo strumento livellatore che\nti consente di prendere qualsiasi testo e livellarlo in modi diversi per diversi livelli di lettura\nè uno dei miei strumenti preferiti perché avevo\nstudenti che avevano IEP e mi dicevano\ntipo, uno, Ms. Howard, io  non capisco cosa dice questo testo Oppure il messaggio che ti sto dando\nsembra un lavoro da bambini.  Lo sentivo\ncontinuamente dai miei studenti. E quindi questa idea che\ntutti possano accedere alle stesse informazioni ma che siano personalizzate\nin modo che siano solo per te, per me è un punto di svolta. E quindi quello sarebbe il mio numero uno. - E prima di Dina, ti lascio\nrispondere, voglio portarmi io stesso sulle spalle come ex\ninsegnante di educazione speciale, in realtà esiste uno strumento per la creazione di IEP. Quanti di voi che guardano\nquesto video hanno mai avuto problemi con gli obiettivi IEP e con il monitoraggio di tali obiettivi? Nessuno?  Stavo solo scherzando.  Sì lo è. E poi mantenere gli studenti\ncoinvolti e in pista. Quindi stavo spingendo Khanmigo a fornirmi\nrisultati di responsabilità misurabili molto specifici per gli obiettivi IEP matematici. E quando lo spingi e lo spingi, ti dà esattamente ciò di cui hai bisogno. Quindi quella cosa, se l'avessi avuta\n, mi avrebbe salvato ore della mia vita, ore. Dina, e tu? - Ok, allora ho un\nfiglio delle medie che è un individuo molto curioso e vuole sapere\ntutto di tutto. Quindi il mio preferito è Accendi la mia curiosità perché mi ha fatto domande su cose di cui non ho idea. E ho imparato che Khanmigo è il mio migliore\namico quando si tratta di rispondere alle sue domande\nsu come funziona il mondo e su come appaiono le cose\nin aree tematiche che sono, sai, il suo mondo della scienza\nè grande, enorme, massiccio e persino  anche se mamma è una brava di matematica e io ho molta\nscienza, penso decisamente che come genitore Ignite\nMy Curiosity mi abbia salvato più di qualche volta. - Sì, capisco che sono stato qualcuno che si è messo nei guai alla\nscuola della chiesa per aver chiesto dove fossero i dinosauri\ncon Adamo ed Eva.  Non so se questo si riferisce a qualcuno tranne che alla curiosità, è importante\ncontinuare ad assicurarsi di sviluppare la curiosità per gli studenti. Quindi ci sono alcune\ndomande logistiche in arrivo. Qualcuno stava chiedendo\ntempo per adattare tutto. Potete parlare di come incorporiamo alcuni di questi strumenti? Stiamo parlando degli\nstrumenti per gli insegnanti che possono far risparmiare tempo, ma voglio tornare un po' indietro agli strumenti rivolti agli studenti di Khanmigo e se effettivamente qualcuno può\nspiegare la differenza tra i nostri corsi e Khanmigo? Perché penso che non so\nse abbiamo davvero iniziato con quello. Quindi chi vuole iniziare semplicemente dando alla gente la conformazione del terreno? - Riesco a farlo.\n- Grazie Dina. Venduto! - Abbiamo corsi su Khan Academy. Abbiamo, e che ci crediate o no, sentiamo spesso,\nsai, Khan Academy, che è matematica e scienze.  In realtà abbiamo anche l'ELA,\nabbiamo studi sociali, abbiamo competenze per la vita, abbiamo preparazione universitaria e professionale,\nalfabetizzazione finanziaria, intelligenza artificiale per educatori, intelligenza artificiale per studenti. Abbiamo storia dell'arte, abbiamo\nmolti corsi diversi e tutti i contenuti dei nostri corsi offrono modi diversi di apprendere. Proponiamo video, proponiamo letture guidate. Offriamo esercizi per\nmettere in pratica ciò che hai imparato. Quindi c'è tutto un altro,\nc'è tutta una serie di contenuti che sono proprio quei corsi\nche possono essere utilizzati in linea con ciò che insegni ogni giorno. Quindi abbiamo corsi che puoi utilizzare, puoi utilizzare i nostri video come tutta la classe, puoi farli\nguardare agli studenti individualmente. Ma poi abbiamo anche gli\nstrumenti per studenti Khanmigo, che sono davvero un bel modo per differenziare il tuo insegnamento. Uno dei miei pezzi preferiti come insegnante, sono sempre stato molto interessato all'insegnamento del vocabolario esplicito, giusto? Anche prima di Hattie avevo detto che era come una di quelle migliori pratiche, come se l'\ninsegnamento esplicito del vocabolario fosse sempre stato una cosa importante per me. E quindi mi piace il fatto che\nabbiamo alcuni strumenti di vocabolario in cui gli studenti possono\nesercitarsi con i loro vocaboli matematici.  Lo userei, penso che\npossa adattarsi al tuo insegnamento in molti modi diversi. Puoi coinvolgere gli studenti con\ndiversi tipi di riscaldamento. Hai contenuti per dare loro pratica, hai opportunità\nper loro di ottenere serie di problemi pratici su cui possono lavorare e devono spiegare il loro ragionamento e Khanmigo li istruirà. Quindi penso che quando chiedi come si\ninserisce nel tuo insegnamento, direi che dipende\ndal tuo stile di insegnamento, dipende da cosa vuoi fare. Ma abbiamo sicuramente abbastanza contenuti per inserirli in una routine settimanale. - Qualcuno di voi vuole aggiungere\nqualcos'altro a questo? - Penso che l'abbia chiuso dentro lei. Sono d'accordo con tutto questo. E Khanmigo, è un\nbel livello in alto, giusto? Perché è lì per supportarti durante\ntutto il percorso. - Quindi voglio tornare al tipo di futuro che stiamo costruendo\nmatematicamente con i nostri studenti. E mi piacerebbe saperlo, e mi\npiace che tutti coloro che guardano questo film pensino alla stessa cosa. Quindi supponiamo che tu abbia una bacchetta magica, giusto? Perché ovviamente abbiamo uno strumento straordinario, ma non è una bacchetta magica. Cosa cambieresti o che tipo di futuro vorresti vedere andare avanti quando pensiamo all’insegnamento della matematica? - Sì, intervengo qui e dico che la mia bacchetta magica cambierebbe lo spirito con cui ci\navviciniamo all'insegnamento della matematica, soprattutto con gli studenti più giovani. Perché sai, se pensi alla\nmatematica avanzata e alla matematica dei matematici, per me è davvero una materia creativa.  Si tratta di costruire la\ncomprensione del mondo.  Si tratta di esplorare cose che ancora non conosciamo e comprendiamo. Ma spesso insegniamo matematica come se\nnon ci fosse creatività, giusto? E penso che l'intelligenza artificiale possa davvero\nsupportarci in quel cambiamento in cui invece di pensare\nalle cose in un modo, l'intelligenza artificiale può aiutare gli studenti a pensare ai problemi\nda una prospettiva diversa o a spiegarli in modo diverso\no con un approccio diverso. E come insegnante, è\ndavvero difficile farlo con 35 o più esseri umani in una stanza, giusto? Quindi penso che sia qui che l'intelligenza artificiale può entrare e supportarci nell'avere\nconversazioni con i bambini e nell'approfondire davvero l'esplorazione. Questo per me è il vero\nspirito della matematica che spesso non abbiamo il\ntempo di sfruttare. - Assolutamente. Sento che se avessi una bacchetta magica, non ci sarebbe un momento decisivo in cui qualcuno deciderebbe\nse è bravo o cattivo in matematica, tutti si\nvedrebbero come una persona matematica. E imparerebbero che quando,\nsai, commetto un errore, non è come un oh no, è una\nconversazione, è stato divertente. Cosa stai pensando? E tutti si sentirebbero autorizzati a tenere questi discorsi su come possiamo imparare dalle idee sbagliate, come possiamo avere un discorso sulla matematica? E ciò che mi piace dell’intelligenza artificiale è\nche ci consente di fare proprio questo, che imparare dagli errori\nè in realtà un’opportunità. - E tu, Dina?\n- Penso che la bellezza della matematica stia nel\nfatto che fa parte di tutto il nostro mondo.  Si sa, diceva Einstein, la matematica è il linguaggio con cui Dio ha scritto l'universo.  E ' là fuori. È ovunque guardiamo\ne ovunque lo vediamo. Ed è un peccato che per la maggior parte degli studenti tutto si riduca a un semplice insieme di equazioni e passaggi procedurali. E penso che, sai, giusto per essere d'accordo con i miei fantastici colleghi qui, si apre il mondo\ndi cosa sia veramente la matematica e cosa dovrebbe essere in modo che\ngli studenti possano vedere, sai, forse non sono molto bravo in geometria  , ma sai una cosa, adoro l'algebra. Adoro trovare generalizzazioni e capire come possono funzionare le equazioni. O forse non sono un algebrista,\nsono un esperto di geometria. Esistono diversi modi di\namare la matematica e di impegnarsi con essa. E penso che tu possa\nvederti in questo quando ne hai l'opportunità e quando ti viene presentata la\nmatematica come molto più grande di una serie di passaggi. - E sono d'accordo con tutti,\ntutto quello che hai detto e dal sostenere da vicino gli insegnanti di matematica\nper, cavolo, gli ultimi 10 anni della mia\ncarriera, voglio anche dare potere, la mia bacchetta magica sarebbe quella di\ndare potere a ogni insegnante di matematica come ha detto Iman,  per non sentirmi come se fossi un, anche alcuni insegnanti delle scuole elementari\na volte si sentono come se non potessero insegnare la matematica o\nsi allontanano dalla matematica o hanno loro stessi un trauma matematico. Ho un trauma matematico. Qualcuno di voi ha avuto un trauma in matematica? Come se sapessi esattamente quando succede. Quindi è sapere che puoi, è sapere che è possibile\ne ritrovare la gioia. Quindi in realtà mi piacerebbe\nparlare un po' di creatività, gioia, che è anche\ncollegata all'aumento della fiducia. In che modo questi strumenti possono contribuire a riportare un po’ di gioia nelle nostre\nclassi di matematica? Stacie, cosa ne pensi? Come possiamo migliorare la creatività? - Sì, sto cercando di\ncapire come non ripetermi perché questa è la mia\ndomanda sulla bacchetta magica, giusto? Penso che si tratti di aiutare gli studenti a esaminare la matematica da\nun'altra prospettiva, giusto? Quindi nella nostra dinamica tradizionale, abbiamo un insegnante che insegna matematica e gli studenti stanno imparando e talvolta hanno l'\nopportunità di rispondere verbalmente, ma tende ad essere una specie di\nconversazione bidirezionale, giusto? Per quanto possiamo avviare un dialogo tra pari e far sì che gli studenti parlino ed esplorino il modo in cui le altre persone pensano ai problemi o il modo in cui le altre\npersone affrontano un problema, è incredibilmente prezioso. Ma il tempo è così limitato. E quindi per me, qualunque\nstrumento di intelligenza artificiale tu stia utilizzando, potrebbe riguardare l'esplorazione della\nmatematica in modo più pittorico, giusto? Dove guardiamo le cose graficamente o giochiamo con le cose graficamente\ne le loro immagini visive. Oppure potrebbe trattarsi semplicemente di\navere quello spazio sicuro per esplorare il come e il\nperché dietro i miei pensieri o i miei cosiddetti errori. Perché per me è lì che emergono la creatività e l'apprendimento. È quasi più probabile che esplorerai il lato creativo e il modo in cui ti avvicini a\nqualcosa quando commetti un errore, giusto? Quando non ho capito bene la prima volta e devo tornare indietro\ned esaminare il mio processo. E penso che sia\nproprio lì che avere il supporto della chat AI o avere quel dialogo può davvero aiutarci a scavare lì. - Assolutamente. E come Stacie, sai, considero la creatività\ncome un modo di pensare di ordine superiore. Quindi, tirando fuori tutto\n, ho capito? Posso ricordarlo? Ma posso analizzarlo? Posso creare qualcosa di nuovo da questo? Posso avere una discussione su questo? Ed è ciò che l'intelligenza artificiale ci consente di fare. E così, quando ci penso,\nquando lo collego a ciò che accade in una classe in cui gli studenti sono tutti a\nlivelli diversi, indipendentemente dal livello, ora possiamo\ntutti impegnarci in un pensiero di ordine superiore che ci incontra\nal nostro limite di apprendimento. E quindi è qualcosa di cui sono davvero entusiasta per questo strumento. - In realtà. Possiamo parlare ancora un po' dell'incontro con te al Learning Edge? Puoi approfondire l'argomento? Perché è una cosa che stanno dimostrando molte ricerche, giusto? Si chiama, voglio dire, anche\nJohn Hattie parla del principio dell'apprendimento Riccioli d'oro, non può essere troppo facile, troppo difficile, deve essere giusto, ma giusto, è diverso per tutti, il limite è diverso. - Esatto, è diverso per ognuno. E sai, torno a questo aneddoto che abbiamo\nusato riguardo al rapporto 1 a 35 tra te e i bambini, secondo cui ogni studente ha un\ndiverso margine di apprendimento. Quindi a che punto\nvi ho spinti al punto in cui non siamo in\nmodalità frustrazione, stiamo ancora ottenendo, sapete, quell'apprendimento che sta accadendo, ma non è anche\ncosì rigoroso, giusto? E quindi l'idea è che\nquando lavoro con Conmigo, potrei sbagliare qualcosa, giusto? E poi Khanmigo\ndirà esattamente dove ho sbagliato e il\ndialogo inizierà proprio da lì. Forse ho capito bene. Khanmigo può quindi salire di livello, giusto? E poi ora possiamo lavorare su qualcosa di un po’ più rigoroso. Ed è davvero importante per il\ncoinvolgimento, è importante per apprendere che ciò sta accadendo, che ogni studente viene incontrato esattamente dove deve essere. E come persona, è\ndavvero difficile da fare. Ma abbiamo un assistente didattico\nche può aiutarci adesso. - Si assolutamente. Dina, qualche considerazione finale\nsulla creatività o sul vantaggio dell'apprendimento? - Penso che con il vantaggio\ndell'apprendimento, penso che siamo in grado di essere reattivi e adattivi più velocemente\ndi quanto lo siamo mai stati. Penso che, sai, per\ngli studenti a volte basta quel momento di illuminazione per\ncomprendere un concetto e dargli un senso. E penso che riuscire a\nfar sì che quel momento accada e poi poter apprezzare,\nusarlo come trampolino di lancio e accelerare in modo da\nnon rimanere bloccato, sai, non essere bloccato a lavorare al di sotto del livello scolastico o su abilità meccaniche per un lungo periodo  tempo in cui sei semplicemente, continui a esercitarti ma non ne hai più bisogno. Penso che ci permetta di\nvedere quando gli studenti ce l'hanno e quando sono pronti a continuare a muoversi, ci aiuta a uscire da un po' di\nfango, se vuoi. E mantieni davvero i progressi, fai sì che gli studenti vadano avanti\ne li mantengano impegnati. E penso in termini\ndi creatività, proprio mentre lo fanno,\ncome ti piace imparare? Stavamo guardando, sai, alcune diverse chat che erano arrivate. Uno studente ha chiesto e ha chiesto a Conmigo di parlare con loro come un pirata per un po' perché\nli teneva impegnati. E così stavano facendo sistemi\ndi equazioni da, sai, un pirata ed era, erano entusiasti di\ndivertirsi, ma era un lavoro eccellente. Stavano facendo domande solide e stavano facendo i conti.  E' favoloso, vero? E penso che lo siamo,\nci dà l'opportunità, sai, di riportare la\ngioia, di divertirci. - Mi credereste tutti\nse vi dicessi che una volta mi sono vestito da pirata e\nquando ero insegnante e insegnavo matematica in quel modo. Quindi ora puoi vestire un pirata e avere problemi di matematica con i pirati. A volte devi fare quello che devi fare per mantenere gli studenti impegnati,\ncosa che voglio solo, stiamo completando\nil tempo, il nostro tempo insieme. Quindi mi piacerebbe sentire la vostra opinione. Qual è la tua\ntecnica e il tuo strumento preferito per il coinvolgimento in matematica e come pensi che potrebbe essere migliorato utilizzando gli strumenti Conmigo? Qual è la tua attività preferita?\nRimettiti il ​​cappello da insegnante. Scaviamo in profondità, cosa ne pensate? Oh, stai sorridendo Iman,\npenso che tu voglia andare per primo. - Va bene, aspetta ancora una volta. Danielle, torna con la\ndomanda ancora una volta. - Qual è il tuo impegno preferito? Qual è stato il tuo impegno preferito in matematica con gli studenti? E in che modo l’intelligenza artificiale potrebbe contribuire a migliorare tutto ciò? - Quindi è divertente perché questa è stata probabilmente la cosa più difficile che ho dovuto fare, ma la cosa più importante, e quella era la mia lezione, come posso rendere i polinomi entusiasmanti? Come posso realizzare questo set di foto? Questo è qualcosa con cui i bambini si identificano. E quindi spesso\nspendo così tanto tempo su come introdurre questa lezione solo per convincere i bambini ad accompagnarmi. E una delle prime\nfunzionalità che abbiamo rilasciato con Conmigo sono\nstati gli hook delle lezioni. E quindi è stato davvero bello prendere davvero velocemente qualcosa che sapevo sarebbe piaciuto ai miei studenti. Ho avuto un anno in cui insegnavo a Philadelphia in cui i miei figli erano ossessionati\ndai Philadelphia Eagles ed essere in grado di collegarlo\nall'insegnamento della matematica, è un punto di svolta. - Sì.  Dina, vai.\n- Il mio preferito era insegnare le parabole iniziali e la velocità utilizzando il lavoro di Galileo e sapersi lanciare. Abbiamo lanciato palline da tennis,\nabbiamo lanciato razzi ad acqua, abbiamo fatto ogni genere di\ncose sul campo. Mi sarebbe piaciuto avere\nIgnite My Curiosity o qualcosa del genere in modo che\npotessero scavare in profondità nella storia perché penso che la\nstoria sia affascinante. Imparare tutto sui matematici che ci hanno dato questi grandi teoremi e idee che usiamo oggi. Penso che avrebbe potuto\nrenderlo ancora più ricco imparare storie diverse. E invece di raccontare loro una storia, potrei comunque raccontare la storia, ma loro potrebbero raccontare le storie. Cos'hai imparato?  Che cosa hai visto? Cosa pensi che sia\ninteressante in questa persona? Ora andiamo a bagnarci e lanciamo razzi d'acqua sul campo. - È fantastico.  Stacie, e tu? - Beh, qui stiamo andando nello specifico. Quindi ho dovuto scavare in profondità per questo. Ero un\ninsegnante di matematica e scienze della scuola media. Ho insegnato entrambi. E quindi la mia cosa preferita è\nsempre stata mostrare agli studenti come la matematica esiste nel\nmondo reale, non isolatamente. E quindi il mio modo preferito che abbia\nmai trovato per farlo è stato insegnare le\nfunzioni insieme alle onde, onde sonore, onde dell'acqua,\nonde luminose, giusto? E guardare le onde come funzioni e chiedere agli studenti di\nfare davvero delle analisi approfondite lì. E il risultato è che i ragazzi\nhanno una comprensione davvero approfondita non solo della scienza, ma anche della matematica,\nche è davvero inerente a quella\ncomprensione e teoria scientifica.  L' intelligenza artificiale avrebbe potuto aiutarmi molto perché mi ci sono voluti\nanni per ottenere quell'unità e quel set di istruzioni giuste. E penso che avere qualcosa su\ncui potrei, sai, fare un semplice brainstorming,\nmi impedirebbe di sfogliare tutti i libri\ne tutte le pagine web, ma potrei semplicemente curare le informazioni più velocemente in modo da poter creare quelle\nconnessioni nel mondo reale di esattamente come funziona  applicare la matematica al\nmondo reale sarebbe stato davvero un punto di svolta per me e\nmi avrebbe permesso di fare molto di più con i miei studenti. - Esattamente. E dirò, Cynthia\nha appena scritto nella chat, so che non potete vederlo, ma Cynthia, sono d'accordo con\nte che chiedi agli studenti di intelligenza artificiale cosa pensano dell'argomento più ampio e cosa pensano di\nciò che hanno appena imparato e aiutandoli a connettersi un po' più a fondo. Quindi la mia strategia preferita quando\nero insegnante, ero un insegnante di educazione speciale di quinta e sesta elementare, e sono arrivato alla matematica\nscalciando e urlando perché anch'io ho avuto un trauma da matematica. Quindi l'ho affrontato decisamente come un pezzo creativo come insegnante. E avrei fatto rap sulle cose e mi sarei letteralmente vestito\ncome un folletto del rap e avrei insegnato con un accento irlandese. Ho fatto tutto il possibile\nper mantenere gli studenti impegnati. E quello che ho scoperto usando\ngli strumenti offerti da Khanmigo, c'è uno strumento per le poesie\nche puoi effettivamente fare, gli insegnanti possono riassumere una lezione di poesia, gli studenti possono riassumere le\nlezioni usando poesie. E penso che sia un\ncollegamento davvero interessante con l'alfabetizzazione e che dà agli studenti la possibilità\ndi pensare alla matematica come a una forma d'arte creativa. Come se tutti voi parlaste di\nequazioni lineari e polinomi e vedo piccoli polinomi\nvestiti con cappelli e, sapete, è proprio bello dare vita alla matematica. Così siamo, è venerdì.  Siete stati tutti meravigliosi. Siamo così felici che tu\nsia qui con noi. Abbiamo pubblicato collegamenti nella chat e registrandoti\nriceverai una copia della registrazione e molto altro ancora. Sì, uso alcuni termini matematici. È un termine matematico? Spero che lo sia, una pletora. È anche solo una parola grossa di risorse. C'è una playlist su YouTube dove puoi vedere esattamente di\ncosa stiamo parlando. Volevamo mantenervi concentrati su di noi e sulla conversazione invece di vedere lo schermo di qualcuno che\nprova qualcosa di diverso qui. Quindi otterrai tutte le\nrisorse se vuoi saperne di più, puoi anche\ncontrollare, ci sono un paio di link che abbiamo inserito nella chat, ma\nti forniremo tutte queste informazioni in un'e-mail\ncon la registrazione. Quindi, in conclusione, qual è l'\nultimo pensiero che ti piacerebbe lasciare pensando all'intersezione tra matematica e intelligenza artificiale? Pensieri finali, ok? - Penso che direi semplicemente\nche c'è molto da imparare e tutti abbiamo molto da\nimparare su come portare l'intelligenza artificiale in classe. Ma per ora, per quanto potessimo semplicemente immergere un piede nell'acqua e provare una cosa e imparare insieme ai nostri studenti, per me si tratta di empowerment.  Si tratta di\nmigliorare la vita dei nostri insegnanti, restituendo loro più tempo da dedicare ai\nloro studenti o alle loro famiglie. Come la sera, quando ero sempre a scuola,\ncome provare semplicemente una cosa ed essere disposti a correre quel rischio e ad imparare qualcosa\ninsieme ai nostri studenti, penso che sia davvero la\nsfida che tutti noi abbiamo davanti  . - Grazie. Iman, cosa ne pensi?  Pensieri finali? - Il mio pensiero finale è che\nogni persona è una persona che pratica la matematica e avere uno strumento come\nKhanmigo ti dà il potere di vedere proprio questo, non importa\ndove ti trovi, se sei al di sotto del livello scolastico, se\nsei al livello scolastico o forse tu'  Se sei un paio\ndi livelli scolastici più avanti, c'è un'opportunità\nper te di rimanere impegnato, di avere un discorso e di essere creativo. - E Dina? - Direi che penso che, sai, siamo stati, abbiamo lottato perché la matematica diventasse\nmolto più procedurale, molto più meccanica, e di conseguenza vediamo che il coinvolgimento dei nostri studenti è\ndiminuito .  Non vedono l'applicazione\ndella matematica, non vedono l'impatto che ha sulle loro vite. E penso che questo sia il nostro momento. Sono d'accordo con Stacie in tutto e per tutto. Stiamo tutti imparando,\nlo stiamo scoprendo tutti insieme. Ma unisciti a noi. Vieni a capirlo con noi. Vieni a conversare\ncon noi, parliamone perché vogliamo parlarne perché vogliamo che i nostri figli\nvedano la matematica che tutti noi amiamo. E penso che questa sia la nostra\noccasione per riaverlo indietro. ♪ Riportare la felicità\nnelle nostre lezioni di matematica ♪ ♪ Questo è un dato di fatto ♪ Questa è la mia nota finale,\nletteralmente su una nota, grazie mille per esserti unito a noi. Ti apprezziamo. Apprezziamo la conversazione. Troveremo\nun modo per esportare questa chat e inviartela. Per favore condividilo con i tuoi amici, per favore, come ha detto Dina, unisciti a noi. Avremo altre\ndi queste conversazioni. Raccontaci cosa ti è piaciuto e\ncosa non ti è piaciuto. Siamo sempre aperti al feedback. Anche noi stiamo imparando. Siamo educatori, voi tutti. E adoriamo parlare con gli educatori perché sei così indulgente\ncon tutte le cose. Quindi grazie per esserti unito a noi. Vi apprezziamo e finché non\nci rivedremo, ciao a tutti. - [Narratore] Grazie\nper aver guardato questo video e per aver fatto parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo e per non perdere mai\nannunci entusiasmanti sui nuovi materiali dei corsi gratuiti su Khan Academy, assicurati di iscriverti."
}