{
    "source": "PInbNdxH39w",
    "youtubelink": "https://www.youtube.com/watch?v=PInbNdxH39w",
    "t_english": "- Hi, I'm Michele, a professional learning specialist here at Khan Academy, and a former classroom teacher just like you. Meet Khanmigo, your AI-driven companion who's revolutionizing teaching for more engaging and efficient experience. Khanmigo has many exciting features that support teachers, and this video will showcase ways that you can use Khanmigo to create course specific content to enhance the learning experience for all of your students. Throughout this video, we'll explore ways Khanmigo can assist you with creating unique and engaging lesson plans and student-centered activities that get students excited about learning while saving you time. Ready to see the teaching assistant you've always wanted? Let's take a look. This is Khanmigo's dashboard. It's filled with a plethora of unique and helpful features designed to enhance your teaching experience and save you time. Let's begin with the Lesson Hook feature. Igniting a passion for mathematics can be challenging, but it's profoundly impactful and a definite game changer when accomplished. Empowered by Khanmigo, I'll be able to design captivating math lesson introductions that ignite students' curiosity and spark a thirst for knowledge in math. Once I select the button, I just have to let Khanmigo know the grade level. This is for my 7th grade class, and I let Khanmigo know the topic. We are working on two-step inequalities. And with just one click, Khanmigo will create three engaging lesson hooks that will be sure to capture my students' attention. With my students' curiosity now ignited, it's time to craft my lesson. Khanmigo's lesson plan tool will help me design a customized plan aligning with my curriculum and my students' needs. Once I enter the lesson plan feature, Khanmigo will ask me to detail the topic I intend to teach. It then presents a selection of topics from Khan Academy's rich course offerings. If my topic isn't listed, Khanmigo allows me to incorporate my own. I'm going to select this lesson. Once I make my selection, Khanmigo swiftly generates a structured detailed lesson plan tailored to my curriculum and my students. The plan includes learning objectives, warmup activities, exit ticket questions, direct instruction, independent practice, and so, so, so much more. And one of my favorite parts is that this lesson plan is fully customizable. I can effortlessly modify any part to better fit the needs of my students. I don't think my students will do well with this warmup, so I'm going to change it. Again, with one click of a button, Khanmigo appears, and I can ask Khanmigo to make changes to it, or I can just ask Khanmigo to try something different, or I can discuss it with Khanmigo. I'm not really sure what I want to change it to, so I'm just gonna ask Khanmigo to please try something different. And, again, with one click, Khanmigo will create a different warmup. After my lesson plan is complete, I'm able to print it, or I can export my lesson plan to a Word document, a PDF, or save it to my Google Drive. This has saved me so much time. Thanks so much, Khanmigo. As an educator, I understand the value of exposing students to grade level text and vocabulary. However, balancing this with comprehension is crucial. My upcoming unit on the play \"Julius Caesar\" often presents a comprehension challenge for high school students, especially in understanding Shakespearean language. Grasping Brutus' speech in act two is crucial to the play, and I want to make sure that my students understand. Once I let Khanmigo know the title of the text, I just copy and paste the original text in the space provided and let Khanmigo know the grade level that I'd like it leveled to. Once I let Khanmigo know the title of the text, I just copy paste the original text in the space provided, and then I just let Khanmigo know the grade level that I'd like the text re-leveled for. I would like this on a 7th grade level, please. And, again, with just one click, all of my students will be able to understand Brutus' speech. Thanks again, Khanmigo. Refresh My Knowledge is another super cool feature with Khanmigo. It's like a friendly nudge to help you review topics that you've learned before, but you may be a little bit rusty on. That's why I plan to use it before I begin my unit on the First Amendment. First, Khanmigo wants to know the topic and what grade level I'd like a refresher on. We are about to work on the First Amendment, and this is for my 10th grade history class. Once I provide that information, Khanmigo gives me the option of quizzing me on the topic or learning through conversation. When I select learning through conversation, Khanmigo gives me five major concepts at this grade level to select from, which helps me review and prepare for my lesson. Now that my memory has been sufficiently refreshed, I want to bridge the lesson with real-life scenarios to enhance my students' engagement with the topic. Khanmigo's Real World Context Generator will do that for me in a matter of seconds, boosting my students' interest and investment in the topic. I just have to let Khanmigo know the grade level and the topic. And with just one click, Khanmigo creates three creative ideas on how I can bring the First Amendment to life for my students. Everything Khanmigo creates is completely customizable, so I can apply it to topics that interest my students. I would like to change this to something about sports. My students are absolutely gonna love this. Thanks, Khanmigo. The next feature I'm going to explore is the Informational Text generator. This feature will create an informational text passage for the grade level that I want from first grade all the way through the collegiate level. Once you input the intended grade level and topic of your choice, you're able to select the length of the passage you'd like to create. And whether you select 100 words, 300 words, or 750 words, Khanmigo will do the rest. This is also an excellent feature for integrating cross-curricular content, because it provides students with multiple ways to engage with the material. As an educator, I aim to craft thought-provoking discussion prompts tailored to specific topics for my students. My goal is to ignite their curiosity and stimulate intellectual discourse, so I'm going to use the Discussion Prompt feature. I let Khanmigo know the grade level and topic, photosynthesis in organisms. And in a matter of seconds, Khanmigo creates multiple detailed and thought-provoking discussion questions that'll be sure to get my students chatting, but in a good way. If you're looking for a fun, engaging way to learn for your students, you have to try our Fun Class Summary Poem feature. It's a unique rhythmic way to summarize lessons for your students. Let's give it a try. When I select the button, Khanmigo wants me to ask my class what they learned today. Today, in my peer counseling class, we talked about goal-setting, and then you want to ask them for a fun word that will inspire your poem. They all scream out summer. Now, Khanmigo will do the rest. And here's our poem. \"In the heart of summer, under the sun's beaming ray, We set our goals, not astray. Like ice cream melting, time will fleet, But our ambitions, the heat can't beat, We'll reach our dreams, come what may, Just like the sun at the end of the day.\" I love it. It's not just a poem, it's a memory booster, a creativity enhancer, and a super cool learning tool. Thanks so much, Khanmigo. As you can see, integrating Khanmigo into your classroom routine empowers you to tailor Khanmigo's ideas and suggestions to your curriculum while factoring in student needs, learning objectives, and creative resources. Khanmigo's insights not only enrich the learning experience for all of your students, but it will also free up your time, enabling you to concentrate on what truly matters, your students. Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen. And to never miss exciting announcements about new free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، \nیہاں خان اکیڈمی میں ایک پیشہ ور سیکھنے کی ماہر، اور آپ کی طرح ایک سابقہ ​​کلاس روم\nٹیچر ہوں۔ خانمیگو سے ملیں، جو آپ کے AI سے چلنے والے ساتھی ہیں\nجو زیادہ دل چسپ اور موثر تجربے کے لیے تدریس میں انقلاب برپا کر رہے ہیں۔\n Khanmigo میں بہت ساری دلچسپ\nخصوصیات ہیں جو اساتذہ کی مدد کرتی ہیں، اور یہ ویڈیو ان طریقوں کو ظاہر کرے گی جن سے آپ اپنے تمام طلباء کے لیے سیکھنے کے تجربے کو بڑھانے کے لیے خانمیگو کو\nکورس کے لیے مخصوص مواد بنانے کے لیے استعمال کر سکتے ہیں۔ \n اس پورے ویڈیو میں، ہم ان طریقوں کی کھوج کریں گے جن سے Khanmigo آپ کی مدد کر سکتا ہے منفرد اور\nپرکشش اسباق کے منصوبے اور طلباء پر مبنی\nسرگرمیاں جو \nآپ کے وقت کی بچت کرتے ہوئے طلباء کو سیکھنے کے لیے پرجوش کرتی ہیں۔ اس ٹیچنگ اسسٹنٹ کو دیکھنے کے لیے تیار ہیں جسے\nآپ ہمیشہ چاہتے ہیں؟ آئیے ایک نظر ڈالتے ہیں۔ یہ Khanmigo کا ڈیش بورڈ ہے۔ یہ آپ کے تدریسی\nتجربے کو بڑھانے اور آپ کا وقت بچانے کے لیے ڈیزائن کردہ منفرد اور مددگار خصوصیات سے بھرا ہوا ہے۔ آئیے سبق ہک کی خصوصیت کے ساتھ شروع کریں۔  ریاضی کے لیے جنون کو بھڑکانا\nمشکل ہو سکتا ہے، لیکن جب یہ مکمل ہو جائے تو یہ بہت زیادہ اثر انگیز اور ایک یقینی گیم\nچینجر ہے۔ Khanmigo کی طرف سے بااختیار، میں \nریاضی کے سبق آموز تعارف تیار کرنے کے قابل ہو جاؤں گا جو طلباء کے تجسس کو بھڑکاتے ہیں اور ریاضی میں علم کی پیاس پیدا کرتے ہیں۔ ایک بار جب میں بٹن کو منتخب کر لیتا ہوں، مجھے صرف خانمیگو کو\nگریڈ کی سطح سے آگاہ کرنا ہوتا ہے۔ یہ میری 7ویں جماعت کی کلاس کے لیے ہے، اور میں نے خانمیگو کو موضوع سے آگاہ کیا۔ ہم دو قدمی عدم مساوات پر کام کر رہے ہیں۔ اور صرف ایک کلک کے ساتھ، Khanmigo تین\nدلچسپ اسباق کے ہکس بنائے گا جو یقینی طور پر\nمیرے طلباء کی توجہ حاصل کریں گے۔ میرے طلباء کا تجسس اب بھڑکنے کے ساتھ، اب وقت آگیا ہے کہ میں اپنے سبق کو تیار کروں۔ Khanmigo کا سبق پلان ٹول میرے نصاب اور میرے طلباء کی ضروریات کے مطابق اپنی مرضی کے مطابق منصوبہ تیار کرنے میں میری مدد کرے گا۔ \n ایک بار جب میں سبق کی منصوبہ بندی کی خصوصیت میں داخل ہو جاؤں گا، Khanmigo مجھ سے اس موضوع کی تفصیل طلب کرے گا جسے\nمیں پڑھانا چاہتا ہوں۔  اس کے بعد یہ خان اکیڈمی کے بھرپور کورس کی پیشکشوں سے موضوعات کا انتخاب پیش کرتا ہے۔\n اگر میرا موضوع درج نہیں ہے، تو خانمیگو مجھے اپنا موضوع شامل کرنے کی اجازت دیتا ہے۔ میں اس سبق کو منتخب کرنے جا رہا ہوں۔ ایک بار جب میں اپنا انتخاب کر لیتا ہوں، Khanmigo تیزی سے\n میرے نصاب اور میرے طلباء کے لیے تیار کردہ تفصیلی سبق کا منصوبہ تیار کرتا ہے۔ پلان میں سیکھنے کے\nمقاصد، وارم اپ سرگرمیاں، ایگزٹ ٹکٹ کے سوالات، براہ راست ہدایات، آزادانہ مشق،\nاور اسی طرح، بہت کچھ شامل ہے۔ اور میرے پسندیدہ حصوں میں سے ایک یہ ہے کہ یہ سبق منصوبہ\nمکمل طور پر حسب ضرورت ہے۔ میں اپنے طلباء کی ضروریات کو بہتر طور پر فٹ کرنے کے لیے کسی بھی حصے میں آسانی سے ترمیم کر سکتا ہوں۔ مجھے نہیں لگتا کہ میرے طلباء\nاس وارم اپ کے ساتھ اچھا کام کریں گے، اس لیے میں اسے تبدیل کرنے جا رہا ہوں۔ ایک بار پھر، ایک بٹن کے ایک کلک کے ساتھ،\nKhanmigo ظاہر ہوتا ہے، اور میں Khanmigo سے\nاس میں تبدیلیاں کرنے کے لیے کہہ سکتا ہوں، یا میں Khanmigo کو\nکچھ مختلف کرنے کو کہہ سکتا ہوں، یا میں Khanmigo کے ساتھ اس پر بات کر سکتا ہوں۔ مجھے واقعی یقین نہیں ہے کہ\nمیں اسے کس چیز میں تبدیل کرنا چاہتا ہوں، اس لیے میں خانمیگو سے کچھ مختلف کرنے کو کہوں گا۔ اور، ایک بار پھر، ایک کلک کے ساتھ، Khanmigo ایک مختلف وارم اپ بنائے گا۔ میرا سبق کا منصوبہ\nمکمل ہونے کے بعد، میں اسے پرنٹ کرنے کے قابل ہوں، یا میں اپنے سبق کے منصوبے کو\nورڈ دستاویز، پی ڈی ایف میں برآمد کر سکتا ہوں، یا اسے اپنی گوگل ڈرائیو میں محفوظ کر سکتا ہوں۔ اس سے میرا بہت وقت بچ گیا ہے۔ بہت شکریہ، خانمیگو۔ ایک معلم کے طور پر، میں\nطلباء کو گریڈ لیول کے متن اور الفاظ سے روشناس کرانے کی اہمیت کو سمجھتا ہوں۔ تاہم، فہم کے ساتھ اس میں توازن رکھنا بہت\nضروری ہے۔  ڈرامے \"جولیس سیزر\" پر میری آنے والی اکائی\n اکثر ہائی اسکول کے طلباء کے لیے خاص طور پر\nشیکسپیئر کی زبان کو سمجھنے کے لیے ایک فہمی چیلنج پیش کرتی ہے۔ ایکٹ ٹو میں بروٹس کی تقریر کو سمجھنا\nڈرامے کے لیے بہت اہم ہے، اور میں اس بات کو یقینی بنانا چاہتا ہوں\nکہ میرے طلباء سمجھیں۔ ایک بار جب میں خانمیگو کو\nمتن کا عنوان بتاتا ہوں، میں صرف اصل متن کو فراہم کردہ جگہ میں کاپی اور پیسٹ کرتا ہوں\nاور خانمیگو کو اس درجہ کی سطح سے آگاہ کرتا ہوں جس پر\nمیں اسے برابر کرنا چاہتا ہوں۔ ایک بار جب میں خانمیگو کو\nمتن کا عنوان بتاتا ہوں، میں صرف اصل\nمتن کو فراہم کردہ جگہ میں کاپی پیسٹ کرتا ہوں، اور پھر میں خانمیگو کو صرف اس\nگریڈ کی سطح سے آگاہ کرتا ہوں جس کے لیے میں متن کو دوبارہ ترتیب دینا چاہتا ہوں۔ \nبراہ کرم، مجھے یہ 7ویں جماعت کی سطح پر پسند ہے۔ اور، ایک بار پھر، صرف ایک کلک سے، میرے تمام طالب علم برٹس کی تقریر کو سمجھ سکیں گے۔  ایک بار پھر شکریہ، خانمیگو۔  خانمیگو کے ساتھ ایک اور زبردست فیچر ریفریش مائی نالج ہے۔ یہ\nآپ کو ان موضوعات کا جائزہ لینے میں مدد کرنے کے لیے ایک دوستانہ جھٹکے کی طرح ہے جو آپ نے پہلے سیکھے ہیں، لیکن آپ کو تھوڑا سا زنگ لگ سکتا ہے۔  اس لیے میں پہلی ترمیم پر اپنا یونٹ شروع کرنے سے پہلے اسے استعمال کرنے کا ارادہ رکھتا ہوں۔\n سب سے پہلے، Khanmigo موضوع اور میں کس گریڈ لیول\nپر ریفریشر چاہتا ہوں جاننا چاہتا ہے۔ ہم\nپہلی ترمیم پر کام کرنے والے ہیں، اور یہ میری 10ویں\nجماعت کی تاریخ کی کلاس کے لیے ہے۔ ایک بار جب میں وہ معلومات فراہم کرتا ہوں، خانمیگو\nمجھے موضوع پر سوال کرنے یا گفتگو کے ذریعے سیکھنے کا اختیار دیتا ہے۔ جب میں گفتگو کے ذریعے سیکھنے کا انتخاب کرتا ہوں،\n Khanmigo مجھے اس گریڈ کی سطح پر پانچ بڑے تصورات دیتا ہے جس میں سے مجھے اپنے اسباق کا جائزہ لینے اور تیاری میں مدد ملتی ہے۔\n اب جب کہ میری یادداشت کافی حد تک\nتازہ ہوگئی ہے، میں اس سبق کو\nحقیقی زندگی کے منظرناموں کے ساتھ جوڑنا چاہتا ہوں تاکہ موضوع کے ساتھ اپنے طلباء کی مصروفیت کو بڑھایا جاسکے۔\n Khanmigo کا حقیقی دنیا کا سیاق و سباق پیدا کرنے والا یہ کام میرے لیے سیکنڈوں میں کرے گا، جس سے\n میرے طلباء کی دلچسپی\nاور موضوع میں سرمایہ کاری بڑھے گی۔ مجھے صرف خانمیگو کو گریڈ لیول اور موضوع سے آگاہ کرنا ہے۔ اور صرف ایک کلک کے ساتھ، Khanmigo تین تخلیقی آئیڈیاز تخلیق کرتا ہے کہ میں\nاپنے طلباء کے لیے پہلی ترمیم کو کیسے زندہ کر سکتا ہوں۔ Khanmigo جو کچھ بھی تخلیق کرتا ہے وہ\nمکمل طور پر حسب ضرورت ہے، لہذا میں اسے اپنے طلباء کی دلچسپی کے موضوعات پر لاگو کر سکتا ہوں۔\n میں اسے\nکھیلوں کے بارے میں کچھ تبدیل کرنا چاہوں گا۔ میرے طالب علموں کو\nیہ بالکل پسند آئے گا۔ شکریہ، خانمیگو۔ اگلی خصوصیت جس کو میں دریافت کرنے جا رہا ہوں وہ ہے معلوماتی ٹیکسٹ جنریٹر۔ یہ فیچر گریڈ لیول کے لیے ایک\nمعلوماتی ٹیکسٹ پیسیج بنائے گا جو میں پہلی جماعت سے لے کر\nکالج کی سطح تک چاہتا ہوں۔ ایک بار جب آپ مطلوبہ گریڈ لیول اور اپنی پسند کا موضوع درج کر دیتے ہیں، تو آپ\nاس راستے کی لمبائی کو منتخب کر سکتے ہیں جسے آپ بنانا چاہتے ہیں۔ اور چاہے آپ 100\nالفاظ، 300 الفاظ، یا 750 الفاظ منتخب کریں، باقی کام خانمیگو کرے گا۔ یہ نصابی مواد کو مربوط کرنے کے لیے بھی ایک بہترین خصوصیت ہے، کیونکہ یہ طلباء کو \nمواد کے ساتھ مشغول ہونے کے متعدد طریقے فراہم کرتا ہے۔ ایک معلم کے طور پر، میرا مقصد\n \nاپنے طلباء کے لیے مخصوص موضوعات کے مطابق فکر انگیز گفتگو کے اشارے تیار کرنا ہے۔ میرا مقصد ان کے تجسس کو بھڑکانا اور فکری گفتگو کو متحرک کرنا ہے، اس لیے میں\nڈسکشن پرامپٹ فیچر استعمال کرنے جا رہا ہوں۔ میں نے خانمیگو کو جانداروں میں\nدرجہ بندی اور موضوع، فوٹو سنتھیسز سے آگاہ کیا۔ اور چند سیکنڈوں میں، Khanmigo متعدد مفصل اور فکر انگیز بحث کے سوالات تخلیق کرتا ہے جو یقینی طور پر\nمیرے طالب علموں کو چیٹنگ کرنے پر مجبور کریں گے، لیکن اچھے طریقے سے۔ اگر آپ اپنے طلباء کے لیے سیکھنے کے لیے ایک تفریحی، دل چسپ طریقہ تلاش کر رہے ہیں، تو آپ کو ہماری فن\nکلاس سمری نظم کی خصوصیت کو آزمانا ہوگا۔ یہ آپ کے طلباء کے لیے اسباق کا خلاصہ کرنے کا ایک انوکھا ردھم والا طریقہ ہے۔ آئیے اسے آزماتے ہیں۔ جب میں بٹن کو منتخب کرتا ہوں، خانمیگو چاہتا ہے کہ میں اپنی\nکلاس سے پوچھوں کہ انہوں نے آج کیا سیکھا۔ آج، میری ہم مرتبہ کونسلنگ کلاس میں، ہم نے گول سیٹنگ کے بارے میں بات کی، اور پھر آپ ان سے ایک پرلطف لفظ پوچھنا چاہتے ہیں جو\nآپ کی نظم کو متاثر کرے گا۔ وہ سب گرمیوں میں چیختے ہیں۔ اب باقی کام خانمیگو کریں گے۔ اور یہاں ہماری نظم ہے۔ \"گرمیوں کے دل میں،\nسورج کی شعاعوں کے نیچے، ہم نے اپنے مقاصد طے کیے، گمراہ نہیں، آئس کریم پگھلنے کی طرح، وقت گزرے گا، لیکن ہمارے عزائم، گرمی ہرا نہیں سکتی، ہم اپنے خوابوں تک پہنچیں گے، آؤ کیا  ہو سکتا ہے، بالکل اسی طرح جیسے دن کے آخر میں سورج۔\" میں اس سے محبت کرتا ہوں۔ یہ صرف ایک نظم نہیں ہے،\nیہ یادداشت بڑھانے والا، تخلیقی صلاحیتوں کو بڑھانے والا، اور\nسیکھنے کا ایک زبردست ٹول ہے۔ بہت شکریہ، خانمیگو۔ جیسا کہ آپ دیکھ سکتے ہیں، Khanmigo کو\nاپنے کلاس روم کے معمولات میں ضم کرنا آپ کو\n \nطالب علم کی ضروریات، سیکھنے کے مقاصد،\nاور تخلیقی وسائل کو مدنظر رکھتے ہوئے اپنے نصاب میں Khanmigo کے خیالات اور تجاویز کو تیار کرنے کا اختیار دیتا ہے۔ Khanmigo کی بصیرتیں نہ صرف\n آپ کے تمام طلبہ کے لیے سیکھنے کے تجربے کو تقویت بخشتی ہیں، بلکہ یہ آپ کا وقت بھی خالی کرے گی، جس سے آپ اپنے طلبہ کے لیے\nواقعی اہم چیزوں پر توجہ مرکوز کر سکیں گے۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ\nخانمیگو کلاس روم میں آپ اور آپ کے طلباء کی کس طرح مدد کر سکتا ہے، اپنی اسکرین پر موجود لنکس پر عمل کریں۔ اور خان اکیڈمی پر نئے مفت کورس کے مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں،\n سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola, soy Michele, una especialista en aprendizaje profesional\naquí en Khan Academy y ex\nmaestra de aula como tú. Conozca a Khanmigo, su compañero impulsado por IA\nque está revolucionando la enseñanza para ofrecer una experiencia más atractiva y\neficiente. Khanmigo tiene muchas\ncaracterísticas interesantes que apoyan a los profesores, y este video mostrará formas en que puede usar Khanmigo para\ncrear contenido específico del curso para mejorar la experiencia de aprendizaje\nde todos sus estudiantes. A lo largo de este video, exploraremos las formas en que Khanmigo puede ayudarlo a crear\nplanes de lecciones únicos y atractivos y\nactividades centradas en los estudiantes que los entusiasmen con el aprendizaje y,\nal mismo tiempo, le ahorren tiempo.  ¿ Listo para ver al\nasistente de enseñanza que siempre quisiste? Vamos a ver. Este es el panel de Khanmigo. Está repleto de una gran cantidad de funciones únicas y útiles diseñadas para mejorar su\nexperiencia docente y ahorrarle tiempo. Comencemos con la función Lesson Hook. Encender una pasión por\nlas matemáticas puede ser un desafío, pero es profundamente impactante y definitivamente cambia las reglas del juego\ncuando se logra.  Con el apoyo de Khanmigo, podré diseñar cautivadoras\nintroducciones a lecciones de matemáticas que enciendan la curiosidad de los estudiantes y despierten su sed de conocimiento en matemáticas. Una vez que selecciono el botón, solo tengo que informarle a Khanmigo\nel nivel de grado. Esto es para mi clase de séptimo grado y le informé a Khanmigo sobre el tema. Estamos trabajando en desigualdades de dos pasos. Y con solo un clic, Khanmigo creará tres\ninteresantes ganchos de lecciones que seguramente captarán la\natención de mis alumnos. Ahora que la curiosidad de mis alumnos está encendida, es hora de elaborar mi lección.  La herramienta de planificación de lecciones de Khanmigo me ayudará a diseñar un plan personalizado que se alinee con mi plan de estudios\ny las necesidades de mis alumnos. Una vez que ingrese a la función de plan de lección, Khanmigo me pedirá que detalle\nel tema que pretendo enseñar. Luego presenta una selección de temas de la\nrica oferta de cursos de Khan Academy. Si mi tema no aparece en la lista, Khanmigo me permite incorporar el mío. Voy a seleccionar esta lección. Una vez que hago mi selección, Khanmigo genera rápidamente un\nplan de lección estructurado y detallado adaptado a mi plan de estudios y a mis alumnos. El plan incluye\nobjetivos de aprendizaje, actividades de preparación, preguntas sobre boletos de salida, instrucción directa, práctica independiente\ny mucho más. Y una de mis partes favoritas es que este plan de lección\nes totalmente personalizable. Puedo modificar sin esfuerzo cualquier pieza para adaptarla mejor a las necesidades de mis alumnos. No creo que a mis alumnos les\nvaya bien con este calentamiento, así que voy a cambiarlo. Nuevamente, con solo hacer clic en un\nbotón, aparece Khanmigo y puedo pedirle a Khanmigo\nque le haga cambios, o simplemente puedo pedirle a Khanmigo\nque pruebe algo diferente, o puedo discutirlo con Khanmigo. No estoy muy seguro de a qué\nquiero cambiarlo, así que le pediré a Khanmigo que pruebe algo diferente. Y, de nuevo, con un clic, Khanmigo creará un calentamiento diferente. Una vez completado mi plan de lección\n, puedo imprimirlo, exportarlo\na un documento de Word, PDF o guardarlo en mi Google Drive. Esto me ha ahorrado mucho tiempo. Muchas gracias Khanmigo. Como educador, entiendo\nel valor de exponer a los estudiantes a textos y vocabulario de nivel de grado. Sin embargo, es crucial equilibrar esto con\nla comprensión. Mi próxima unidad sobre la\nobra \"Julio César\" a menudo presenta un desafío de comprensión para los estudiantes de secundaria, especialmente en la comprensión del\nlenguaje de Shakespeare. Comprender el discurso de Brutus en el\nsegundo acto es crucial para la obra y quiero asegurarme\nde que mis alumnos lo comprendan. Una vez que le informo a Khanmigo\nel título del texto, simplemente copio y pego el texto original en el espacio provisto\ny le informo a Khanmigo el nivel de grado al que me\ngustaría que se nivele. Una vez que le informo a Khanmigo\nel título del texto, simplemente copio y pego el\ntexto original en el espacio provisto, y luego le informo a Khanmigo\nel nivel de grado para el que me gustaría volver a nivelar el texto. Me gustaría esto en un\nnivel de séptimo grado, por favor. Y, nuevamente, con solo un clic, todos mis alumnos podrán entender el discurso de Brutus. Gracias de nuevo, Khanmigo. Actualizar mis conocimientos es otra característica genial de Khanmigo. Es como un empujón amistoso\npara ayudarte a repasar temas que has aprendido antes, pero que quizás estés un poco oxidado.  Por eso planeo usarlo antes de comenzar mi unidad\nsobre la Primera Enmienda. Primero, Khanmigo quiere saber el tema y en qué grado me\ngustaría un repaso. Estamos a punto de trabajar\nen la Primera Enmienda y esto es para mi\nclase de historia de décimo grado. Una vez que proporciono esa información, Khanmigo me da la opción\nde interrogarme sobre el tema o aprender a través de una conversación. Cuando selecciono aprender\na través de la conversación, Khanmigo me da cinco conceptos principales en este nivel de grado para seleccionar, lo que me ayuda a revisar y\nprepararme para mi lección. Ahora que mi memoria se ha\nrefrescado lo suficiente, quiero unir la lección\ncon escenarios de la vida real para mejorar el compromiso de mis alumnos\ncon el tema.  El generador de contexto del mundo real de Khanmigo lo hará por mí en\ncuestión de segundos, aumentando el interés y la inversión de mis alumnos\nen el tema. Sólo tengo que informarle a Khanmigo el nivel de grado y el tema. Y con solo un clic, Khanmigo crea tres ideas creativas sobre cómo puedo darle vida a la Primera\nEnmienda para mis alumnos. Todo lo que crea Khanmigo\nes completamente personalizable, por lo que puedo aplicarlo a temas\nque interesen a mis alumnos. Me gustaría cambiar esto\npor algo sobre deportes.  A mis alumnos les\nencantará esto. Gracias, Khanmigo. La siguiente característica que voy a explorar es el generador de texto informativo. Esta función creará un\npasaje de texto informativo para el nivel de grado que deseo, desde el primer grado\nhasta el nivel universitario. Una vez que ingrese el nivel de grado deseado y el tema de su elección, podrá seleccionar\nla longitud del pasaje que desea crear. Y ya sea que seleccione 100\npalabras, 300 palabras o 750 palabras, Khanmigo hará el resto. Esta también es una característica excelente para integrar contenido interdisciplinario, porque proporciona a los estudiantes múltiples formas de\ninteractuar con el material. Como educador, mi objetivo es crear temas de debate que inviten a la reflexión y\n adaptados a\ntemas específicos para mis alumnos. Mi objetivo es despertar su curiosidad y estimular el discurso intelectual, por eso voy a utilizar la\nfunción Mensaje de debate.  Le informé a Khanmigo el\nnivel de grado y el tema, la fotosíntesis en los organismos. Y en cuestión de segundos, Khanmigo crea múltiples preguntas de discusión detalladas y estimulantes que seguramente harán que\nmis alumnos conversen, pero en el buen sentido. Si está buscando una forma divertida y atractiva de que sus alumnos aprendan, debe probar nuestra\nfunción Poema divertido de resumen de clase. Es una forma rítmica única de resumir las lecciones para sus alumnos. Hagamos un intento. Cuando selecciono el botón, Khanmigo quiere que le pregunte a mi\nclase qué aprendieron hoy. Hoy, en mi clase de consejería entre pares, hablamos sobre el establecimiento de metas y luego quieres pedirles una palabra divertida que\ninspire tu poema. Todos gritan verano. Ahora Khanmigo hará el resto. Y aquí está nuestro poema. \"En el corazón del verano,\nbajo el rayo radiante del sol, fijamos nuestras metas, no nos extraviamos. Como el helado que se derrite, el tiempo pasará, pero nuestras ambiciones, el calor no pueden vencer, alcanzaremos nuestros sueños, pase lo que pase.  mayo, como el sol al final del día.\" Me encanta. No es sólo un poema,\nes un refuerzo de la memoria, un potenciador de la creatividad y\nuna herramienta de aprendizaje genial. Muchas gracias Khanmigo. Como puede ver, integrar Khanmigo en\nsu rutina de clase le permite adaptar las\nideas y sugerencias de Khanmigo a su plan de estudios, teniendo en cuenta las\nnecesidades de los estudiantes, los objetivos de aprendizaje\ny los recursos creativos.  Los conocimientos de Khanmigo no solo\nenriquecen la experiencia de aprendizaje de todos sus estudiantes, sino que también le liberarán tiempo, permitiéndole concentrarse\nen lo que realmente importa: sus estudiantes. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus alumnos en el aula, siga los enlaces en su pantalla. Y para no perderse nunca anuncios interesantes sobre nuevos materiales de cursos gratuitos\nen Khan Academy, asegúrese de suscribirse.",
    "t_arabic": "- مرحبًا، أنا ميشيل، متخصص في التعلم المهني\nهنا في أكاديمية خان، ومدرس سابق في الفصل الدراسي\nمثلك تمامًا. تعرف على Khanmigo، رفيقك المعتمد على الذكاء الاصطناعي\nوالذي أحدث ثورة في التدريس من أجل تجربة أكثر جاذبية\nوكفاءة. يحتوي Khanmigo على العديد من\nالميزات المثيرة التي تدعم المعلمين، وسيعرض هذا الفيديو الطرق التي يمكنك من خلالها استخدام Khanmigo\nلإنشاء محتوى خاص بالدورة التدريبية لتعزيز تجربة التعلم\nلجميع طلابك. خلال هذا الفيديو، سنستكشف الطرق التي يمكن أن يساعدك بها Khanmigo في إنشاء\nخطط دروس فريدة وجذابة وأنشطة تتمحور حول الطلاب\nوالتي تجعل الطلاب متحمسين للتعلم\nمع توفير الوقت.  هل أنت مستعد لرؤية\nمساعد التدريس الذي طالما أردته؟ لنلقي نظرة. هذه لوحة تحكم خانميغو. إنها مليئة بعدد كبير من الميزات الفريدة والمفيدة المصممة لتحسين تجربة التدريس الخاصة بك\nوتوفير وقتك. لنبدأ بميزة \"ربط الدرس\". \nقد يكون إشعال الشغف بالرياضيات أمرًا صعبًا، لكنه ذو تأثير عميق ويغير قواعد اللعبة بشكل واضح\nعند إنجازه. بدعم من خانميغو، سأكون قادرًا على تصميم\nمقدمات جذابة لدروس الرياضيات تثير فضول الطلاب وتثير التعطش للمعرفة في الرياضيات. بمجرد تحديد الزر، يجب علي فقط السماح لـ Khanmigo\nبمعرفة مستوى الصف. هذا لصفي في الصف السابع، وقد أخبرت خانميغو بالموضوع. نحن نعمل على المتباينة ذات الخطوتين. وبنقرة واحدة فقط، سيقوم Khanmigo بإنشاء ثلاثة\nدروس جذابة من شأنها أن تجذب\nانتباه طلابي بالتأكيد. مع إشعال فضول طلابي الآن، فقد حان الوقت لصياغة الدرس.  ستساعدني أداة خطة الدروس الخاصة بـ Khanmigo في تصميم خطة مخصصة تتماشى مع المنهج الدراسي الخاص بي واحتياجات\nطلابي. بمجرد الدخول إلى ميزة خطة الدرس، سيطلب مني خانميغو تفصيل\nالموضوع الذي أنوي تدريسه. ثم يقدم مجموعة مختارة من المواضيع من\nعروض الدورات التدريبية الغنية التي تقدمها أكاديمية خان. إذا لم يكن موضوعي مدرجًا، فإن Khanmigo يسمح لي بدمج موضوعي الخاص. سأقوم باختيار هذا الدرس بمجرد تحديد اختياري، يقوم Khanmigo بسرعة بإنشاء\nخطة درس مفصلة ومنظمة مصممة خصيصًا لمناهجي وطلابي. تتضمن الخطة\nأهدافًا تعليمية، وأنشطة إحماء، وأسئلة بشأن تذكرة الخروج، وتعليمات مباشرة، وممارسة مستقلة، وغير ذلك\nالكثير. وأحد الأجزاء المفضلة لدي هو أن خطة الدرس هذه\nقابلة للتخصيص بالكامل. يمكنني بسهولة تعديل أي جزء ليناسب احتياجات طلابي بشكل أفضل. لا أعتقد أن طلابي\nسيبلون بلاءً حسنًا في عملية الإحماء هذه، لذا سأقوم بتغييرها. مرة أخرى، بنقرة زر واحدة\n، يظهر خانميغو، ويمكنني أن أطلب من خانميغو\nإجراء تغييرات عليه، أو يمكنني فقط أن أطلب من خانميغو\nتجربة شيء مختلف، أو يمكنني مناقشة الأمر مع خانميغو. لست متأكدًا حقًا مما\nأريد تغييره إليه، لذا سأطلب من خانميجو تجربة شيء مختلف من فضلك. ومرة أخرى، بنقرة واحدة، سيقوم Khanmigo بإنشاء عملية إحماء مختلفة. بعد اكتمال خطة الدرس\n، يمكنني طباعتها، أو يمكنني تصدير خطة الدرس\nإلى مستند Word، أو PDF، أو حفظها على Google Drive.  لقد وفر لي هذا الكثير من الوقت. شكرا جزيلا، خانميجو. كمعلم، أفهم\nقيمة تعريض الطلاب للنصوص والمفردات على مستوى الصف الدراسي. ومع ذلك، فإن تحقيق التوازن بين هذا\nوالفهم أمر بالغ الأهمية.  غالبًا ما تمثل وحدتي القادمة حول\nمسرحية \"يوليوس قيصر\" تحديًا في الفهم لطلاب المدارس الثانوية، خاصة في فهم\nاللغة الشكسبيرية.  يعد استيعاب خطاب بروتوس في الفصل\nالثاني أمرًا بالغ الأهمية للمسرحية، وأريد التأكد\nمن فهم طلابي. بمجرد أن أعلم خانميغو\nبعنوان النص، أقوم فقط بنسخ النص الأصلي ولصقه في المساحة المتوفرة\nوأخبر خانميغو بمستوى الدرجة الذي\nأرغب في الوصول إليه. بمجرد أن أعلم خانميغو\nبعنوان النص، أقوم فقط بنسخ النص الأصلي ولصقه\nفي المساحة المتوفرة، ثم أعلم خانميغو\nبمستوى الدرجة الذي أرغب في إعادة تسوية النص له. أرغب في ذلك في\nمستوى الصف السابع من فضلك. ومرة أخرى، بنقرة واحدة فقط، سيتمكن جميع طلابي من فهم خطاب بروتوس. شكرا مرة أخرى، خانميجو. تحديث معرفتي هي ميزة رائعة أخرى مع Khanmigo. إنها بمثابة دفعة ودية\nلمساعدتك في مراجعة الموضوعات التي تعلمتها من قبل، ولكن قد تكون متعثرًا بعض الشيء. ولهذا السبب أخطط لاستخدامه قبل أن أبدأ وحدتي\nفي التعديل الأول. أولاً، يريد خانميغو معرفة الموضوع والمستوى الدراسي الذي\nأرغب في تجديد المعلومات عنه. نحن على وشك العمل\nعلى التعديل الأول، وهذا مخصص\nلصف التاريخ للصف العاشر. بمجرد تقديم هذه المعلومات، يمنحني Khanmigo خيار\nاستجوابي حول الموضوع أو التعلم من خلال المحادثة. عندما أحدد التعلم\nمن خلال المحادثة، يمنحني Khanmigo خمسة مفاهيم رئيسية في هذا المستوى الدراسي للاختيار من بينها، مما يساعدني في المراجعة والتحضير\nلدرسي. والآن بعد أن تم\nتحديث ذاكرتي بشكل كافٍ، أريد ربط الدرس\nبسيناريوهات من الحياة الواقعية لتعزيز\nتفاعل طلابي مع الموضوع.  سوف يقوم مولد سياق العالم الحقيقي الخاص بـ Khanmigo بذلك في\nغضون ثوانٍ، مما يعزز اهتمام طلابي\nواستثمارهم في الموضوع. عليّ فقط أن أخبر خانميغو بمستوى الصف والموضوع. وبنقرة واحدة فقط، يبتكر خانميغو ثلاث أفكار إبداعية حول كيفية\nإحياء التعديل الأول لطلابي. كل ما ينشئه Khanmigo قابل\nللتخصيص بالكامل، حتى أتمكن من تطبيقه على الموضوعات\nالتي تهم طلابي. أود تغيير هذا\nإلى شيء يتعلق بالرياضة. طلابي\nسيحبون هذا بالتأكيد. شكرا خانميجو. الميزة التالية التي سأستكشفها هي منشئ النص المعلوماتي. ستقوم هذه الميزة بإنشاء\nمقطع نصي إعلامي لمستوى الصف الذي أريده من الصف الأول\nوحتى المستوى الجامعي. بمجرد إدخال مستوى الصف المقصود والموضوع الذي تختاره، ستتمكن من تحديد\nطول المقطع الذي ترغب في إنشائه. وسواء قمت بتحديد 100\nكلمة، أو 300 كلمة، أو 750 كلمة، فإن خانميغو سيقوم بالباقي.  تعد هذه أيضًا ميزة ممتازة لدمج المحتوى عبر المناهج الدراسية، لأنها توفر للطلاب طرقًا متعددة\nللتفاعل مع المادة. كمعلم، أهدف إلى صياغة\nمناقشات مثيرة للتفكير ومصممة خصيصًا\nلموضوعات محددة لطلابي. هدفي هو إثارة فضولهم وتحفيز الخطاب الفكري، لذلك سأستخدم\nميزة \"موجه المناقشة\".  لقد سمحت لـKhanmigo بمعرفة\nمستوى الصف والموضوع، التمثيل الضوئي في الكائنات الحية. وفي غضون ثوانٍ، يقوم Khanmigo بإنشاء العديد من أسئلة المناقشة التفصيلية والمثيرة للتفكير والتي من المؤكد أنها ستجعل\nطلابي يدردشون، ولكن بطريقة جيدة. إذا كنت تبحث عن طريقة ممتعة وجذابة للتعلم لطلابك، فعليك تجربة\nميزة Fun Class Summary Poem الخاصة بنا. إنها طريقة إيقاعية فريدة لتلخيص الدروس لطلابك. دعنا نعطيها محاولة. عندما أحدد الزر، يريدني خانميغو أن أسأل\nطلاب صفي عما تعلموه اليوم. اليوم، في صف إرشاد الأقران، تحدثنا عن تحديد الأهداف، وبعد ذلك تريد أن تطلب منهم كلمة ممتعة\nتلهم قصيدتك. كلهم يصرخون في الصيف. الآن، سيقوم خانميغو بالباقي. وهنا قصيدتنا. \"في قلب الصيف،\nتحت شعاع الشمس الساطع، نحدد أهدافنا، لا نضل. مثل ذوبان الآيس كريم، سوف يمر الوقت، لكن طموحاتنا، لا يمكن للحرارة أن تغلب، سنصل إلى أحلامنا، مهما حدث  ربما، مثل الشمس في آخر النهار.\" أنا أحبه. إنها ليست مجرد قصيدة،\nإنها معززة للذاكرة، ومُحسِّنة للإبداع،\nوأداة تعليمية رائعة للغاية. شكرا جزيلا، خانميجو. كما ترون، فإن دمج Khanmigo في\nروتين الفصل الدراسي الخاص بك يمكّنك من تصميم\nأفكار واقتراحات Khanmigo لتناسب منهجك الدراسي مع\nالأخذ في الاعتبار احتياجات الطلاب وأهداف التعلم\nوالموارد الإبداعية. لا تعمل رؤى خانميغو على\nإثراء تجربة التعلم لجميع طلابك فحسب، بل ستوفر أيضًا وقتك، مما يتيح لك التركيز\nعلى ما يهم حقًا، أي طلابك. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد حول كيفية\nدعم Khanmigo لك ولطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك. وحتى لا تفوت أبدًا الإعلانات المثيرة حول المواد الدراسية المجانية الجديدة\nفي أكاديمية خان، تأكد من الاشتراك.",
    "t_italian": "- Ciao, sono Michele, uno specialista dell'apprendimento professionale\nqui alla Khan Academy e un ex\ninsegnante di classe proprio come te. Incontra Khanmigo, il tuo compagno basato sull'intelligenza artificiale\nche sta rivoluzionando l'insegnamento per un'esperienza più coinvolgente ed\nefficiente. Khanmigo ha molte\nfunzionalità interessanti che supportano gli insegnanti e questo video mostrerà i modi in cui puoi utilizzare Khanmigo per\ncreare contenuti specifici del corso per migliorare l'esperienza di apprendimento\nper tutti i tuoi studenti. In questo video esploreremo i modi in cui Khanmigo può aiutarti a creare\nprogrammi di lezioni unici e coinvolgenti e\nattività incentrate sugli studenti che li entusiasmano all'apprendimento\nfacendoti risparmiare tempo. Pronto a vedere l'\nassistente didattico che hai sempre desiderato? Diamo un'occhiata. Questa è la dashboard di Khanmigo. È ricco di numerose funzionalità uniche e utili progettate per migliorare la tua\nesperienza di insegnamento e farti risparmiare tempo. Cominciamo con la funzione Lesson Hook. Accendere la passione per la\nmatematica può essere impegnativo, ma ha un profondo impatto e,\nuna volta realizzato, rappresenta una svolta decisiva. Grazie al supporto di Khanmigo, sarò in grado di progettare accattivanti\nintroduzioni alle lezioni di matematica che accendono la curiosità degli studenti e suscitano la sete di conoscenza in matematica. Una volta selezionato il pulsante, devo solo comunicare a Khanmigo\nil livello del voto. Questo è per la mia classe di seconda media e ho fatto conoscere l'argomento a Khanmigo. Stiamo lavorando sulle disuguaglianze in due fasi. E con un solo clic, Khanmigo creerà tre\ncoinvolgenti hook di lezione che cattureranno sicuramente l'\nattenzione dei miei studenti. Con la curiosità dei miei studenti ora accesa, è tempo di creare la mia lezione.  Lo strumento di pianificazione delle lezioni di Khanmigo mi aiuterà a progettare un piano personalizzato in linea con il mio curriculum\ne le esigenze dei miei studenti. Una volta entrato nella funzione del piano di lezione, Khanmigo mi chiederà di dettagliare\nl'argomento che intendo insegnare. Presenta quindi una selezione di argomenti dalla\nricca offerta di corsi di Khan Academy. Se il mio argomento non è elencato, Khanmigo mi consente di incorporarne uno mio. Selezionerò questa lezione. Una volta effettuata la selezione, Khanmigo genera rapidamente un\npiano di lezioni strutturato e dettagliato su misura per il mio curriculum e per i miei studenti. Il piano include\nobiettivi di apprendimento, attività di riscaldamento, domande sui ticket di uscita, istruzioni dirette, pratica indipendente\ne molto altro ancora. E una delle mie parti preferite è che questo programma di lezione\nè completamente personalizzabile. Posso modificare facilmente qualsiasi parte per adattarla meglio alle esigenze dei miei studenti. Non penso che i miei studenti se la\ncaveranno bene con questo riscaldamento, quindi lo cambierò. Ancora una volta, con un semplice clic di un\npulsante, appare Khanmigo e posso chiedere a Khanmigo\ndi apportare modifiche, oppure posso semplicemente chiedere a Khanmigo\ndi provare qualcosa di diverso, oppure posso discuterne con Khanmigo. Non sono proprio sicuro di cosa\nvoglio cambiarlo, quindi chiederò semplicemente a Khanmigo di provare qualcosa di diverso. E, ancora, con un clic, Khanmigo creerà un riscaldamento diverso. Una volta completato il programma della lezione,\nposso stamparlo oppure posso esportarlo\nin un documento Word, un PDF o salvarlo sul mio Google Drive. Questo mi ha fatto risparmiare così tanto tempo. Grazie mille, Khanmigo. Come educatore, capisco\nil valore di esporre gli studenti al testo e al vocabolario di livello scolastico. Tuttavia, bilanciare questo con\nla comprensione è cruciale. La mia prossima unità sull'opera\nteatrale \"Giulio Cesare\" rappresenta spesso una sfida di comprensione per gli studenti delle scuole superiori, soprattutto nella comprensione della\nlingua shakespeariana. Comprendere il discorso di Bruto nel\nsecondo atto è fondamentale per lo spettacolo e voglio assicurarmi\nche i miei studenti capiscano. Dopo aver comunicato a Khanmigo\nil titolo del testo, copio e incollo semplicemente il testo originale nello spazio fornito\ne faccio sapere a Khanmigo il livello di voto a cui\nvorrei che fosse livellato. Dopo aver comunicato a Khanmigo\nil titolo del testo, copio e incollo il\ntesto originale nello spazio fornito, quindi faccio sapere a Khanmigo\nil livello di voto per il quale vorrei che il testo venisse livellato nuovamente. Lo vorrei a\nlivello di seconda media, per favore. E, ancora una volta, con un solo clic tutti i miei studenti potranno comprendere il discorso di Bruto. Grazie ancora, Khanmigo. Aggiorna la mia conoscenza è un'altra fantastica funzionalità di Khanmigo. È come una spinta amichevole\nper aiutarti a rivedere argomenti che hai imparato in precedenza, ma su cui potresti essere un po' arrugginito. Ecco perché intendo usarlo prima di iniziare la mia unità\nsul Primo Emendamento. Per prima cosa, Khanmigo vuole sapere l'argomento e su quale livello scolastico\nvorrei un ripasso. Stiamo per lavorare\nsul Primo Emendamento, e questo è per la mia\nlezione di storia in terza media. Una volta fornite tali informazioni, Khanmigo mi dà la possibilità\ndi interrogarmi sull'argomento o di imparare attraverso la conversazione. Quando seleziono l'apprendimento\nattraverso la conversazione, Khanmigo mi fornisce cinque concetti principali a questo livello scolastico tra cui scegliere, il che mi aiuta a rivedere e\npreparare la mia lezione. Ora che la mia memoria è stata\nsufficientemente rinfrescata, voglio collegare la lezione\ncon scenari di vita reale per aumentare il coinvolgimento dei miei studenti\ncon l'argomento.  Il generatore di contesto del mondo reale di Khanmigo lo farà per me in\npochi secondi, aumentando l'interesse\ne l'investimento dei miei studenti nell'argomento. Devo solo far sapere a Khanmigo il livello della scuola e l'argomento. E con un solo clic, Khanmigo crea tre idee creative su come posso dare vita al Primo\nEmendamento per i miei studenti. Tutto ciò che Khanmigo crea\nè completamente personalizzabile, quindi posso applicarlo agli argomenti\nche interessano i miei studenti. Vorrei cambiarlo\nin qualcosa che riguarda lo sport. I miei studenti\nlo adoreranno assolutamente. Grazie, Khanmigo. La prossima funzionalità che esplorerò è il generatore di testo informativo. Questa funzione creerà un\npassaggio di testo informativo per il livello scolastico che desidero, dalla prima elementare\nfino al livello collegiale. Dopo aver inserito il livello di voto previsto e l'argomento di tua scelta, puoi selezionare\nla lunghezza del passaggio che desideri creare. E se selezioni 100\nparole, 300 parole o 750 parole, Khanmigo farà il resto. Questa è anche una caratteristica eccellente per l'integrazione di contenuti interdisciplinari, perché offre agli studenti molteplici modi per\ninteragire con il materiale. Come educatore, miro a creare\nspunti di discussione stimolanti su misura per\nargomenti specifici per i miei studenti.  Il mio obiettivo è accendere la loro curiosità e stimolare il discorso intellettuale, quindi utilizzerò la\nfunzione Richiesta di discussione.  Ho comunicato a Khanmigo il\nlivello scolastico e l'argomento, la fotosintesi negli organismi. E in pochi secondi, Khanmigo crea molteplici domande di discussione dettagliate e stimolanti che faranno sicuramente\nchiacchierare i miei studenti, ma in senso positivo. Se stai cercando un modo divertente e coinvolgente di apprendere per i tuoi studenti, devi provare la nostra\nfunzione Poesia di riepilogo della classe divertente. È un modo ritmico unico per riassumere le lezioni per i tuoi studenti. Proviamolo. Quando seleziono il pulsante, Khanmigo vuole che chieda alla mia\nclasse cosa hanno imparato oggi. Oggi, nel mio corso di consulenza tra pari, abbiamo parlato della definizione degli obiettivi e poi vuoi chiedere loro una parola divertente che\nispirerà la tua poesia. Tutti gridano estate. Adesso Khanmigo farà il resto. Ed ecco la nostra poesia. \"Nel cuore dell'estate,\nsotto i raggi splendenti del sole, stabiliamo i nostri obiettivi, senza smarrirci. Come il gelato che si scioglie, il tempo scorre veloce, ma le nostre ambizioni, il caldo non possono battere, raggiungeremo i nostri sogni, qualunque cosa accada  può, proprio come il sole alla fine del giorno.\"  Lo adoro . Non è solo una poesia,\nè un potenziatore della memoria, un potenziatore della creatività e\nuno strumento di apprendimento fantastico. Grazie mille, Khanmigo. Come puoi vedere, l' integrazione di Khanmigo nella\nroutine della tua classe ti consente di adattare le\nidee e i suggerimenti di Khanmigo al tuo curriculum tenendo conto delle\nesigenze degli studenti, degli obiettivi di apprendimento\ne delle risorse creative.  Gli approfondimenti di Khanmigo non solo\narricchiscono l'esperienza di apprendimento di tutti i tuoi studenti, ma ti libereranno anche tempo, permettendoti di concentrarti\nsu ciò che conta veramente: i tuoi studenti. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo. E per non perdere mai gli entusiasmanti annunci sui nuovi materiali dei corsi gratuiti\nsu Khan Academy, assicurati di iscriverti."
}