{
    "source": "pLw4oG5JNN0",
    "youtubelink": "https://www.youtube.com/watch?v=pLw4oG5JNN0",
    "t_english": "- Hi, I'm Michelle, a professional learning specialist here at Khan Academy and a former classroom teacher just like you. Today I have the pleasure of introducing you to Khanmigo, your AI-driven companion who's revolutionizing teaching for a more engaging and efficient experience. Khanmigo has many exciting features that support teachers, and this video will showcase ways that you can use Khanmigo to create core specific English language arts content to enhance the learning experience for all of your students. Throughout this video, we'll explore ways Khanmigo can assist you with creating unique and engaging lesson plans and student center activities that get students excited about reading while saving you time. Ready to see the teaching assistant you've always wanted? Let's take a look. This is Khanmigo's dashboard brimming with a multitude of unique time-saving features, all tailored to elevate your teaching experience. Let's begin our journey by exploring the lesson hook feature, because let's face it, it's not just about teaching, it's about creating memorable, engaging experiences that enhance understanding and retention. I just have to let Khanmigo know the grade level, this is for my eighth grade English class, and the topic. We are about to start the novel \"Animal Farm\". I just hit the button and Khanmigo immediately creates fantastic lesson hooks that I can use to engage my students, and as soon as I hit the button, Khanmigo goes to work, creating three wonderful lesson hooks that I can use with my students. Now that my students' curiosity has been sparked, Khanmigo can assist me with crafting compelling lesson plans by utilizing the lesson plan feature. I can select a topic from one of Khan Academy's rich course offerings, or I can select my own. My students are about to read Chapter 1 of \"Animal Farm\". Khanmigo, could you please create a lesson plan for me? And as soon as I hit the button, Khanmigo goes to work, generating a detailed lesson plan for me, which includes the objectives, the materials, the activities, the assessments, warmup activities, direct instruction, independent practice, you name it, it's in here. Plus the lesson plan is completely customizable, so I'm in charge and I usually know what works best for my students. Like I don't think my students will do well with a reflection journal. No worries, I can change the exit ticket in a matter of seconds. All I have to do is click on it, Khanmigo gives me a couple of prompts. I can either ask Khanmigo to make changes, I can ask Khanmigo to try something different, or I can discuss it with Khanmigo. I'm not really sure what I wanna do, so I'm just gonna ask Khanmigo to try something different. And in a matter of seconds, Khanmigo creates a new exit ticket for me. Thanks, Khanmigo. Once my lesson plan is created and I'm completely satisfied, I have a few options. I can choose to print the lesson plan or I can export it. If I export it, I'm able to export it to a Word document, to a PDF, or I can save it to my Google Drive and upload it to my Google Classroom. This has saved me so much time, thanks Khanmigo. As an English teacher, I aim to crack thought provoking discussion prompts tailored to specific topics for my students. My goal is to ignite their curiosity and stimulate intellectual discourse, so I'm going to use the discussion prompt feature. Again, I just have to let Khanmigo know my grade level, eighth grade, and the topic. This is going to be for Chapter 1 of \"Animal Farm\". And in a matter of seconds, Khanmigo creates multiple detailed and thought-provoking discussion questions that will be sure to get my students chatting, but in a good way. Thanks, Khanmigo. As an English teacher, I understand the value of exposing students to grade level text and vocabulary, however, balancing this with comprehension is crucial. The leveler feature, one of my new favorite tools, adjust text complexity to match student abilities, ensuring understanding while engaging with grade level material and personalizing instruction to each student's need. Once I let Khanmigo know the title of the text, I just copy paste the original text in the space provided and then let Khanmigo know the grade level that I'd like it re-leveled to. I have a couple of ninth grade students that are currently reading on a fifth, sixth grade level, and in a matter of seconds, Khanmigo will rewrite the prologue for Romeo and Juliet for my students who are currently reading on a sixth grade level, so that all of my students will understand and enjoy the play. Another feature that's a game changer in the classroom is the real world context generator. Imagine a tool that brings learning to life right in your classroom. Khanmigo's real world context generator does just that as it transforms abstract concepts into relatable scenarios, making learning fun and relatable. All I have to do is click on the feature, let Khanmigo know my grade level, I'm a sixth grade language arts teacher, and then let Khanmigo know my topic, we are currently working on inferences. Khanmigo creates three unique and engaging ideas that I can share with my students, enhancing their understanding and interest in the topic. These ideas incorporate detective work, texting their friends, and predicting the weather, all things that my students will find interesting. Thanks, Khanmigo. The next feature I'm going to explore is the informational text generator. This feature will create an informational text passage for the grade level you want from first grade all the way to the collegiate level. Once I input the intended grade level, fourth grade, and the topic of my choice, the lifecycle of a butterfly, I just have to select the length of the passage that I'd like created, I'm able to select 100, 300, or 750 words, Khanmigo will do the rest. This is also an excellent feature for integrating cross-curricular content, because it provides students with multiple ways to engage with the material. And as always, you can print or export to a Word document, a PDF, or save it to your Google Drive and upload to Google Classroom. This saved me so much time, Khanmigo, thank you. Refresh my knowledge is a super cool feature, it's like a friendly nudge to help me review topics that I've learned before, but I may be a little rusty on, such as grammar. First, Khanmigo would like to know the topic and the grade level that I'd like a refresher on. We are working on prepositional phrases in my seventh grade class. Once I provide that information, Khanmigo gives me the option of quizzing me on the topic or learning through conversation. I always love a good conversation, so I'm going to select that. When I select learning through conversation, Khanmigo gives me five major concepts at this grade level to select, and just like that, the memories are back, prepositions, I remember you, I always love the good prepositional phrase. And to ensure that my students don't forget about prepositional phrases like I did, I'm going to give the fun class summary poem feature a whirl. This unique tool turns lessons into rhythmic recaps. Once I ask my students what they learned today, prepositional phrases, and they give me a fun word to inspire our poem, like Pizza, Khanmigo will do the rest. And here is our fun class poem about prepositions. \"In the realm of grammar, we had a feast. About prepositional phrases, not in the least. On the topic of pizza, we did dwell. Under the cheese, where the toppings fell. Over the crust, the sauce did spread. Through each slice, our hunger fled.\" See, it's not just a poem, it's a memory enhancer, and it's going to spark creativity, and it's also a thrilling educational tool to use for our students. Thanks so much, Khanmigo. As you can see, integrating Khanmigo into your classroom routine empowers you to plan, create, differentiate, and support your students like never before. Khanmigo's insights will not only enrich the learning experience for your students, but it will also free up your time, enabling you to concentrate on what truly matters most, your students. Thank you for watching this video and for being part of our teaching and learning community. To learn more about how Khanmigo can support you and your students in the classroom, follow the links on your screen. And to never miss exciting announcements about new, free course materials on Khan Academy, be sure to subscribe. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو، میں مشیل ہوں، \nیہاں خان اکیڈمی میں ایک پیشہ ور سیکھنے کی ماہر اور آپ کی طرح ایک سابقہ ​​کلاس روم\nٹیچر ہوں۔ آج مجھے\nخانمیگو سے آپ کا تعارف کرواتے ہوئے خوشی ہو رہی ہے، جو آپ کے AI سے چلنے والے ساتھی ہیں\nجو زیادہ پرکشش اور\nموثر تجربے کے لیے تدریس میں انقلاب برپا کر رہا ہے۔ Khanmigo میں بہت ساری دلچسپ\nخصوصیات ہیں جو اساتذہ کی مدد کرتی ہیں، اور یہ ویڈیو ان\nطریقوں کو ظاہر کرے گی جن سے آپ اپنے تمام طلباء کے لیے سیکھنے کے تجربے کو بڑھانے کے لیے بنیادی مخصوص\nانگریزی زبان کے آرٹس کے مواد کو بنانے کے لیے Khanmigo کو استعمال کر سکتے ہیں۔ \n اس پورے ویڈیو کے دوران،\nہم ان طریقوں کو تلاش کریں گے جن سے Khanmigo آپ کی مدد کر سکتا ہے\nانوکھے اور پرکشش اسباق کے منصوبے اور طلباء مرکز کی سرگرمیاں جو آپ کے وقت کی بچت کرتے ہوئے طلباء کو پڑھنے میں پرجوش ہو جاتی ہیں۔ اس ٹیچنگ اسسٹنٹ کو دیکھنے کے لیے تیار ہیں جسے\nآپ ہمیشہ چاہتے ہیں؟ آئیے ایک نظر ڈالتے ہیں۔ یہ Khanmigo کا ڈیش بورڈ ہے جس میں وقت کی بچت کی بے شمار منفرد\nخصوصیات ہیں، جو\nآپ کے تدریسی تجربے کو بلند کرنے کے لیے تیار کی گئی ہیں۔ آئیے سبق کے ہک کی خصوصیت کو دریافت کرکے اپنے سفر کا آغاز کرتے ہیں ،\nکیونکہ آئیے اس کا سامنا کریں، یہ صرف پڑھانے کے بارے میں نہیں ہے، یہ یادگار، دلکش تجربات تخلیق کرنے کے بارے میں ہے\n جو سمجھ اور برقراری کو بڑھاتے ہیں۔ مجھے صرف خانمیگو کو\nگریڈ لیول بتانا ہے، یہ میری آٹھویں جماعت کی\nانگریزی کلاس، اور موضوع کے لیے ہے۔ ہم\nناول \"اینیمل فارم\" شروع کرنے والے ہیں۔ میں نے ابھی بٹن دبایا اور\nKhanmigo نے فوراً ہی شاندار اسباق کے ہکس بنائے جنہیں میں\nاپنے طلبہ کو مشغول کرنے کے لیے استعمال کر سکتا ہوں، اور جیسے ہی میں\nبٹن کو مارتا ہوں، Khanmigo کام پر چلا جاتا ہے، تین شاندار سبق کے ہکس بناتا ہے جنہیں میں اپنے طلبہ کے ساتھ استعمال کر سکتا ہوں۔ اب جبکہ میرے طالب علموں کا\nتجسس پیدا ہو گیا ہے، خانمیگو سبق کے منصوبے کی خصوصیت کو استعمال کر کے زبردست سبق کے منصوبے بنانے میں میری مدد کر سکتا ہے۔ میں خان اکیڈمی کے بھرپور کورس پیشکشوں میں سے کسی ایک موضوع کا انتخاب کر سکتا ہوں،\n \nیا میں اپنا انتخاب کر سکتا ہوں۔ میرے طلباء\n\"اینیمل فارم\" کا باب 1 پڑھنے والے ہیں۔ خانمیگو، کیا آپ براہ کرم\nمیرے لیے کوئی سبق کا منصوبہ بنا سکتے ہیں؟ اور جیسے ہی میں بٹن دباتا ہوں\n، خانمیگو کام پر چلا جاتا ہے، میرے لیے ایک تفصیلی سبق کا منصوبہ تیار کرتا ہے، جس میں\nمقاصد، مواد، سرگرمیاں،\nتشخیص، وارم اپ سرگرمیاں، براہ راست ہدایات، آزادانہ مشق، آپ اسے نام دیں، یہ ہے  یہاں میں۔  اس کے علاوہ سبق کا منصوبہ\nمکمل طور پر حسب ضرورت ہے، اس لیے میں انچارج ہوں اور میں عام طور پر جانتا ہوں کہ میرے طلباء کے لیے کون سا بہترین کام کرتا ہے۔ جیسا کہ مجھے نہیں لگتا کہ میرے\nطلباء عکاسی جریدے کے ساتھ اچھا کام کریں گے۔ پریشان ہونے کی کوئی بات نہیں، میں چند سیکنڈ میں ایگزٹ ٹکٹ تبدیل کر سکتا ہوں۔ مجھے بس اس پر کلک کرنا ہے، خانمیگو مجھے چند اشارے دیتا ہے۔ میں یا تو Khanmigo سے تبدیلیاں کرنے کو کہہ سکتا ہوں، میں Khanmigo سے\nکچھ مختلف کرنے کو کہہ سکتا ہوں، یا میں Khanmigo سے اس پر بات کر سکتا ہوں۔ مجھے واقعی یقین نہیں ہے کہ میں کیا کرنا چاہتا ہوں، اس لیے میں خانمیگو سے\nکچھ مختلف کرنے کو کہوں گا۔ اور چند ہی سیکنڈوں میں، Khanmigo میرے لیے ایک نیا ایگزٹ ٹکٹ بناتا ہے۔ شکریہ، خانمیگو۔ ایک بار جب میرا سبق کا منصوبہ بن جاتا ہے اور میں مکمل طور پر مطمئن ہو جاتا ہوں،\nمیرے پاس چند اختیارات ہوتے ہیں۔ میں سبق کے منصوبے کو پرنٹ کرنے کا انتخاب کر سکتا ہوں یا میں اسے برآمد کر سکتا ہوں۔ اگر میں اسے ایکسپورٹ کرتا ہوں تو میں\nاسے ورڈ دستاویز، پی ڈی ایف میں ایکسپورٹ کرنے کے قابل ہوں، یا میں\nاسے اپنی گوگل ڈرائیو میں محفوظ کر کے اپنے گوگل کلاس روم میں اپ لوڈ کر سکتا ہوں۔ اس سے میرا بہت\nوقت بچ گیا، شکریہ خانمیگو۔ ایک انگلش ٹیچر کے طور پر، میرا مقصد \nاپنے طلباء کے لیے مخصوص عنوانات کے لیے تیار کردہ سوچ کو بھڑکانے والی بحث کو ختم کرنا ہے۔ میرا مقصد ان کے تجسس کو بھڑکانا اور فکری گفتگو کو ابھارنا ہے، اس لیے میں\nڈسکشن پرامپٹ فیچر استعمال کرنے جا رہا ہوں۔ ایک بار پھر، مجھے\nخانمیگو کو اپنے گریڈ لیول، آٹھویں جماعت اور موضوع سے آگاہ کرنا ہے۔ یہ\n\"اینیمل فارم\" کے باب 1 کے لیے ہو گا۔ اور چند سیکنڈوں میں، Khanmigo متعدد مفصل اور فکر انگیز بحث کے\nسوالات تخلیق کرتا ہے جو یقینی طور پر میرے طالب علموں کو\nچیٹنگ کرنے پر مجبور کریں گے، لیکن اچھے طریقے سے۔ شکریہ، خانمیگو۔ ایک انگلش ٹیچر کے طور پر،\nمیں طلباء کو گریڈ\nلیول کے متن اور ذخیرہ الفاظ سے روشناس کرانے کی اہمیت کو سمجھتا ہوں، تاہم، فہم کے ساتھ اس میں توازن رکھنا بہت\nضروری ہے۔ لیولر فیچر،\nمیرے نئے پسندیدہ ٹولز میں سے ایک، \nطالب علم کی صلاحیتوں سے مطابقت رکھنے کے لیے متن کی پیچیدگی کو ایڈجسٹ کرتا ہے، گریڈ لیول کے مواد کے ساتھ مشغول رہتے ہوئے سمجھ بوجھ کو یقینی بناتا ہے \nاور ہر طالب علم کی ضرورت کے مطابق ہدایات کو ذاتی بناتا ہے۔ ایک بار جب میں خانمیگو کو\nمتن کے عنوان سے آگاہ کرتا ہوں، میں صرف اصل\nمتن کو فراہم کردہ جگہ میں کاپی پیسٹ کرتا ہوں اور پھر خانمیگو کو اس درجہ کی سطح سے آگاہ کرتا ہوں جس پر میں اسے دوبارہ ترتیب دینا چاہتا ہوں۔ میرے پاس نویں جماعت کے کچھ طلباء ہیں جو اس وقت\nپانچویں، چھٹی جماعت کی سطح پر پڑھ رہے ہیں، اور کچھ ہی سیکنڈوں میں، خانمیگو میرے طلباء کے لیے رومیو اور جولیٹ کی تجویز کو دوبارہ لکھے گا جو اس وقت\nچھٹی جماعت کی سطح پر پڑھ رہے ہیں، لہذا  کہ میرے تمام طلباء اس ڈرامے کو سمجھیں گے اور لطف اندوز ہوں گے۔ ایک اور خصوصیت جو\nکلاس روم میں گیم چینجر ہے وہ حقیقی دنیا کا سیاق و سباق پیدا کرنے والا ہے۔ ایک ایسے ٹول کا تصور کریں جو آپ کے کلاس روم میں ہی سیکھنے کو زندگی بخشے۔ خانمیگو کا حقیقی دنیا کے سیاق و سباق کا\nجنریٹر بالکل ایسا ہی کرتا ہے جیسا کہ یہ تجریدی\nتصورات کو متعلقہ منظرناموں میں تبدیل کرتا ہے، جس سے سیکھنے کو تفریح ​​اور متعلقہ بناتا ہے۔ مجھے صرف یہ کرنا ہے کہ فیچر پر کلک کریں، خانمیگو کو میرے گریڈ لیول سے آگاہ کریں، میں چھٹی جماعت کا لینگویج آرٹس ٹیچر ہوں، اور پھر خانمیگو کو میرا موضوع بتائیں، ہم فی الحال انفرنسز پر کام کر رہے ہیں۔ Khanmigo تین\nمنفرد اور دل چسپ خیالات تخلیق کرتا ہے جو میں اپنے طلباء کے ساتھ شیئر کر سکتا ہوں، \nموضوع میں ان کی سمجھ اور دلچسپی کو بڑھا سکتا ہوں۔ ان خیالات میں جاسوسی کا کام، اپنے دوستوں کو ٹیکسٹ بھیجنا، اور\nموسم کی پیشین گوئی کرنا، وہ تمام چیزیں شامل ہیں جو میرے طلباء کو\nدلچسپ لگیں گی۔ شکریہ، خانمیگو۔ اگلی خصوصیت جس کو میں دریافت کرنے جا رہا ہوں وہ معلوماتی ٹیکسٹ جنریٹر ہے۔ یہ خصوصیت گریڈ لیول کے لیے ایک\nمعلوماتی ٹیکسٹ پیسیج بنائے گی جسے آپ\nپہلی جماعت سے لے کر کالج کی سطح تک چاہتے ہیں۔ ایک بار جب میں مطلوبہ\nگریڈ لیول، چوتھا درجہ، اور اپنی پسند کا موضوع،\nتتلی کا لائف سائیکل داخل کر دوں، تو مجھے بس اس\nراستے کی لمبائی کو منتخب کرنا ہوگا جسے میں بنانا چاہتا ہوں،\nمیں 100، 300 کو منتخب کرنے کے قابل ہوں ، یا 750 الفاظ،\nخانمیگو باقی کام کرے گا۔ یہ نصابی مواد کو مربوط کرنے کے لیے بھی ایک بہترین خصوصیت ہے، کیونکہ یہ\nطلباء کو مواد کے ساتھ مشغول ہونے کے متعدد طریقے فراہم کرتا ہے۔ اور ہمیشہ کی طرح، آپ\nورڈ دستاویز، پی ڈی ایف کو پرنٹ یا ایکسپورٹ کر سکتے ہیں، یا اسے اپنی گوگل ڈرائیو میں محفوظ کر کے گوگل کلاس روم پر اپ لوڈ کر سکتے ہیں۔ اس سے میرا بہت\nوقت بچ گیا، خانمیگو، شکریہ۔ میرے علم کو تازہ کرنا\nایک زبردست خصوصیت ہے، یہ ایک دوستانہ جھٹکے کی طرح ہے جو\nمجھے ایسے موضوعات کا جائزہ لینے میں مدد کرتا ہے جو میں نے پہلے سیکھا ہے، لیکن ہو سکتا ہے کہ میں تھوڑا\nزنگ آلود ہوں، جیسے کہ گرامر۔ سب سے پہلے، خانمیگو\nاس موضوع اور گریڈ کی سطح کو جاننا چاہیں گے جس\nپر میں ریفریشر چاہتا ہوں۔ ہم ساتویں جماعت کی کلاس میں پیشگی جملے پر کام کر رہے ہیں۔ ایک بار جب میں وہ معلومات فراہم کرتا ہوں، خانمیگو\nمجھے موضوع پر سوال کرنے یا گفتگو کے ذریعے سیکھنے کا اختیار دیتا ہے۔ مجھے ہمیشہ اچھی گفتگو پسند ہے، لہذا میں اسے منتخب کرنے جا رہا ہوں۔ جب میں گفتگو کے ذریعے سیکھنے کا انتخاب کرتا ہوں، تو\n خانمیگو مجھے\nاس گریڈ کی سطح پر پانچ بڑے تصورات کو منتخب کرنے کے لیے دیتا ہے، اور بالکل اسی طرح، یادیں واپس آ گئی ہیں،\nprepositions، میں آپ کو یاد کرتا ہوں، مجھے ہمیشہ اچھے جملے پسند ہیں۔\n اور اس بات کو یقینی بنانے کے لیے کہ میرے\nطالب علم پہلے کی طرح کے فقروں کو نہ بھولیں جیسے\nمیں نے کیا تھا، میں تفریحی کلاس کے خلاصے کی\nنظم کو ایک چکر دینے جا رہا ہوں۔ یہ انوکھا ٹول\nاسباق کو ریتھمک ریکیپس میں بدل دیتا ہے۔ ایک بار میں اپنے طلباء سے پوچھتا ہوں کہ\nانہوں نے آج کیا سیکھا، پیشگی جملے، اور\nوہ مجھے ہماری نظم کو متاثر کرنے کے لیے ایک دلچسپ لفظ دیتے ہیں ، جیسے پیزا، خانمیگو باقی کام کریں گے۔ اور پیشی کے بارے میں ہماری تفریحی کلاس کی نظم یہ ہے۔\n \"گرائمر کے دائرے میں، ہم نے ایک عید منائی۔ پیشگی\nفقروں کے بارے میں، کم از کم نہیں۔ پیزا کے موضوع پر، ہم نے بسیرا کیا۔ پنیر کے نیچے، جہاں ٹاپنگس گرے۔ کرسٹ کے اوپر، چٹنی پھیل گئی۔ ہر ایک ٹکڑا، ہماری بھوک بھاگ گئی.\" دیکھیں، یہ صرف ایک نظم نہیں ہے،\nیہ یادداشت بڑھانے والا ہے، اور یہ تخلیقی صلاحیتوں کو جنم دے گا، اور یہ ہمارے طلباء کے لیے استعمال کرنے کے لیے ایک سنسنی خیز تعلیمی ٹول بھی ہے۔ بہت شکریہ، خانمیگو۔ جیسا کہ آپ دیکھ سکتے ہیں،\nKhanmigo کو اپنے کلاس روم کے معمولات میں ضم کرنا آپ کو اپنے طلباء کی منصوبہ بندی کرنے، تخلیق کرنے، فرق کرنے اور ان کی مدد کرنے کی طاقت دیتا ہے\nجیسا کہ پہلے کبھی نہیں تھا۔ Khanmigo کی بصیرت نہ صرف آپ کے طلباء کے لیے سیکھنے کے تجربے کو تقویت بخشے گی، بلکہ یہ\nآپ کا وقت بھی خالی کرے گی، جس سے آپ اس بات پر توجہ مرکوز کر سکیں گے کہ\nآپ کے طلباء، جو واقعی سب سے اہم ہیں۔ اس ویڈیو کو دیکھنے اور ہماری\nتدریسی اور سیکھنے والی کمیونٹی کا حصہ بننے کے لیے آپ کا شکریہ۔  اس بارے میں مزید جاننے کے لیے کہ\nخانمیگو کلاس روم میں آپ اور آپ کے طلباء کی کس طرح مدد کر سکتا ہے، اپنی اسکرین پر موجود لنکس پر عمل کریں۔ اور خان اکیڈمی پر\nنئے، مفت کورس مواد کے بارے میں دلچسپ اعلانات سے کبھی محروم نہ ہوں \n، سبسکرائب کرنا یقینی بنائیں۔",
    "t_spanish": "- Hola, soy Michelle, una especialista en aprendizaje profesional\naquí en Khan Academy y ex\nmaestra de aula como tú. Hoy tengo el placer de\npresentarles a Khanmigo, su compañero impulsado por IA\nque está revolucionando la enseñanza para ofrecer una experiencia más atractiva y\neficiente. Khanmigo tiene muchas\nfunciones interesantes que apoyan a los profesores, y este video mostrará\nformas en que puede utilizar Khanmigo para crear contenido básico específico de\nartes del lenguaje inglés para mejorar la experiencia de aprendizaje\nde todos sus estudiantes. A lo largo de este video,\nexploraremos las formas en que Khanmigo puede ayudarlo a\ncrear planes de lecciones y actividades del centro de estudiantes únicos y atractivos que entusiasmen a los estudiantes con la lectura y, al mismo tiempo, les ahorren tiempo.  ¿ Listo para ver al\nasistente de enseñanza que siempre quisiste? Vamos a ver. Este es el panel de Khanmigo repleto de una multitud de\nfunciones únicas para ahorrar tiempo, todas diseñadas para mejorar\nsu experiencia docente. Comencemos nuestro viaje explorando la función de gancho de lección,\nporque seamos realistas, no se trata solo de enseñar, sino de crear\nexperiencias memorables y atractivas que mejoren la comprensión y la retención. Sólo tengo que informarle a Khanmigo\nel nivel de grado, esto es para mi\nclase de inglés de octavo grado, y el tema. Estamos a punto de empezar\nla novela \"Animal Farm\". Simplemente presiono el botón y\nKhanmigo inmediatamente crea fantásticos ganchos de lecciones que\npuedo usar para involucrar a mis alumnos, y tan pronto como presiono el\nbotón, Khanmigo se pone a trabajar, creando tres maravillosos ganchos de lecciones que puedo usar con mis alumnos. Ahora que se ha despertado la curiosidad de mis alumnos\n, Khanmigo puede ayudarme a elaborar planes de lecciones atractivos utilizando la función de plan de lecciones. Puedo seleccionar un tema de\nuna de las ricas ofertas de cursos de Khan Academy \no puedo seleccionar el mío propio. Mis alumnos están a punto de leer el\nCapítulo 1 de \"Animal Farm\". Khanmigo, ¿podrías\ncrear un plan de lección para mí? Y tan pronto como presiono el\nbotón, Khanmigo se pone a trabajar, generando un plan de lección detallado para mí, que incluye los\nobjetivos, los materiales, las actividades, las\nevaluaciones, las actividades de preparación, la instrucción directa, la práctica independiente, lo que sea, es  aquí dentro. Además, el plan de lección es\ncompletamente personalizable, por lo que estoy a cargo y normalmente sé qué funciona mejor para mis alumnos. Por ejemplo, no creo que a mis\nalumnos les vaya bien con un diario de reflexión. No te preocupes, puedo cambiar el billete de salida en cuestión de segundos. Todo lo que tengo que hacer es hacer clic en él, Khanmigo me da un par de indicaciones. Puedo pedirle a Khanmigo que haga cambios, puedo pedirle a Khanmigo que\npruebe algo diferente o puedo discutirlo con Khanmigo. No estoy muy seguro de lo que quiero hacer, así que le pediré a Khanmigo\nque pruebe algo diferente. Y en cuestión de segundos, Khanmigo me crea un nuevo ticket de salida. Gracias, Khanmigo. Una vez creado mi plan de lección y estoy completamente satisfecho,\ntengo algunas opciones. Puedo optar por imprimir el plan de lección o puedo exportarlo. Si lo exporto, puedo\nexportarlo a un documento de Word, a un PDF, o puedo guardarlo\nen mi Google Drive y subirlo a mi Google Classroom. Esto me ha ahorrado mucho\ntiempo, gracias Khanmigo. Como profesora de inglés, mi objetivo es encontrar temas de debate que inviten a la reflexión y que se adapten a\ntemas específicos para mis alumnos. Mi objetivo es despertar su curiosidad y estimular el discurso intelectual, por eso voy a utilizar la\nfunción de inicio de discusión. Nuevamente, solo tengo que\ninformarle a Khanmigo mi nivel de grado, octavo grado y el tema. Esto será para el\nCapítulo 1 de \"Animal Farm\". Y en cuestión de segundos, Khanmigo crea múltiples preguntas de discusión detalladas y estimulantes\nque seguramente harán que mis alumnos\nconversen, pero en el buen sentido. Gracias, Khanmigo. Como profesora de inglés,\nentiendo el valor de exponer a los estudiantes a\ntextos y vocabulario de su grado; sin embargo, equilibrar esto con\nla comprensión es crucial. La función de nivelación, una\nde mis nuevas herramientas favoritas, ajusta la complejidad del texto para que\ncoincida con las habilidades de los estudiantes, lo que garantiza la comprensión mientras interactúa con el material del nivel de grado\ny personaliza la instrucción según las necesidades de cada estudiante. Una vez que le informo a Khanmigo\nel título del texto, simplemente copio y pego el\ntexto original en el espacio provisto y luego le informo a Khanmigo el nivel de grado al que me gustaría volver a nivelarlo. Tengo un par de estudiantes de noveno grado que actualmente están leyendo en\nun nivel de quinto o sexto grado, y en cuestión de segundos, Khanmigo reescribirá el prólogo de Romeo y Julieta para mis estudiantes que actualmente están leyendo\nen un nivel de sexto grado, así que  que todos mis alumnos comprendan y disfruten la obra. Otra característica que\ncambia las reglas del juego en el aula es el generador de contexto del mundo real. Imagine una herramienta que dé vida al aprendizaje directamente en su salón de clases.  El generador de contexto del mundo real de Khanmigo\nhace precisamente eso: transforma\nconceptos abstractos en escenarios identificables, haciendo que el aprendizaje sea divertido y identificable. Todo lo que tengo que hacer es hacer clic en la función, informarle a Khanmigo mi nivel de grado, soy profesor de artes del lenguaje de sexto grado, y luego informarle a Khanmigo mi tema, actualmente estamos trabajando en inferencias. Khanmigo crea tres\nideas únicas y atractivas que puedo compartir con mis alumnos, mejorando su comprensión\ne interés en el tema. Estas ideas incorporan el trabajo de detective, enviar mensajes de texto a sus amigos y\npredecir el clima, todas cosas que mis alumnos\nencontrarán interesantes. Gracias, Khanmigo. La siguiente característica que voy a explorar es el generador de texto informativo. Esta función creará un\npasaje de texto informativo para el nivel de grado que\ndesea, desde el primer grado hasta el nivel universitario. Una vez que ingreso el\nnivel de grado deseado, cuarto grado, y el tema de mi elección,\nel ciclo de vida de una mariposa, solo tengo que seleccionar\nla longitud del pasaje que me gustaría crear,\npuedo seleccionar 100, 300  , o 750 palabras,\nKhanmigo hará el resto. Esta también es una característica excelente para integrar contenido interdisciplinario, porque proporciona a\nlos estudiantes múltiples formas de interactuar con el material. Y como siempre, puedes imprimirlo\no exportarlo a un documento de Word, un PDF o guardarlo en tu Google Drive y subirlo a Google Classroom. Esto me ahorró mucho\ntiempo, Khanmigo, gracias. Actualizar mis conocimientos es\nuna característica genial, es como un empujón amistoso\nque me ayuda a repasar temas que he aprendido antes, pero que tal vez esté un poco\noxidado, como la gramática. Primero, a Khanmigo le\ngustaría saber el tema y el nivel de grado sobre el que\nme gustaría repasar el tema. Estamos trabajando en frases preposicionales en mi clase de séptimo grado. Una vez que proporciono esa información, Khanmigo me da la opción\nde interrogarme sobre el tema o aprender a través de una conversación. Siempre me encanta una buena conversación, así que voy a seleccionar esa. Cuando selecciono aprender\na través de la conversación, Khanmigo me da cinco\nconceptos principales en este nivel de grado para seleccionar, y así, los recuerdos regresan,\npreposiciones, te recuerdo, siempre me encanta la buena\nfrase preposicional. Y para asegurarme de que mis\nalumnos no se olviden de las frases preposicionales como lo\nhice yo, voy a darle una oportunidad al divertido poema resumen de la clase\n. Esta herramienta única convierte las\nlecciones en resúmenes rítmicos. Una vez que les pregunte a mis alumnos\nqué aprendieron hoy, frases preposicionales, y\nme den una palabra divertida para inspirar nuestro poema, como Pizza, Khanmigo hará el resto. Y aquí está nuestro divertido\npoema de clase sobre preposiciones. \"En el ámbito de la gramática, nos dimos un festín. Sobre\nlas frases preposicionales, en lo más mínimo. En el tema de la pizza, nos detuvimos. Debajo del queso, donde caían los aderezos. Sobre la corteza, la salsa se extendió. A través  Con cada rebanada, nuestra hambre se esfumaba.\" Mira, no es solo un poema,\nes un potenciador de la memoria, despertará la creatividad y también es una herramienta educativa emocionante para nuestros estudiantes. Muchas gracias Khanmigo. Como puede ver, integrar\nKhanmigo en su rutina de clase le permite planificar, crear, diferenciar y apoyar a sus\nestudiantes como nunca antes.  Los conocimientos de Khanmigo no solo enriquecerán la experiencia de aprendizaje de sus estudiantes, sino que también le liberarán\ntiempo, permitiéndole concentrarse en lo que realmente\nimporta: sus estudiantes. Gracias por ver este video y por ser parte de nuestra\ncomunidad de enseñanza y aprendizaje. Para obtener más información sobre cómo\nKhanmigo puede ayudarlo a usted y a sus alumnos en el aula, siga los enlaces en su pantalla. Y para no perderse nunca\nanuncios interesantes sobre materiales de cursos nuevos y gratuitos en Khan\nAcademy, asegúrese de suscribirse.",
    "t_arabic": "- مرحبًا، أنا ميشيل، أخصائية تعلم محترفة\nهنا في أكاديمية خان ومعلمة سابقة\nمثلك تمامًا. يسعدني اليوم أن أقدم لكم\nخانميغو، رفيقكم المعتمد على الذكاء الاصطناعي\nوالذي أحدث ثورة في التدريس من أجل تجربة أكثر جاذبية\nوكفاءة. يحتوي Khanmigo على العديد من\nالميزات المثيرة التي تدعم المعلمين، وسيعرض هذا الفيديو\nالطرق التي يمكنك من خلالها استخدام Khanmigo لإنشاء\nمحتوى أساسي محدد لفنون اللغة الإنجليزية لتعزيز تجربة التعلم\nلجميع طلابك. خلال هذا الفيديو،\nسنستكشف الطرق التي يمكن أن يساعدك بها Khanmigo في\nإنشاء خطط دروس فريدة وجذابة وأنشطة مركز الطلاب التي تجعل الطلاب متحمسين للقراءة مع توفير الوقت.  هل أنت مستعد لرؤية\nمساعد التدريس الذي طالما أردته؟ لنلقي نظرة. هذه هي لوحة تحكم Khanmigo المليئة بالعديد من\nالميزات الفريدة لتوفير الوقت، وكلها مصممة للارتقاء\nبتجربة التدريس الخاصة بك. دعونا نبدأ رحلتنا باستكشاف ميزة ربط الدروس،\nلأننا لنواجه الأمر، لا يتعلق الأمر بالتدريس فحسب، بل يتعلق بإنشاء تجارب لا تُنسى وجذابة\n تعزز الفهم والاحتفاظ. يجب علي فقط أن أخبر خانميغو\nبمستوى الصف، وهذا مخصص\nلصف اللغة الإنجليزية للصف الثامن، والموضوع. نحن على وشك أن نبدأ\nرواية \"مزرعة الحيوانات\".  كل ما قمت به هو الضغط على الزر ويقوم\nخانميغو على الفور بإنشاء روابط دروس رائعة\nيمكنني استخدامها لإشراك طلابي، وبمجرد الضغط على\nالزر، يذهب خانميغو إلى العمل، وينشئ ثلاث روابط دروس رائعة يمكنني استخدامها مع طلابي. الآن بعد أن\nأثار فضول طلابي، يمكن لـ Khanmigo مساعدتي في صياغة خطط دروس مقنعة من خلال الاستفادة من ميزة خطة الدرس. يمكنني اختيار موضوع من\nإحدى الدورات التدريبية الغنية التي تقدمها أكاديمية خان،\nأو يمكنني اختيار موضوعي الخاص. طلابي على وشك قراءة\nالفصل الأول من \"مزرعة الحيوانات\". خانميغو، هل يمكنك من فضلك\nإنشاء خطة درس لي؟ وبمجرد أن أضغط على\nالزر، يبدأ خانميغو في العمل، وينشئ خطة درس مفصلة لي، والتي تتضمن\nالأهداف، والمواد، والأنشطة،\nوالتقييمات، وأنشطة الإحماء، والتعليم المباشر، والممارسة المستقلة، سمها ما شئت، إنها  هنا. بالإضافة إلى أن خطة الدرس\nقابلة للتخصيص بالكامل، لذا فأنا المسؤول وأعرف عادةً ما هو الأفضل لطلابي. كما لو أنني لا أعتقد أن\nطلابي سيعملون بشكل جيد مع مجلة التأمل. لا تقلق، يمكنني تغيير تذكرة الخروج في غضون ثوانٍ. كل ما علي فعله هو النقر عليه، ويعطيني خانميغو بعض المطالبات. يمكنني إما أن أطلب من خانميجو إجراء تغييرات، أو يمكنني أن أطلب من خانميجو\nتجربة شيء مختلف، أو يمكنني مناقشة الأمر مع خانميجو. لست متأكدًا حقًا مما أريد فعله، لذا سأطلب من خانميجو\nتجربة شيء مختلف. وفي غضون ثوانٍ، أنشأ خانميغو تذكرة خروج جديدة لي. شكرا خانميجو. بمجرد إنشاء خطة الدرس الخاصة بي وأنا راضٍ تمامًا،\nلدي بعض الخيارات. يمكنني اختيار طباعة خطة الدرس أو تصديرها. إذا قمت بتصديره، فسأتمكن من\nتصديره إلى مستند Word، أو إلى ملف PDF، أو يمكنني حفظه\nعلى Google Drive وتحميله على Google Classroom الخاص بي.  لقد وفر لي هذا الكثير من\nالوقت، شكرًا لك خانميجو. باعتباري مدرسًا للغة الإنجليزية، أهدف إلى طرح مناقشات مثيرة للتفكير ومصممة خصيصًا\nلموضوعات محددة لطلابي. هدفي هو إثارة فضولهم وتحفيز الخطاب الفكري، لذلك سأستخدم\nميزة المناقشة الفورية. مرة أخرى، عليّ فقط أن أخبر\nخانميغو بمستوى صفي، والصف الثامن، والموضوع. سيكون هذا\nللفصل الأول من \"مزرعة الحيوانات\". وفي غضون ثوانٍ، يقوم Khanmigo بإنشاء العديد من أسئلة المناقشة التفصيلية والمثيرة للتفكير\nوالتي من المؤكد أنها ستجعل طلابي\nيدردشون، ولكن بطريقة جيدة. شكرا خانميجو. كمدرس للغة الإنجليزية،\nأفهم قيمة تعريض الطلاب\nللنصوص والمفردات على مستوى الصف الدراسي، ومع ذلك، فإن الموازنة بين ذلك\nوالفهم أمر بالغ الأهمية.  تعمل ميزة التسوية،\nإحدى أدواتي المفضلة الجديدة، على ضبط تعقيد النص ليتناسب مع\nقدرات الطلاب، مما يضمن الفهم أثناء التعامل مع مواد مستوى الصف الدراسي\nوتخصيص التعليمات وفقًا لاحتياجات كل طالب. بمجرد السماح لـ Khanmigo بمعرفة\nعنوان النص، أقوم فقط بنسخ النص الأصلي ولصقه\nفي المساحة المتوفرة ثم السماح لـ Khanmigo بمعرفة مستوى الصف الذي أرغب في إعادة المستوى إليه. لدي اثنين من طلاب الصف التاسع يقرؤون حاليًا على\nمستوى الصف الخامس والسادس، وفي غضون ثوانٍ، سيعيد خانميغو كتابة مقدمة روميو وجولييت لطلابي الذين يقرؤون حاليًا\nعلى مستوى الصف السادس، لذا  أن جميع طلابي سيفهمون المسرحية ويستمتعون بها. ميزة أخرى\nتغير قواعد اللعبة في الفصل الدراسي هي مولد سياق العالم الحقيقي. تخيل أداة تضفي الحيوية على التعلم في الفصل الدراسي الخاص بك.  يقوم منشئ سياق العالم الحقيقي الخاص بـ Khanmigo بذلك\nتمامًا حيث يقوم بتحويل\nالمفاهيم المجردة إلى سيناريوهات قابلة للربط، مما يجعل التعلم ممتعًا وقابلاً للربط. كل ما علي فعله هو النقر على الميزة، وإخبار خانميغو بمستوى صفي، فأنا مدرس فنون لغة للصف السادس، ثم إخبار خانميغو بموضوعي، ونحن نعمل حاليًا على الاستدلالات. يبتكر خانميغو ثلاث\nأفكار فريدة وجذابة يمكنني مشاركتها مع طلابي، مما يعزز فهمهم\nواهتمامهم بالموضوع. تتضمن هذه الأفكار العمل البوليسي، ومراسلة الأصدقاء،\nوالتنبؤ بالطقس، وكل الأشياء التي\nسيجدها طلابي مثيرة للاهتمام. شكرا خانميجو. الميزة التالية التي سأستكشفها هي منشئ النص المعلوماتي. ستقوم هذه الميزة بإنشاء\nمقطع نصي إعلامي لمستوى الصف الذي\nتريده من الصف الأول وحتى المستوى الجامعي. بمجرد إدخال\nمستوى الصف المقصود، الصف الرابع، والموضوع الذي اخترته،\nدورة حياة الفراشة، كل ما علي فعله هو تحديد\nطول المقطع الذي أرغب في إنشائه،\nيمكنني تحديد 100، 300  أو 750 كلمة،\nوسيقوم خانميغو بالباقي.  تعد هذه أيضًا ميزة ممتازة لدمج المحتوى عبر المناهج الدراسية، لأنها توفر\nللطلاب طرقًا متعددة للتفاعل مع المادة.  وكما هو الحال دائمًا، يمكنك الطباعة\nأو التصدير إلى مستند Word أو PDF أو حفظه على Google Drive وتحميله إلى Google Classroom.  لقد وفر لي هذا الكثير من\nالوقت، خانميجو، شكرًا لك. يعد تحديث معرفتي\nميزة رائعة للغاية، فهي بمثابة تنبيه ودود\nلمساعدتي في مراجعة الموضوعات التي تعلمتها من قبل، ولكن قد أكون متعثرًا بعض الشيء\n، مثل القواعد النحوية. أولاً، يود خانميغو\nمعرفة الموضوع ومستوى الصف الذي\nأرغب في تجديد معلوماته. نحن نعمل على عبارات حروف الجر في صفي بالصف السابع. بمجرد تقديم هذه المعلومات، يمنحني Khanmigo خيار\nاستجوابي حول الموضوع أو التعلم من خلال المحادثة. أنا دائمًا أحب المحادثة الجيدة، لذلك سأختار ذلك. عندما أختار التعلم\nمن خلال المحادثة، يعطيني خانميغو خمسة\nمفاهيم رئيسية في هذا المستوى الدراسي لاختيارها، وهكذا، تعود الذكريات،\nوحروف الجر، وأتذكرك، وأنا دائمًا أحب\nعبارة حروف الجر الجيدة. وللتأكد من أن\nطلابي لا ينسون عبارات حروف الجر كما\nفعلت، سأقوم بإعطاء ميزة القصيدة التلخيصية الممتعة للفصل نظرة\nسريعة.  تعمل هذه الأداة الفريدة على تحويل\nالدروس إلى ملخصات إيقاعية. بمجرد أن أسأل طلابي\nعما تعلموه اليوم، عبارات حروف الجر،\nويعطونني كلمة ممتعة لإلهام قصيدتنا، مثل بيتزا، سيقوم خانميغو بالباقي. وهنا قصيدتنا الممتعة\nحول حروف الجر. \"في عالم القواعد، كان لدينا وليمة. فيما يتعلق\nبعبارات حروف الجر، ليس على الأقل. في موضوع البيتزا، لقد سكنا. تحت الجبن، حيث سقطت الطبقة. وفوق القشرة، انتشرت الصلصة. من خلال  مع كل شريحة هرب جوعنا.\"  كما ترون، إنها ليست مجرد قصيدة،\nإنها مُحسِّنة للذاكرة، وسوف تثير الإبداع، وهي أيضًا أداة تعليمية مثيرة لاستخدامها من قبل طلابنا. شكرا جزيلا، خانميجو. كما ترون، فإن دمج\nKhanmigo في روتين الفصل الدراسي الخاص بك يمكّنك من تخطيط طلابك وإنشاءهم وتمييزهم ودعمهم\nبشكل لم يسبق له مثيل. لن تعمل رؤى خانميغو على إثراء تجربة التعلم لطلابك فحسب، بل ستوفر أيضًا\nوقتك، مما يتيح لك التركيز على ما\nيهم حقًا، وهو طلابك. نشكرك على مشاهدة هذا الفيديو وعلى كونك جزءًا من\nمجتمع التعليم والتعلم لدينا. لمعرفة المزيد حول كيفية\nدعم Khanmigo لك ولطلابك في الفصل الدراسي، اتبع الروابط التي تظهر على شاشتك. وحتى لا تفوت أبدًا\nالإعلانات المثيرة حول المواد الدراسية المجانية الجديدة في\nأكاديمية خان، تأكد من الاشتراك.",
    "t_italian": "- Ciao, sono Michelle, una specialista dell'apprendimento professionale\nqui alla Khan Academy ed ex\ninsegnante di classe proprio come te. Oggi ho il piacere di\npresentarti Khanmigo, il tuo compagno basato sull'intelligenza artificiale\nche sta rivoluzionando l'insegnamento per un'esperienza più coinvolgente ed\nefficiente. Khanmigo ha molte\nfunzionalità interessanti che supportano gli insegnanti e questo video mostrerà i\nmodi in cui puoi utilizzare Khanmigo per creare\ncontenuti artistici specifici in lingua inglese per migliorare l'esperienza di apprendimento\nper tutti i tuoi studenti. In questo video\nesploreremo i modi in cui Khanmigo può aiutarti a\ncreare programmi di lezioni e attività del centro studenti unici e coinvolgenti che stimolino gli studenti ad appassionarsi alla lettura facendoti risparmiare tempo. Pronto a vedere l'\nassistente didattico che hai sempre desiderato? Diamo un'occhiata. Questa è la dashboard di Khanmigo ricca di una moltitudine di\nfunzionalità uniche per risparmiare tempo, tutte su misura per migliorare\nla tua esperienza di insegnamento. Iniziamo il nostro viaggio esplorando la funzione di apprendimento della lezione,\nperché ammettiamolo, non si tratta solo di insegnare, si tratta di creare\nesperienze memorabili e coinvolgenti che migliorano la comprensione e la memorizzazione. Devo solo far\nsapere a Khanmigo il livello della scuola, questo è per la mia\nlezione di inglese di terza media, e l'argomento. Stiamo per iniziare\nil romanzo \"La fattoria degli animali\". Premo semplicemente il pulsante e\nKhanmigo crea immediatamente fantastici hook per le lezioni che\nposso utilizzare per coinvolgere i miei studenti e, non appena premo il\npulsante, Khanmigo si mette al lavoro, creando tre meravigliosi hook per le lezioni che posso utilizzare con i miei studenti. Ora che la curiosità dei miei studenti è\nstata stimolata, Khanmigo può aiutarmi a creare piani di lezione avvincenti utilizzando la funzione piano di lezione. Posso selezionare un argomento da\nuna delle ricche offerte di corsi di Khan Academy \noppure posso selezionarne uno mio.  I miei studenti stanno per leggere il\ncapitolo 1 della \"Fattoria degli animali\". Khanmigo, potresti per favore\ncreare uno schema di lezione per me? E non appena premo il\npulsante, Khanmigo si mette al lavoro, generando per me un piano di lezione dettagliato, che include gli\nobiettivi, i materiali, le attività, le\nvalutazioni, le attività di riscaldamento, l' istruzione diretta, la pratica indipendente, qualsiasi cosa tu dica, è così.  qui. Inoltre il programma delle lezioni è\ncompletamente personalizzabile, quindi sono io il responsabile e di solito so cosa funziona meglio per i miei studenti. Come se non penso che i miei\nstudenti se la caveranno bene con un diario di riflessione. Nessun problema, posso cambiare il ticket di uscita in pochi secondi. Tutto quello che devo fare è cliccarci sopra, Khanmigo mi dà un paio di suggerimenti. Posso chiedere a Khanmigo di apportare modifiche, posso chiedere a Khanmigo di\nprovare qualcosa di diverso o posso discuterne con Khanmigo. Non sono proprio sicuro di cosa voglio fare, quindi chiederò semplicemente a Khanmigo\ndi provare qualcosa di diverso. E nel giro di pochi secondi Khanmigo crea per me un nuovo biglietto d'uscita. Grazie, Khanmigo. Una volta creato il programma della lezione e sono completamente soddisfatto,\nho alcune opzioni. Posso scegliere di stampare il programma della lezione oppure esportarlo. Se lo esporto, posso\nesportarlo in un documento Word, in un PDF oppure posso salvarlo\nsul mio Google Drive e caricarlo sul mio Google Classroom. Questo mi ha fatto risparmiare così tanto\ntempo, grazie Khanmigo. Come insegnante di inglese, il mio obiettivo è quello di creare spunti di discussione stimolanti su misura per\nargomenti specifici per i miei studenti.  Il mio obiettivo è accendere la loro curiosità e stimolare il discorso intellettuale, quindi utilizzerò la\nfunzione di suggerimento della discussione. Ancora una volta, devo solo far\nsapere a Khanmigo il mio livello scolastico, la terza media e l'argomento. Questo sarà per il\ncapitolo 1 della \"Fattoria degli animali\". E in pochi secondi, Khanmigo crea molteplici domande di discussione dettagliate e stimolanti\nche sicuramente faranno chiacchierare i miei studenti\n, ma in senso positivo. Grazie, Khanmigo. Come insegnante di inglese,\ncapisco l'importanza di esporre gli studenti al\ntesto e al vocabolario di livello scolastico, tuttavia, bilanciare questo con\nla comprensione è fondamentale. La funzione livellatore, uno\ndei miei nuovi strumenti preferiti, regola la complessità del testo per\nadattarla alle capacità degli studenti, garantendo la comprensione mentre si interagisce con il materiale di livello scolastico\ne personalizzando le istruzioni in base alle esigenze di ogni studente. Dopo aver comunicato a Khanmigo\nil titolo del testo, copio e incollo il\ntesto originale nello spazio fornito e poi faccio sapere a Khanmigo il livello di voto a cui vorrei che fosse livellato nuovamente. Ho un paio di studenti della nona elementare che attualmente stanno leggendo a\nun livello di quinta, sesta elementare e, in pochi secondi, Khanmigo riscriverà il prologo di Romeo e Giulietta per i miei studenti che attualmente stanno leggendo\na un livello di prima media, quindi  che tutti i miei studenti capiranno e apprezzeranno lo spettacolo. Un'altra caratteristica che\ncambia le regole del gioco in classe è il generatore di contesto del mondo reale. Immagina uno strumento che dia vita all'apprendimento direttamente nella tua classe.  Il generatore di contesto del mondo reale di Khanmigo\nfa proprio questo poiché trasforma\nconcetti astratti in scenari riconoscibili, rendendo l'apprendimento divertente e riconoscibile. Tutto quello che devo fare è fare clic sulla funzione, far sapere a Khanmigo il mio livello scolastico, sono un insegnante di arti linguistiche di prima media, e poi far sapere a Khanmigo il mio argomento, attualmente stiamo lavorando sulle inferenze. Khanmigo crea tre\nidee uniche e coinvolgenti che posso condividere con i miei studenti, migliorando la loro comprensione\ne interesse per l'argomento. Queste idee includono il lavoro investigativo, l'invio di messaggi agli amici e la\nprevisione del tempo, tutte cose che i miei studenti\ntroveranno interessanti. Grazie, Khanmigo. La prossima funzionalità che esplorerò è il generatore di testo informativo. Questa funzione creerà un\npassaggio di testo informativo per il livello scolastico\ndesiderato, dalla prima elementare fino al livello collegiale. Una volta inserito il\nlivello scolastico previsto, quarta elementare, e l'argomento di mia scelta,\nil ciclo di vita di una farfalla, devo solo selezionare\nla lunghezza del passaggio che vorrei creare,\nposso selezionare 100, 300  , ovvero 750 parole,\nKhanmigo farà il resto. Questa è anche una caratteristica eccellente per l'integrazione di contenuti interdisciplinari, perché offre agli\nstudenti molteplici modi per interagire con il materiale. E come sempre, puoi stampare\no esportare in un documento Word, un PDF oppure salvarlo su Google Drive e caricarlo su Google Classroom. Questo mi ha fatto risparmiare un sacco di\ntempo, Khanmigo, grazie. Aggiornare le mie conoscenze è\nuna funzionalità davvero interessante, è come una spinta amichevole\nper aiutarmi a rivedere argomenti che ho imparato in precedenza, ma su cui potrei essere un po'\narrugginito, come la grammatica. Per prima cosa, Khanmigo\nvorrebbe sapere l'argomento e il livello scolastico su cui\nvorrei un ripasso. Stiamo lavorando sulle frasi preposizionali nella mia classe di seconda media. Una volta fornite tali informazioni, Khanmigo mi dà la possibilità\ndi interrogarmi sull'argomento o di imparare attraverso la conversazione. Mi piace sempre una buona conversazione, quindi selezionerò quella. Quando seleziono l'apprendimento\nattraverso la conversazione, Khanmigo mi dà cinque\nconcetti principali a questo livello da selezionare e, proprio così, i ricordi tornano,\npreposizioni, mi ricordo di te, amo sempre la buona\nfrase preposizionale. E per garantire che i miei\nstudenti non dimentichino le frasi preposizionali come ho\nfatto io, darò un vortice alla divertente poesia riassuntiva della classe\n. Questo strumento unico trasforma le\nlezioni in riassunti ritmici. Una volta che chiedo ai miei studenti\ncosa hanno imparato oggi, frasi preposizionali, e\nloro mi danno una parola divertente per ispirare la nostra poesia, come Pizza, Khanmigo farà il resto. Ed ecco la nostra divertente\npoesia di classe sulle preposizioni. \"Nel campo della grammatica abbiamo fatto festa. A proposito di\nlocuzioni preposizionali, nientemeno. Sul tema della pizza ci siamo soffermati. Sotto il formaggio, dove cadevano i condimenti. Sopra la crosta, la salsa si è sparsa. Attraverso  ogni fetta, la nostra fame se ne andava.\" Vedi, non è solo una poesia,\nè un potenziatore della memoria, stimolerà la creatività ed è anche uno strumento educativo emozionante da utilizzare per i nostri studenti. Grazie mille, Khanmigo. Come puoi vedere, l'integrazione di\nKhanmigo nella routine della tua classe ti consente di pianificare, creare, differenziare e supportare i tuoi\nstudenti come mai prima d'ora.  Gli approfondimenti di Khanmigo non solo arricchiranno l'esperienza di apprendimento dei tuoi studenti, ma ti libereranno anche\ntempo, permettendoti di concentrarti su ciò che\nconta veramente di più: i tuoi studenti. Grazie per aver guardato questo video e per far parte della nostra\ncomunità di insegnamento e apprendimento. Per saperne di più su come\nKhanmigo può supportare te e i tuoi studenti in classe, segui i collegamenti sullo schermo. E per non perdere mai entusiasmanti\nannunci sui nuovi materiali gratuiti dei corsi su Khan\nAcademy, assicurati di iscriverti."
}