{
    "source": "PSFLgn_7McY",
    "youtubelink": "https://www.youtube.com/watch?v=PSFLgn_7McY",
    "t_english": "- Hi, everyone, Sal here from Khan Academy, and as some of y'all know, I have released my second book, \"Brave New Words\", about the future of AI in education and work. It's available wherever you might buy your books. But as part of the research for that book, I did some interviews with some fascinating people, which you are about to watch. I have two very exciting guests today. I have Dr. Peggy Buffington, who's the superintendent of the Hobart School District in Indiana, in the Greater Chicago Area, I guess we can say. And we also have Dr. Tim Krieg, who's the director of Secondary Curriculum and Instruction at School City of Hobart. Welcome to both of you. - Thank you for having us today. - Yes, thank you so much. - So let me just start. No, well thanks for joining, and let me just start with a very basic question, before we get into some of the things that we've been collaborating with over the last several months. When ChatGPT hit the scene at the end of November of 2022, or early December, and y'all started learning about it and maybe hearing the rumors that the students might be using it for essays or for other things, what was y'all's reactions? What were y'all thinking about? What were you hearing from your teachers? And maybe start with you, Dr. Buffington. - Well, at first, and just to give you some background in terms of technology use, you know, I started reading everything that I could about it and making an account, figuring out the intricacies of it. And I've approached it in a sense that I would, with any type of technology, which would be, wow, how are we going to integrate this, use it, and not be afraid of it. And I think that that was the most important approach that I could take to it, just simply because this isn't something that, let's just say, when Google came out or when we first started introducing how to use the internet, people didn't really have a clue as to how they would integrate that with teaching, or with their curriculum. So I immediately started thinking about how are we going to help people see this as a tool and they can't run from it. And basically what I really thought was going to happen is exactly what happened. Everybody turned to the plagiarism and are we gonna do something to block this? And so I was like, \"Whoa, wait just a second here.\" Let's try to figure out, first of all, we knew that you had to be 18-years-old to use ChatGPT, but we know that that doesn't stop kids from making fake accounts. And we knew that we were going to have this issue with it, and we have to, we have to embrace and start figuring out how we're going to use it. And quite frankly, what's really interesting, Sal, is that I had a second grader that created his own recycled monster for a project, and his dad helped him go to ChatGPT to write a story about it. So if second graders are going to already be using this, we have to see that this is going to be a tool that kids are going to embrace. So how do we teach them how to use it ethically, and it's their voice, and not run from it? And so that was our position from the very beginning. But I can tell you that the teachers were all like, \"What are you gonna do to block it?\" Until we started having this kind of dialogue. Why would we block something that could potentially help a student? We just have to learn how to use it, right? - And how do you respond? Because a good number of those concerns are real. I'm a humanities teacher and I'm used to assigning term papers, and now students might be using ChatGPT and they're, you know, I think you can't detect it. I know there's folks who are claiming that they're gonna create some technology, but you really can't detect it if someone's even vaguely creative about it. What have you been telling those or have y'all started changing practice inside the district, and Dr. Buffington, you can continue and then I'm really curious, Tim, how you feel about these issues. - Well, I mean, I am gonna say that there were some English teachers, you can imagine, those are the first to speak up and say, \"Wow, they're out policing.\" And look, I think that this is this and I ran this checker. And it was very interesting to see their approach to it. And one of the things that I really do believe is that we have to change the way we're assigning things to kids. And you're going to have to show them and teach them how to appropriately use it. Because there has to be discernment, there has to be ethical use of, is this your voice or someone else's voice? And how do you prove that it's true, how are you citing it, and all of these things. Because it just makes us look at things differently. Now, I don't know how quickly you wanna get into our experiences with Khanmigo, but what I can say is that we started looking at, even prior to piloting Khanmigo, what would be an acceptable use of AI? And before they started piloting, it was really about making sure that there's discernment, making sure that we're representing your voice and you're not just copying and pasting something. So we started looking at perhaps a rubric with no AI, a little bit of AI, and what would you allow it to be used for? And then, you know, like, what does full blown AI look like? And are you going to use that for discourse and debate? So we kind of started having that kind of conversation to not just completely ban it, but to talk about what would you allow. And then I think we'll get more into what we discovered with Khanmigo, but that's kind of the dialogue we started having with people. - Super helpful. And Dr. Krieg, what's your point of view on both of those? What was your first reaction when you saw ChatGPT come on the scene and what have you been hearing from your teachers and others about how to navigate it? - It's a great question, and it's actually really interesting for me because Dr. Buffington had me leading a late start, which, late start means for us, all of our staff is sitting together and the students come late, so we can do collective professional development. And I don't remember exactly what it was that I had the staff working on, but at the end, one of our engineering teachers came up to me and he said, and this was in November of 2022, and he said, \"Hey, I responded to the question.\" He's like, \"What do you think about it?\" And so I read it and I said, \"Oh, very well done, Daniel, this is great.\" And he goes, \"I didn't write it.\" And I said, \"Okay.\" And so that was my first real iteration with ChatGPT that put it on the radar. Now, being one who is a former English teacher, I'd be remiss not to say at that point what did I do, right? Dr. Buffington talked about this, I like books, you can see books behind me. Dr. Buffington likes books, she has them all over. I started to research, right? And, you know, quite frankly, I think there's something crippling about what I like to refer to as acronym-itis, meaning, you know, we have acronyms for everything. And so, you know, dispelling this notion of like, what is that, you know, ChatGPT or whatever the case may be. And you come to find out that, you know, all of this gets embedded into what's considered AI, right? Artificial intelligence. And so that then kind of took me down a rabbit trail, if you will, to, you know, looking at what is AI and is this new or is it in a different iteration, right? So I went from not having any idea what it was to then reading, you know, articles about, you know, major school districts in the country, for example, that were going to ban this, and so forth. At that point I said to myself, well, you know, that's understandable. It's human nature, you know, survivalists, to try to protect ourselves, right, and put up those hedges of protection. Well then the more that you look into it, you know, as a former English teacher, I know that a lot of these terms that we use, like AI for example, they're a lot of times based in things that are, you know, science fiction related. I mean, you look all the way back at AI and, you know, it's like \"The Wizard of Oz.\" You know, Tin Man, right? Like, is this possible, you know, that I could have a being, if you will, this created thing that can reason, right? And so it's so fascinating, like a heartless Tin Man, right, and the concept of artificially intelligent robots. And you look back and this isn't anything new, it's taken on a different iteration as technology has caught up. And so, you know, I started to look into it and I'm like, \"Oh my gosh.\" You know, back in the 1950s, you know, this was being talked about, right? And so philosophers were trying to explore this and there was a, I don't remember the guy's name, but a British mathematician that tried to create the possibility of, you know, is there proof of this. - Alan Turing. - Yeah. And it was like, you see this all over fiction, you know. A little short story called \"The Most Dangerous Game.\" And, you know, looking at animals and humans and the ability to reason as the differentiator. And so, you know, the problem was, as we all know, you know, technology wasn't ready, you know, at the time. And so you see this like whole notion of artificial intelligence that just went through decades of changes, right? It was like a rollercoaster. It was up and down and all over the place. And so, you know, that then obviously led to the current era we're in, where technology can keep up, right? And so now we see this really like societal shift where all of a sudden the engineering teacher is using this thing, but I don't even know what it is, you know, acronym-itis, ChatGPT. And what do you do? You put up your hedges of protection, right? Like, I don't know what this is and it's scary, right? And so I think one of the most important things to that point then was, you know, as soon as we had that conversation, you know, then like Dr. Buffington, as the leader she is, she already knew about this. I was late to the party, right? But then we start to problem solve together and think and explore. And I think what makes this district unique and why we value the partnership we have with Khan and why I think we're on the line with you right now is just because, you know, thing about \"Brave New Words.\" You know, Dr. Buffington's a trailblazer and she's not afraid to look at things in a non-binary way, right? Have or don't have, good or bad. What about the gray areas, right? And these are tools just like calculators. You look at the changes to the new digital SAT, you know. They have a Desmos infused calculator that's, there's no such thing anymore for the new SAT of a calculator or no calculator section. Well, this is the reality of where we are, and it doesn't necessarily have to be dystopian if we can, to Dr. Buffington's point, work with our staff and students to be wise stewards of these resources, because it's not going to change, right? And so I think for me, you know, Dr. Buffington in her dissertation, you know, what do you start with, a definition of terms? And so when you start to research things, you start to realize, are we even talking about the same thing, right? Are we defining our terms or are we just going around and around and around about things that we don't even understand what they are? Right? - Right, can I jump in there for just a second, because one of the things, as a technology user back in the day, back in the '80s, you know, and I did my internship with Apple Computer in instructional design, and, you know, and you're trying to figure out how do you get teachers to embrace technology, not be afraid of it. And you have to really say to yourself, the number one thing that they wanna know is the, how is this gonna make my job better? How is it going to help my students? And if you can't sell them on that, you might as well forget it. And so then, if you can sell them that it will make their job better and make achievement more accessible for their students, and they're on board with that, then you have to lay out a good plan to teach them how to use it. And so what I really feel, one of the first things that's so exciting about it is when you start talking to them about it, is just make an account, right? You wanna know how to make the best carbonara? Ask that question, right, and see what you get. And they're fascinated by it. It's kind of like using the search engine for the first time, and you come up with all these hits and then you say, \"Well, you have to refine it to get what you want.\" So you can regenerate questions, right? And so they find these little things to be fascinating, and then you take those extra little steps to show them things like how to generate an exit ticket. And then they're starting to see a little bit of use and they're going, \"Whoa!\" So a case in point, the engineering teacher that was talking to Dr. Krieg, he comes up and he is like, \"Wow, I just turned in my Hobart Educational Foundation grant, and I wrote all of it in ChatGPT.\" And of course he was awarded it. He had to go in and tweak a few things, and he's like, \"It was amazing.\" And we're like, all right, great job, you found a use for it. My director of technology and my IT person, our student management system, something was not quite working right in a report that they had to do. They went behind in the back end and some code that they thought was wrong, and they put it in in ChatGPT, and then it came back and it corrected. They were able to correct it, and they said, \"Wow!\" Our food service director, looking at something that they had to do for a federal report, went out and was doing some things in ChatGPT. Now, as we all know, it's not the end all be all. They do still have to check things and have discernment, right? So the point is is that, when you're introducing this, whether it's terms or whatever, if you can't show some great benefit, you're gonna be turned off. And then I think the other aspect of this is teaching teachers once they see that resource side of it, because, quite frankly, the resource side is really great for teachers when they start looking at it, how do I make assignments that utilize this type of technology? You know, and I think about that narrative, that essay, and, you know, when I think about 21st century skills with collaborating with a team and having like that discourse and debate over, you know, what is artificial intelligence telling you? And then you regenerate and you get another answer and another answer, and you're on that team and you're discussing and debating what's accurate, what's real, what's possible, and then you're starting to formulate some sort of hypothesis or thematic type of situation where you're gonna expand on it. I think that it has great potential, when we teach people just how to use it appropriately. And we have to look to the future and say, they're going to do this. Our competitors globally are going to use this. Why in the world would we ban something? And then they're going to go out into the real world and use it. So it's our job to use it and use it well. Teach them ethical use, teach them how to strategically use it to get an end product. So I think that our teachers need that type of help. And so you start off with, how does it benefit me as a teacher? And now, how am I gonna use this with my kids? And boy do I have, you know, I have some really great ideas on how we can use this with kids, just with, I love the coaching aspect of it, I love the differentiation, but that's more on the Khanmigo side, and I know you're gonna get to that with us, because I do love Khanmigo. I'm just saying. - No, I mean, I obviously, I'm biased, I love Khanmigo, but I get more enthusiastic about it every time I talk to you, Dr. Buffington. And, you know, for those listening, several of the teacher features are direct ideas from Dr. Buffington. So your feedback is definitely manifesting itself in our product. But let's switch gears to that, because Hobart was already a district that was pretty engaged, heavily engaged using, let's call it pre-AI Khan Academy. Then we showed y'all early demos of Khanmigo, and since March, y'all have been one of the first districts in the country, probably the world, to use Khanmigo in a systematic way, and it seems in a productive way. What were y'all's original reactions to Khanmigo? What questions or aspirations do you still have for it? And what's been the experience like over the last several months? I'll start with you, Dr. Buffington, and then go to Dr. Krieg. - Well, I love the aspect of confidence in a student, right? So I mean, anything that you wanna read on student achievement has to start with building confidence that they have within themselves, that they know they can do it. And so our job then is to make sure that we're equipping them with the skills that they can manifest themselves and have this confidence level. And one of the things that pre-COVID, and then you can just now jump forward to COVID, is that you just started to notice that kids really are not asking questions. They don't wanna raise their hand. And then you're the teacher trying to pull, you're soliciting, you're coming up with hooks, you're trying to engage kids. It's difficult. And yet I can go to an elementary school and what do I watch kids do on a Chromebook, an iPad, whatever? They're automatically going out, hitting the microphone, \"Show me a blue snake and tell me why it's blue.\" Right? And they love that kind of stuff. And so they're so apt to talk to their device and they love the response that they get, and then it makes them a little more excited to ask it and get a little more specific with it. So one of the things that I love about watching this with Khanmigo is just that tutor, that guide on the side, and kids not afraid to ask the device a question. And I think that it's ingenious because they'll sit and ask questions all day long. And if they have an assignment that is geared, and let's just say it's the writing essay. And, you know, Sal, when I first did the first talk with you, you're gonna crack up at this, but you were talking about your son having to write an essay, right? And so I only had five teachers that were piloting this, but yet I'm so excited about it, I'm talking to everybody about it, right? I'm like, \"You would not believe what Sal Khan showed us.\" And then I had a student that I was mentoring at the middle school, and she's like, \"Dr. Buffington, is that AI stuff ready yet?\" Because she needed a writing coach, right? And so then I'm like, well, I'll pretend to be AI like Khanmigo, and I said, \"I'll be your writing coach.\" And I was trying to pretend like asking, I would prompt a question like I would think that AI would do, and not that I replaced your Khanmigo, Sal. But here's what I can tell you. She wrote a six paragraph essay on mystery, and it was beautiful. She needed that extra help with just asking questions and getting answers, and pushing her a little bit. And it was beautiful. And one of the things that the feedback, that our teachers told us, how great is it to have a tutor or an assistant or a coach when I'm not available? And they loved that because they see their, and these are high school teachers that said, I'm not up at two in the morning when they're done playing Minecraft and they decide to start writing their paper and boom, they have a teaching assistant, and they're asking questions and they come to school and they feel confident in their work. And so I think that that is the beauty of this. Now, I'm still going to come back as your educator and make sure that you have applied and it's your voice, and you are representing what I've assigned to you. But wow, the confidence level in kids is amazing. And that's what I like about it. Any time you can have a tutor right then and there, and I think that that is the best part of it. I do think that the feedback that we've been able to give you, that you've made the program even better, is the whole chat history, right? So I can see how long you've engaged, what type of questions you're asking, and it's not just a quick get this done copy paste sort of thing. You really are out there using discernment, refining, and asking the right questions to turn in a great piece of work. I love this about this. Questioning, tutoring, confidence building. That's all what we want for our students. - You know, I hear two really powerful themes there. One is the confidence building aspect of it, which on introspection makes all the sense in the world. If the students can just get more confident and get their questions answered, they're gonna engage more. And then the other one, which you just alluded to, which is the process over just the output. And that, AI, interestingly I think, gives us a lens into the process that we never had before, because you're not going to see what a student is doing at two in the morning while they're writing their essay, and they might be getting their older sister to write it for them or something like that. And now you get a lens. Dr. Krieg, what about yourself? You know, what was your initial reaction to Khanmigo, especially vis-a-vis your reaction to ChatGPT, and how's been the experience so far? - That's a great question. You know, quite frankly, when you, you know, that you can go to all different kinds of workshops and read books and, you know, it's helpful. It gives you a spark. But, you know, it's like, how do I take that spark and really allow that spark to take on like an organic nature to it, to where it just becomes embedded in how you do things, right? We talk about culture, we talk about climate. And I see things like, you know, equity and access and, you know, we talk about learning loss and we talk about, you know, how the Matthew effect, right? The haves keep having and the have nots don't. How do we get into that gap and truly provide opportunities? I was at a workshop yesterday with a colleague, and we were looking at the new digital SAT, and my colleague, who's an educator and an involved parent, she said, \"Well, you know, I was working with my daughter and, you know, she didn't understand this, that, and the other.\" And so, you know, I'm like, well, we can get you a tutor, you know, and dah, dah, dah, dah, dah. And it really got me thinking about this again, because it's like, what about Khanmigo? Well, we've, to your point, and to Dr. Buffington's point, we've been on, you know, the Khan Academy track for a long time now. I've used it from a student's perspective, a teacher's perspective, and now, through Khan districts, an administrative perspective. But what I'm seeing with Khanmigo is the ability to take the ideas that people have and really make it to where it's systemic. And so I think as we move further and further away from rote memory, and you start to see lines blurred. I mean, our students are creators, they're producers, they are songwriters, they are singers, they are podcasters, right? They're curators, they're consumers of media and information, but they're also creating it. And so what does all of that take? It takes increased depth of knowledge, complexity, interacting with materials, right? Interacting with concepts, et cetera. Well, the problem is, if you think about the Matthew effect and, you know, the ability of some situations socioeconomically and culturally, whereby they are able to fill gaps, identify them and fund them, what about everybody else? What about those who don't have access to such types of things? And even if they do, what if it's not working? And so we hear all about, you know, student apathy and lack of engagement and, you know, whatever the case is, and this is a question I'll ask. I'll say, okay, let's just say we do get your students' attention. You have a captivated audience. What are you gonna do with it? Let's flip the script on that, right? And so I think what's exciting to me, as we use this beta mode of Khanmigo, and as we're observing with it, you're seeing students interacting with knowledge and concepts in a way that's increasing the complexity of what they're doing. And it's not a interact, it's not a, the best way to put it would be a transaction, right? It's not just a, okay, I need this, you give me that. It's an ongoing relationship whereby students are interacting with new material, or challenging themselves, or expanding what they thought was to be true. And that readmission of learning is what we're all passionate about, right? So we talk here a lot about, you know, how do we find ways to marry up passions, purpose, possibilities, et cetera. And so when I look at Khanmigo, to Dr. Buffington's point, if I'm a teacher, it's not teaching for you, right? But what can it do? It can help refresh knowledge. It can, you know, create and partner with the teacher to create hooks, right? It can help the teacher by creating exit tickets with them. It can help with lesson planning. It can give, you know, there's even a neat little feature where you could take an entire lesson and it turns it into a fun little poem, right? You can co-create rubrics, all that kind of stuff, right? Learning objectives, use it as a tool to Dr. Buffington's point. And then, on the learner side. Go ahead. - That, I mean like, some of the most exciting things during the pilot that they were finding out, that you could talk to a literary figure. Oh my gosh! Or you could talk to someone historically and then you're, it just put them in the moment and it just brought learning to life. And so it's so engaging. You know, when I think about, for years we've said, differentiation, you know, that was one of the biggies on Khan Academy. And as you have said, and as Dr. Kreig has said, we were using Khan Academy, we were early adopters. I loved it. We had our own, we even made our own Khan Academy dictionary, it was pretty funny, on how to use it. But what did I like about that? I liked that there was differentiation. There was that guide on the side, some extra help, right? And I see Khanmigo as exactly that, but I also see it as totally engaging. So I can look at it, wow, differentiation, and, as an educator, I really didn't have to do that much to provide that differentiation. And it is a guide on the side. But on the same token, it's not something that kids don't wanna do. They like it. Now, one of our English teachers, and I totally cracked up at this, is that one of the kids said, and he was interacting with a historical figure with Khanmigo, and the kid said, \"This is more fun than TikTok.\" So Sal, you've made it. It's more enlightening than TikTok. And when kids tell you that, you know you got something there. But anyways, I think that that's a big plus with this. This is not where I just have to get my assignment done. They're actually out there and they're engaging with it, and they're taking it to new levels. And we found with some of the kids that were a part of the pilot, they were doing things that were not part of their assignment. They were out creating things, creating like companies, and putting in these scenarios. It was just hysterical. We didn't ask them to do that. They just really liked it. And so I think that that is what we want for kids. We want them to wonder. We want them to innovate. We want them to be problem solvers and go out there and take the information and do something with it. And that's what really happened with this. I do think, again, that beauty of just going back and looking at, as an educator, the chat history, so I know what they're doing, I can see safety, I can see their work, et cetera, that's really important to educators. But I think this has opened up a whole different meaning to engagement and what are they wondering, and what do they wanna know more about, and what do they want to do with it? And I do find that the kids that we serve today, I do think that they have a heart for other people, and they are problem-solvers. I do think that they have an entrepreneurial, you know, being, that they want to make things and they want to be successful at it, they want it to serve other people, problem solve, and they want to be successful with what they've made. This is just such a game-changer with equity. And I think that Dr. Krieg said that pretty well. I can take an English language learner, which we piloted with our EL teacher, and just a game-changer for them. I mean, their primary language is not a stumbling block for them. They're on par with their classmates. And that's pretty awesome. One of the things too that, you know, we're talking to our AP chemistry teacher, also a dual credit early college teacher, just looking at some of the equations that they were doing in chemistry. And, you know, Khanmigo wouldn't give them the answer, but it was probing them to how to get the answer. And so our teachers loved that, you know. If you're at home trying to solve that problem and they can't help you, Khanmigo was there to assist them. Now, I will tell you that they all said that sometimes the kids started bullying AI because they just wanted the answer and it wouldn't do it. So that made the teachers pretty happy. Just to let you know, there's some feedback for you. There was a little bullying going on at times with Khanmigo, and it, you know, it just kept prompting them and said, I'm not gonna give you the answer. - Yeah, we have to teach- - We liked that part of it. - I think the golden rule should apply to AI. Treat the AI as you wish you're treated yourself. I mean, just continuing on that feedback lens. And I wasn't joking when, you know, our last meeting, we have several features on Khanmigo that directly came out of that meeting. So I'm gonna continue to pick y'all's brain. You know, some of the things that we are working on above and beyond what you're already experiencing. We're working on giving the artificial intelligence, giving Khanmigo a sense of memory, so that it knows the tone that a teacher or a student prefers. It remembers previous conversations, it can pick up where you left off. We're adding things where teachers can assign through Khanmigo both traditional Khan Academy activities and AI activities. And potentially fine tune the activity, instead of saying, \"Talk to historical characters.\" Like, \"Hey, I want you to talk to Benjamin Franklin and figure out the following.\" And so we're gonna be doing things like that. We already have a little bit of this, but we're gonna have more on reporting, where Khanmigo really acts as a teaching assistant. You mentioned English language learners. We just released that it now works in every major language. And so a student could be doing their math or their chemistry in English, but they could be getting their help or their tutoring in Spanish or Portuguese or Hindi or whatever language they might need. And then the other thing that we are hoping to do, let's call it in the next six months is, have the AI, have activities that are multi-user, facilitate collaborative learning amongst many students. So, you know, you can imagine, instead of having a debate with the AI, maybe the AI could facilitate a debate with several students. Or run a Socratic dialogue with several students or do a simulation or a game with several students. So I'd love y'all's thoughts are, you know, what already exists of that list that I just talked to you, maybe you're extra excited about. Any ideas on how to tweak it? Any concerns, and on the risk side, what would you like to see more of? Are there are, have you been seeing problems that you wanna make sure that we can address to just make things go smoother? I'll start with you, Dr. Buffington. - Well, I think one of the things that we gave feedback on, obviously sometimes we pick up on things that are safety concerns for us. And I think that you addressed, you know, immediately you started digging into like, how can we make sure that if there is some sort of risk to a student or to other people with just what we, there's an indicator system. And so we so appreciate that you took that feedback, because a lot of the times we're able to pick that up in class or in some work or body of work that, or if a student has been talking to another student or a teacher, we're able to pick up some signs of things that where a student may need extra help, because they're going through a very bad time. Or there is just some potential there for, you know, wrong application or something to that effect. And so I think that you took our feedback pretty well in terms of us having concern for kids that may need some extra social emotional support, or if their safety is being compromised in their home or with other people. I think that that was one of our biggest concerns when we first started the pilot. Because we have things like that in place right now, and I see kids using Khanmigo more than, I mean, I just think they're gonna use it a lot. And so if they're going to use that a lot, I like that you have built in some safety measures. That was really important to us. In terms of going forward, I think engagement is really important and communicating with other people. Thank you so much for the language portion that you just created, because I think that is vitally important right now. And I would just say, one of the things that I think is really important, and I think this goes back to the age old question, and we really get this from middle school kids more than anyone, like, why do I have to learn that? And I think having experts out in the field, if we could, besides the AI portion being that expert, when you're saying that they can communicate with other students, I would love to see a database or, besides the AI expert, I would like to see experts out in the field. Because a lot of the times with college and career readiness and thinking about these are gonna be our next leaders, you know, talking to people and understanding what they do for a living and how it might be changing, and just the whole concept of AI. Let me give a case endpoint. So right now, when you think about computer science, and we're talking about coding and just trying to get kids to go into coding and computer science, it's going to be different now. AI gives it a whole different flavor, and I think that they need to be talking to, besides the AI expert, who are those people out in the field? Like your people. Like how does this work behind the scenes? And what, and you wanna do this for a living? And if you really enjoy it, it's really not even a job. But I think that there needs to be more of that. And so, you know, there's software out there that you can meet up with an expert here, an expert there. But giving kids a real flavor for it. And then, I mean, you can still, if you're going to allow them to meet with other kids, I'd like to see them meet with other experts out in the field. - It's a fascinating idea. I think y'all know we have another sister nonprofit that I started during the pandemic called schoolhouse.world, which, and the whole premise of schoolhouse.world is, you know, it's connect the world through learning and give folks free live tutoring via video conference. And the way we do that is by leveraging volunteers. Many of the volunteers are high school or college students, but many of them are professionals. And when we launched Khanmigo we started to think, well maybe Khanmigo could be an interesting bridge between traditional Khan Academy and maybe something like schoolhouse.world, where you actually have real people showing up. And so, Peggy, your idea, I'm almost thinking of like, what if schoolhouse.world, I think most professionals would love to give back in some way. They would love to tell, you know, most parents, when they go home, they wanna tell their kids about their job and their kids aren't interested. But the kids might be interested about other parents' jobs, which tends to be the case. And so there might be a fun way where you can show up on these, on say a schoolhouse, and then Khanmigo can say, hey, you were wondering why this matters. There's a session that's happening. So-and-so is showing up who's a AI researcher, or who's a doctor, or who's a lawyer, who can talk about, why don't you go to that, and you'll learn a lot more about why this algebra is useful. So I love that idea. Dr. Krieg, more ideas, keep them coming, we can't- - Yeah, no, I- - And fears, and risks, 'cause those are also ideas that, you know, opportunities for us to make it better. - So, quite frankly, to go right off that note, I remember as a student, I didn't understand why Shakespeare, for instance. And, you know, in college, when I was an undergrad and then grad school and whatnot, I started to have a different appreciation for it. But ironically, to Dr. Buffington's point, what really started that was this short little video that I stumbled upon, where there were actors and actresses who were talking about why Shakespeare. And for the first time I started to view the theater, for example, not just in its own siloed reality, like, oh, this is theater, but as a bridge, if you will, like you mentioned, to all sorts of other occupations. And when you get to see and hear how things are hybrid now, right, things aren't siloed anymore, you can be in a subject and apply the concepts, the principles, the experiences, to not just other things that you're doing currently, but the possibilities are endless because we really don't know how that's going to come up later on, right? We're not even always consciously aware of it. And so when I think about the current activities for students inside of, through Khanmigo, I would encourage you to continue to look at ways to break silos down. And by that I mean, you know, it's like modes of writing. Modes of writing for far too long were taught in a way that was singular. So it's like, this is expository writing, this is argumentative writing, this is narrative writing. But, you know, research shows that the writing process of our most successful authors, it mirrors those of small children prior to going through a traditional K-12 education system, because of exactly what we talked about before. Curiosity. Is it a discipline? Sure. Read Stephen King on writing, he will tell you it's a discipline, it's a science, but there has to be that passion. And so for me, I think about what's the difference between what we have done, what we are doing, and what we could and should do. What we need to start to do, we could do and should do, is break down the walls between classes, break down the walls between in school and out of school. Dr. Buffington could tell you that our most successful things going on right now have been organic, and they then become systematic, where the engineering teacher partners up with the business teacher, who partners up with the teacher in PLTW biomed. Why, because they're aligned to passions. They're aligned to things you're interested in. So if I look at something like craft a story, understanding when you go out and you read and you listen to podcasts, part of argumentation is storytelling, right? There's no such thing as, oh, this is expository writing, so I only exposit information, right? Writing is messy. The writing process is non-linear. Everything evolves and changes. So to Dr. Buffington's point, two things here. One, applying these topics in a way that makes it more and more seamless, and that's why I love your comment, Sal, about having the journey be something that is building upon itself. And if the AI capability is such to where it allows the learning progression to continue, that's a game-changer. I had one of my best composition teachers in grad school, she talked about how, you know, writing should ultimately be assessed, not at these little, you know like, oh, well you took this class and earned an A or that class and earned a B. It should be, where did the students start, and then where did they end up at the natural end of the segment. And it's about that growth. Well, that growth is such to where you start to understand, oh, everything is rhetorical, right? You go back to Plato to, you know, Socrates, to Aristotle, whatever the case is, everything's rhetorical. Well, our students now are presenting to a world that is gigantic, but it can also be niche, right? How can we take these things that they're learning about history, about technology, about engineering, about, you know, the human body, all these different things and say, this could apply to fields that don't even exist. This could end up applying, it could be sticky, right? That's how our brains work. We need to stick information onto things that we already have frameworks built on, in such a way that now I'm combining something I'm doing in class with the side hustle I have, you know, a shop that I do on the side or whatever, and also at home in my own personal and, you know, preferences and whatever the case may be. So, for example, if I listen to podcasts about, you know, sports related things, that may then change the way that I do a recorded, you know, session for staff, because I like the way that they introduce this or that they, you know, use voice inflection there and whatnot. So my encouragement would be twofold. One, continue to break those silos down to show how all this stuff fits into other stuff, right? And then two, there's a little bit right now in Khanmigo, as it relates to like navigating college admissions and financial aid, you know, and then also like the career aspect. So I would say, I would encourage you to continue to connect students and what they're learning about or could learn about, with then what. And when you think about like the state of Indiana, for example, a lot of what Dr. Buffington and I and our team are doing here is helping align what students are doing now with stackable credentials of currency, showing future employers, scholarship committees, et cetera, that I have mastery of something or proficiency in something or experience in something. We see this even with digital badges and things of that nature. So when a student sees a career path, it's intimidating because the language that's used to characterize it might not have anything to do with really what the occupation entails. And or the future occupations I may use these things for don't even exist, right? And so how can we try to marry those worlds up to connect students present with their future in the shorter term, as well as, you know, the opportunities there that exist thereafter that we don't even know of yet. - I love that, this kind of theme of breaking down barriers between subjects, which I think is now more doable than ever. And then also between school and the real world. One last question for you Dr. Buffington. Let's fast forward, I don't know, two, three years. It doesn't have to be a long time, but things are changing very fast. Do you think that everything we've talked about is going to somehow fundamentally alter what school is like, including, you know, we didn't even talk about things like assessment, which we are starting to think about on our side. Or do you think it'll just be a nice supplement on top of the existing architecture? Or do you think in some ways it changes the classroom fundamentally, Dr. Buffington? - Well, I mean, Tim will know this, Dr. Krieg. I mean, I had the philosophy that, you know, during COVID, that the landscape was forever changed, right? I mean, it's already changed. If I don't wanna come to my public institution and sit all day, I can choose to go to an online school and, you know, maybe that works for me. I think that, I think when I look at this, I don't want to view this as supplemental. I wanna view this as a tool that is a tool that is, you know, it's usable now, but it's also able to help us in the future. You know, when I think about things and I think about college career readiness, and, you know, right now I can let a kid get out early, graduate early, and, you know, I have kids that are graduating with associates degrees in our high school right now. What do I see potentially happening here? I see what people want with the kids that are graduating from high school now. They want them to be problem solvers. They want them to be able to collaborate and work on a team. They want them to have ethical practices behind them. And I think that you already have the potential with this. Now the interesting thing is is that, how do I give a student an internship, and maybe in Khanmigo there's an internship aspect of this and it counts for their day. You know, I'm all about reinventing the high school and what that looks like. And, you know, I think that that funnels down to, you know, middle school, elementary. I think there's so many different aspects of this AI that I could explore. You know, when I think about, kids wanna have fun, they don't wanna dread assignments, I already see that that part is cured. I see kids going on there just because they want to, and they like asking questions. And that's what we want as educators. We want them asking questions. And they're fascinated by it. And so I wanna take that fascination and build on it. And if that means redesigning the way we do school, then we have to do that, right? And so we already have some redesigning and reinventing our high schools with early college and, you know, you can get industry certifications one year of college, two years of college. You don't necessarily need to go five days a week. You don't maybe need to go a whole day. Because you can have a different opportunity. And if that opportunity presents itself in such a way, you're credentialed to graduate and perhaps even enter the workforce or enter post-secondary to further explore what we're trying to achieve with, you know, some post-secondary credential that contributes to the world. And so I'm all about, is there better ways, more efficient ways or more exciting, engaging ways to reinvent things that we're doing? And I think that, I think like anything that's been new to education, sometimes we are the last adopters. And so why? And I think we started talking about this. They're afraid of it. And you can't be afraid of it, you have to embrace what the future is. And so I think there's gonna be some adaptability when you're talking about supplemental, right? I mean, like, so right now you're gonna have early adopters that are going to basically take something that they have in their curriculum map and say, \"How does AI help me?\" \"How might I use Khanmigo?\" And then you're going to start seeing some trailblazing where it'll be like, whoa, I'm not, it's not a replacement. And you're going to see them start using it in a way that enhances even more, and it's not replacing like what they did. And it's pushing kids to grow and learn and perhaps come up with an idea that they might cure something. You know, I love the fact that this is a generation that likes to problem solve. And they'll say like, \"What about this?\" Or, \"What about that?\" And I think that this has the potential to do that. So if I have a student and, you know, to talk about what we were talking about, we will put kids in a biomedical class and then we will have them butt up with the engineering program, because they're thinking about one thing and these are the people over here that can really build it for you or help you with your calculations or whatever. Those barriers are broken. And I see high school being totally reinvented with giving kids the opportunity to apply this in a real-world setting. And so I think that there's room for this, and I'm just gonna give you a concept here of, you know, Indiana's doing something with career scholarship accounts. They're called CSAs. And it's really meant to put kids out into the workforce, and work-based learning and internships. And they're already on the cusp of what would a high school diploma look like with a kid that we give this CSA to? And is it really the traditional, like you have to have 40 credits of this and that and that. And they're starting to see, well, eh, maybe they don't need that. And maybe, just maybe they're gonna be somebody that I put out in the workforce that has some know-how with using technology in an appropriate way, and come up with a solution for something that they've been struggling to find. I think the potential is there for that. I think you're gonna see early adopters supplementing, replacing, and then finding new things. And then I think you're going to see kids be like, I could do this, I could do that. And we're gonna have to re-look at the way we're delivering to allow growth, if that makes sense. - Makes a ton of sense. And, you know, I could talk to both of y'all for hours, especially about this topic, 'cause it's so fascinating. But I love that kind of final push where, you know, break all the boundaries and actually we always get our ideas from, activity ideas from you, Dr. Buffington. And you kind of reinforced something that we were brainstorming, which is, what if there was an activity for students, or for teachers or for anyone, to solve big problems in the world. You know, you need us, you need to tackle climate, you wanna figure out how can I, as a student, start to tackle climate change? How as I, as a student, can start to tackle cancer research? How can I, as a student, start to tackle, I don't know, whatever issue in the world you think needs solving. A lot of students want to, but they don't know where to start, where do they, so I like that idea as well. Well, thank you both- - And Sal can, Sal can I just mention in terms of what you just said and how important it is, and they try to solve things that are so important to them. So during COVID, one of my students was trying to figure out how to have a better check-in system with symptoms in the emergency room. - Hmm. - And why. She wanted it to notify them that you have to reprioritize who's in your emergency room, because her grandfather died from COVID. So I had this little entrepreneur innovator, and we have maker spaces here, we do, you know, we do makers' fairs, we have, and we have STEM spaces everywhere. And her creation was, and she worked with the engineers at the hospital on symptoms and where they're at, and how do we prioritize who you're going to see first, because it was so real to her, and to you. You know, when you're saying climate change, the things that really matter to them, they will spend all day. That is the type of student that won't go to bed because they're out there trying to figure out where's the information, what type of tool, what kind of instrument. She's in the biomed class, goes down to the engineering class and they're creating a handheld, and it's going to sync with watches or whatever at the hospital, to change the priority of like, who do you need to see now? And I just think that our kids have that potential, right? And so, guess what, that didn't happen in her classroom, that happened outside of her classroom, but she brought it into the classroom that there has to be a better way. Right? And so I think that this opens up all kinds of avenues of questions or problems that they wanna solve, and it gives them a good start and it will make them want to keep going after it. You know what I mean? And I think that's the beauty of it. It's so engaging, they don't wanna stop - 100%. Couldn't agree more. - Sal, if I may. Just on both of our behalfs, you know, thank you for, you know, that's what you did, right? You started by identifying a problem, a need, right, that was personal to you in a familial sense. And you asked a lot of questions and you trailblaze, and then, you know, here we are, right? And so what our hope is is that as passionate as the three of us are, for example, about education and, you know, Khanmigo, and just different ways to try to help our students, you know, be on mission, to be able to pursue their passions. If they can have that same kind of passion about things that they're interested in, and we're marrying up the possibilities where they can pursue 'em, then, you know, education may look different, but the fundamental, you know, true North Star remains the same. Right? - 100%. - And then we just, we just go about it in different ways, you know. But the why is still there. The denominator is still there. And that's our kids, that's our students. And so just thank you, I think, on both of our behalfs, for championing that. - No, well, thank y'all for being part of this. - Oh, hey- - For taking the time out. - This one. - Oh yeah. - This was the best thing ever. I mean, I'm not kidding you. I could sit and talk with the teachers and the kids that were using this. I could sit with them all day, and I, and they were sending me things that they were creating out of Khanmigo, and I was loving it and I have other work to do, but I wanted to read what they were doing with it. And, you know, I think, just kudos, and thank you for including us in the pilot. I think that we'll be trailblazers with going out and talking to people about how, you know, how to break the barriers and how to use it. But you can't do that without giving people an initial start. Right? And you did that, and I'm just telling you, it's fascinating to sit and talk to these teachers about how they think they're gonna use it next. And so thank you for that. You've taken something that I think that they were so afraid of, especially the English teachers. And they're not afraid of it. And so they know how they're gonna approach it. They're, you know, they did talk to our Secretary of Education, Katie Jenner, which is interesting because you had talked to Katie Jenner and she's like, \"Hey, I wanna talk to those teachers.\" And so we lined it up and she was fascinated by it too. So you've taken something and given us a really good tool to use in education. And for that, we're grateful for it, and I can't wait to see the next version. - No, we're excited, and I think this is gonna be one of many conversations over the next few months and years, as we go on this adventure together. But thank you because you know, you know, obviously we can do all this work, but if we're not serving the needs of school leaders and teachers and students, then why are we doing this? So it means a lot to be able to partner with y'all. Thank y'all. - Thank you, Sal.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "-  \n                    AI     \n   \"Brave New Words\"    \n      \n                         \n                   \n          \n                        \n           -          -    .\n-        \n  ChatGPT\n2022                 \n               \n          \n       ?                       -      \n                                 \n                         \n        \n    \n                     \n                  \n                               \n             \n                        \n                             \n                                   \"\n     \"              \nChatGPT       18                           \n       \n                       \n                                     ChatGPT                \n             \n                    \n                          \n        \n     \"        \"    \n                           \n         -             \n                   \nChatGPT                                                             \n            \n                                   -       \n                        \"     \"       \n        \n                \n         \n           \n                             \n          \n                \n                Khanmigo          \n          \n  Khanmigo             AI                          \n           \n          \n            \n         AI     AI  \n                \n   AI       \n            \n                                                                     -      \n          \n   ChatGPT             \n     \n           -         \n         \n                                 \n                \n           \n         \n2022        \"       \"     \"       \"            \"   \n    .\"     \"    \"     \" \"   \nChatGPT               \n                                               \n                                \n-itis                        \n              ChatGPT\n                      AI     \n          \n                \nAI         \n           \n               \n       \n                                                                 \n                   \n            AI     \n                 \nAI          \"The Wizard of Oz\"                                                \n               \n       \n                            \n           \"  \"    1950                     \n             \n                   \n        \n-   - .       \n            \n\"   \"       \n      \n                 \n             \n                    \n                       .       \n                        \n        \n            \n          -itis ChatGPT        \n            \n                \n            \n         \n                   \n                   \n          \n                \n             \n\"  \"                                                    \n  SAT              \n       SAT\n                            \n        \n                                               \n     \n                              \n                       \n              \n          -    \n                  \n  80          \n                            \n                           \n                                                       \n                                      .            \n                                       \n         \n              .                  \n           \" \n           \"                 \n                   \n       \n             \"!\"       \n                \"                  ChatGPT   \"                        \"   \"                    \n                                           ChatGPT   \n                 \n    \"!\"                     \nChatGPT                \n                    \n                                             \n               \n                                    \n                  \n21                     \n          \n            \n          \n             \n                      \n                                   \n                            \n                  \n                                                      \n                         \n                 \n                 \n                         \n                   -       \n                                                    \n                               \n         AI          \nKhanmigo             \n       \n      Khanmigo           \n         \n   \n                                       -   \n                                                                                                      \nCOVID                                 \n              \n                              \n  Chromebook            \n         \"     \n      \"               \n                         \n                                 \n                \n          \n             \n                                                                \n                                   \"    \n     \"        \n              \"   \nAI     \"                    AI          \"       \"                        AI        \n                         \n        \n                                          \n               \n          \n                     \n                        \n                     \n       \n                  \n                \n         \n                        \n           \n                                                                               \n                              .    \n           -    \n       \n          \n      \n              \n       \n                 AI                 \n              \n          \n            \n           \n                                \n      \nChatGPT              -      .       \n      \n            \n                    \n                                                \n         .        \n                  \n                            \n                              \n  \n  SAT         \n          \"     \n                     \"          \n                       \n                      \n        \n                        \n                               \n                    \n           \n          \n                            \n                     \n                      \n                 \n                       \n                            \n                            \n        \n                   \n                                              Khanmigo             \n                                  .                \n             \n                 \n                       \n                                     \n                     \n             \n                                \n             \n                               \n                 \n                \n                                 -          \n   \n                 !    \n                                      \n           \n                \n             \n               \n                                  \n                               \n    \n                              \n                                 \n              \" TikTok    \"          TikTok                                 \n             \n           \n                              \n                 \n                             .       \n                          \n        \n                   \n \n                     \n                      .         \n                                     \n             \n                  \n        \n                   \n               \n . \n               \n                EL                                                                                         \n            \n                     \n                    Khanmigo\n            \n         AI         \n                     \n                   \n       \n               -    -\n-        -    \n AI     AI          \n       \n              \n                      \n            \n             \n       \n                                                       \n  Khanmigo  \n      AI        \"\n     \"            \"     \n          \"       \n                            Khanmigo \n                          \n                         \n                            \n          \n     AI         \n                       AI  \n         AI    \n             \n          \n         \n                \n                                         \n         \n                       -           \n                                                                                       \n                                           ,                       \n       \n       \n                \n                     \n           \n                             \n           \n             \nKhanmigo                                        \n                                                    \n             \n                 \n       \n       \n           \n          AI                              \n AI    \n         \n           \n            \n            \n        AI     .            \n                  \n            \n       AI             AI    \n                              \n                  \n           \n            \n      \n                               \n            \n       -                \n        \n                   \n    \n           \n           \n          \n                   \nKhanmigo              Khanmigo\n     \nschoolhouse.world            \n           \n              \n                      \n                                   \n                               \n                                \n         \n                  \n                        \n       - -   -\n-     '   \n             -     \n                    \n     .      \n            \n                                 \n                               \n          \n          \n                 \n      .                      \n        \n           \n                  \n        \n             \n                       \n                 \n                \n                   \n            \n          \n K-12                \n                            \n                   \n                          \n             \n                        \n        \n      \n        \nPLTW                         \n             \n                          \n          \n                                \n                                               AI                 \n            \n               \n                \n    A        B      \n                              \n                     \n         \n         \n              \n                       \n       \n                       \n           \n                                                 \n                \n               \n                 \n              \n          \n          \n                             \n            \n           \n          \n                            \n            \n                            \n     \n                \n                  \n           \n                                           \n            \n                 \n                    \n              \n                   \n                -                     \n       \n                     \n                .      \n                 \n                       \n     \n                     \n                   \n        -       \n             \n    COVID      \n                  \n            \n                                                  \n                 \n                     \n                \n                \n            \n                                                 \n              \n                \n                        \n                  \n                      \n             \n AI                  \n                                 \n                                    .          \n              \n                                          \n    \n                     \n                        \n    \n                                 \n                                        \n      \n                       \n                                                            \n               \n       \n                    \n        \"AI     \" \"       \"   \n            \n           \n                                   \n              \n              \n                    \"  \"  \"    \"       \n                                                                                   \n                          \n             \n                           \n                    \n  CSAs        \n                                     CSA            \n      40                         \n                \n                                             \n                     \n                        \n                   -          \n                \n        \n                                                   \n                                  \n             \n                   \n                 \n            \n                    \n                  - -       \n               \n             \n        COVID    \n             \n           - .\n-                  \n             COVID         \n            \n                    STEM           \n                   \n                     \n                             \n        \n         \n                             \n              \n                         \n          \n                                       \n          \n                  \n                                - 100%     \n-      .     \n                \n           \n            \n                            \n             \n                                                                        \n             - 100%\n-         \n             .                              \n     -   \n          -  -\n-     -  \n-   -                                \n                     \n                               \n                 \n              \n                         \n                 \n        \n       \n                                                               \n              \n         \n             \" \n      \"           \n            \n                                 -     \n                                                                             \n                 -    .",
    "t_spanish": "- Hola a todos, soy Sal\nde Khan Academy y, como algunos de ustedes saben,\npubliqu mi segundo libro, \"Brave New Words\", sobre el futuro de la IA\nen la educacin y el trabajo. Est disponible dondequiera que\npueda comprar sus libros. Pero como parte de la investigacin para ese libro, hice algunas entrevistas con\npersonas fascinantes, que ests a punto de ver. Tengo dos invitados muy interesantes hoy. Tengo a la Dra. Peggy Buffington,\nque es la superintendente del distrito escolar de Hobart en Indiana, en el rea metropolitana de Chicago\n, supongo que podemos decir. Y tambin tenemos al Dr. Tim Krieg, director de\nPlan de Estudios e Instruccin Secundaria en School City of Hobart. Bienvenidos a los dos. - Gracias por invitarnos hoy. - Si muchas gracias.\n- As que djame empezar. No, bueno, gracias por unirse y permtanme comenzar con\nuna pregunta muy bsica, antes de entrar en algunas de las cosas en las que hemos estado colaborando durante los ltimos meses. Cuando ChatGPT apareci en escena a\nfinales de noviembre de 2022, o principios de diciembre, y todos\nempezaron a aprender sobre l y tal vez a escuchar los rumores de que los estudiantes podran\nestar usndolo para ensayos o para otras cosas, cules\nfueron sus reacciones?  ?  En qu estaban pensando?   Qu escuchabas de tus profesores? Y tal vez empiece por usted, Dr. Buffington. - Bueno, al principio, y slo\npara darles algunos antecedentes en trminos del uso de la tecnologa, ya saben, comenc a leer todo\nlo que pude al respecto y a crear una cuenta, descubriendo sus complejidades. Y lo he abordado\nen el sentido en que lo hara con cualquier tipo de tecnologa,\nque sera, vaya, cmo vamos a\nintegrar esto, usarlo y no tenerle miedo. Y creo que ese fue\nel enfoque ms importante que pude adoptar, simplemente porque esto\nno es algo que, digamos, cuando apareci Google o cuando empezamos a introducir cmo usar Internet, la gente\nno lo haca.  Realmente no tengo idea de cmo\nintegraran eso con la enseanza o con su plan de estudios. As que inmediatamente comenc a pensar en cmo vamos a ayudar a que la\ngente vea esto como una herramienta y no puedan huir de ella. Y bsicamente lo que realmente\npens que iba a pasar es exactamente lo que pas. Todo el mundo recurri al plagio y  vamos a hacer algo para bloquearlo? Y entonces pens: \"\nEspera un segundo\". Intentemos averiguarlo, en primer lugar, sabamos que deba tener\n18 aos para usar ChatGPT, pero sabemos que eso no impide que los nios creen cuentas falsas. Y sabamos que bamos a\ntener este problema, y tenemos que\naceptarlo y comenzar a descubrir cmo lo vamos a utilizar. Y, francamente, lo que es\nrealmente interesante, Sal, es que tuve un nio de segundo grado que cre su propio monstruo reciclado para un proyecto, y su padre lo ayud a ir a ChatGPT para escribir una historia sobre ello. Entonces, si los estudiantes de segundo grado\nya van a usar esto, tenemos que ver que\nser una herramienta que los nios adoptarn. Entonces, cmo les enseamos a\nutilizarla de forma tica y a que sea su voz, y no a huir de ella? Y esa fue nuestra posicin\ndesde el principio. Pero puedo decirte que\ntodos los profesores decan: \"Qu vas a hacer para bloquearlo?\" Hasta que empezamos a tener\neste tipo de dilogo.   Por qu bloquearamos algo que potencialmente podra ayudar a un estudiante? Slo tenemos que aprender a\nusarlo, verdad? - Y cmo respondes? Porque muchas de\nesas preocupaciones son reales. Soy profesor de humanidades y estoy acostumbrado a asignar trabajos finales, y ahora los estudiantes pueden estar\nusando ChatGPT y, ya sabes, creo que no puedes detectarlo. S que hay gente que afirma que van a crear alguna tecnologa, pero realmente no se puede detectar si alguien es siquiera vagamente\ncreativo al respecto.   Qu les ha estado diciendo a esos o han comenzado a cambiar la\nprctica dentro del distrito? Dr. Buffington, puede continuar y luego tengo mucha curiosidad, Tim, sobre cmo se siente acerca de estos temas. - Bueno, quiero decir,\nvoy a decir que hubo algunos profesores de ingls, como puedes imaginar, esos son los primeros en hablar y decir: \"Vaya, estn afuera vigilando\". Y mira, creo que esto es\nesto y ejecut este verificador. Y fue muy interesante\nver su enfoque al respecto. Y una de las cosas que\nrealmente creo es que tenemos que cambiar la forma en que\nasignamos las cosas a los nios. Y tendrs que\nmostrarles y ensearles cmo usarlo apropiadamente. Porque tiene que haber discernimiento, tiene que haber uso tico de,  es esta tu voz o la\nvoz de alguien ms?   Y cmo se prueba que es\nverdad?, cmo se cita? y todas esas cosas. Porque simplemente nos hace\nver las cosas de manera diferente. Ahora, no s qu tan rpido quieres entrar en nuestras\nexperiencias con Khanmigo, pero lo que puedo decir es que\ncomenzamos a analizar, incluso antes de probar Khanmigo,  cul sera un uso aceptable de la IA? Y antes de comenzar a poner a prueba, en realidad se trataba de\nasegurarse de que hubiera discernimiento, de que \nrepresentramos su voz y que no estuvieran simplemente copiando\ny pegando algo. As que comenzamos a buscar\nquizs una rbrica sin IA, con un poco de IA, y \npara qu permitiran que se usara? Y luego, ya sabes, cmo\nes la IA en toda regla?   Y vas a utilizar eso\npara el discurso y el debate? Entonces comenzamos a tener\nese tipo de conversacin no solo para prohibirlo por completo, sino para hablar sobre lo que permitiran. Y luego creo que profundizaremos en lo que descubrimos con Khanmigo, pero ese es el tipo de dilogo que comenzamos a tener con la gente. - Muy til. Y Dr. Krieg, cul es su\npunto de vista sobre ambos?   Cul fue tu primera reaccin\ncuando viste ChatGPT entrar en escena y qu\nhas escuchado de tus profesores y otras personas\nsobre cmo navegar por l? - Es una gran pregunta y, de hecho, es muy\ninteresante para m porque el Dr. Buffington me hizo\nliderar un comienzo tardo, lo que, para nosotros, un comienzo tardo significa que todo nuestro personal est sentado junto y los estudiantes llegan tarde, por lo que podemos hacer cosas colectivas.\ndesarrollo profesional. Y no recuerdo exactamente en qu tena trabajando al personal\n, pero al final, uno de nuestros profesores de ingeniera se\nme acerc y me dijo, y esto fue en noviembre\nde 2022, y me dijo: \"Oye  , Respond a la pregunta \". l dice: \"Qu opinas al respecto?\" Entonces lo le y dije: \"Oh, muy bien hecho,\nDaniel, esto es genial\". Y l dice: \"Yo no lo escrib\". Y dije: \"Est bien\". Y esa fue mi primera\niteracin real con ChatGPT que lo puso en el radar. Ahora, siendo\nexprofesor de ingls, sera negligente no decir en ese momento qu hice, verdad? El Dr. Buffington habl sobre esto, me gustan los libros, puedes ver los libros detrs de m.  A la Dra. Buffington le gustan los libros,\nlos tiene por todos lados. Empec a investigar, no? Y, francamente, creo que hay algo paralizante en lo que me gusta llamar\nacrnimo-itis, es decir, tenemos acrnimos para todo. Y as, ya sabes, disipar\nesta nocin de qu es eso, ya sabes, ChatGPT\no cualquiera que sea el caso. Y descubres que todo esto est integrado en\nlo que se considera IA, verdad? Inteligencia artificial. Y eso\nme llev por un camino de conejo, por as decirlo, para\nver qu es la IA y si es nuevo o est en\nuna iteracin diferente, verdad? As que pas de no tener\nidea de qu era a leer, ya sabes,\nartculos sobre, ya sabes, los principales distritos escolares\ndel pas, por ejemplo, que iban a prohibir esto, y dems. En ese momento me dije a m mismo, bueno, ya sabes, eso es comprensible.  Es parte de la naturaleza humana, ya saben, supervivientes, tratar de protegernos a nosotros mismos, verdad?, y levantar esos muros de proteccin. Bueno, cuanto ms\nlo investigas, ya sabes, como exprofesor de ingls, s que muchos de\nestos trminos que usamos, como IA, por ejemplo, muchas veces se basan\nen cosas que son,  Ya sabes, relacionado con la ciencia ficcin. Quiero decir, miras hacia\natrs a la IA y, ya sabes, es como \"El Mago de Oz\".  Ya sabes, Hombre de Hojalata, verdad?   Es esto posible, ya sabes, que pueda tener un ser, por as decirlo, esta cosa creada que puede razonar, verdad? Y por eso es tan fascinante,\ncomo un hombre de hojalata sin corazn, verdad? y el concepto de\nrobots con inteligencia artificial. Y miras hacia atrs y\nesto no es nada nuevo, ha adoptado una iteracin diferente a medida que la tecnologa se ha puesto al da. Entonces, ya sabes, comenc\na investigarlo y dije: \"Dios mo\".  Ya sabes, en la dcada de 1950, ya sabes, se hablaba de esto, verdad? Y entonces los filsofos estaban\ntratando de explorar esto y haba un, no\nrecuerdo el nombre del tipo, pero un matemtico britnico que trat de crear la\nposibilidad de, ya sabes, hay pruebas de esto?\n-Alan Turing. - S. Y fue como, ves esto en\ntoda la ficcin, ya sabes. Un pequeo cuento llamado\n\"El juego ms peligroso\". Y, ya sabes, observar\na los animales y a los humanos y la capacidad de razonar\ncomo diferenciador. Y entonces, ya sabes, el problema\nera, como todos sabemos, que la tecnologa no estaba lista, ya\nsabes, en ese momento. Entonces ves esto como una nocin completa de inteligencia artificial que acaba de pasar por\ndcadas de cambios, verdad? Era como una montaa rusa. Estaba arriba y abajo y por todos lados. Y entonces, ya sabes, eso\nobviamente condujo a la era actual en la que nos encontramos, donde la tecnologa puede mantenerse al da, verdad? Y ahora vemos este\ncambio social en el que, de repente,\nel profesor de ingeniera est usando esta cosa, pero ni\nsiquiera s qu es, ya sabes, acrnimo, ChatGPT. Y que haces? Pones tus setos\nde proteccin, verdad? No s qu\nes esto y da miedo, verdad? Y entonces creo que una de\nlas cosas ms importantes hasta ese momento fue, ya sabes, tan pronto como tuvimos esa\nconversacin, ya sabes, entonces, como la Dra. Buffington,\ncomo lder que es, ella ya saba sobre esto. Llegu tarde a la fiesta, verdad? Pero luego empezamos a\nresolver problemas juntos y a pensar y explorar. Y creo que lo que hace que\neste distrito sea nico y por qu valoramos la\nasociacin que tenemos con Khan y por qu creo que estamos en\nla lnea con ustedes en este momento es simplemente porque, ya saben,\nlo de \"Brave New Words\". Ya sabes, la Dra. Buffington es una pionera y no tiene miedo de ver las cosas de una manera no binaria, verdad? Tener o no tener, bueno o malo.   Qu pasa con las zonas grises, verdad? Y estas son herramientas como las calculadoras. Miras los cambios en\nel nuevo SAT digital, ya sabes. Tienen una\ncalculadora con infusin de Desmos, es decir, ya no existe tal cosa para el nuevo SAT de una calculadora\no ninguna seccin de calculadora. Bueno, esta es la realidad en la que nos encontramos, y no necesariamente\ntiene que ser distpica si podemos, como seala el Dr. Buffington, trabajar\ncon nuestro personal y estudiantes para ser administradores sabios de estos recursos, porque no va a  cambiar, verdad? Entonces creo que para m, ya sabes, la Dra. Buffington en su\ndisertacin, ya sabes,  con qu se empieza,\nuna definicin de trminos? Y entonces, cuando empiezas a investigar cosas, empiezas a darte cuenta de que estamos hablando de lo\nmismo, verdad?   Estamos definiendo nuestros trminos o simplemente estamos dando vueltas y\nvueltas sobre cosas que ni\nsiquiera entendemos qu son?   Bien? - Bien, puedo entrar\nall por un segundo? Porque una de las cosas, como usuario de tecnologa en\nel pasado, en los aos 80, ya sabes, hice mi\npasanta en Apple Computer en diseo instruccional, y  , ya sabes, y ests tratando de descubrir cmo lograr que los profesores\nadopten la tecnologa y no le tengan miedo. Y realmente tienes que decirte a ti mismo, lo primero que\nquieren saber es,  cmo mejorar esto mi trabajo?   Cmo va a ayudar a mis alumnos? Y si no puedes venderles eso, mejor olvdalo. Entonces, si puedes venderles que mejorar su trabajo y har que los logros sean ms\naccesibles para sus estudiantes, y ellos estn de acuerdo con eso, entonces tienes que disear un buen plan para ensearles cmo usarlo.  . Y entonces, lo que realmente siento, una de las primeras cosas\nque es tan emocionante es cuando empiezas a hablar con ellos al respecto, es simplemente crear una cuenta, verdad?   Quieres saber cmo\nhacer la mejor carbonara? Haga esa pregunta, verdad?,\ny vea lo que obtiene. Y les fascina. Es como usar el motor de bsqueda por primera vez,\nencuentras todos estos resultados y luego dices: \"Bueno,\ntienes que perfeccionarlo para obtener lo que quieres\". Entonces puedes regenerar preguntas, verdad? Y entonces encuentran fascinantes estas pequeas\ncosas, y luego se toman esos pequeos pasos adicionales para mostrarles cosas como cmo\ngenerar un boleto de salida. Y luego empiezan\na ver un poco de uso y dicen: \"Guau!\" Un ejemplo de ello es el profesor de ingeniera que\nestaba hablando con el Dr. Krieg, se acerca y dice: \"Vaya, acabo de entregar mi beca de la Fundacin Educativa Hobart y lo escrib todo en ChatGPT\". Y por supuesto se lo concedieron. Tuvo que entrar y modificar algunas cosas y dijo: \"Fue increble\". Y nosotros dijimos, est bien, buen trabajo, le encontraste un uso. Mi director de tecnologa\ny mi encargado de TI, nuestro sistema de gestin de estudiantes, algo no funcionaba bien en un informe que tenan que hacer. Se retrasaron en el back-end y algo de cdigo que pensaron que estaba mal, lo pusieron en\nChatGPT, y luego regres y lo corrigi. Pudieron\ncorregirlo y dijeron: \"Guau!\" Nuestro director de servicio de alimentos, viendo algo que tenan que hacer para un informe federal, sali y estaba haciendo\nalgunas cosas en ChatGPT. Ahora bien, como todos sabemos,\nno es el final de todo. Todava tienen que revisar las cosas y tener discernimiento, verdad? Entonces, el punto es que,\ncuando introduces esto, ya sean trminos o lo que sea, si no puedes mostrar algn gran beneficio, te desanimars. Y luego creo que el otro aspecto de esto es ensear a los maestros una vez que\nven el lado de los recursos, porque, francamente, el lado de los recursos es\nrealmente excelente para los maestros cuando comienzan a mirarlo,  cmo hago tareas que utilicen este tipo?  de tecnologa? Ya sabes, y pienso en\nesa narrativa, ese ensayo, y, ya sabes, cuando pienso\nen las habilidades del siglo XXI para colaborar con un equipo y tener ese discurso\ny debate sobre, ya sabes,  qu\nte dice la inteligencia artificial? Y luego te regeneras\ny obtienes otra respuesta y otra respuesta,\ny ests en ese equipo y ests discutiendo y\ndebatiendo qu es exacto, qu es real, qu es posible, y luego comienzas a formular algn tipo de hiptesis o\ntemtica.  tipo de situacin en la que vas a ampliarlo. Creo que tiene un gran potencial cuando enseamos a la gente\ncmo utilizarlo adecuadamente. Y tenemos que mirar hacia el futuro y decir: van a hacer esto. Nuestros competidores a nivel mundial\nvan a utilizar esto.   Por qu demonios prohibiramos algo? Y luego\nsaldrn al mundo real y lo utilizarn. As que es nuestro trabajo usarlo y usarlo bien. Enseles el uso tico, enseles cmo usarlo estratgicamente para obtener un producto final. Entonces creo que nuestros profesores\nnecesitan ese tipo de ayuda. Y para empezar,  en qu me beneficia como profesor? Y ahora, cmo voy a\nusar esto con mis hijos? Y tengo, ya sabes,\ntengo algunas ideas realmente geniales sobre cmo podemos usar esto\ncon los nios, solo con, me encanta el aspecto de entrenamiento, me encanta la diferenciacin, pero eso es ms del lado de Khanmigo, y yo  S que\nllegars a eso con nosotros, porque amo a Khanmigo. Slo digo. - No, quiero decir, obviamente,\nsoy parcial, amo a Khanmigo, pero me entusiasmo ms cada vez que hablo con usted, Dr. Buffington. Y, para quienes escuchan, varias de las caractersticas del maestro son ideas directas del Dr. Buffington. As que sus comentarios\ndefinitivamente se manifiestan en nuestro producto. Pero cambiemos de tema a eso, porque Hobart ya era un distrito que estaba bastante comprometido,\nmuy comprometido con el uso de, llammoslo Academia Khan anterior a la IA. Luego les mostramos las\nprimeras demostraciones de Khanmigo y, desde marzo, han\nsido uno de los primeros distritos del pas, probablemente\ndel mundo, en utilizar Khanmigo de manera sistemtica, y\nparece que de manera productiva.   Cules fueron sus\nreacciones originales ante Khanmigo?   Qu preguntas o aspiraciones\ntienes todava al respecto?   Y cmo ha sido la experiencia durante los ltimos meses? Empezar con usted, Dr. Buffington, y luego ir con el Dr. Krieg. - Bueno, me encanta el aspecto de\nconfianza en un estudiante, verdad? Quiero decir, cualquier cosa que quieras leer sobre el rendimiento de los estudiantes tiene que empezar por desarrollar la confianza que tienen dentro de s mismos, que saben que pueden hacerlo. Entonces, nuestro trabajo es asegurarnos de equiparlos con las habilidades que puedan manifestar y tener este nivel de confianza. Y una de las cosas que antes de la COVID, y luego ahora podemos\npasar a la COVID, es que comenzamos a notar que los nios realmente no hacen preguntas. No quieren levantar la mano. Y luego eres el\nmaestro que intenta atraer, solicitas,\ncreas ganchos, intentas involucrar a los nios. Es difcil. Y, sin embargo, puedo ir a una escuela primaria y qu veo\nhacer a los nios en una Chromebook, un iPad, lo que sea? Automticamente\nsalen y presionan el micrfono: \"Mustrame una serpiente azul y\ndime por qu es azul\".   Bien? Y les encanta ese tipo de cosas. Y por eso son muy propensos\na hablar con su dispositivo y les encanta la respuesta que reciben, y luego les entusiasma un\npoco ms preguntar y ser un poco ms especficos. Entonces, una de las cosas que me encanta de ver esto con Khanmigo\nes ese tutor, esa gua lateral y los nios que no tienen miedo de\nhacerle preguntas al dispositivo. Y creo que es ingenioso porque se sientan y hacen\npreguntas todo el da. Y si tienen una\ntarea que est orientada, digamos que es escribir el ensayo. Y sabes, Sal, cuando habl por primera vez contigo, te vas a rer de esto, pero estabas hablando de que tu hijo tena que escribir un ensayo, verdad? Entonces solo tena cinco maestros\nque estaban pilotando esto, pero an as estoy tan emocionado que estoy hablando con todos al respecto, verdad? Yo digo: \"No creeras\nlo que nos mostr Sal Khan\". Y luego tuve una estudiante\na la que estaba asesorando en la escuela secundaria y ella me dijo: \"Dr. Buffington, \nya est listo ese material de IA?\" Porque necesitaba un profesor de escritura, verdad? Y entonces pens, bueno, fingir ser IA como Khanmigo, y dije: \"Ser tu entrenador de escritura\". Y estaba tratando de fingir que preguntaba, formulara una pregunta como si pensara que la IA funcionara, y no que reemplac a\ntu Khanmigo, Sal. Pero esto es lo que puedo decirte. Escribi un ensayo de seis prrafos\nsobre el misterio y fue hermoso. Necesitaba esa ayuda adicional simplemente para hacer preguntas\ny obtener respuestas, y empujarla un poco. Y fue hermoso. Y una de las cosas que nos dijeron los profesores, qu tan bueno es tener un tutor\n, un asistente o un entrenador cuando no estoy disponible? Y les encant\nporque vieron a sus, y estos son\nprofesores de secundaria que dijeron: \" No me levanto a las dos de la maana cuando terminan de jugar Minecraft\" y deciden empezar a\nescribir su trabajo y boom, tienen una enseanza.  asistente, hacen preguntas\ny vienen a la escuela y se sienten seguros en su trabajo. Y entonces creo que esa\nes la belleza de esto. Ahora, todava\nregresar como su educador y me asegurar de que hayan\npresentado su solicitud y que sea su voz y que representen\nlo que les he asignado. Pero vaya, el\nnivel de confianza en los nios es asombroso. Y eso es lo que me gusta de l.  En cualquier momento puedes tener un\ntutor en ese mismo momento, y creo que esa\nes la mejor parte. Creo que los comentarios que hemos podido brindarte, que has mejorado an ms el programa, son todo el historial de chat, verdad? Entonces puedo ver cunto tiempo han estado involucrados, qu tipo de preguntas estn haciendo, y no es solo una especie de copia y pegado rpido. Realmente ests ah fuera\nusando discernimiento, refinando y haciendo las preguntas correctas para realizar un gran trabajo. Me encanta esto sobre esto. Cuestionamiento, tutora,\nfomento de la confianza. Eso es todo lo que queremos para nuestros estudiantes. - Sabes, escucho dos\ntemas realmente poderosos all. Uno es el\naspecto de generar confianza, que en la introspeccin tiene\ntodo el sentido del mundo. Si los estudiantes pueden\ntener ms confianza y obtener respuestas a sus preguntas,\nse involucrarn ms. Y luego el otro,\nal que acaba de aludir, que es el proceso sobre solo el resultado. Y creo que, curiosamente, la IA nos da una perspectiva del proceso\nque nunca antes habamos tenido, porque no vas a\nver lo que hace un estudiante a las dos de la maana mientras\nescribe su ensayo, y  Podra ser conseguir que\nsu hermana mayor se lo escriba\no algo as. Y ahora tienes una lente. Dr. Krieg, qu hay de usted?  Ya sabes, cul fue tu\nreaccin inicial ante Khanmigo, especialmente en relacin con\ntu reaccin ante ChatGPT, y cmo ha sido la experiencia hasta ahora? - Esa es una gran pregunta. Sabes, francamente,\ncuando sabes que puedes ir a todo\ntipo de talleres y leer libros y, ya\nsabes, es til. Te da una chispa. Pero, ya sabes, es como, \ncmo tomo esa chispa y realmente permito que esa chispa adquiera una naturaleza orgnica, hasta el punto de que simplemente se incrusta en la forma en que haces las cosas, verdad? Hablamos de cultura,\nhablamos de clima. Y veo cosas como, ya\nsabes, equidad y acceso y, ya sabes, hablamos de\nprdida de aprendizaje y hablamos del efecto Matthew, verdad? Los que tienen siguen teniendo\ny los que no tienen, no.   Cmo llenamos esa brecha y realmente brindamos oportunidades?  Ayer estuve en un taller\ncon un colega y estbamos viendo\nel nuevo SAT digital, y mi colega, que es\neducadora y madre involucrada, dijo: \"Bueno, ya sabes,\nestaba trabajando con mi hija y,  \"Sabes, ella no entenda esto, aquello y lo otro.\" Entonces, ya sabes, dije,\nbueno, podemos conseguirte un tutor, ya sabes, y dah, dah, dah, dah, dah. Y realmente me hizo\npensar en esto otra vez, porque es como, qu pasa con Khanmigo? Bueno, segn su punto\ny el del Dr. Buffington, hemos estado en\nla pista de Khan Academy durante mucho tiempo. Lo he usado desde la perspectiva de un estudiante, una perspectiva de maestro y\nahora, a travs de los distritos de Khan, una perspectiva administrativa. Pero lo que estoy viendo con Khanmigo es la capacidad de tomar\nlas ideas que tiene la gente y realmente llevarlas a un lugar sistmico. Y eso creo que a medida que nos alejamos\nms y ms de la memoria de memoria,\ncomenzamos a ver lneas borrosas. Quiero decir, nuestros estudiantes son\ncreadores, son productores, son compositores, son cantantes, son podcasters, verdad? Son curadores, consumidores de medios e informacin,\npero tambin los crean.   Y entonces qu se necesita para todo eso?  Se necesita mayor profundidad\nde conocimiento, complejidad e interaccin con materiales, verdad? Interactuar con conceptos, etctera. Bueno, el problema es que, si\npiensas en el efecto Matthew y, ya sabes, en la\ncapacidad de algunas situaciones socioeconmica y culturalmente, mediante las cuales son capaces de llenar vacos, identificarlos y financiarlos, \nqu pasa con todos los dems?   Qu pasa con aquellos que no tienen acceso a ese tipo de cosas? E incluso si lo hacen, \nqu pasa si no funciona? Y entonces escuchamos todo sobre la apata y la falta de\ncompromiso de los estudiantes y, cualquiera que sea el caso, y\nesta es una pregunta que har. Dir, est bien, digamos que captamos la\natencin de sus alumnos. Tienes una audiencia cautivada.   Qu vas a hacer con l? Vamos a darle la vuelta al guin, verdad? Y entonces creo que lo que es emocionante para m es que a medida que usamos este modo beta de Khanmigo, y mientras observamos con\nl, vemos a los estudiantes interactuando con el conocimiento y los conceptos de una manera que aumenta la complejidad de lo que estn haciendo.  . Y no es una interaccin, no es una, la mejor manera de decirlo\nsera una transaccin, verdad? No es slo un, est bien,\nnecesito esto, dame aquello. Es una relacin continua mediante la cual los estudiantes\ninteractan con material nuevo, se desafan a s mismos o amplan lo que\npensaban que era cierto. Y esa readmisin al aprendizaje es lo que a todos nos apasiona, verdad? As que aqu hablamos mucho sobre cmo encontramos formas de\nunir pasiones, propsitos, posibilidades, etc. Y entonces, cuando miro a Khanmigo,\nal punto del Dr. Buffington, si soy profesor, no soy\nprofesor para ti, verdad?   Pero qu puede hacer? Puede ayudar a actualizar el conocimiento. Puede, ya sabes, crear ganchos\ny asociarse con el maestro para crear ganchos, verdad? Puede ayudar al profesor\ncreando billetes de salida con ellos. Puede ayudar con la planificacin de lecciones. Puede darte, ya sabes,\nincluso hay una pequea caracterstica interesante en la que puedes tomar una leccin completa y convertirla en un\npequeo poema divertido, verdad? Puedes co-crear rbricas y\ntodo ese tipo de cosas, verdad? Objetivos de aprendizaje, utilcelo como herramienta para el punto del Dr. Buffington. Y luego, del lado del alumno. Adelante. - Eso, quiero decir, algunas\nde las cosas ms emocionantes que descubrieron durante el piloto\n, que se poda hablar con una figura literaria.   Oh Dios mo! O podras hablar con alguien\nhistricamente y luego, simplemente lo puso en el momento y le dio vida al aprendizaje. Y por eso es tan atractivo.  Ya sabes, cuando pienso\nen, durante aos hemos dicho, diferenciacin, ya sabes, ese fue uno de los\naspectos ms importantes de Khan Academy. Y como usted ha dicho, y\ncomo ha dicho el Dr. Kreig, estbamos usando Khan Academy,\nfuimos los primeros en adoptarla.  Me encant. Tenamos el nuestro, incluso hicimos nuestro propio\ndiccionario de Khan Academy, fue bastante divertido saber cmo usarlo.   Pero qu me gust de eso? Me gust que hubiera diferenciacin. Haba una gua al\nlado, algo de ayuda adicional, verdad? Y veo a Khanmigo exactamente eso, pero tambin lo veo totalmente atractivo. Entonces puedo verlo, guau,\ndiferenciacin y, como educador, realmente\nno tuve que hacer mucho para brindar esa diferenciacin. Y es una gua al lado. Pero del mismo modo, no es algo que\nlos nios no quieran hacer.  Les gusta. Ahora, uno de nuestros profesores de ingls, y yo me re totalmente con esto, es que uno de los nios dijo, y estaba interactuando\ncon una figura histrica con Khanmigo, y el nio dijo: \"Esto es ms divertido que TikTok\". Entonces Sal, lo lograste. Es ms esclarecedor que TikTok. Y cuando los nios te dicen eso, sabes que tienes algo ah. Pero de todos modos, creo que\neso es una gran ventaja con esto. Aqu no es donde simplemente tengo que\nhacer mi tarea.  De hecho, estn ah fuera, se\ninvolucran con ello y lo llevan a nuevos niveles. Y descubrimos que algunos de los nios que formaban parte del\npiloto estaban haciendo cosas que no formaban parte de su tarea. Estaban creando cosas,\ncreando empresas similares y creando estos escenarios. Fue simplemente histrico. No les pedimos que hicieran eso. Simplemente les gust mucho. Y creo que eso\nes lo que queremos para los nios. Queremos que se pregunten. Queremos que innoven. Queremos que\nsolucionen problemas y salgan, tomen la informacin\ny hagan algo con ella. Y eso es lo que realmente pas con esto. Pienso, nuevamente, que es\nhermoso simplemente regresar y mirar, como\neducador, el historial de chat, as s lo que estn\nhaciendo, puedo ver la seguridad, puedo ver su trabajo, etctera, eso es realmente importante.  a los educadores. Pero creo que esto ha\nabierto un significado completamente diferente al compromiso y qu se preguntan, sobre qu quieren saber ms y qu quieren hacer con ello? Y encuentro que los\nnios a los que servimos hoy, creo que tienen\nun corazn para otras personas y son capaces de resolver problemas. Creo que\ntienen un ser emprendedor, ya sabes, que\nquieren hacer cosas y quieren tener xito en ello, quieren que sirva a otras\npersonas, resuelvan problemas y quieren tener xito\ncon lo que hacen.  he hecho. Este es un gran\ncambio en materia de equidad. Y creo que el Dr. Krieg lo\ndijo bastante bien. Puedo tomar a un estudiante de ingls, lo cual probamos con nuestro maestro de EL, y simplemente un cambio de juego para ellos. Quiero decir, su lengua materna no es un obstculo para ellos. Estn a la par de sus compaeros de clase. Y eso es bastante asombroso. Una de las cosas tambin es que estamos hablando con nuestro maestro de qumica AP, tambin un maestro universitario de doble crdito, simplemente mirando algunas de las ecuaciones que estaban haciendo en qumica. Y, ya sabes, Khanmigo\nno les dio la respuesta, pero les estaba investigando\ncmo obtener la respuesta. Y a nuestros profesores les encant eso, sabes? Si ests en casa tratando\nde resolver ese problema y no pueden ayudarte, Khanmigo\nestuvo all para ayudarlos. Ahora, les dir\nque todos dijeron que a veces los nios comenzaban a intimidar a la IA porque solo queran la\nrespuesta y no la funcionaba. Eso hizo que los profesores estuvieran muy contentos. Slo para que sepas que hay\nalgunos comentarios para ti.  A veces haba un poco de intimidacin\ncon Khanmigo, y, ya sabes,\nsegua incitndolos y deca: No te voy a dar la respuesta. - S, tenemos que ensear...\n- Nos gust esa parte. - Creo que la\nregla de oro debera aplicarse a la IA. Trate a la IA como deseara que lo\ntrataran a usted mismo. Quiero decir, simplemente continuar\ncon esa lente de retroalimentacin. Y no estaba bromeando cuando, ya\nsabes, en nuestra ltima reunin, tenemos varias funciones en Khanmigo que surgieron directamente de esa reunin. As que voy a seguir\nescogiendo el cerebro de todos ustedes.  Ya sabes, algunas de las cosas en las\nque estamos trabajando ms all de lo que\nya ests experimentando. Estamos trabajando para dotar a la\ninteligencia artificial de Khanmigo de un sentido de memoria, para que sepa el tono que prefiere un profesor o un alumno. Recuerda conversaciones anteriores y puede continuar donde las dejaste. Estamos agregando cosas\ndonde los profesores pueden asignar a travs de Khanmigo tanto\nactividades tradicionales de Khan Academy como actividades de IA. Y potencialmente afinar la\nactividad, en lugar de decir \"Habla con personajes histricos\". Como, \"Oye, quiero que\nhables con Benjamin Franklin y averiges lo siguiente\". Y entonces vamos a\nhacer cosas as. Ya tenemos un poco de esto, pero tendremos ms sobre informes, donde Khanmigo realmente acta\ncomo asistente de enseanza. Mencionaste a los estudiantes de ingls. Acabamos de publicar que ahora\nfunciona en todos los idiomas principales. Entonces, un estudiante podra estar haciendo matemticas o qumica en ingls, pero podra recibir\nayuda o tutora en espaol, portugus, hindi o cualquier idioma que necesite. Y luego, la otra cosa\nque esperamos hacer, llammoslo en los prximos\nseis meses, es tener IA, tener actividades que sean multiusuario, facilitar el\naprendizaje colaborativo entre muchos estudiantes. Entonces, ya sabes, puedes imaginar que,\nen lugar de tener un debate con la IA, tal vez la IA\npodra facilitar un debate con varios estudiantes. O realizar un dilogo socrtico\ncon varios estudiantes o realizar una simulacin o un\njuego con varios estudiantes. As que me encantara que sus\npensamientos fueran, ya saben, lo que ya existe de esa\nlista de la que les acabo de hablar, tal vez les entusiasme mucho.   Alguna idea sobre cmo modificarlo?  Tiene alguna inquietud y, en cuanto al riesgo, qu le gustara ver ms?  Los hay? Ha\nvisto problemas que desea\nasegurarse de que podamos abordar para que las cosas vayan mejor? Empezar por usted, Dr. Buffington. - Bueno, creo que una de las\ncosas sobre las que dimos retroalimentacin es que, obviamente, a veces nos damos cuenta de cosas que son preocupaciones de seguridad para nosotros. Y creo que usted abord, ya sabe, inmediatamente comenz a investigar cmo podemos asegurarnos de que si existe algn tipo de riesgo para un estudiante o para otras personas con lo que nosotros, haya un sistema de indicadores.  Por eso, apreciamos mucho\nque haya recibido esos comentarios, porque muchas veces podemos recogerlos en clase o en algn trabajo o cuerpo de trabajo, o si un estudiante ha estado hablando con otro estudiante o un maestro.  , podemos detectar algunas seales de cosas que indican que un estudiante puede necesitar ayuda adicional porque est pasando por\nun momento muy malo. O simplemente existe la\nposibilidad de que se produzca una aplicacin incorrecta o\nalgo por el estilo. Entonces, creo que tom\nbastante bien nuestros comentarios en trminos de que nos preocupamos por los nios que pueden necesitar\napoyo socioemocional adicional, o si su seguridad se ve\ncomprometida en su hogar o con otras personas. Creo que esa fue una\nde nuestras mayores preocupaciones cuando iniciamos el piloto por primera vez. Porque tenemos cosas\nas en este momento, y veo que los nios usan\nKhanmigo ms que, quiero decir, creo que lo usarn mucho. Y si van a usarlo mucho, me gusta que hayan incorporado\nalgunas medidas de seguridad. Eso fue realmente importante para nosotros. En trminos de seguir adelante, creo que el compromiso y la comunicacin con otras personas son realmente importantes. Muchas gracias por la parte de lenguaje que acaba de crear, porque creo que es de\nvital importancia en este momento. Y simplemente dira, una de las cosas que\ncreo que es realmente importante, y creo que esto se remonta\na la vieja pregunta, y realmente recibimos esto de los\nnios de secundaria ms que de nadie, como, por qu\ntengo que aprender?  eso? Y creo que\nsi pudiramos tener expertos en el campo, adems de que la parte de IA sea tan experta, cuando dices que pueden comunicarse con otros estudiantes, me encantara ver una base de datos\no, adems del experto en IA, Me gustara ver\nexpertos en el campo. Porque muchas veces, cuando estamos\npreparados para la universidad y la carrera, y pensamos en estos,\nnuestros prximos lderes sern, ya sabes, hablar con la\ngente y comprender a qu se dedican\ny cmo podra estar cambiando, y todo el concepto de IA.  . Permtanme darles un punto final del caso. Entonces, ahora mismo, cuando piensas\nen informtica, y hablamos de codificacin y simplemente intentamos que los\nnios se dediquen a la codificacin y la informtica,\nahora ser diferente. La IA le da un sabor completamente diferente y creo que es\nnecesario hablar con ellos, adems del experto en IA,  quines son esas personas en el campo? Como tu gente.   Cmo funciona esto detrs de escena?   Y qu? Quieres ganarte la\nvida con esto? Y si realmente lo disfrutas,\nni siquiera es un trabajo. Pero creo que es\nnecesario que haya ms de eso. Y entonces, ya sabes, existe\nsoftware con el que puedes reunirte con un\nexperto aqu, un experto all. Pero darles a los nios un sabor real. Y luego, quiero decir, todava puedes, si les vas a permitir que se\nrenan con otros nios, me gustara verlos\nreunirse con otros expertos en el campo. - Es una idea fascinante. Creo que todos saben que tenemos\notra organizacin hermana sin fines de lucro que comenc durante la\npandemia llamada schoolhouse.world, que, y toda la premisa\nde schoolhouse.world es, ya saben, conectar\nel mundo a travs del aprendizaje y brindar a las personas tutoras en vivo gratuitas a\ntravs de  video conferencia. Y la forma en que lo hacemos es\naprovechando los voluntarios. Muchos de los voluntarios son\nestudiantes de secundaria o universitarios, pero muchos de ellos son profesionales. Y cuando lanzamos\nKhanmigo empezamos a pensar, bueno, tal vez Khanmigo podra\nser un puente interesante entre la Khan Academy tradicional y tal vez algo\ncomo schoolhouse.world, donde en realidad\naparecen personas reales. Y entonces, Peggy,\ncasi estoy pensando en tu idea, y si en schoolhouse.world,\ncreo que a la mayora de los profesionales les encantara retribuir de alguna manera? Les encantara contarles, ya\nsabes, la mayora de los padres, cuando regresan a casa, quieren contarles a sus hijos sobre su trabajo y sus hijos no estn interesados. Pero los nios podran estar interesados\nen los trabajos de otros padres, lo que suele ser el caso. Entonces, podra haber una forma divertida en la que puedas aparecer en\nestos, digamos en una escuela, y luego Khanmigo pueda decir, oye, te preguntabas por qu esto es importante. Hay una sesin que est sucediendo. Fulano de tal est mostrando\nquin es un investigador de IA, o quin es mdico, o quin es\nabogado, quin puede hablar sobre,  por qu no vas a eso? y\naprenders mucho ms sobre por qu esta lgebra es  til. Entonces me encanta esa idea. Dr. Krieg, ms ideas,\nsiga viniendo, no podemos... - S, no, yo... -\nY miedos y riesgos, porque esas tambin son\nideas que, ya sabes, oportunidades para que podamos mejorarlas. - Entonces, francamente, para\nsalirme de esa nota, recuerdo que cuando era estudiante no entenda por qu\nShakespeare, por ejemplo. Y, ya sabes, en la universidad,\ncuando era estudiante universitario y luego de posgrado y todo eso, comenc a\napreciarlo de manera diferente. Pero, irnicamente, al punto del Dr. Buffington, lo que realmente comenz\nfue este breve video con el que me top, donde haba actores y actrices que hablaban sobre por qu Shakespeare. Y por primera vez\ncomenc a ver el teatro, por ejemplo, no solo en\nsu propia realidad aislada, como, oh, esto es teatro,\nsino como un puente, por as decirlo, como mencionaste, hacia todo\ntipo de otras ocupaciones.  . Y cuando puedas ver y escuchar cmo las cosas son hbridas ahora, las cosas ya no estn aisladas,\npuedes estar en un tema y aplicar los conceptos, los\nprincipios, las experiencias, no solo a otras cosas\nque ests haciendo.  Actualmente, pero las posibilidades son infinitas porque realmente no sabemos cmo\nsuceder ms adelante, verdad? Ni siquiera siempre somos\nconscientes de ello. Entonces, cuando pienso en\nlas actividades actuales para los estudiantes dentro de, a travs de Khanmigo, los animo a\ncontinuar buscando formas de romper los silos. Y con esto quiero decir, ya sabes,\nson como modos de escribir.  Los modos de escritura durante demasiado\ntiempo se ensearon de una manera singular. Entonces es como si esto fuera escritura expositiva, esto es escritura argumentativa,\nesto es escritura narrativa. Pero, ya sabes, las investigaciones muestran\nque el proceso de escritura de nuestros autores ms exitosos refleja el de los nios pequeos antes de pasar por un\nsistema educativo tradicional K-12, debido exactamente a lo que\nhablamos antes. Curiosidad.   Es una disciplina? Seguro. Lea a Stephen King sobre la escritura, l le dir que es una\ndisciplina, es una ciencia, pero tiene que haber esa pasin. Entonces, para m, pienso en\ncul es la diferencia entre lo que hemos hecho, lo que estamos haciendo y lo que podramos y deberamos hacer. Lo que tenemos que empezar a hacer, lo que\npodramos y deberamos hacer, es derribar los muros entre las clases, derribar los muros entre\ndentro y fuera de la escuela. El Dr. Buffington podra decirles que las cosas ms exitosas que estamos\nsucediendo en este momento han sido orgnicas y\nluego se vuelven sistemticas, donde el\nprofesor de ingeniera se asocia con el profesor de negocios, quien se asocia con el\nprofesor de biomedicina PLTW. Porque estn alineados con las pasiones. Estn alineados con las cosas que\nte interesan. Entonces, si me fijo en algo\ncomo elaborar una historia, comprender cundo sales, lees y escuchas podcasts, parte de la argumentacin\nes contar historias, verdad? No existe tal cosa como, oh,\nesto es escritura expositiva, as que solo expongo informacin, verdad? Escribir es complicado. El proceso de escritura no es lineal. Todo evoluciona y cambia.  En cuanto al punto del Dr. Buffington\n, hay dos cosas aqu. Primero, aplicar estos temas de una manera que los haga cada vez ms fluidos, y es por eso que me encanta tu comentario, Sal, sobre hacer que el viaje sea algo que se construye sobre s mismo. Y si la capacidad de la IA es tal que permite que\ncontine la progresin del aprendizaje, eso es un cambio de juego. Tuve una de mis mejores\nprofesoras de composicin en la escuela de posgrado, ella habl sobre cmo, ya sabes, la escritura debera evaluarse en ltima instancia\n, no en estos pequeos, ya sabes, oh, bueno,\ntomaste esta clase y obtuviste una A o aquella clase y  obtuvo una B. Debera ser dnde\ncomenzaron los estudiantes y luego dnde terminaron en el final natural del segmento. Y se trata de ese crecimiento. Bueno, ese crecimiento es tal que\nempiezas a entender, ay, todo es retrico, no? Vuelve a Platn, ya\nsabes, a Scrates, a Aristteles, cualquiera que sea el caso,\ntodo es retrico. Bueno, nuestros estudiantes ahora se\npresentan a un mundo que es gigantesco, pero\ntambin puede ser un nicho, verdad?   Cmo podemos tomar estas cosas que estn aprendiendo sobre\nhistoria, tecnologa, ingeniera, ya\nsabes, el cuerpo humano, todas estas cosas diferentes y decir, esto podra aplicarse a campos\nque ni siquiera existen? Esto podra terminar aplicndose,\npodra quedar pegajoso, verdad? As es como funciona nuestro cerebro. Necesitamos incluir informacin en cosas sobre las que ya tenemos marcos construidos, de tal manera que ahora estoy combinando algo que estoy haciendo en clase\ncon el trabajo secundario que tengo, ya sabes, una tienda que hago\nal mismo tiempo.  o lo que sea, y tambin en casa en mis preferencias\npersonales y, ya sabes, y como sea el caso. Entonces, por ejemplo, si escucho\npodcasts sobre cosas relacionadas con los deportes, eso\npuede cambiar la forma en que hago una\nsesin grabada para el personal, porque me gusta la forma en\nque presentan esto o aquello.  , ya sabes, usa la inflexin de voz all y todo eso. Por tanto, mi aliento sera doble. Primero, continuar derribando\nesos silos para mostrar cmo todo esto encaja\nen otras cosas, verdad? Y luego dos, hay un\npoco ahora en Khanmigo, en lo que se refiere a cmo\nnavegar las admisiones universitarias y la ayuda financiera, ya sabes, y luego tambin el aspecto profesional. Entonces yo dira que\nlos animo a continuar conectando a los estudiantes y\nlo que estn aprendiendo o podran aprender y con qu. Y cuando piensas en\nel estado de Indiana, por ejemplo, mucho de lo que el Dr.\nBuffington, yo y nuestro equipo estamos haciendo aqu es ayudar a alinear\nlo que los estudiantes estn haciendo ahora con credenciales acumulables de moneda, mostrando futuros empleadores,\ncomits de becas,  etctera, que tengo dominio de algo\no competencia en algo o experiencia en algo. Vemos esto incluso con insignias digitales y cosas de esa naturaleza. Entonces, cuando un estudiante ve una carrera profesional, se siente intimidante porque\nel lenguaje que se utiliza para caracterizarla puede\nno tener nada que ver con lo que realmente implica la ocupacin. Y las ocupaciones futuras\npara las que puedo usar estas cosas ni siquiera existen, verdad? Entonces, cmo podemos intentar\nunir esos mundos para conectar a los estudiantes\npresentes con su futuro en el corto plazo, as como, ya sabes, las oportunidades\nque existen a partir de entonces y que ni siquiera conocemos todava? - Me encanta, este tipo de tema de romper barreras entre temas, que creo que ahora es\nms factible que nunca. Y luego tambin entre la\nescuela y el mundo real. Una ltima pregunta para usted, Dr. Buffington. Avancemos rpido, no\ns, dos, tres aos. No tiene que pasar mucho tiempo, pero las cosas estn cambiando muy rpido.   Crees que todo lo que\nhemos hablado va a alterar de alguna manera fundamentalmente\ncmo es la escuela, incluso, ya sabes, ni siquiera hablamos de\ncosas como la evaluacin, en la que estamos empezando a\npensar de nuestra parte?   O crees que ser simplemente\nun buen complemento a la arquitectura existente?   O cree que de alguna manera cambia fundamentalmente el aula\n, Dr. Buffington? - Bueno, quiero decir, Tim lo\nsabr, Dr. Krieg. Quiero decir, tena la filosofa\nde que, ya sabes, durante COVID, el panorama\ncambi para siempre, verdad? Quiero decir, ya ha cambiado. Si no quiero venir\na mi institucin pblica y sentarme todo el da, puedo elegir\nir a una escuela en lnea y, ya sabes, tal vez eso funcione para m. Creo que, cuando miro esto, no quiero verlo como algo complementario. Quiero ver esto como una herramienta\nque es, ya sabes, utilizable ahora, pero que tambin puede\nayudarnos en el futuro.  Ya sabes, cuando pienso en cosas y pienso en la\npreparacin para una carrera universitaria, y, ya sabes, ahora mismo puedo dejar que un nio\nsalga temprano, se grade temprano y, ya sabes, tengo\nnios que se estn graduando con ttulos asociados en\nnuestra escuela secundaria en este momento.   Qu veo que podra suceder aqu? Veo lo que la gente quiere con los nios que ahora se gradan de la escuela secundaria. Quieren que solucionen problemas. Quieren que puedan\ncolaborar y trabajar en equipo. Quieren que tengan\nprcticas ticas detrs. Y creo que ya\ntienes el potencial con esto. Ahora lo interesante es cmo le doy una pasanta a un estudiante, y tal vez en Khanmigo haya\nun aspecto de pasanta de esto y cuente para su da. Sabes, me refiero a\nreinventar la escuela secundaria y cmo se ve eso. Y, ya sabes, creo que\neso se canaliza hasta, ya sabes, la escuela secundaria y la primaria. Creo que hay muchos\naspectos diferentes de esta IA que podra explorar. Sabes, cuando pienso que los\nnios quieren divertirse, no quieren temer las tareas, ya veo que esa parte est curada. Veo nios que van all\nslo porque quieren y les gusta hacer preguntas. Y eso es lo que queremos como educadores. Queremos que hagan preguntas. Y les fascina. Y por eso quiero tomar esa\nfascinacin y desarrollarla. Y si eso significa redisear\nla forma en que hacemos escuela, entonces tenemos que hacerlo, verdad?  Por eso, ya estamos rediseando y reinventando nuestras\nescuelas secundarias con universidad temprana y, ya sabes, puedes obtener\ncertificaciones de la industria un ao de universidad, dos aos de universidad. No es necesario que\nvayas cinco das a la semana. Quizs no necesites ir un da entero. Porque puedes tener una\noportunidad diferente. Y si esa oportunidad\nse presenta de esa manera, ests acreditado para graduarte y tal vez incluso ingresar a la fuerza laboral o ingresar a la educacin postsecundaria para explorar ms a fondo lo que estamos tratando de\nlograr con, ya sabes, alguna credencial postsecundaria que contribuya.  al mundo. Y entonces mi pregunta es: \nexisten formas mejores, ms eficientes o ms\nemocionantes y atractivas de reinventar las cosas que estamos haciendo? Y creo que, como todo lo que ha\nsido nuevo en la educacin, a veces somos los ltimos en adoptarlo.  Y entonces por qu? Y creo que empezamos a hablar de esto.  Le tienen miedo. Y no hay que tenerle miedo, hay que aceptar lo que es el futuro. Entonces creo que\nhabr cierta adaptabilidad cuando se habla de\nsuplementos, verdad? Quiero decir, ahora mismo\ntendrs usuarios pioneros que bsicamente tomarn algo que tienen en su\nmapa curricular y dirn: \"Cmo me ayuda la IA?\". \"Cmo puedo utilizar Khanmigo?\" Y luego\ncomenzars a ver algo pionero en el que ser como, vaya,\nno lo soy, no es un reemplazo. Y vern que\ncomienzan a usarlo de una manera que mejora an ms, y no reemplaza como lo hicieron antes. Y est empujando a los nios\na crecer y aprender y tal vez a tener una idea\nde que podran curar algo. Sabes, me encanta el hecho\nde que esta es una generacin a la que le gusta resolver problemas. Y dirn: \"Qu pasa con esto?\" O \"Qu pasa con eso?\" Y creo que esto tiene\nel potencial para lograrlo. Entonces, si tengo un estudiante y, ya sabes, para hablar sobre lo que estbamos hablando, pondremos a los nios en una clase de biomedicina y luego les pediremos que se enfrenten al programa de ingeniera, porque estn pensando en una cosa y  Estas son las personas aqu que realmente pueden construirlo para usted o ayudarlo con sus\nclculos o lo que sea. Esas barreras estn rotas. Y veo que la escuela secundaria\nse reinventa por completo al brindarles a los nios la\noportunidad de aplicar esto en un entorno del mundo real. Entonces creo que hay espacio para esto, y solo les dar\nun concepto de, ya saben, Indiana est haciendo algo con las\ncuentas de becas profesionales.  Se llaman CSA. Y en realidad est destinado a incorporar a los\nnios a la fuerza laboral y al aprendizaje y las pasantas en el trabajo.   Y ya estn en la cspide de cmo sera un diploma de escuela secundaria para un nio al que le damos este CSA?   Y es realmente lo tradicional? Tienes que tener 40 crditos\nde esto y aquello. Y estn empezando a ver, bueno, eh, tal vez no necesiten eso. Y tal vez, solo tal vez\nsea alguien que yo incluya en la fuerza laboral que tenga algn conocimiento sobre el\nuso apropiado de la tecnologa y que encuentre una solucin para algo que han estado luchando por encontrar. Creo que existe el potencial para eso. Creo que veremos a los\nprimeros usuarios complementar, reemplazar y luego encontrar cosas nuevas. Y luego creo que vers a\nnios decir: \" Puedo hacer esto, puedo hacer aquello\". Y tendremos que reconsiderar\nla forma en que estamos cumpliendo para permitir el crecimiento, si eso tiene sentido. - Tiene mucho sentido. Y saben, podra hablar\ncon ustedes dos durante horas, especialmente sobre este tema,\nporque es muy fascinante. Pero me encanta ese tipo de\nempujn final en el que, ya sabes, se rompen todos los lmites y, de hecho, siempre obtenemos nuestras ideas y actividades de usted, Dr. Buffington. Y de alguna manera reforz algo que estbamos pensando, es decir,  qu pasara si hubiera una\nactividad para los estudiantes, o para los maestros o para cualquier persona, para resolver grandes problemas en el mundo? Sabes, nos necesitas,\nnecesitas abordar el clima,  quieres descubrir\ncmo puedo yo, como estudiante, comenzar a abordar el cambio climtico?   Cmo puedo yo, como estudiante,\nempezar a abordar la investigacin del cncer?   Cmo puedo yo, como estudiante,\nempezar a abordar, no s, cualquier problema del mundo que\ncreas que necesita solucin? Muchos estudiantes quieren hacerlo, pero no saben por dnde\nempezar, por dnde empezar, as que a m tambin me gusta esa idea. Bueno, gracias a ambos... Y Sal puede, Sal, puedo\nsimplemente mencionar lo que acabas de decir y\nlo importante que es, y ellos tratan de resolver cosas\nque son tan importantes para ellos. Entonces, durante COVID, uno de mis\nestudiantes estaba tratando de descubrir cmo tener un mejor\nsistema de registro de sntomas en la sala de emergencias. - Mmm.\n- Y por qu. Quera que les notifique que deben volver a priorizar\nquin est en su sala de emergencias, porque su abuelo muri de COVID. Entonces tuve a este pequeo\nemprendedor innovador, y tenemos espacios para creadores\naqu, ya sabes, hacemos ferias de fabricantes, tenemos espacios STEM en todas partes. Y su creacin fue, y trabaj con los\ningenieros del hospital sobre los sntomas y dnde se encuentran, y cmo priorizamos a quin vas a\nver primero, porque era muy real para ella y para ti.  Ya sabes, cuando\nhablas de cambio climtico, las cosas que realmente les importan las pasan todo el da. Ese es el tipo de estudiante\nque no se va a la cama porque est ah afuera\ntratando de descubrir dnde est la informacin,\nqu tipo de herramienta, qu tipo de instrumento. Ella est en la clase de biomedicina, va a la clase de ingeniera y estn creando una computadora de mano, y se sincronizar\ncon relojes o lo que sea en el hospital, para cambiar\nla prioridad de, a quin necesitas ver ahora? Y creo que nuestros hijos\ntienen ese potencial, verdad? Y entonces, adivinen qu? Eso\nno sucedi en su saln de clases, sucedi fuera de su saln de clases, pero ella trajo al saln de clases que tiene que haber una manera mejor.   Bien?  Por eso creo que esto\nabre todo tipo de vas de preguntas o problemas\nque quieren resolver, les da un buen comienzo y les har querer\nseguir adelante.   Usted sabe lo que quiero decir? Y creo que esa es la belleza de esto. Es tan atractivo que no quieren parar: 100%. No podra estar ms de acuerdo.\n- Sal, si me permites. Solo en nombre de ambos, ya\nsabes, gracias por, ya sabes, eso es lo que hiciste, verdad? Empezaste identificando\nun problema, una necesidad, cierto, que era personal para\nti en un sentido familiar. Y hiciste muchas\npreguntas y fuiste pionero, y luego, ya sabes, aqu estamos, verdad? Y entonces, nuestra esperanza es que, por muy apasionados que seamos los tres\n, por ejemplo, por la educacin y, ya sabes, Khanmigo, y las diferentes formas de\ntratar de ayudar a nuestros estudiantes, ya sabes, tener una misin, poder  para perseguir sus pasiones. Si pueden tener el mismo tipo de pasin por las cosas que les interesan, y estamos uniendo las posibilidades donde pueden perseguirlas, entonces, ya sabes, la educacin puede verse diferente,\npero lo fundamental, ya sabes,  La verdadera Estrella Polar sigue siendo la misma.   Bien? - 100%.\n- Y luego simplemente lo hacemos de\ndiferentes maneras, ya sabes. Pero el por qu sigue ah. El denominador sigue ah. Y esos son nuestros hijos, esos son nuestros estudiantes. Y creo que gracias en nombre de ambos\npor defender esto. - No, bueno, gracias a todos\npor ser parte de esto. - Oh, oye...\n- Por tomarte el tiempo libre. - ste.\n- Oh s. - Esto fue lo mejor que jams haya sucedido. Quiero decir, no estoy bromeando. Poda sentarme y hablar con\nlos profesores y los nios que estaban usando esto. Poda sentarme con ellos todo el da, y ellos me enviaban\ncosas que estaban creando a partir de Khanmigo, y me encantaba y tengo otro trabajo que hacer, pero quera leer lo que\nestaban haciendo con eso. Y creo que simplemente felicitaciones y gracias por\nincluirnos en el piloto. Creo que seremos\npioneros al salir y hablar con la gente sobre cmo, ya sabes, cmo romper las barreras\ny cmo utilizarlas. Pero no se puede hacer eso\nsin darle a la gente un comienzo inicial.   Bien? Y lo hiciste, y\nsolo te digo que es fascinante sentarse y\nhablar con estos profesores sobre cmo creen que lo usarn a continuacin. Y gracias por eso. Has tomado algo que creo que les tena tanto miedo, especialmente los profesores de ingls. Y no le tienen miedo. Y entonces saben cmo\nlo abordarn. Ellos, ya sabes, hablaron con nuestra Secretaria\nde Educacin, Katie Jenner, lo cual es interesante porque\nhablaste con Katie Jenner y ella dijo: \"Oye, quiero\nhablar con esos maestros\". As que lo alineamos y a\nella tambin le fascin. As que tomaste algo y\nnos diste una herramienta realmente buena para usar en educacin. Y por eso, lo agradecemos y no puedo esperar a ver la prxima versin. - No, estamos entusiasmados y\ncreo que esta ser una de muchas conversaciones durante los prximos meses y aos, a medida que emprendamos esta aventura juntos. Pero gracias porque sabes, obviamente podemos hacer todo este trabajo, pero si no atendemos las necesidades de los lderes escolares, los maestros y los estudiantes, entonces por qu hacemos esto? Significa mucho\npoder asociarnos con todos ustedes. Gracias a todos. - Gracias, Sal.",
    "t_arabic": "-   \n        \n   \"  \"    \n  .   \n  .          \n       .     .    \n            \n    .      \n      .      . -    . -    .\n-     .         \n               .   ChatGPT \n  2022      \n        \n      \n                     . -    \n             \n      .   \n        \n   \n     .    \n            \n       Google          \n         \n       .        \n        .    \n    .             \"\n    .\"              \n18   ChatGPT           .   \n     \n     .    \n                         ChatGPT   .      \n       \n   .  \n            \n .     \n    \"  \"    \n   .           \n    -      \n  .             \n  ChatGPT        .                  \n   .          \n                    . -  \n                 \"   .\"     \n    .    \n      .     \n       \n   .   \n      .                \n      \n      .  \n    .          \n        \n                  \n      \n      \n  .     \n           \n        \n       \n        \n            .                    . -  .    \n         \n  ChatGPT    \n   \n    -      \n        \n                      \n .        \n          \n    \n  2022  \"      .\"    \"   \"    \"  \n  .\" : \"   \". : \"\".    \n    ChatGPT    .  \n                             .    \n    .                      \n        .    \n    ChatGPT\n   .       \n       . \n           \n           \n        \n         \n     \n          .           .               .  \n             \n              \n       .   \n       \" \".                                  \n Tin Man    \n   .      \n            .     \n   : \" .\"                   \n     \n        \n       .\n-  . - .        \n    .    \n\"  \".    \n     \n  .    \n         \n  .          \n         .      .    \n                     \n     \n    \n        ChatGPT.         \n        \n       \n          \n     \n       .            \n    .    \n      \n        \n       \n  \"  \".                        .            .       \nSAT    . \n    Desmos          SAT   \n     .              \n        \n                       .  \n  \n              \n         \n     \n    -     \n          \n      \n   Apple Computer             \n    .       \n                    .             \n               .         \n                        \n      \n   .   .       \n       \"\n     .\"          \n             \n  .   \n     \"!\"      \n       \"               ChatGPT.\"   .        : \"  \".         .    \n                    .              \nChatGPT    .     \n : \"!\"                    \n  ChatGPT.     \n .                  \n                    .              \n       \n                      \n       \n            \n     \n      \n     \n     \n                 \n      .        \n   .         .       \n.        \n    .         .            .    \n     .        \n      \n        \n                   \n      .   . -     \n               .                 .   \n   .              \n           .    \n        \n      \n     \n   .  \n          \n                    . -    \n                             .                     .           \n             .    .   \n     \n    .  .         \n    Chromebook  iPad       \n   \"  \n   .\"       .    \n        \n       .           Khanmigo\n            \n   .        \n  .   \n       .                             \n                : \" \n    .\"     \n       \"  \n     \"                   \"   .\"                 \n   .       .       \n   .          \n    .  .              \n          \n     \n             Minecraft   \n        \n      .    \n  .   \n     \n      \n   .  \n    .    .       \n      \n    .                                       .  \n        .     .    \n .     . -   \n   .  \n     \n    .    \n      \n   .   \n          .            \n      \n       \n     \n   \n    .    .          \n        \n  ChatGPT      -   .     \n      \n      \n   .  .      \n                             \n  .    \n      \n             \n     .            \n     \n SAT     \n   \"  \n            .\"    \n            .   \n               \n          \n     .           \n       .         \n         .     \n    \n    .   \n            \n  .        \n            .    \n      \n             \n                     \n            \n     \n  .       \n .   .                        Khanmigo \n              .        \n         \n    .    \n          \n  .                     \n       .     \n          \n               .     \n            \n   .      .     \n         \n          \n               .      . . -   \n        \n      .  !      \n          .    .     \n          \n    .  \n       \n   . .         \n            .           .     \n                 .       \n     \n    .    .       \n    .   .                  \n       \"     .\"     .     TikTok.          .      \n   .        \n.     \n     .        \n         .    \n     .    .      .     .    \n   .   .   .     \n       \n  .      .    \n     \n     \n                .     \n                     \n      \n        .  \n    \n           \n      \n .   .  \n      .    \n   .                    .         .        .   .                                 .   \n      \n    .      .     \n        \n  .  \n                   \n .      .   \n  .      \n       \n      . -    -\n-     . -  \n       .       \n .   \n    .     \n                 .  \n  .     \n    \n .    \n             .         .   \n     \n         .   \n    \"   \".  \"  \n      .\"   \n    .              \n  .      .     \n    .               \n              .  \n      \n               \n     .      \n          \n     .     \n       \n    .    \n         \n          .                       \n  \n               . -    \n                 .                                .    \n                                                    \n  .     \n   \n   .    \n          \n        \n      .    \n        .   \n      \n       .            \n  .      .             .              \n  .       \n       \n      \n          \n     -     \n                          \n        \n   .      \n      \n      \n       \n         .       .    \n         \n       \n .        \n                .         \n          \n     .   \n      .    \n    \n    .      .         \n      \n      . -   .      \n     \n  schoolhouse.world   \nschoolhouse.world    \n         \n    .      \n    .    \n        .  \n   \n          \n schoolhouse.world \n   .    \n       schoolhouse.world\n        .    \n               .     \n      .           \n                   .   .   \n           \n          \n        .     .     \n    - -   -\n-     \n      . -    \n          \n   .    \n          \n  .           \n               .  \n         \n      \n       \n    .               \n       \n      \n               \n    \n   .    \n        \n     .    \n   .       \n   .       \n  .     \n             \n          \n    . .     .       \n         .     \n             .         \n               \n .       \n       \n   \n        \n  PLTW biomed.     .     \n .     \n              \n         \n           .    .    .     \n   .                    .          \n     .     \n             \n        \n      A         B.     \n           .    .      \n            \n       \n  .   \n    \n                \n     \n            \n  .      \n            .                      \n         \n         \n     .      \n      \n      \n     \n                .      .    \n       \n       \n      \n              .      \n     \n         .   \n        \n       \n             \n          \n         .           .          \n   \n         .    \n            \n     \n       \n         . -                 \n      .   \n  .     .    \n   .            .     \n  \n             \n     \n   .      \n              \n     -    \n    .     \n   -19 \n         .     \n       \n           .           .       \n        \n  .         \n         \n     \n    \n  .                  .      .      \n   .     \n  .    \n   .               \n      .         \n     .    \n     .     \n       .     \n                 .     \n      .    .       .     \n  .      \n                   \n         \n           .    \n    .       .     \n .    \n                  \n              .       \n       \n              \n      .       .    .           .   \n        \n     \n       \n    \"   \" \"   \"    \n       \n    .  \n          .   \n      \n    .      \n     .    \"  \"  \"  \"    \n   .                                               \n    .     .    \n       \n     .       \n           \n   .   CSA.      \n        .             CSA          40  \n   .         .  \n        \n              .     .   \n       .    \n           .    \n          . -    .    \n       \n .     \n                   .              \n           .      \n     \n           \n         \n     \n      .           \n        .   - -    \n    \n     \n  .     \n       \n         . - .\n-  .           \n            .    \n     \n                .    \n          \n      .    \n           .    \n      \n    \n       .               \n        \n         \n       \n                      .     \n     \n       \n     .          .         - 100%.     .\n-    .    \n              \n    \n  .     \n                     \n          \n             .                           \n         .  - 100%.\n-    \n   .     .    .    .      \n  . -     \n    . -  -\n-   . - .\n-  . -      .     .    \n     .          \n                 \n  .      \n   .   \n         \n .     \n    .    \n       \n           .    .              .    .    \n .      \n        \n    : \" \n   .\"   \n   .     \n      .          . -   \n                   .                           \n     .   . -   .",
    "t_italian": "- Ciao a tutti, sono Sal\ndella Khan Academy e, come alcuni di voi sanno,\nho pubblicato il mio secondo libro, \"Brave New Words\", sul futuro dell'intelligenza artificiale\nnell'istruzione e nel lavoro.  disponibile ovunque\ntu possa acquistare i tuoi libri. Ma come parte della ricerca per quel libro, ho fatto alcune interviste con\nalcune persone affascinanti, che stai per guardare. Ho due ospiti davvero interessanti oggi. Ho la dottoressa Peggy Buffington,\nche  il sovrintendente del distretto scolastico di Hobart in Indiana, nella Greater Chicago\nArea, immagino si possa dire. E abbiamo anche il dottor Tim Krieg, che  il direttore del\ncurriculum e dell'istruzione secondaria presso la School City di Hobart. Benvenuti a entrambi. - Grazie per averci ospitato oggi. - S, grazie mille.\n- Quindi lasciami iniziare. No, beh, grazie per esserti unito e lasciami iniziare con\nuna domanda molto semplice, prima di entrare in alcune delle cose con cui abbiamo collaborato negli ultimi mesi. Quando ChatGPT  entrato in scena alla\nfine di novembre del 2022, o all'inizio di dicembre, e avete\niniziato a scoprirlo e magari a sentire le voci secondo cui gli studenti avrebbero potuto\nusarlo per saggi o per altre cose, quali\nsono state le vostre reazioni?  ? A cosa stavate pensando? Cosa hai sentito dai tuoi insegnanti? E magari comincio da lei, dottor Buffington. - Beh, all'inizio, e solo\nper darti un po' di background in termini di utilizzo della tecnologia, sai, ho iniziato a leggere tutto\nquello che potevo sull'argomento e a creare un resoconto, comprendendone le complessit. E mi sono avvicinato ad esso\nnel senso che lo farei, con qualsiasi tipo di tecnologia,\nil che sarebbe, wow, come lo\nintegreremo, lo useremo e non ne avremo paura. E penso che questo sia stato\nl'approccio pi importante che ho potuto adottare, semplicemente perch\nnon  qualcosa che, diciamo solo, quando  uscito Google o quando abbiamo iniziato a introdurre come usare Internet, la gente\nnon l'ha fatto.  Non ho davvero la minima idea di come lo\nintegrerebbero con l'insegnamento o con il loro curriculum. Quindi ho subito iniziato a pensare a come aiutare le\npersone a vederlo come uno strumento da cui non possono scappare. E fondamentalmente quello che\npensavo davvero sarebbe successo  esattamente quello che  successo. Tutti si sono rivolti al plagio e faremo qualcosa per bloccarlo? E cos ho pensato: \"Whoa,\naspetta solo un secondo qui\". Cerchiamo di capirlo, prima di tutto sapevamo che dovevi avere\n18 anni per usare ChatGPT, ma sappiamo che questo non impedisce ai ragazzi di creare account falsi. E sapevamo che avremmo\navuto questo problema, e dobbiamo, dobbiamo\nabbracciarlo e iniziare a capire come usarlo. E francamente, la cosa\nveramente interessante, Sal,  che avevo un bambino di seconda elementare che ha creato il suo mostro riciclato per un progetto, e suo padre lo ha aiutato ad andare su ChatGPT per scrivere una storia al riguardo. Quindi, se gli alunni della seconda elementare\nlo utilizzeranno gi, dobbiamo vedere che questo\nsar uno strumento che i bambini abbracceranno. Allora come possiamo insegnare loro\ncome usarlo in modo etico, ed  la loro voce, e non scappare da essa? E questa  stata la nostra posizione\nfin dall'inizio. Ma posso dirti che\ngli insegnanti dicevano tutti: \"Cosa farai per bloccarlo?\" Fino a quando non abbiamo iniziato ad avere\nquesto tipo di dialogo. Perch dovremmo bloccare qualcosa che potrebbe potenzialmente aiutare uno studente? Dobbiamo solo imparare ad\nusarlo, giusto? - E come rispondi? Perch un buon numero di\nqueste preoccupazioni sono reali. Sono un insegnante di materie umanistiche e sono abituato ad assegnare tesine, e ora gli studenti potrebbero\nusare ChatGPT e, sai, penso che tu non riesca a rilevarlo. So che ci sono persone che affermano che creeranno qualche tecnologia, ma davvero non puoi rilevarlo se qualcuno  anche solo vagamente\ncreativo al riguardo. Cosa avete detto a loro o avete iniziato a cambiare la\npratica all'interno del distretto, e dottor Buffington, puoi continuare e poi sono davvero curioso, Tim, cosa ne pensi di questi problemi. - Beh, voglio dire,\ndir che c'erano alcuni insegnanti di inglese, puoi immaginare, quelli sono i primi a parlare e dire: \"Wow, sono fuori a fare la polizia\". E guarda, penso che questo sia\nquesto e ho eseguito questo controllo. Ed  stato molto interessante\nvedere il loro approccio alla cosa. E una delle cose in cui\ncredo davvero  che dobbiamo cambiare il modo in cui\nassegniamo le cose ai bambini. E dovrai\nmostrarglielo e insegnargli come usarlo in modo appropriato. Perch ci deve essere discernimento, ci deve essere un uso etico di,  questa la tua voce o la\nvoce di qualcun altro? E come provi che \nvero, come lo citi e tutte queste cose. Perch ci fa semplicemente\nvedere le cose in modo diverso. Ora, non so quanto velocemente vuoi entrare nelle nostre\nesperienze con Khanmigo, ma quello che posso dire  che\nabbiamo iniziato a guardare, anche prima di pilotare Khanmigo, quale sarebbe un uso accettabile dell'IA? E prima che iniziassero la fase pilota, si trattava davvero di\nassicurarsi che ci fosse discernimento, assicurandoci che\nrappresentassimo la tua voce e non stessi semplicemente copiando\ne incollando qualcosa. Quindi abbiamo iniziato a considerare\nforse una rubrica senza intelligenza artificiale, un po' di intelligenza artificiale, e per cosa\nconsentiresti che venisse utilizzata? E poi, sai, che aspetto ha\nl'intelligenza artificiale in piena regola? E lo userai\nper discorsi e dibattiti? Quindi abbiamo iniziato ad avere\nquel tipo di conversazione non solo per vietarlo completamente, ma per parlare di cosa consentiresti. E poi penso che approfondiremo ci che abbiamo scoperto con Khanmigo, ma questo  il tipo di dialogo che abbiamo iniziato ad avere con le persone. - Molto utile. E dottor Krieg, qual  il tuo\npunto di vista su entrambi? Qual  stata la tua prima reazione\nquando hai visto ChatGPT entrare in scena e cosa\nhai sentito dai tuoi insegnanti e da altri\nsu come navigare al suo interno? -  un'ottima domanda, ed  davvero molto\ninteressante per me perch il dottor Buffington mi ha fatto\ncondurre un inizio in ritardo, il che, inizio in ritardo significa per noi, tutto il nostro staff  seduto insieme e gli studenti arrivano in ritardo, quindi possiamo fare un lavoro collettivo\nsviluppo professionale. E non ricordo esattamente su cosa lavorasse lo staff\n, ma alla fine, uno dei nostri insegnanti di ingegneria\n venuto da me e mi ha detto, ed era nel novembre\ndel 2022, e ha detto: \"Ehi  , ho risposto alla domanda.\" Lui dice: \"Cosa ne pensi?\" E cos l'ho letto e ho detto: \"Oh, molto ben fatto,\nDaniel,  fantastico\". E lui: \"Non l'ho scritto io\". E io ho detto: \"Va bene\". E cos quella  stata la mia prima\nvera iterazione con ChatGPT che l'ha messo sul radar. Ora, essendo uno che \nstato un insegnante di inglese, sarei negligente se non dicessi a quel punto cosa ho fatto, giusto? Il dottor Buffington ne ha parlato, mi piacciono i libri, puoi vedere i libri dietro di me. Alla dottoressa Buffington piacciono i libri,\nli ha dappertutto. Ho iniziato a fare delle ricerche, vero? E, sai, francamente, penso che ci sia qualcosa di paralizzante in ci che mi piace chiamare\nacronimi-ite, nel senso che abbiamo acronimi per tutto. E quindi, sai, dissipando\nquesta nozione di simile, cos', sai, ChatGPT\no qualunque sia il caso. E arrivi a scoprire che, sai, tutto questo viene incorporato in\nquella che  considerata intelligenza artificiale, giusto? Intelligenza artificiale. E cos questo\nmi ha portato lungo una pista del coniglio, se vuoi, per, sai,\nguardare cos' l'intelligenza artificiale ed  nuova o  in\nun'iterazione diversa, giusto? Quindi sono passato dal non avere\nidea di cosa fosse a leggere, sai,\narticoli sui principali distretti scolastici del\npaese, per esempio, che avrebbero vietato questo, e cos via. A quel punto mi sono detto, beh, sai,  comprensibile.  nella natura umana, sai, i sopravvissuti, cercare di proteggere noi stessi, giusto, e alzare quelle siepi di protezione. Bene, pi\napprofondisci la cosa, sai, come ex insegnante di inglese, so che molti di\nquesti termini che usiamo, come AI per esempio, sono spesso basati\nsu cose che sono, tu  sai, legato alla fantascienza. Voglio dire, guardi\nindietro all'intelligenza artificiale e, sai,  come \"Il mago di Oz\".  Lo sai, Uomo di Latta, vero? Tipo,  possibile, sai, che io possa avere un essere, se vuoi, questa cosa creata in grado di ragionare, giusto? E quindi  cos affascinante,\ncome un uomo di latta senza cuore, giusto, e il concetto di\nrobot artificialmente intelligenti. E guardi indietro e\nquesto non  niente di nuovo, ha assunto un'iterazione diversa man mano che la tecnologia ha raggiunto. E cos, sai, ho iniziato\na esaminarlo e ho pensato \"Oh mio Dio\". Sai, negli anni '50, se ne parlava, giusto? E cos i filosofi stavano\ncercando di esplorare questo e c'era un, non\nricordo il nome del ragazzo, ma un matematico britannico che cerc di creare la\npossibilit di, sai, c' la prova di ci.\n-Alan Turing. - S. Ed era come se lo vedessi in\ntutta la fiction, sai. Un piccolo racconto intitolato\n\"Il gioco pi pericoloso\". E, sai, considerare\ngli animali e gli esseri umani e la capacit di ragionare\ncome elemento di differenziazione. E quindi, sai, il problema\nera, come tutti sappiamo, che la tecnologia non era pronta,\nsai, in quel momento. E quindi vedi questo come l'intera nozione di intelligenza artificiale che ha appena attraversato\ndecenni di cambiamenti, giusto? Era come sulle montagne russe. Era su e gi e dappertutto. E quindi, sai, questo\novviamente ha portato all'era attuale in cui ci troviamo, dove la tecnologia pu tenere il passo, giusto? E cos ora vediamo questo\nvero e proprio cambiamento sociale in cui all'improvviso\nl'insegnante di ingegneria usa questa cosa, ma non\nso nemmeno cosa sia, sai, acronimo, ChatGPT. E cosa fai? Hai alzato le tue siepi\ndi protezione, vero? Tipo, non so cosa sia\ned  spaventoso, giusto? E quindi penso che una delle\ncose pi importanti fino a quel momento sia stata, sai, non appena abbiamo avuto quella\nconversazione, sai, poi come la dottoressa Buffington,\nin quanto leader quale , lo sapeva gi. Sono arrivato tardi alla festa, vero? Ma poi iniziamo a\nrisolvere i problemi insieme, a pensare ed esplorare. E penso che ci che rende\nunico questo distretto e perch apprezziamo la\npartnership che abbiamo con Khan e perch penso che siamo in\nlinea con te in questo momento  solo perch, sai, il\nproblema di \"Brave New Words\". Sai, la dottoressa Buffington  una pioniera e non ha paura di guardare le cose in modo non binario, giusto? Avere o non avere, buono o cattivo. E le zone grigie, vero? E questi sono strumenti proprio come le calcolatrici. Guardi le modifiche al\nnuovo SAT digitale, lo sai. Hanno una\ncalcolatrice infusa da Desmos, non esiste pi una cosa del genere per il nuovo SAT di una\nsezione con calcolatrice o senza calcolatrice. Bene, questa  la realt di dove siamo, e non deve necessariamente\nessere distopica se possiamo, secondo il punto del dottor Buffington, lavorare\ncon il nostro staff e gli studenti per essere saggi amministratori di queste risorse, perch non sar cos.  cambiare, vero? E quindi penso per me, sai, la dottoressa Buffington nella sua\ntesi, sai, con cosa inizi,\nuna definizione di termini? E cos quando inizi a fare ricerche sulle cose, inizi a realizzare, stiamo parlando della\nstessa cosa, giusto? Stiamo definendo i nostri termini o stiamo semplicemente girando\nintorno a cose che non\ncapiamo nemmeno cosa siano? Giusto? - Giusto, posso\nintervenire solo per un secondo, perch una delle cose, come utente di tecnologia ai\ntempi, negli anni '80, sai, e ho fatto il mio\ntirocinio con Apple Computer in progettazione didattica, e  , sai, e stai cercando di capire come convincere gli insegnanti\nad abbracciare la tecnologia, senza averne paura. E devi davvero dire a te stesso, la cosa numero uno che\nvogliono sapere , come migliorer il mio lavoro? In che modo aiuter i miei studenti? E se non puoi venderli, potresti anche dimenticartelo. E quindi, se riesci a convincerli che ci migliorer il loro lavoro e render i risultati pi\naccessibili ai loro studenti, e loro sono d'accordo con questo, allora devi elaborare un buon piano per insegnare loro come usarlo  . E quindi quello che sento davvero, una delle prime cose\ncos eccitanti  quando inizi a parlarne con loro,  semplicemente creare un account, giusto? Vuoi sapere come\npreparare la migliore carbonara? Fai quella domanda, giusto,\ne vedi cosa ottieni. E ne sono affascinati.  un po' come usare il motore di ricerca per la prima volta, e ti\nvengono fuori tutti questi risultati e poi dici: \"Beh,\ndevi perfezionarlo per ottenere quello che vuoi.\" Quindi puoi rigenerare le domande, giusto? E cos trovano queste piccole\ncose affascinanti, e poi fai quei piccoli passi extra per mostrare loro cose come\ngenerare un biglietto di uscita. E poi iniziano\na vedere un po' di utilit e dicono: \"Whoa!\" Quindi, un esempio calzante, l'insegnante di ingegneria che\nstava parlando con il dottor Krieg, si avvicina e dice: \"Wow, ho appena consegnato la mia borsa di studio alla Hobart Educational Foundation e ho scritto tutto in ChatGPT\". E ovviamente gli  stato assegnato. Ha dovuto modificare alcune cose e ha detto: \" stato fantastico\". E noi diciamo, va bene, ottimo lavoro, hai trovato un utilizzo per questo. Il mio direttore della tecnologia\ne il mio responsabile IT, il nostro sistema di gestione degli studenti, qualcosa non funzionava bene in un rapporto che dovevano fare. Sono rimasti indietro nel back-end e hanno inserito del codice che pensavano fosse sbagliato, l'hanno inserito in\nChatGPT, quindi  tornato indietro ed  stato corretto. Sono stati in grado di correggerlo\ne hanno detto: \"Wow!\" Il nostro direttore del servizio di ristorazione, esaminando qualcosa che dovevano fare per un rapporto federale,  uscito e stava facendo\nalcune cose in ChatGPT. Ora, come tutti sappiamo,\nnon  finita. Devono ancora controllare le cose e avere discernimento, giusto? Quindi il punto  che,\nquando introduci questo, che si tratti di termini o altro, se non riesci a mostrare qualche grande vantaggio, verrai spento. E poi penso che l'altro aspetto di questo sia insegnare agli insegnanti una volta che\nvedono il lato delle risorse, perch, francamente, il lato delle risorse \ndavvero ottimo per gli insegnanti quando iniziano a guardarlo, come posso fare compiti che utilizzano questo tipo  della tecnologia? Sai, e penso a\nquella narrazione, a quel saggio e, sai, quando penso\nalle abilit del 21  secolo nel collaborare con un team e avere quel discorso\ne dibattito su, sai, cosa\nti sta dicendo l'intelligenza artificiale? E poi ti rigeneri\ne ottieni un'altra risposta e un'altra risposta,\ne sei in quella squadra e stai discutendo e\ndibattendo su cosa  accurato, cosa  reale, cosa  possibile, e poi inizi a formulare una sorta di ipotesi o\ntematica  tipo di situazione in cui lo espanderai. Penso che abbia un grande potenziale, quando insegniamo alle persone\ncome usarlo in modo appropriato. E dobbiamo guardare al futuro e dire che lo faranno. I nostri concorrenti a livello globale\nlo utilizzeranno. Perch mai dovremmo vietare qualcosa? E poi\nusciranno nel mondo reale e lo useranno. Quindi  nostro compito usarlo e usarlo bene. Insegna loro un uso etico, insegna loro come usarlo strategicamente per ottenere un prodotto finale. Quindi penso che i nostri insegnanti abbiano\nbisogno di questo tipo di aiuto. E quindi inizi con: in che modo mi avvantaggia come insegnante? E ora, come lo\nuser con i miei figli? E ragazzi,\nho delle idee davvero fantastiche su come possiamo usarlo\ncon i bambini, semplicemente con, adoro l'aspetto del coaching, adoro la differenziazione, ma questo  pi dal lato Khanmigo, e io  so che ci\narriverai con noi, perch adoro Khanmigo.  Sto solo dicendo. - No, voglio dire, ovviamente\nsono di parte, adoro Khanmigo, ma ne divento sempre pi entusiasta ogni volta che ti parlo, dottor Buffington. E, per chi ascolta, molti dei contenuti dell'insegnante sono idee dirette del Dr. Buffington. Quindi il tuo feedback si sta\nsicuramente manifestando nel nostro prodotto. Ma passiamo a questo, perch Hobart era gi un distretto piuttosto impegnato,\nfortemente impegnato utilizzando, chiamiamolo pre-AI Khan Academy. Poi vi abbiamo mostrato le\nprime demo di Khanmigo, e da marzo siete\nstati tutti uno dei primi distretti del paese, probabilmente\ndel mondo, a usare Khanmigo in modo sistematico, e\nsembra in modo produttivo. Quali sono state le vostre\nreazioni originali a Khanmigo? Quali domande o aspirazioni\nhai ancora a riguardo? E com' stata l'esperienza negli ultimi mesi? Inizier con lei, dottor Buffington, e poi andr dal dottor Krieg. - Beh, adoro l'aspetto della\nfiducia in uno studente, giusto? Quindi voglio dire, tutto ci che vuoi leggere sui risultati degli studenti deve iniziare con la costruzione della fiducia che hanno dentro di s, che sanno di potercela fare. E quindi il nostro compito  assicurarci di dotarli delle competenze necessarie per manifestarsi e avere questo livello di fiducia. E una delle cose che pre-COVID, e poi puoi fare proprio adesso,\n  che hai appena iniziato a notare che i bambini in realt non fanno domande. Non vogliono alzare la mano. E poi sei l'\ninsegnante che cerca di attirare, stai sollecitando, stai\ninventando agganci, stai cercando di coinvolgere i bambini.  difficile. Eppure posso andare a una scuola elementare e cosa guardo\nfare i bambini su un Chromebook, un iPad, qualunque cosa? Escono automaticamente\n, colpiscono il microfono: \"Mostrami un serpente blu e\ndimmi perch  blu\". Giusto? E adorano quel genere di cose. E quindi sono cos propensi\na parlare con il loro dispositivo e adorano la risposta che ricevono, e poi questo li rende un\npo' pi entusiasti di chiederlo e di essere un po' pi specifici con esso. Quindi una delle cose che adoro guardare questo film con Khanmigo\n proprio quel tutor, quella guida a lato e i bambini che non hanno paura di\nporre domande al dispositivo. E penso che sia ingegnoso perch si siedono e fanno\ndomande tutto il giorno. E se hanno un\ncompito mirato, diciamo solo che  il saggio di scrittura. E sai, Sal, quando ti ho parlato per la prima volta, stai per scoppiare a ridere, ma stavi parlando di tuo figlio che doveva scrivere un tema, giusto? E quindi avevo solo cinque insegnanti\nche lo stavano sperimentando, ma ne sono cos entusiasta che ne sto parlando con tutti, giusto? Dico: \"Non crederesti a\nquello che ci ha mostrato Sal Khan\". E poi ho avuto una studentessa\na cui stavo facendo da mentore alla scuola media, e lei mi ha detto: \"Dottor Buffington, quella\nroba sull'IA  gi pronta?\" Perch aveva bisogno di un insegnante di scrittura, giusto? E quindi ho pensato, beh, far finta di essere un'intelligenza artificiale come Khanmigo, e ho detto: \"Sar il tuo insegnante di scrittura\". E stavo cercando di far finta di chiedere, di porre una domanda come penso che l'intelligenza artificiale andrebbe bene, e non che io abbia sostituito\nil tuo Khanmigo, Sal. Ma ecco cosa posso dirti.  Ha scritto un saggio di sei paragrafi\nsul mistero ed  stato bellissimo. Aveva bisogno di quell'aiuto extra semplicemente facendo domande\ne ottenendo risposte, e spingendola un po'. Ed  stato bellissimo. E una delle cose che ci hanno detto i nostri insegnanti, quanto  bello avere un tutor,\nun assistente o un allenatore quando non sono disponibile? E l'hanno adorato\nperch vedono i loro, e questi sono insegnanti delle scuole superiori\nche hanno detto, non mi alzo alle due del mattino quando hanno finito di giocare a Minecraft e decidono di iniziare a\nscrivere il loro compito e boom, hanno un insegnamento  assistente, fanno domande,\nvengono a scuola e si sentono sicuri del loro lavoro. E quindi penso che questa\nsia la bellezza di tutto questo. Ora, torner comunque\ncome tuo educatore e mi assicurer che tu abbia\nfatto domanda e che sia la tua voce e che rappresenti\nci che ti ho assegnato. Ma wow, il\nlivello di fiducia nei bambini  sorprendente. Ed  questo che mi piace.  In qualsiasi momento puoi avere un\ntutor proprio l e in quel momento, e penso che questa\nsia la parte migliore. Penso che il feedback che siamo stati in grado di darti, che hai reso il programma ancora migliore, sia l'intera cronologia della chat, giusto? Cos posso vedere da quanto tempo siete impegnati, che tipo di domande state ponendo, e non si tratta solo di una cosa veloce da copiare e incollare. Sei davvero l fuori\nusando discernimento, perfezionando e ponendo le domande giuste per realizzare un ottimo lavoro. Mi piace questo di questo. Domande, tutoraggio,\nrafforzamento della fiducia. Questo  tutto ci che vogliamo per i nostri studenti. - Sai, sento due\ntemi davvero potenti l. Uno  l\naspetto di costruzione della fiducia, che nellintrospezione ha\ntutto il senso del mondo. Se gli studenti riuscissero ad\nacquisire pi sicurezza e ad ottenere risposte alle loro domande,\nsi impegnerebbero di pi. E poi l'altro, a\ncui hai appena accennato, che  il processo che si basa solo sull'output. E questo, l'intelligenza artificiale, credo interessante, ci fornisce una lente sul processo\nche non abbiamo mai avuto prima, perch non\nvedrai cosa fa uno studente alle due del mattino mentre\nscrive il suo saggio, e loro  potrebbero convincere\nla sorella maggiore a scriverlo per loro\no qualcosa del genere. E ora prendi un obiettivo. Dottor Krieg, e lei? Sai, qual  stata la tua\nreazione iniziale a Khanmigo, soprattutto rispetto alla\ntua reazione a ChatGPT, e com' stata l'esperienza finora? - Questa  una bella domanda. Sai, francamente,\nquando sai che puoi frequentare tutti i\ndiversi tipi di seminari e leggere libri e,\nsai,  utile. Ti d una scintilla. Ma sai, \ncome prendere quella scintilla e permettere davvero a quella scintilla di assumere una natura organica, fino al punto in cui diventa semplicemente incorporata nel modo in cui fai le cose, giusto? Parliamo di cultura,\nparliamo di clima. E vedo cose come,\nsai, equit e accesso e, sai, parliamo di\nperdita di apprendimento e parliamo di, sai, come l'effetto Matthew, giusto? Quelli che hanno continuano ad avere\ne quelli che non hanno no. Come possiamo colmare questo divario e offrire davvero opportunit?  Ieri ero a un seminario\ncon un collega e stavamo guardando\nil nuovo SAT digitale, e la mia collega, che \nun'educatrice e un genitore coinvolto, ha detto: \"Beh, sai,\nstavo lavorando con mia figlia e tu  sai, non ha capito questo, quello e quell'altro.\" E quindi, sai, ho pensato,\nbeh, possiamo trovarti un tutor, sai, e dah, dah, dah, dah, dah. E mi ha fatto davvero\nriflettere di nuovo su questa cosa, perch  come, che ne dici di Khanmigo? Beh, secondo te\ne secondo il dottor Buffington, siamo sulla\npista della Khan Academy ormai da molto tempo. L'ho usato dal punto di vista dello studente, dal punto di vista dell'insegnante e\nora, attraverso i distretti di Khan, dal punto di vista amministrativo. Ma quello che vedo con Khanmigo  la capacit di prendere\nle idee che le persone hanno e di farle diventare sistemiche. E cos penso che man mano che ci allontaniamo sempre di\npi dalla memoria meccanica, i\nconfini iniziano a essere sfumati. Voglio dire, i nostri studenti sono\ncreatori, sono produttori, sono cantautori, sono cantanti, sono podcaster, giusto? Sono curatori, sono consumatori di media e informazioni,\nma le creano anche. E allora cosa serve tutto questo?  Ci vuole una maggiore profondit\ndi conoscenza, complessit e interazione con i materiali, giusto? Interagire con i concetti, eccetera. Bene, il problema , se si\npensa all'effetto Matthew e, sai, alla\ncapacit di alcune situazioni socioeconomiche e culturali, per cui sono in grado di colmare le lacune, identificarle e finanziarle,\nche dire di tutti gli altri? Che dire di coloro che non hanno accesso a questo tipo di cose? E anche se lo facessero,\ncosa succede se non funziona? E cos sentiamo tutto, sai, di apatia degli studenti e mancanza di\nimpegno e, sai, qualunque sia il caso, e\nquesta  una domanda che far. Dir, okay, diciamo solo che attiriamo l'\nattenzione dei tuoi studenti. Hai un pubblico affascinato. Cosa ne farai? Capovolgiamo la sceneggiatura, giusto? E quindi penso che ci che  entusiasmante per me, mentre usiamo questa modalit beta di Khanmigo, e mentre la osserviamo,\nvedi gli studenti interagire con conoscenze e concetti in un modo che aumenta la complessit di ci che stanno facendo  . E non  un'interazione, non  un, il modo migliore per dirlo\nsarebbe una transazione, giusto? Non  solo un, okay, mi\nserve questo, dammi quello.  una relazione continua in cui gli studenti\ninteragiscono con nuovo materiale, o sfidano se stessi, o espandono ci che\npensavano fosse vero. E la riammissione all'apprendimento  ci che ci appassiona tutti, giusto? Quindi qui parliamo molto di come troviamo modi per\nunire passioni, scopi, possibilit, eccetera. E quindi quando guardo Khanmigo,\nsecondo il punto del dottor Buffington, se sono un insegnante, non\nti sta insegnando, giusto? Ma cosa pu fare? Pu aiutare ad aggiornare la conoscenza. Pu, sai, creare\ne collaborare con l'insegnante per creare ganci, giusto? Pu aiutare l'insegnante\ncreando biglietti di uscita con loro. Pu aiutare con la pianificazione delle lezioni. Pu darti, sai, c'\nanche una piccola funzionalit in cui potresti prendere un'intera lezione e trasformarla in una\npiccola poesia divertente, giusto? Puoi co-creare rubriche,\ntutto quel genere di cose, giusto? Obiettivi di apprendimento, usalo come strumento per il punto del Dr. Buffington. E poi, dal lato dello studente. Andare avanti. - Quello, voglio dire, alcune\ndelle cose pi eccitanti che stavano scoprendo durante il pilot,\n era che potevi parlare con una figura letteraria. Oh mio Dio! Oppure potresti parlare con qualcuno\nstoricamente e poi lo sei, lo hai semplicemente messo nel momento e ha dato vita all'apprendimento. E quindi  cos coinvolgente. Sai, quando ci\npenso, per anni abbiamo detto, la differenziazione, sai, quello era uno dei\npezzi grossi della Khan Academy. E come hai detto tu, e\ncome ha detto il dottor Kreig, stavamo usando Khan Academy,\nsiamo stati i primi ad adottarlo.  Lo amavo.  Ne avevamo uno nostro, abbiamo persino creato il nostro\ndizionario della Khan Academy, era piuttosto divertente come usarlo. Ma cosa mi  piaciuto di questo? Mi  piaciuto che ci fosse differenziazione. C'era quella guida a\nlato, un po' di aiuto extra, giusto? E vedo Khanmigo esattamente cos, ma lo vedo anche totalmente coinvolgente. Quindi posso guardarlo, wow,\ndifferenziazione e, come educatore,\nnon ho dovuto fare molto per fornire quella differenziazione. Ed  una guida a lato. Ma allo stesso tempo, non  qualcosa che\ni bambini non vogliono fare.  A loro piace. Ora, uno dei nostri insegnanti di inglese, e questo mi ha fatto impazzire,  che uno dei ragazzi ha detto, e stava interagendo\ncon una figura storica con Khanmigo, e il ragazzo ha detto: \"Questo  pi divertente di TikTok\". Allora Sal, ce l'hai fatta.  pi illuminante di TikTok. E quando i bambini te lo dicono, sai che c' qualcosa l. Ma comunque, penso che\nquesto sia un grande vantaggio. Non  qui che devo solo\nportare a termine il mio compito.  In realt sono l fuori\ne si stanno impegnando, e lo stanno portando a nuovi livelli. E abbiamo scoperto che alcuni dei ragazzi che facevano parte del\npilot stavano facendo cose che non facevano parte del loro compito. Erano fuori a creare cose,\ncreare aziende simili e inserire questi scenari. Era semplicemente isterico. Non abbiamo chiesto loro di farlo.  A loro  piaciuto davvero tanto. E quindi penso che questo\nsia ci che vogliamo per i bambini. Vogliamo che si chiedano. Vogliamo che innovino. Vogliamo che\nrisolvano problemi e vadano l fuori, prendano le informazioni\ne facciano qualcosa con esse. Ed  quello che  realmente successo con questo. Penso, ancora una volta, che sia\nbello tornare indietro e guardare, come\neducatore, la cronologia della chat, cos so cosa stanno\nfacendo, posso vedere la sicurezza, posso vedere il loro lavoro, eccetera, questo  davvero importante  agli educatori. Ma penso che questo abbia\naperto un significato completamente diverso al coinvolgimento e cosa si stanno chiedendo, e cosa vogliono saperne di pi e cosa vogliono farne? E trovo che i\nragazzi che serviamo oggi, penso che abbiano\nun cuore per le altre persone e risolvano i problemi. Penso che\nabbiano un essere imprenditoriale, sai, che\nvogliono fare cose e vogliono avere successo, vogliono che servano altre\npersone, risolvano problemi e vogliono avere successo\ncon ci che fanno.  ho fatto. Questo  proprio un\npunto di svolta per quanto riguarda lequit. E penso che il dottor Krieg lo abbia\ndetto piuttosto bene. Posso prendere uno studente di lingua inglese, che abbiamo sperimentato con il nostro insegnante EL, e per loro  semplicemente una svolta. Voglio dire, la loro lingua principale non  un ostacolo per loro. Sono alla pari con i loro compagni di classe. E questo  davvero fantastico. Una delle cose anche che, sai, stiamo parlando con il nostro insegnante di chimica AP, anche lui un insegnante di scuola materna con doppio credito, solo guardando alcune delle equazioni che stavano facendo in chimica. E, sai, Khanmigo\nnon voleva dare loro la risposta, ma li stava sondando\nsu come ottenerla. E quindi ai nostri insegnanti  piaciuto molto, sai. Se sei a casa e stai cercando\ndi risolvere il problema e loro non possono aiutarti, Khanmigo\nera l per assisterli. Ora, vi dir\nche tutti hanno detto che a volte i ragazzi cominciavano a fare il prepotente con l'intelligenza artificiale perch volevano solo la\nrisposta e questa non bastava. Quindi questo ha reso gli insegnanti piuttosto felici. Giusto per farti sapere, c'\nqualche feedback per te.  A volte c'era un po' di bullismo\ncon Khanmigo, e questo, sai,\ncontinuava a spingerli a dire: \" Non ti dar la risposta\". - S, dobbiamo insegnare...\n- Ci  piaciuta quella parte. - Penso che la regola d'oro\ndovrebbe applicarsi all'intelligenza artificiale. Tratta l'IA come vorresti essere\ntrattato tu stesso. Voglio dire, sto solo continuando\ncon quella lente di feedback. E non stavo scherzando quando,\nsai, durante il nostro ultimo incontro, abbiamo avuto diversi articoli su Khanmigo che sono usciti direttamente da quell'incontro. Quindi continuer\na scegliere il vostro cervello. Sapete, alcune delle cose su\ncui stiamo lavorando vanno oltre ci che\nstate gi sperimentando. Stiamo lavorando per dare\nall'intelligenza artificiale, dando a Khanmigo il senso della memoria, in modo che riconosca il tono preferito da un insegnante o da uno studente. Ricorda le conversazioni precedenti e pu riprendere da dove eri rimasto. Stiamo aggiungendo elementi\nin cui gli insegnanti possono assegnare tramite Khanmigo sia le\nattivit tradizionali della Khan Academy che le attivit di intelligenza artificiale. E potenzialmente perfezionare l'\nattivit, invece di dire \"Parla con personaggi storici\". Tipo: \"Ehi, voglio che\nparli con Benjamin Franklin e capisci quanto segue\". E quindi\nfaremo cose del genere.  Ne abbiamo gi un po', ma ne avremo di pi sul reporting, dove Khanmigo funge davvero\nda assistente didattico. Hai menzionato gli studenti di lingua inglese. Abbiamo appena annunciato che ora\nfunziona in tutte le principali lingue. E cos uno studente potrebbe fare i suoi compiti di matematica o di chimica in inglese, ma potrebbe ricevere il\nsuo aiuto o il suo tutoraggio in spagnolo, portoghese, hindi o qualunque lingua di cui potrebbe aver bisogno. E poi l'altra cosa\nche speriamo di fare, chiamiamola nei prossimi\nsei mesi,  avere l'intelligenza artificiale, avere attivit multiutente, facilitare l'\napprendimento collaborativo tra molti studenti. Quindi potete immaginare che\ninvece di avere un dibattito con l'intelligenza artificiale, forse l'intelligenza artificiale\npotrebbe facilitare un dibattito con diversi studenti. Oppure esegui un dialogo socratico\ncon diversi studenti o fai una simulazione o un\ngioco con diversi studenti. Quindi mi piacerebbe che i vostri\npensieri fossero, sapete, ci che gi esiste di\nquell'elenco di cui vi ho appena parlato, forse siete molto entusiasti. Qualche idea su come modificarlo? Hai qualche dubbio e, dal punto di vista del rischio, cosa ti piacerebbe vedere di pi? Ci sono, hai\nriscontrato problemi che vuoi\nassicurarti che possiamo affrontare per rendere le cose pi agevoli? Inizier con lei, dottor Buffington. - Beh, penso che una delle\ncose su cui abbiamo dato feedback, ovviamente a volte rileviamo cose che rappresentano problemi di sicurezza per noi. E penso che tu abbia affrontato, sai, immediatamente hai iniziato a indagare su come possiamo assicurarci che se c' qualche tipo di rischio per uno studente o per altre persone proprio con quello che noi, esiste un sistema di indicatori. E quindi apprezziamo molto\nche tu abbia accettato quel feedback, perch molte volte siamo in grado di coglierlo in classe o in qualche lavoro o corpo di lavoro, o se uno studente ha parlato con un altro studente o un insegnante  , siamo in grado di rilevare alcuni segnali di situazioni in cui uno studente potrebbe aver bisogno di ulteriore aiuto perch sta\nattraversando un brutto momento. Oppure c' semplicemente qualche\npotenziale per, sai, un'applicazione sbagliata o\nqualcosa del genere. E quindi penso che tu abbia preso\nabbastanza bene il nostro feedback in termini di preoccupazione per i bambini che potrebbero aver bisogno di un ulteriore\nsupporto socio-emotivo o se la loro sicurezza viene\ncompromessa a casa loro o con altre persone. Penso che questa sia stata una\ndelle nostre maggiori preoccupazioni quando abbiamo avviato il progetto pilota. Perch abbiamo cose del\ngenere in atto in questo momento, e vedo i bambini usare\nKhanmigo pi di quanto, voglio dire, penso solo che lo useranno molto. E quindi, se lo useranno molto, mi piace che tu abbia\nincorporato alcune misure di sicurezza. Questo  stato davvero importante per noi. In termini di futuro, penso che sia davvero importante il coinvolgimento e la comunicazione con altre persone. Grazie mille per la parte linguistica che hai appena creato, perch penso che sia di\nvitale importanza in questo momento. E vorrei solo dire, una delle cose che\npenso sia davvero importante, e penso che questo ritorni\nalla vecchia domanda, e lo riceviamo davvero dai\nragazzi delle scuole medie pi di chiunque altro, tipo, perch\ndevo imparare  Quello? E penso che avendo degli esperti\nsul campo, se potessimo, oltre al fatto che la parte dell'intelligenza artificiale  quella esperta, quando dici che possono comunicare con altri studenti, mi piacerebbe vedere un database\no, oltre all'esperto di intelligenza artificiale, io  mi piacerebbe vedere\nesperti sul campo. Perch molte volte con la\npreparazione al college e alla carriera e pensando a questi\nsaranno i nostri prossimi leader, sai, parlare con le\npersone e capire cosa fanno per vivere\ne come potrebbe cambiare, e solo l'intero concetto di intelligenza artificiale  . Vorrei fornire un endpoint del caso. Quindi in questo momento, quando pensi\nall'informatica, e parliamo di programmazione e stiamo solo cercando di convincere i\nragazzi a dedicarsi alla programmazione e all'informatica,\nora sar diverso. L'intelligenza artificiale d un sapore completamente diverso e penso che abbiano\nbisogno di parlare, oltre all'esperto di intelligenza artificiale, con chi sono quelle persone sul campo? Come la tua gente. Come funziona dietro le quinte? E cosa, e vuoi\nfare questo per vivere? E se ti piace davvero,\nnon  nemmeno un lavoro. Ma penso che ce ne sia bisogno\ndi pi. E quindi, sai, c' del\nsoftware l fuori con cui puoi incontrare un\nesperto qui, un esperto l. Ma dare ai bambini un vero sapore. E poi, voglio dire, puoi ancora, se permetti\nloro di incontrarsi con altri ragazzi, mi piacerebbe vederli\nincontrare altri esperti sul campo. - E' un'idea affascinante. Penso che sappiate tutti che abbiamo\nun'altra organizzazione no-profit consorella che ho fondato durante la\npandemia chiamata schoolhouse.world, che, e l'intera premessa\ndi schoolhouse.world, , sai, connettere\nil mondo attraverso l'apprendimento e offrire alle persone tutoraggio dal vivo gratuito\ntramite  video conferenza. E il modo in cui lo facciamo \nsfruttando i volontari. Molti dei volontari sono\nstudenti delle scuole superiori o universitari, ma molti di loro sono professionisti. E quando abbiamo lanciato\nKhanmigo abbiamo iniziato a pensare, beh, forse Khanmigo potrebbe\nessere un ponte interessante tra la tradizionale Khan Academy e forse qualcosa\ncome schoolhouse.world, dove effettivamente\ncompaiono persone reali. E quindi, Peggy, la tua idea,\nsto quasi pensando, e se schoolhouse.world,\npenso che la maggior parte dei professionisti vorrebbe ricambiare in qualche modo.  A loro piacerebbe dirlo,\nsai, la maggior parte dei genitori, quando tornano a casa, vogliono parlare ai loro figli del loro lavoro e i loro figli non sono interessati. Ma i bambini potrebbero essere interessati\nai lavori degli altri genitori, il che tende ad essere il caso. E quindi potrebbe esserci un modo divertente in cui puoi presentarti su\nquesti, diciamo in una scuola, e poi Khanmigo pu dire, ehi, ti stavi chiedendo perch  importante. C' una sessione in corso. Cos e cos sta mostrando\nchi  un ricercatore di intelligenza artificiale, o chi  un medico, o chi \nun avvocato, chi pu parlare, perch non vai l, e\nimparerai molto di pi sul perch questa algebra   utile. Quindi adoro quell'idea. Dr. Krieg, altre idee,\ncontinua ad arrivare, non possiamo... - S, no, io... -\nE paure e rischi, perch anche quelle sono\nidee che, sai, opportunit per noi di migliorare le cose. - Quindi, francamente, per\nandare dritto al punto, ricordo che da studente non capivo perch\nShakespeare, per esempio. E, sai, al college,\nquando ero uno studente universitario e poi una scuola di specializzazione e quant'altro, ho iniziato ad\napprezzarlo in modo diverso. Ma ironicamente, secondo il punto del dottor Buffington, ci che veramente ha dato il via a tutto\n stato questo breve video in cui mi sono imbattuto, dove c'erano attori e attrici che parlavano del perch Shakespeare. E per la prima volta ho\niniziato a vedere il teatro, ad esempio, non solo nella\nsua realt isolata, come, oh, questo  teatro,\nma come un ponte, se vuoi, come hai detto, verso ogni\nsorta di altre occupazioni.  . E quando riesci a vedere e sentire come le cose sono ibride ora, giusto, le cose non sono pi isolate,\npuoi essere in una materia e applicare i concetti, i\nprincipi, le esperienze, non solo ad altre cose\nche stai facendo  attualmente, ma le possibilit sono infinite perch non sappiamo davvero come\naccadr in seguito, giusto? Non ne siamo nemmeno sempre\nconsapevoli consapevolmente. E quindi, quando penso\nalle attuali attivit per gli studenti all'interno, attraverso Khanmigo, vi incoraggio a\ncontinuare a cercare modi per abbattere i silos. E con questo intendo dire che\n come un modo di scrivere. Per troppo tempo le modalit di scrittura sono state\ninsegnate in un modo singolare. Quindi  come se questa fosse scrittura espositiva, questa fosse scrittura argomentativa,\nquesta fosse scrittura narrativa. Ma, si sa, la ricerca mostra\nche il processo di scrittura dei nostri autori di maggior successo rispecchia quello dei bambini piccoli prima di passare attraverso un\nsistema educativo tradizionale K-12, proprio per quello di cui\nabbiamo parlato prima. Curiosit.  una disciplina? Sicuro. Leggi Stephen King sulla scrittura, ti dir che  una\ndisciplina,  una scienza, ma deve esserci quella passione. E quindi per me, penso a\nqual  la differenza tra ci che abbiamo fatto, ci che stiamo facendo e ci che potremmo e dovremmo fare. Ci che dobbiamo iniziare a fare,\npotremmo e dovremmo fare,  abbattere i muri tra le classi, abbattere i muri tra\ndentro e fuori la scuola. Il dottor Buffington potrebbe dirti che le nostre cose di maggior successo in\nquesto momento sono state organiche e\npoi sono diventate sistematiche, dove l'\ninsegnante di ingegneria collabora con l'insegnante di economia, che collabora con l'\ninsegnante di PLTW biomedico. Perch, perch sono allineati alle passioni. Sono allineati alle cose che\nti interessano. Quindi, se guardo a qualcosa\ncome creare una storia, capire quando esci, leggi e ascolti podcast, parte dell'argomentazione\n la narrazione, giusto? Non esiste qualcosa come, oh,\nquesta  scrittura espositiva, quindi espongo solo informazioni, giusto? Scrivere  disordinato. Il processo di scrittura non  lineare. Tutto evolve e cambia. Quindi, secondo il punto del dottor Buffington\n, due cose qui. Primo, applicare questi argomenti in un modo che li renda sempre pi fluidi, ed  per questo che adoro il tuo commento, Sal, sul fatto che il viaggio sia qualcosa che si costruisce su se stesso. E se la capacit dellintelligenza artificiale  tale da consentire il\nproseguimento della progressione dellapprendimento, ci rappresenta un punto di svolta. Avevo una delle mie migliori\ninsegnanti di composizione alla scuola di specializzazione, mi parlava di come, sai, la scrittura alla fine dovrebbe essere\nvalutata, non a questi piccoli, sai tipo, oh, beh, hai\nseguito questo corso e hai guadagnato una A o quel corso e  ha guadagnato una B. Dovrebbe essere, da dove\nhanno iniziato gli studenti e poi dove sono finiti alla fine naturale del segmento. E riguarda quella crescita. Bene, quella crescita  tale che\ninizi a capire, oh, tutto  retorico, giusto? Torni da Platone, a\nSocrate, ad Aristotele, qualunque sia il caso,\ntutto  retorico. Ebbene, i nostri studenti ora si\npresentano a un mondo gigantesco, ma che\npu anche essere di nicchia, giusto? Come possiamo prendere queste cose che stanno imparando sulla\nstoria, sulla tecnologia, sull'ingegneria, sul\ncorpo umano, tutte queste cose diverse e dire che questo potrebbe applicarsi a campi\nche non esistono nemmeno. Questo potrebbe finire per applicarsi,\npotrebbe essere appiccicoso, giusto?  cos che funziona il nostro cervello. Dobbiamo inserire le informazioni nelle cose su cui abbiamo gi costruito delle strutture, in modo tale che ora sto combinando qualcosa che sto facendo in classe\ncon il trambusto che ho, sai, un negozio che faccio\nsul lato  o qualsiasi altra cosa, e anche a mio agio nelle mie preferenze\npersonali e, sai, e qualunque sia il caso. Quindi, ad esempio, se ascolto\npodcast su argomenti legati allo sport, ci\npotrebbe cambiare il modo in cui eseguo una\nsessione registrata per lo staff, perch mi piace il modo\nin cui introducono questo o quello  , sai, usa l'inflessione della voce l e quant'altro. Quindi il mio incoraggiamento sarebbe duplice. Primo, continuare ad abbattere\nquei silos per mostrare come tutta questa roba si inserisce\nin altre cose, giusto? E poi due, ce n' un po'\nproprio adesso a Khanmigo, in quanto riguarda la\nnavigazione tra le ammissioni al college e gli aiuti finanziari, sai, e poi anche l'aspetto della carriera. Quindi direi che\nti incoraggio a continuare a connettere gli studenti e\nci che stanno imparando o potrebbero imparare, e poi cosa. E quando pensi\nallo stato dell'Indiana, ad esempio, molto di ci che il dottor\nBuffington, io e il nostro team stiamo facendo qui  aiutare ad allineare\nci che gli studenti stanno facendo ora con credenziali impilabili di valuta, mostrando futuri datori di lavoro,\ncomitati di borse di studio,  eccetera, che ho padronanza di qualcosa\no competenza in qualcosa o esperienza in qualcosa. Lo vediamo anche con i badge digitali e cose del genere. Quindi, quando uno studente vede un percorso professionale,  intimidatorio perch\nil linguaggio utilizzato per caratterizzarlo potrebbe\nnon avere nulla a che fare con ci che realmente comporta l'occupazione. E/o le future occupazioni\nper cui potrei usare queste cose non esistono nemmeno, giusto? E quindi come possiamo provare\na unire questi mondi per connettere gli studenti\npresenti con il loro futuro a breve termine, cos come, sapete, le opportunit\nche esisteranno da allora in poi e di cui ancora non siamo nemmeno a conoscenza. - Adoro questo tipo di tema dell'abbattimento delle barriere tra gli argomenti, che penso sia ora\npi fattibile che mai. E poi anche tra\nscuola e mondo reale. Un'ultima domanda per lei, dottor Buffington. Andiamo avanti velocemente, non lo\nso, due, tre anni. Non deve passare molto tempo, ma le cose stanno cambiando molto velocemente. Pensi che tutto ci di cui\nabbiamo parlato cambier in qualche modo radicalmente il modo in cui\n la scuola, incluso, sai, non abbiamo nemmeno parlato di\ncose come la valutazione, a cui stiamo iniziando a\npensare da parte nostra. O pensi che sar semplicemente\nun bel supplemento all'architettura esistente? O pensa che in qualche modo questo cambi radicalmente la classe\n, dottor Buffington? - Beh, voglio dire, Tim lo\nsapr, dottor Krieg. Voglio dire, la mia filosofia era\nche, sai, durante il COVID, il panorama era\ncambiato per sempre, giusto? Voglio dire,  gi cambiato. Se non voglio venire\nnel mio istituto pubblico e stare seduto tutto il giorno, posso scegliere\ndi frequentare una scuola online e, sai, forse per me funziona. Penso che, quando lo guardo, non voglio vederlo come un supplemento. Voglio vederlo come uno strumento\nche , sai, utilizzabile ora, ma  anche in grado di\naiutarci in futuro. Sai, quando penso alle cose e penso alla\npreparazione per la carriera universitaria, e, sai, in questo momento posso lasciare che un ragazzo\nesca presto, si diplomi presto, e, sai, ho\nfigli che si stanno diplomando con una laurea in  la\nnostra scuola superiore in questo momento. Cosa vedo che potrebbe accadere qui? Vedo cosa vuole la gente dai ragazzi che si stanno diplomando adesso. Vogliono che siano risolutori di problemi. Vogliono che siano in grado di\ncollaborare e lavorare in squadra. Vogliono che abbiano alle\nspalle pratiche etiche. E penso che tu\nabbia gi il potenziale con questo. Ora la cosa interessante  questa, come posso dare uno stage a uno studente, e forse a Khanmigo c'\nun aspetto di stage in questo e conta per la sua giornata. Sai, il mio obiettivo \nreinventare la scuola superiore e come appare. E, sai, penso che\nquesto arrivi fino alla scuola media, alle elementari. Penso che ci siano cos tanti\naspetti diversi di questa IA che potrei esplorare. Sai, quando penso che i\nbambini vogliono divertirsi, non vogliono temere gli incarichi, vedo gi che quella parte  risolta. Vedo ragazzi che vanno l\nsolo perch lo vogliono e gli piace fare domande. Ed  quello che vogliamo come educatori. Vogliamo che facciano domande. E ne sono affascinati. E quindi voglio prendere quel\nfascino e svilupparlo. E se questo significa riprogettare\nil modo in cui facciamo scuola, allora dobbiamo farlo, giusto? E quindi abbiamo gi riprogettato e reinventato le nostre\nscuole superiori con l'universit anticipata e, sai, puoi ottenere\ncertificazioni di settore un anno di college, due anni di college. Non devi necessariamente\nandare cinque giorni a settimana. Forse non hai bisogno di andarci un'intera giornata. Perch puoi avere\nun'opportunit diversa. E se questa opportunit si\npresenta in questo modo, hai le credenziali per laurearti e forse anche per entrare nel mondo del lavoro o entrare in un corso post-secondario per esplorare ulteriormente ci che stiamo cercando di\nottenere con, sai, alcune credenziali post-secondarie che contribuiscono  al mondo. E quindi mi chiedo:\nesistono modi migliori, modi pi efficienti o\nmodi pi entusiasmanti e coinvolgenti per reinventare le cose che stiamo facendo? E penso che, come tutto ci che \nnuovo nel campo dell'istruzione, a volte siamo gli ultimi ad adottarlo. E allora perch? E penso che abbiamo iniziato a parlare di questo.  Ne hanno paura. E non puoi averne paura, devi abbracciare cos' il futuro. E quindi penso che ci\nsar una certa adattabilit quando parli di\nsupplementi, giusto? Voglio dire, quindi in questo momento\navrete i primi ad adottare che fondamentalmente prenderanno qualcosa che hanno nella loro\nmappa del curriculum e diranno: \"In che modo l'intelligenza artificiale mi aiuta?\" \"Come potrei usare Khanmigo?\" E poi\ninizierai a vedere alcuni pionieristici in cui sar come, whoa,\nnon lo sono, non  un sostituto. E li vedrete\niniziare a usarlo in un modo che lo migliora ancora di pi, e non si sostituir come hanno fatto loro. E sta spingendo i bambini\na crescere e imparare e forse ad avere l'idea\nche potrebbero curare qualcosa. Sai, mi piace il fatto\nche questa sia una generazione a cui piace risolvere i problemi. E diranno: \"Che ne dici di questo?\" Oppure: \"Che ne dici?\" E penso che questo abbia\nil potenziale per farlo. Quindi, se ho uno studente e, sai, per parlare di quello di cui stavamo parlando, metteremo i ragazzi in un corso di biomedicina e poi li faremo confrontarsi con il programma di ingegneria, perch stanno pensando a una cosa e  queste sono le persone qui che possono davvero costruirlo per te o aiutarti con i tuoi\ncalcoli o altro. Quelle barriere sono rotte. E vedo che la scuola superiore\nviene totalmente reinventata dando ai ragazzi l'\nopportunit di applicarlo in un contesto del mondo reale. E quindi penso che ci sia spazio per questo, e qui ti dar solo\nun concetto di, sai, che l' Indiana sta facendo qualcosa con i\nconti delle borse di studio per la carriera.  Si chiamano CSA. Ed  davvero pensato per inserire i\nragazzi nel mondo del lavoro, nell'apprendimento e nei tirocini basati sul lavoro. E sono gi sul punto di chiedersi come sarebbe un diploma di scuola superiore con un ragazzo a cui diamo questo CSA? Ed  davvero tradizionale, come se dovessi avere 40 crediti\ndi questo e quello e quello. E stanno iniziando a capire che, beh, forse non ne hanno bisogno. E forse, solo forse,\nsaranno qualcuno che inserir nel mondo del lavoro che abbia un po' di know-how\nnell'uso della tecnologia in modo appropriato, e troveranno una soluzione per qualcosa che hanno faticato a trovare. Penso che il potenziale ci sia per questo. Penso che vedrai i\nprimi utenti che integrano, sostituiscono e poi trovano cose nuove. E poi penso che\nvedrai i bambini dire, potrei fare questo, potrei fare quello. E dovremo riesaminare\nil modo in cui stiamo offrendo per consentire la crescita, se ci ha senso. - Ha molto senso. E, sapete, potrei parlare\ncon entrambi per ore, soprattutto di questo argomento,\nperch  cos affascinante. Ma adoro quel tipo di\nspinta finale in cui, sai, si rompono tutti i confini e in realt riceviamo sempre le nostre idee, idee per le attivit da te, dottor Buffington. E in un certo senso hai rafforzato qualcosa su cui stavamo facendo un brainstorming, ovvero cosa accadrebbe se ci fosse\nun'attivit per studenti, o insegnanti o chiunque altro, per risolvere i grandi problemi del mondo. Sai, hai bisogno di noi,\ndevi affrontare il clima, vuoi capire\ncome posso, da studente, iniziare ad affrontare il cambiamento climatico? Come posso, da studente,\niniziare ad affrontare la ricerca sul cancro? Come posso, da studente,\niniziare ad affrontare, non lo so, qualunque problema nel mondo\ntu pensi debba essere risolto. Molti studenti vorrebbero farlo, ma non sanno da dove\ncominciare, quindi dove andare, quindi mi piace anche questa idea. Beh, grazie a entrambi ... E Sal pu, Sal posso\nsolo menzionarlo in termini di ci che hai appena detto e di\nquanto sia importante, e loro cercano di risolvere le cose\nche sono cos importanti per loro. Quindi durante il COVID, uno dei miei\nstudenti stava cercando di capire come avere un migliore\nsistema di check-in con i sintomi al pronto soccorso. - Hmm.\n- E perch. Voleva che li informasse che devi ridefinire le priorit su\nchi si trova al pronto soccorso, perch suo nonno  morto di COVID. Quindi ho avuto questo piccolo\nimprenditore innovatore, e abbiamo spazi per i maker\nqui, facciamo, sai, facciamo fiere dei maker, abbiamo, e abbiamo spazi STEM ovunque. E la sua creazione  stata, e ha lavorato con gli\ningegneri dell'ospedale sui sintomi e su dove si trovano, e su come dare la priorit a chi\nvedrai per primo, perch era cos reale per lei e per te. Sapete, quando si\nparla di cambiamento climatico, di cose che contano davvero per loro, passano tutto il giorno. Questo  il tipo di studente\nche non va a letto perch  l fuori\na cercare di capire dove sono le informazioni,\nche tipo di strumento, che tipo di strumento. Frequenta il corso di biomedicina, scende al corso di ingegneria e stanno creando un palmare, che si sincronizzer\ncon gli orologi o qualsiasi altra cosa in ospedale, per cambiare\nla priorit del tipo, chi devi vedere adesso? E penso solo che i nostri figli\nabbiano questo potenziale, giusto? E quindi, indovina un po', questo non \nsuccesso nella sua classe,  successo fuori dalla sua classe, ma lei ha portato in classe che deve esserci un modo migliore. Giusto? E quindi penso che questo\napra tutti i tipi di strade a domande o problemi\nche vogliono risolvere, e d loro un buon inizio e li far desiderare di\nandare avanti. Sai cosa voglio dire? E penso che sia questo il bello.  cos coinvolgente che non vogliono fermarsi al 100%. Non potrei essere pi d'accordo.\n- Sal, se posso. Solo a nome di entrambi,\nsai, grazie per, sai,  quello che hai fatto, giusto? Hai iniziato identificando\nun problema, un bisogno, giusto, che era personale per\nte in senso familiare. E hai fatto un sacco di\ndomande e hai aperto la strada, e poi, sai, eccoci qui, giusto? E quindi la nostra speranza  che, per quanto \nnoi tre siamo appassionati, ad esempio, dell'istruzione e, sai, di Khanmigo, e semplicemente di modi diversi per\ncercare di aiutare i nostri studenti, sai, ad essere in missione, ad essere in grado  per perseguire le proprie passioni. Se possono avere lo stesso tipo di passione per le cose a cui sono interessati, e noi stiamo unendo le possibilit in cui possono perseguirle, allora, sai, l'istruzione potrebbe sembrare diversa,\nma l'aspetto fondamentale, sai, la vera Stella Polare rimane la stessa. Giusto? - 100%.\n- E poi lo facciamo in\nmodi diversi, sai. Ma il perch  ancora l. Il denominatore  ancora l. E questi sono i nostri figli, questi sono i nostri studenti. E quindi solo grazie, penso, a nome di entrambi,\nper aver sostenuto questo. - No, beh, grazie a tutti\nper aver preso parte a questa cosa. - Oh, ehi...\n- Per essermi preso un po' di tempo. - Questo.\n- O si. - Questa  stata la cosa migliore di sempre. Voglio dire, non ti sto prendendo in giro. Potevo sedermi e parlare con\ngli insegnanti e i bambini che lo usavano. Potevo sedermi con loro tutto il giorno, e io, e loro mi mandavano\ncose che stavano creando da Khanmigo, e lo adoravo e ho altro lavoro da fare, ma volevo leggere cosa ne\nstavano facendo. E, sai, penso, solo complimenti e grazie per averci\nincluso nel pilot. Penso che saremo\npionieri nell'uscire e parlare alla gente di come, sai, come rompere le barriere\ne come usarlo. Ma non  possibile farlo\nsenza dare alle persone un primo avvio. Giusto? E lo avete fatto, e\nvi sto solo dicendo che  affascinante sedersi e\nparlare con questi insegnanti di come pensano che lo useranno in seguito. E quindi grazie per questo. Hai preso qualcosa di cui penso che avessero tanta paura, soprattutto gli insegnanti di inglese. E non ne hanno paura. E quindi sanno come\naffrontarlo. Sai, hanno parlato con la nostra segretaria\nall'Istruzione, Katie Jenner, il che  interessante perch\nhai parlato con Katie Jenner e lei ha detto: \"Ehi, voglio\nparlare con quegli insegnanti\". E cos l'abbiamo messo in fila e\nanche lei ne  rimasta affascinata. Quindi hai preso qualcosa e\nci hai fornito uno strumento davvero valido da utilizzare nell'istruzione. E per questo ne siamo grati e non vedo l'ora di vedere la prossima versione. - No, siamo emozionati e\npenso che questa sar una delle tante conversazioni nei prossimi mesi e anni, mentre affronteremo questa avventura insieme. Ma grazie perch sapete, ovviamente possiamo fare tutto questo lavoro, ma se non serviamo i bisogni dei dirigenti scolastici, degli insegnanti e degli studenti, allora perch lo stiamo facendo? Quindi significa molto\npoter collaborare con tutti voi. Grazie a tutti. - Grazie, Sal."
}