{
    "source": "q4ZIbxLYG5U",
    "youtubelink": "https://www.youtube.com/watch?v=q4ZIbxLYG5U",
    "t_english": "- Hi everyone, my name is Danielle Sullivan. My role at Khan Academy is I'm the senior manager of Northeast District Partnerships, and my educator former role is I used to be a fifth and sixth grade special education teacher. I taught ELA and math in Washington DC and upstate New York, and I will let Sarah go ahead and introduce herself. - Hey everyone, welcome. I am Sarah Robertson. I'm currently the senior product manager of literacy and classroom experience teams here at Khan Academy. Just like Danielle, I'm a former classroom teacher. I taught middle school ELA, and brief stint as a history teacher, but mostly reading and writing. And I also am coming from another literacy focused ed tech company, I think Danielle also joined us from another one as well. And I will pass it off to, let's do Diona. - Hello, everyone. I am Diona Clingman. I am a professional learning specialist with Khan Academy. Just like my colleagues that are on the panel with me, I am a former classroom teacher. Elementary is where my heart is. I have taught second grade, third grade, and fifth grade. I've done behavior intervention. I've been a building principal, as well as director of academics. So been in all levels, definitely understand and love connecting with other educators. And with that, I am gonna pass it over to Bernadette. - Hi, I am Bernadette Bennett. I am a professional learning content specialist with Khan Academy. I am a former middle school teacher and district social studies supervisor from Florida, and I am so excited to be with you guys today. - Great, so here's how this is going to work. We, I'm gonna stop sharing my screen because the focus is going to be on the conversation. So we will be having some really rich, interesting conversation around transformative role of AI and improving literacy scores, because as you know, I'm sure you're feeling this, a lot of students have felt left behind after COVID, especially in literacy. I mean, I would say math too, but today we're focusing on literacy. So we wanna delve into and just have a, like a really in-depth conversation around how you all can start to think about AI's adaptive learning, personalized feedback to help students improve their reading and writing skills. And actually, just let's talk about a little joy too, right? Love literacy. Though we're just, we'll be talking, please post comments in the chat and questions in the chat. I'll be able to see those, and we are going to kick it off with this question. So, Sarah, Khan Academy isn't often thought of... Khan Academy isn't often thought of as like a go-to tool for literacy instruction and support. But here we are, we are doing a literacy and ELA webinar. So, what has changed? - Yeah, so I actually joined Khan Academy about a year and a half ago, which was right around the time that Khan Academy had partnered with OpenAI around how we might use large language models in order to create really rich learning experiences. And so on my first day at Khan Academy, my manager sat me down and said, \"By the way, we have this partnership with OpenAI, have you heard of ChatGPT?\" And I had just come from another literacy supplemental EdTech tool product, and was, you know, had literacy on the mind, was very excited to come to Khan Academy knowing that there were opportunities to build new tools and content for literacy. So this was, it felt like a sign that like I had come at exactly the right time, because what we were seeing with many of our different explorations we were doing with ChatGPT and the large language models that they were, that we were experimenting with was that some of the best experiences that LLMs could support were related to reading instruction and writing instruction. And so we dove headfirst into the different ways that we could leverage AI to create really innovative, rich learning experiences for students when it came to reading and writing. The very, you know, first month I was here we did a hackathon, and one of the features that came out of that was our current essay feedback activity, which I'll talk a little bit more about later on. But I'll also just say that the more that we at Khan Academy have partnered with districts over the past few years, the clearer it is to us that the demand for high quality and flexible resources for ELA is higher than it's ever been. I think, again, just coming out of, you know, the pandemic and coming into this age of AI, reading and writing classes have been disrupted and we need to be thinking of like really creative, innovative ways to be reaching students now in a way that's maybe a little bit different than, you know, when I was actually in the classroom and definitely when I was a student myself. So we're really excited about some of that, of those new activities we're building. We also are launching brand new ELA courses for middle school and high school starting, I think we just launched the 6th grade one already, and we'll be launching I think 9th and 10th grade as well for this back to school season. So it's definitely a new age, a new era of Khan Academy, and we're really excited about the new reading and writing resources that we're building. - Yes, and how many of you who are watching this sometimes have struggled with supporting your students in writing? Anybody, anybody feel that pain? That would be me. Yes, facts, exactly. So the goal is how can we engage our students to be more thoughtful in the way they express themselves? So I wanna think through, it's been a rough couple of years, can you believe it's '24 by the way, 2024? We're just thinking about students that are graduating this year, they started in 2020, so, whew, there's a lot that's happened in the last four years. So thinking of the last four years, Diona, how can AI be leveraged to address some of the gaps that we're seeing exasperated by the pandemic, or learning opportunities if we wanna spin it the positive way? - Yeah, absolutely. I am not only an educator, but I'm a parent, so my daughter is a senior this year, and so some of that personal impact of the pandemic not only, you know, has affected me not as a educator, but also as a parent as well. My mind when I think about AI and how we could use it to help leverage some, help with some of those gaps is my mind goes to that targeted instruction. You know, the bigger the gaps, the more of that targeted instruction that you wanna give to your students, right? But I also know that, you know, it's easy to say targeted instruction or small group plans, what do you wanna do with your small groups? But in reality that's a whole nother set of planning, right? So I'm thinking of the, of that small group planning. And so when I think about AI, I think about some of these tools that we have, such as the ability to just use Khanmigo to, one, just add to help group your students. You know, it's helping you with grouping your students. It's even being an assistant to you to even, you can just ask it, what do my students need to work on? So cutting that time out with that small group planning, just by having that in the moment support as a teacher to know how do I group my students, and what are those things that, you know, they should be working on? I also think about the social emotional approach, right? Thinking about that whole child and addressing those needs. And we know that one of the things is are students even safe with, feel a safe feeling as though I don't know, right? I don't know what's going on, and so students having that ability to discuss and ask those questions with Khanmigo just to, even when you're thinking about text analysis, right? Help me understand, I have a question about this text that maybe they don't wanna ask out loud in front of their peers, and so just leveraging it in that way I think is just one of many. - Yeah, absolutely. I mean, all of what you said, the small group instruction, again, how many of you watching have ever struggled with small group instruction? I see you middle school educators, I see you high school educators, right? We know that this is really important practice. So Sarah, can you talk to us about your point of view or some things you're thinking about with post-COVID years? - Yeah, so I, I mean, I taught in a classroom where students ranged, I taught in a seventh grade classroom for most of my time in teaching, and I had students who were on a second grade reading level to 12th grade reading level, all the way in between, just a very wide span of skill levels. And a lot of my students struggled with fluency and comprehension, or mixture of both. There were all kinds of different needs across the entire room, and I know that one of the best things that we can do for students who have gaps in reading comprehension skills specifically, which I would say for my seventh graders was the biggest challenge, was really making sure, A, that they had access to grade-level text. Way too many students do not even get the opportunity to try and, you know, access and read a grade-level text, but knowing that so many students are below grade level, how can we scaffold instruction and how can we create opportunities for students to be able to, you know, fill in what's missing in between? And some of the best strategies for doing that are related to pre-teaching and pre-reading prep, which means and looks like activating prior knowledge, making connections to what the text is about, building background knowledge for any of the schema that the student needs to have when it comes to what the text is about, whether it's fiction or nonfiction, pre-teaching tier two and tier three vocabulary, and giving students opportunities to practice and get to know words they may be unfamiliar with. And then of course supporting them when it comes to breaking down complex sentences, and one of the really cool things about having an AI presence around to help students with this and help teachers with this is that many of these things are now extremely easy and quick to do with AI. So when you think about, you know, activating prior knowledge or making connections, all you need to do is go to Khanmigo or any AI tool and have it look at the text and identify, you know, questions and different engagements, tactics for getting students to think about what this text means to them or if they have any kinds of connections to the theme or the characters in the text. Identifying what background knowledge is necessary to be able to understand what the text is about and pre-teaching that, having Khanmigo summarize that for students or ask the students questions about what they already know or what they wanna know, identifying and having Khanmigo even identify from a text what vocabulary words a student likely needs to know in order to be able to comprehend something. And then using some of our pre-built learner activities like word safari and word architect to practice some of those different words before they even get to the reading piece. And then when the student is actually reading a grade-level text, having Khanmigo there on Khan Academy to support them if they run into something that's really complicated or hard for them to parse, it is a, you know, a judgment free... Not person, but AI to- - Support. - To support, yeah, to go to when they are stuck and when they really don't know, you know, even why they don't understand something, they can go there to ask questions. Another really helpful activity that I would recommend for students who are below grade level is we have this teacher tool with Khanmigo called the text re-leveler. And obviously, like I said before, it's super important that students don't just get, you know, texts that are far below grade level for an entire school year. It's really important that they do have opportunities to access grade-level text. So one of the best ways to use the text releveler is to re-level a text that's at grade level for students, re-level it down, you know, a couple of levels, and then have Khanmigo take that re-level text and re-level it back up again to where it was before. And then have students look at all three versions, have them look at the easier version that the AI releveled down, and that will help them kind of get a baseline understanding of like what the text was about, have them look at the releveled up version, and then have them compare that to the original text and look at what did we lose, you know, when the AI took this text and releveled it, what changed, what aspects of author's craft, or, you know, different linguistic elements changed, and how did that affect the text's meaning? So there are many kind of different and creative ways that you can use AI not only to just, you know, get students accessing grade-level materials more easily, but also to create kind of fun and engaging learning experiences. - I mean, you said so much, Sarah, a lot of really amazing gems, but I wanna hear Bernadette's spin, because Berna, you have a little bit of a different perspective and a background in social studies, and some of what Sarah was sharing is from vocabulary and seeing authentic text and making sure that students have the ability to access rigor text. So I'd love to add some color and context from your point of view on how you see that we can help close these gaps. - So, when I think about social studies teachers who are also working a lot with vocabulary and with reading and primary source documents, so many times when students are looking at primary source documents, you know, they're looking at some archaic vocabulary, they're looking at sometimes a cursive document. So you can use AI to focus in on those primary and secondary source documents, you can have AI modify it, but still have that original document right there next to it so that a student will see that original document, what it looks like at a different grade level, but always be able to go back and reach into that original document, reach into that original vocabulary and help students understand, you know, the nuances that were put into that original document, as Sarah said, that might just be missed when we have a document that is not, that's not been modified. But the whole key when we're looking at disciplinary literary and social studies literacy is ensuring that students are looking at that original document, so being able to take that original document and have them be able to access and understand those concepts is really important as you pull it all together. - Thank you, so there's some chatter in the chat around what the heck we're talking about. I'm gonna give you a resource at the end or QR code to find out more, but there are links in the chat. We are talking about, first and foremost, we wanna just have a great rich conversation about literacy and post-pandemic, and how we can leverage AI tools. But we do have some really great AI tools as part of Khan Academy that you can absolutely find out more when you find the link in the chat, but I want us to really dig into more reading and writing, because as somebody said, preach in the chat, struggling to get students to really engage with meaningful writing. I mean I, my students as a former special ed teacher, they had a fear of putting anything on the page, can anyone relate? Them just getting started, not having idea generation, and it was really difficult because I was full inclusion, so I was trying to support so many students in a sixth grade ELA classroom, and help my students, as Diona was talking about, feeling safe, feeling validated. So, how could personalized feedback enhance students reading and writing abilities? Diona, let's kick off with you, and then we'll circle back. - Yeah, absolutely. Again, I think about that safe space, right? Just feeling okay with, you know, being able to speak in front of everyone, or being able to know, am I writing or am I writing the correct sentence, or just getting them comfortable. So I like the fact that we have, for example, like the tutor me tool with is tutoring me in humanities. And so students have the opportunity to either get quizzed on certain skills, and again, it's that safe space. I just, I keep going to that because I know a lot of my students came to me with not a lot of prior knowledge. We talked about that before, and so when it came time for those class discussions, what did some of them do? Behave their way out, right? Or they might just shut down because they don't want to, they don't have anything to contribute to the conversation. So having tools such as like tutor me, you know, in humanities where you can ask those questions about the text prior to, or even during, you know, as the teacher, if I had it in my classroom, I would definitely model for them and create opportunity for them, create opportunities for them to, you know, answer specific questions, go, you know, reach out to Khanmigo. Ask Khanmigo, you know, why this is happening, and then that'll give them that context. The other cool thing about it as well is for those students that may have those kind of issues with reading that, you know, reading fluently may be an issue, Khanmigo can speak to them. So they can have their headphones in, and it almost feels like an actual conversation because what happens is, even if, you know, if typing is not my strong suit, like you were talking about for some of your special education students, you know, you can speak into Khanmigo and say, you know, \"Hey, why is this happening?\" Khanmigo's gonna generate it, and then it has the ability now to talk back to you. So if typing and reading is not a student's strong point, they're able to now feel more empowered because now it's almost like having a conversation like you and I are having in this moment to help them, you know, get stronger in those skills. - Absolutely. So Sarah, what are your thoughts on this? - Yeah, so I mentioned earlier one of the first things that we started exploring when we were dipping our toes into the AI pool was essay feedback, so I taught both reading and writing. At the school where I taught, they were separate classes and writing was a lot harder. I think that teaching reading for the main reason that the feedback piece is just such a challenge if you have more than, you know, 20 students in a class, which I think most teachers do. And so the way that we designed the Khanmigo academic essay feedback activity was a way for students to get instant high quality feedback that was actionable and organized by, you know, specific feedback area without having to wait for, you know, days or even weeks to get any kind of information back from their teachers. And so the way that it works is that a student submits their essay draft as well as information about the essay as it was assigned by their teacher, anything related to the essays genre or the grade level that they're in, and then we put the essay through all of these very, very meticulously configured AI prompts that generate feedback in five different areas, and then students can kind of navigate between those five different areas. If they click on a piece of feedback, it will highlight what part of the essay it's talking about. The student can then also chat with Khanmigo about that piece of feedback and say, \"I don't understand what you mean, can you explain this?\" Or, \"Can you give me an example of, you know, you're telling me my thesis isn't very strong, can you give me an example of what a strong thesis looks like?\" And it will do that without actually giving them any of the writing for the essay itself, so it's programmed in order to prevent students from using AI to cheat. And the best part too is that students can then update and revise their essay and ask Khanmigo, \"Hey, what does it look like now? Like, what do you think now?\" And Khanmigo can look at the feedback that the student's referencing and the edit they just made and say, yes, like, you know what you just did. You check the box like that looks great, or it can say, you know, \"I think you still need a little bit of work here,\" and it's this safe space for students to get follow-up support, they can ask for more help. And as a teacher, again, I just remember like being in a classroom where, you know, sometimes I would have like a sea of hands in the air where kids were just like, \"I'm stuck.\" Or they had, you know, it was maybe a student who was just like, \"Can you read the sentence?\" And every time they wrote a sentence they'd be like, \"Can you read the sentence?\" And then there were other students who just had their heads down, or the ones who usually needed the help the most didn't have their hands up at all. And the best part about this is that it empowers the students to do, to ask Khanmigo for help when they need it, but it also allows Khanmigo to do some of those checks for students even if they are not asking for it. So one of the things we're working on now is called Writing Coach, which builds upon the essay feedback activity, and it actually walks students through the entire essay process. So that one in particular really targets those kids who are just feeling really stuck, feeling really disengaged, like feeling like they don't know where to begin. And we're excited too about the implications that Writing Coach will have on our ability to report back so much more about student writing to teachers. Right now, you know, teachers often see the final draft, maybe a first draft if they can manage it, but with this kind of AI activity, we can synthesize a lot of these interactions and report them back to the teacher, including things like, \"Hey, you know, this student just pasted 500 words. It's not from their outline that I helps them work on.\" Maybe you should, you know, click on this and drill down and see, see what happens, so lots of really exciting new Khanmigo features coming for writing this fall. - Lots of new exciting things. Can we just pause and just let this marinate for a second? How many of you watching teach writing? I bet you all do, because we're teachers. And any ELA class, any literacy, if we think about reading is breathing in, writing is exhaling. Getting students to be able to explain their thoughts and to have a tool that really supports students. I mean, Bernadette, how many times did you have to read essays on all the things? And what happens if students don't cite it correctly, or if they try to make up facts? How do you think AI can help with that? - So, there are a couple of things that we can do. First of all, before we even get to that sighting, kids have to be able to know, you know, where do we start? And so sometimes using tools like chatting with a historical figure or chatting with a literary figure are great ways to get kids to start thinking about topics. So they can chat with a literary figure or historical figure, ask them about claims and evidence, what do they think? And they can go and develop those arguments. The other thing that Khanmigo does is it does debates. It does debates at the elementary, the middle, and the high school level on specific topics. So if a student is having trouble trying to figure out a claim or evidence or an argument, starting with one of these and giving them that practice with Khanmigo to develop those themes is a great way to get them started in that writing process. I think so many of my middle school students, and, you know, teachers that I worked with at the high school level were always, \"How do we get my kids started?\" And this is a great way to get your kids started. And again, there's lots of ways to look at that when we come back around and start looking at, you know, how do we make sure that they're citing correctly, how do we make sure we're doing that? Khanmigo can help with that as well, and that's also a good check. It's important for students to understand what it is to cite, what is plagiarism, how do you cite AI? How do you cite that you used an AI tool in your paper? And that's an important piece that so many times, well, you know, if I co-wrote it, well you know what, it's like having a co-author. You have to write it together and you have to be able to explain that to your teacher. So being able to use these tools at all areas of the writing piece, and again, being able to zoom in on things like claims and evidence, or being able to zoom in on argumentation depending upon what kind of writing they're doing and what kind of testing they're taking. Because when we start now looking even at some of our AP and IB and ACE exams, they have to be able to do that as well, and this is great practice for all levels. - Yeah, and this conversation's making me wanna go back and teach essays, which I wasn't very successful at, let's be honest. Well, so a couple people are chiming in the chat, really excited about the writing coach. Really excited, yes, we are gonna send the recording to everybody, so you get a care package by signing up for the webinar. You are welcome, and part of that care package, not to get that excited, it's just a recording and some resources. But speaking of resources, speaking of cha, I'm segueing really randomly, I'm gonna into challenges, opportunities. I'm excited about a lot of things. \"I wish I could have had a really long conversation with, you know, Jay Gatsby.\" You can now through Khanmigo, but I couldn't back then, but what are some things you think people will be nervous to implement? Diona, why don't you kick us off? Some maybe opportunities or the challenges. - Well, I think one of the things like a lot of, like with other AI, the cool thing about Khanmigo is students don't have an opportunity to go to Khanmigo and say, \"Write my essay for me.\" Khanmigo is a Socratic tutor, and so because of that, Khanmigo's gonna come back, and I think Khanmigo has like the best personality, or if that's what you wanna call it, but it has a little personality because it's gonna say, \"Yeah, but as your AI tutor, I can't write your paper, but let's think about this topic.\" It always brings the student back, so it won't be, it won't just do the work for them. That process, especially in writing, writing is a process, right? So, you know, no matter what, you know, students still need to be able to speak to how did I come up with this idea? You know, what edits did I make? It's one thing, it just on one day, you know, just yesterday you were only writing two sentences, now today you can do a whole dissertation? Like, you know, it's so you still have to make students, students still need to be able to speak to it. So I think this is a great opportunity to still hold students accountable, but still have them have an assistant without it just doing the work for them. I think one of the challenges that, you know, we're finding too is having to coach students on having these conversations back and forth with Khanmigo. You know, it's one thing to say, \"I don't understand, you know, this specific topic, you know, that we're studying,\" but students are still having a mindset kinda that Khanmigo is a search engine, and it's not. It's more so ask it to simplify, ask it to clar, you know, clarify for you what do you mean by this? You know, what does it mean to analyze this text? Or, you know, any having those conversations back and forth, that's, you know, one of the challenges, but you just have to make sure you're coaching your students and modeling for them how to, you know, have a conversation back and forth with Khanmigo. It's not a one and done. - Correct, and AI is meant to enhance the human intelligence, human experience, right? Because we want to still bring talking back into our classrooms. I just did a Justin Timberlake reference for y'all. So, Sarah, when we think about challenges, right? I mean, in thinking about the human experience, what are some of your thoughts on that? - Yeah, I agree with, you know, everything that Bernadette and Diona have been saying. I feel like there's this common misconception that AI equals chatbots, and, you know, it's probably the most commonly known format for interacting with AI right now that teachers are aware of, but I don't think that we should be thinking about integrating AI into literacy classrooms as just finding more ways for students to chat with AI. I actually, I mean, when I think back to the best moments as a teacher in my reading classrooms, in my writing classrooms, it was the moments where we were talking together and with each other, with our peers and groups about books and about, you know, big themes, important characters, and all kinds of like, you know, just the rich experiences that you have when you are writing and when you are reading something together. And one of the things that I want people to come away with is this understanding that bringing AI into literacy classrooms doesn't mean taking that time away where we're connecting with each other and we're talking with each other, I think it has more to do with enabling teachers with better tools to generate like really creative learning experiences and materials, and helping students with the hard parts of reading and writing that are often experienced independently anyway. So that experience of, you know, reading a paper that your teacher's marked up, you know, that doesn't have to be such an isolating experience, and we know that every teacher doesn't have time to sit down and do that every time with every kid. And then same thing with reading, you know, oftentimes there's moments where you might get tripped up when you're reading something, and we don't want that to, you know, dismantle this whole classroom experience of being able to discuss a book and what it means, and those are the experiences that I think AI can help with a lot. And then again, just making it a lot more, a lot easier for teachers to have access to a creative partner, to something that can help them plan projects or class discussions, give students an opportunity to, like Bernadette mentioned, chat with a literary character from a book they're reading, but then talk about it as a class, like discuss with each other, \"What did we think of that experience? Like, did it feel authentic? Like, what about the AI seems like it might have, you know, gone against what the author intended in the book that they wrote, and why?\" Like, that's a really wonderful jumping off point for an essay they could write. So, there's so many ways that you can integrate AI into classroom experiences that don't necessarily, you know, keep students just isolated in front of their screens. I think the best use case that we can all drive toward is ways that we can use AI to actually encourage more learning experiences that are collaborative and communal, because again, like that I think is where all the joy comes out. And I think if we are able to get AI to help more students access, you know, rich and grade-level appropriate texts, then I think we could see a lot more opportunities to have that kind of class discussion and engagement. - Absolutely, and I would love for us to take a minute, and really, we have been wearing our teacher hats, but I want us to put our teacher hats back on, and I want you to think about what was maybe something that was really challenging for you when you were teaching, you know, social studies, literacy, for me, special education, that this tool could have helped immediately, like solve that pain point? Bernadette, what about you? What's something that maybe you were like, \"I wish I had this.\" - I wish I had this, so I think there, I think there are so many levels to that, because the Khanmigo teacher tools are so varied and so diverse. I think that there isn't enough time in a webinar to really go over all of those, but some of the things that when I think about it, you know, as a teacher, I always wanted to make sure that my students were accurate and that we were ensuring accuracy. And I know when I first, you know, thought about AI, you know, it was the wild, wild west, you know? It was this AI coming in and writing everything for my kids, and it was none of their own original work, and that to me was probably the biggest pain point and fear when I started thinking and looking into AI. What I absolutely love about Khanmigo and Khan Academy is the fact that that's not the case. This is your student's original work. When they're working with an essay generator, the students have to put in their own thoughts and ideas and develop their own characters. Khanmigo can help them expand that and update their vocabulary and help them look at those juicy sentences and juicy words, but those are the places where when we start talking about ensuring that accuracy, it's student generated work. It's not, \"I threw in a topic and, you know, this essay was spit out for me,\" and I think that that's really, really important as a teacher, and that was always my fear with this. I think the other thing is that whole feedback piece. You know, when you've got a class of 20, 25, 30 or more students, how do you give that individual feedback on a regular basis? I would love to say I did that every day with every single student, there was no way, there was no way. But with Khan Academy and with AI and with Khanmigo, a teacher can go in and say, \"Okay, I want you to put your essays in. I want everybody to look at your own introductions and do it and talk through,\" and then even have a class discussion about the feedback that they got from the AI from Khanmigo regarding that introduction or their conclusion or their claims, whatever those pieces are. And it's now a student is getting that individual work, and even when they're at home, maybe they're writing at home, or maybe you're working with a small group and the rest of your class is kind of sitting there, this is an opportunity for your students to get that one-on-one when you physically cannot do it. Which, unfortunately as teachers, ends up happening, and especially if they're taking work home and writing from home. You wanna make sure that they're not, you know, just getting an AI to do it, because when they do put it in the essay checker, AI is gonna look at it and go, \"Hey, you know, are you sure? Where did you get this?\" And that's something that is important as a teacher for me to know that there's accuracy there and that they're getting feedback, and they're getting good feedback, and it's on their work. - Yeah, last time I checked, we still can't clone teachers, so this is a really important way to be able to do that feedback. Diona, what do you think? What would be your? - Whew, there's a couple. Right, there's a couple. The rubric generator. The fact that I can, you know, I used to spend so much time going online trying to find rubrics, you know, that align with, you know, the writing that we're doing, you know, for my students. And then sometimes, you know, it was a PDF, so I couldn't go in and make any kind of edits to it. And so the fact that there's an actual rubric generator, you know, to help with, help my students with writing is amazing. The other one that comes out to me as well is the fun class summary poem. You know, when I think about my students and, you know, you wanna wait to kind of wrap up that lesson, right? You might have, you know, just been talking about main idea. My students used to love rap music, so poetry and rap, you know, they kind of go hand in hand. And so I think it would've just been so cool to, because I'm not a lyricist, I can't come up with, you know, quick things like that, and then also include maybe even incorporating things that they like, you know, in this fun class, this the fun class summary poem, because the students have to give you feedback of, \"What did we learn today, give me some ideas.\" And then it generates and it wraps up the lesson into this nice summary like poem. And I think that, you know, it would've just been a fun way to close out that lesson. For me, it was also hard, you know, if your students say, \"Hey, I like 'Fortnite,' or I like this game or that game,\" I only knew it because of them, but something right now, being able to generate and talk about those things without me having to go and interview a kid or take some more time that I don't have away from my planning to research this on my own, to me is amazing. So I just really wish I had that rubric generator, and like I said, the funny class summary poem is would've been one of my go-tos. - That's amazing. So we are just rounding out our time together, but I want, I'm just gonna have Sarah have the last word. Let's think forward 5, 10 years in the future. What are your dreams and hopes for literacy instruction? What kind of utopian world could there be knowing what we know now? - Yeah, that's a great question. So, I mean, my mind is like spinning with all of the different ways that the current tools we have and the current technology we have could have helped me in the classroom, and the hours I spent, hours and hours and hours doing things that AI can now do in seconds. I think one of the challenges though is, you know, like, I've learned now in my role here at Khan Academy how to be a fairly decent prompt engineer, which means I know how to talk to AI to get it to give me the things that I need, but not all teachers have those skills. And one of the benefits of the Khanmigo teacher tools, which all of you can go and sign up for right now on the Khanmigo dot AI link that I think we've put in the chat, but one of the benefits of those tools is that you don't have to be a skilled prompt engineer to do many of these things. But thinking forward to the, you know, the next five years or so, it's hard to predict where we're going. But I am imagining even more kind of like custom flexible tools that are designed specifically for ELA teachers. A lot of our Khanmigo tools now can be used by any subject, but I'm really excited about some of the things that we are, we have in the works for reading instruction and reading comprehension where teachers don't have to, you know, do much of that front work to prep. I just remember it took so long for me to find a text that I wanted to use, and then prepare that text for my students in order for them to access it with the scaffolding and the questions and all the different ways we would discuss it. So I don't even think that's five years, I think that's like six months from now on Khan Academy, but just like freeing up so much more teacher time. And when I think about it from a student perspective, just calling back to what I was talking about earlier with these just like rich classroom experiences where students are not focused on what's happening on a screen necessarily, and maybe the technology is there to provide support where they need it, or to, you know, be a partner when they need one, to motivate students. I think there's some cool things that we're dreaming up right now when it comes to, you know, student engagement and gamification and student motivation that we can use AI for. But yeah, I think the future is just let's bring students together more, and let's bring teachers, let's make teachers more of, you know, a facilitator of learning versus just these task masters that are just having to do so many things, all at the same time usually. So I think that there's just a lot of really, really exciting, fun, innovative, rigorous, differentiated experiences that we're dreaming up here that will hopefully just make, you know, reading and writing classes that much more powerful and exciting for future learners. - Oh, hear hear, who does not want to have more of that in your classroom and save some time? Anybody, anybody? Of course you want some time saved. Speaking of time, unfortunately, that is all the time we have for today. Thank you to my amazing panelists for sharing their insights and thoughts from their classroom experience, and I just wanna point out that we want to continue to work with you. If you wanna work with us, I mean, a lot, we offer, you can go right now and sign up for Khan Academy, but if you wanna have a deeper partnership, we do offer something called district partnerships where you get a success manager and tailored professional learning that meets your needs. We can even help you with data analysis for MTSS, all the things, district tracking boards, you name it. We'll have it with the data when it comes to understanding where your students are with Khan. But most importantly, we really are making sure that Khanmigo is safe and ethical, and that there are lots of guardrails, and it's not, and we are really thinking about this every single day. We're not just throwing it out and just making it scary. We are really being mindful of the way that we are building this. So if you wanna learn more, this is our district partnership team. We'd love to connect with you. Click on this QR code, and until we meet again. Keep reading, keep writing, keep learning. We appreciate y'all.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- ہیلو سب، میرا نام\nڈینیئل سلیوان ہے۔ خان اکیڈمی میں میرا کردار یہ ہے کہ\nمیں شمال مشرقی ضلع پارٹنرشپس کا سینئر مینیجر ہوں، اور میرے معلم کا سابقہ\nکردار یہ ہے کہ میں پانچویں اور چھٹی جماعت کا\nخصوصی تعلیم کا استاد ہوا کرتا تھا۔ میں نے واشنگٹن ڈی سی اور نیو یارک کے اوپری حصے میں ELA اور ریاضی پڑھایا، اور میں سارہ کو\nآگے بڑھ کر اپنا تعارف کرانے دوں گا۔ - ارے سب، خوش آمدید. میں سارہ رابرٹسن ہوں۔ میں فی الحال یہاں خان اکیڈمی میں خواندگی اور کلاس روم کی تجربہ کار ٹیموں کا سینئر پروڈکٹ مینیجر ہوں۔ ڈینیئل کی طرح، میں ایک\nسابقہ ​​کلاس روم ٹیچر ہوں۔ میں نے مڈل اسکول ELA، اور تاریخ کے استاد کے طور پر مختصر وقت پڑھایا، لیکن زیادہ تر پڑھنا اور لکھنا۔ اور میں بھی خواندگی پر\nمرکوز ایک اور ایڈ ٹیک کمپنی سے آ رہا ہوں، میرے خیال میں ڈینیئل نے بھی\nہمارے ساتھ ایک اور کمپنی سے شمولیت اختیار کی ہے۔ اور میں اسے دے دوں گا، آئیے ڈیونا کرتے ہیں۔ - سب کو سلام۔ میں ڈیونا کلنگ مین ہوں۔ میں خان اکیڈمی کے ساتھ پیشہ ورانہ سیکھنے کا ماہر ہوں۔\n بالکل میرے ساتھیوں کی طرح جو\nمیرے ساتھ پینل پر ہیں، میں ایک سابقہ ​​کلاس روم ٹیچر ہوں۔ ابتدائی وہ جگہ ہے جہاں میرا دل ہے۔ میں نے دوسری جماعت،\nتیسری جماعت، اور پانچویں جماعت کو پڑھایا ہے۔ میں نے رویے کی مداخلت کی ہے۔ میں بلڈنگ پرنسپل کے ساتھ ساتھ اکیڈمکس کا ڈائریکٹر بھی رہا ہوں۔ لہذا تمام سطحوں پر رہے،\nیقینی طور پر سمجھتے ہیں اور دوسرے اساتذہ کے ساتھ جڑنا پسند کرتے ہیں۔ اور اس کے ساتھ، میں\nاسے برناڈیٹ کے حوالے کرنے والا ہوں۔ - ہیلو، میں برناڈیٹ بینیٹ ہوں۔ میں خان اکیڈمی کے ساتھ ایک پیشہ ور\nلرننگ مواد کا ماہر ہوں۔ میں فلوریڈا سے ایک سابق مڈل اسکول ٹیچر اور ڈسٹرکٹ سوشل اسٹڈیز\nسپروائزر ہوں، اور میں\nآج آپ لوگوں کے ساتھ ہونے کے لیے بہت پرجوش ہوں۔ - بہت اچھا، تو یہ ہے کہ\nیہ کیسے کام کرے گا۔ ہم، میں اپنی اسکرین کا اشتراک بند کرنے والا ہوں کیونکہ توجہ\nبات چیت پر مرکوز ہوگی۔ لہذا ہم AI کے تبدیلی کے کردار اور\nخواندگی کے اسکور کو بہتر بنانے کے بارے میں کچھ واقعی بھرپور، دلچسپ گفتگو کریں گے، کیونکہ جیسا کہ آپ جانتے ہیں، مجھے\nیقین ہے کہ آپ یہ محسوس کر رہے ہیں، بہت سارے طلباء نے\nCOVID کے بعد، خاص طور پر خواندگی میں پیچھے رہ جانے کا احساس کیا ہے۔  . میرا مطلب ہے، میں ریاضی بھی کہوں گا، لیکن آج ہم خواندگی پر توجہ مرکوز کر رہے ہیں۔ لہٰذا ہم اس کا جائزہ لینا چاہتے ہیں اور صرف اس بات پر غور کرنا چاہتے ہیں، جیسے کہ آپ سب کس طرح\nAI کی موافقت پذیر سیکھنے کے بارے میں سوچنا شروع کر سکتے ہیں، طالب علموں کو\nپڑھنے اور لکھنے کی مہارت کو بہتر بنانے میں مدد کرنے کے لیے ذاتی تاثرات۔ اور اصل میں، چلو تھوڑی سی\nخوشی کے بارے میں بھی بات کرتے ہیں، ٹھیک ہے؟ خواندگی سے محبت کریں۔ اگرچہ ہم صرف ہیں، ہم بات کریں گے، براہ کرم چیٹ میں تبصرے\nاور چیٹ میں سوالات پوسٹ کریں۔ میں ان کو دیکھ سکوں گا، اور ہم\nاس سوال کے ساتھ اسے شروع کرنے جا رہے ہیں۔ تو، سارہ، خان اکیڈمی کے بارے میں اکثر نہیں سوچا جاتا... خان اکیڈمی کے بارے میں اکثر ایسا نہیں\nسوچا جاتا جیسے خواندگی کی ہدایات اور مدد کے لیے جانے والے ٹول کے طور پر۔ لیکن ہم یہاں ہیں، ہم\nخواندگی اور ELA ویبینار کر رہے ہیں۔ تو، کیا بدل گیا ہے؟ - ہاں، تو میں نے درحقیقت تقریباً ڈیڑھ سال قبل خان اکیڈمی میں شمولیت اختیار کی تھی، جو اس\nوقت کے قریب تھا جب خان اکیڈمی نے OpenAI کے ساتھ شراکت داری کی تھی کہ ہم سیکھنے کے حقیقی تجربات پیدا کرنے کے لیے بڑے زبان کے ماڈلز کو کس طرح استعمال کر سکتے ہیں۔\n \n اور اسی طرح خان اکیڈمی میں میرے پہلے دن، میرے مینیجر نے مجھے بٹھایا\nاور کہا، \"ویسے، ہماری یہ شراکت OpenAI کے ساتھ ہے، کیا آپ نے ChatGPT کے بارے میں سنا ہے؟\" اور میں ابھی ابھی ایک اور خواندگی کے ضمنی ایڈ ٹیک ٹول پروڈکٹ سے آیا تھا، اور آپ جانتے ہیں کہ میرے\nذہن میں خواندگی تھی، خان اکیڈمی آنے کے لیے بہت پرجوش تھا یہ\nجان کر کہ وہاں خواندگی کے لیے نئے ٹولز اور مواد تیار کرنے کے مواقع موجود ہیں۔\n تو یہ تھا، یہ ایک نشانی کی طرح محسوس ہوا کہ جیسے میں\nبالکل صحیح وقت پر آیا ہوں، کیونکہ جو کچھ ہم اپنی بہت سی مختلف دریافتوں کے ساتھ دیکھ رہے تھے جو \nہم ChatGPT اور بڑے زبان کے\nماڈلز کے ساتھ کر رہے تھے، جس کے ساتھ ہم تجربہ کر رہے تھے۔  یہ تھا کہ کچھ بہترین تجربات جن کی LLM معاونت کر سکتے ہیں وہ ہدایات پڑھنے\nاور لکھنے کی ہدایات سے متعلق تھے۔ اور اس لیے ہم نے پہلے\nمختلف طریقوں کی طرف قدم بڑھایا جس سے ہم\n طالب علموں کے لیے جب\nپڑھنے اور لکھنے کی بات آتی ہے تو واقعی جدید، بھرپور سیکھنے کے تجربات پیدا کرنے کے لیے AI کا فائدہ اٹھا سکتے ہیں۔ بہت، آپ جانتے ہیں، پہلے مہینے میں یہاں تھا ہم نے ایک ہیکاتھون کیا تھا، اور اس سے سامنے آنے والی خصوصیات میں سے ایک\n ہماری موجودہ مضمون کی فیڈ بیک سرگرمی تھی، جس کے بارے میں میں بعد میں کچھ اور بات کروں گا۔\n لیکن میں یہ بھی کہوں گا کہ\nخان اکیڈمی میں ہم نے پچھلے کچھ سالوں میں اضلاع کے ساتھ جتنا زیادہ شراکت داری کی ہے،\n ہمارے لیے اتنا ہی واضح ہے کہ \nELA کے لیے اعلیٰ معیار اور لچکدار وسائل کی مانگ پہلے سے کہیں زیادہ ہے۔ میرے خیال میں، ایک بار پھر،\nآپ کو معلوم ہے کہ وبائی مرض سے نکل کر اور\nAI کے اس دور میں آنے سے، پڑھنے اور لکھنے کی\nکلاسوں میں خلل پڑ گیا ہے اور ہمیں اب طلباء تک پہنچنے کے لیے\nواقعی تخلیقی، اختراعی طریقوں کے بارے میں سوچنے کی ضرورت ہے۔  یہ\n طریقہ اس سے تھوڑا سا\nمختلف ہے، آپ جانتے ہیں، جب میں اصل میں کلاس روم میں تھا اور یقینی طور پر جب میں\nخود ایک طالب علم تھا۔ لہذا ہم ان میں سے\nکچھ کے بارے میں واقعی پرجوش ہیں، ان نئی سرگرمیوں میں سے جو ہم بنا رہے ہیں۔ ہم\n مڈل اسکول اور\nہائی اسکول کے لیے بالکل نئے ELA کورسز بھی شروع کر رہے ہیں، مجھے لگتا ہے کہ ہم نے\nابھی 6ویں جماعت کا آغاز کیا ہے، اور ہم\n9ویں اور 10ویں جماعت کے ساتھ ساتھ اسکول میں واپسی کے اس موسم کے لیے بھی شروع کریں گے۔ لہذا یہ یقینی طور پر ایک نیا دور ہے،\nخان اکیڈمی کا ایک نیا دور ہے، اور ہم واقعی\nپڑھنے اور لکھنے کے نئے وسائل کے بارے میں بہت پرجوش ہیں جو ہم بنا رہے ہیں۔ - جی ہاں، اور آپ میں سے کتنے لوگ\nجو کبھی کبھی یہ دیکھ رہے ہیں اپنے طلباء کو تحریری طور پر سپورٹ کرنے کے لیے جدوجہد کی ہے؟ کوئی، کوئی اس درد کو محسوس کرتا ہے؟ وہ میں ہوں گا۔  جی ہاں، حقائق، بالکل. تو مقصد یہ ہے کہ\nہم اپنے طلباء کو \nاپنے اظہار کے انداز میں مزید سوچنے سمجھنے کے لیے کس طرح مشغول کر سکتے ہیں؟ تو میں سوچنا چاہتا ہوں، یہ\nچند سال گزرے ہیں، کیا آپ یقین کر سکتے ہیں کہ یہ '24 ویسے، 2024 ہے؟ ہم صرف ان طلباء کے بارے میں سوچ رہے ہیں جو اس\nسال گریجویشن کر رہے ہیں، انہوں نے 2020 میں آغاز کیا، تو، واہ، \nپچھلے چار سالوں میں بہت کچھ ہوا ہے۔ تو پچھلے چار سالوں کے بارے میں سوچتے ہوئے، ڈیونا، AI کو ان\nکچھ خلاوں کو دور کرنے کے لیے کیسے فائدہ اٹھایا جا سکتا ہے جنہیں ہم\nوبائی امراض سے پریشان دیکھ رہے ہیں، یا سیکھنے کے مواقع اگر ہم اسے مثبت انداز میں گھمانا چاہتے ہیں؟ - جی ہاں، بالکل. میں نہ صرف ایک معلم ہوں،\nبلکہ میں ایک والدین ہوں، اس لیے میری بیٹی اس سال سینئر ہے، اور اس لیے\nاس وبائی بیماری کے کچھ ذاتی اثرات نے نہ صرف، آپ جانتے ہیں، مجھے ایک معلم کے طور پر متاثر کیا ہے،\nبلکہ  ایک والدین بھی. میرا دماغ جب میں AI کے بارے میں سوچتا ہوں اور ہم اسے کچھ فائدہ اٹھانے میں مدد کرنے کے لیے کس طرح استعمال کر سکتے ہیں،\n ان میں سے کچھ خلا کو دور کرنے میں مدد کرتے ہیں تو میرا ذہن اس\nہدف شدہ ہدایات پر جاتا ہے۔ آپ جانتے ہیں، جتنا بڑا خلا ہوگا، اتنی ہی زیادہ ٹارگٹڈ\nہدایات جو آپ اپنے طلباء کو دینا چاہتے ہیں، ٹھیک ہے؟ لیکن میں یہ بھی جانتا ہوں کہ، آپ جانتے ہیں، ہدفی ہدایات یا چھوٹے گروپ پلان کہنا آسان ہے، آپ\nاپنے چھوٹے گروپوں کے ساتھ کیا کرنا چاہتے ہیں؟ لیکن حقیقت میں یہ\nمنصوبہ بندی کا ایک مکمل سیٹ ہے، ٹھیک ہے؟ تو میں\nاس چھوٹے گروپ کی منصوبہ بندی کے بارے میں سوچ رہا ہوں۔ اور اس لیے جب میں AI کے بارے میں سوچتا ہوں، تو\nمیں ان میں سے کچھ ٹولز کے بارے میں سوچتا ہوں جو ہمارے پاس ہیں، جیسے کہ\nخانمیگو کو صرف استعمال کرنے کی صلاحیت، ایک، صرف اپنے طلباء کو گروپ میں مدد کرنے کے لیے شامل کریں۔ آپ جانتے ہیں، یہ\nآپ کے طلباء کو گروپ کرنے میں آپ کی مدد کر رہا ہے۔  یہاں تک کہ یہ\nآپ کا معاون بھی ہے، آپ صرف اس سے پوچھ سکتے ہیں،\nمیرے طلباء کو کس چیز پر کام کرنے کی ضرورت ہے؟ لہذا\nاس چھوٹے گروپ کی منصوبہ بندی کے ساتھ اس وقت کو کم کرنا، صرف اس\nلمحے میں بطور استاد یہ جاننے کے لیے مدد کرنا کہ میں اپنے طلبا کو کیسے گروپ بناؤں، اور وہ کون سی چیزیں ہیں جن پر آپ جانتے ہیں، انہیں کام کرنا چاہیے؟ میں سماجی\nجذباتی نقطہ نظر کے بارے میں بھی سوچتا ہوں، ٹھیک ہے؟ اس پورے بچے کے بارے میں سوچنا\nاور ان ضروریات کو پورا کرنا۔ اور ہم جانتے ہیں کہ ان چیزوں میں سے ایک طالب علم بھی محفوظ ہیں، ایک محفوظ احساس محسوس کرتے ہیں جیسے\nکہ میں نہیں جانتا، ٹھیک ہے؟ میں نہیں جانتا کہ کیا ہو رہا ہے، اور اس لیے طلباء خانمیگو کے ساتھ ان سوالات پر بات کرنے اور پوچھنے کی صلاحیت رکھتے ہیں،\n یہاں تک کہ جب آپ\nمتن کے تجزیہ کے بارے میں سوچ رہے ہوں، ٹھیک ہے؟ مجھے سمجھنے میں مدد کریں، میرا\nاس متن کے بارے میں ایک سوال ہے جو شاید وہ اپنے ساتھیوں کے سامنے اونچی آواز میں پوچھنا نہیں چاہتے ہیں، اور اس طرح اس کا فائدہ اٹھانا میرے خیال میں بہت سے لوگوں میں سے ایک ہے۔ - جی ہاں، بالکل. میرا مطلب ہے، آپ نے جو کچھ کہا،\nچھوٹے گروپ کی ہدایات، ایک بار پھر، آپ میں سے کتنے لوگوں نے \nچھوٹے گروپ کی ہدایات کے ساتھ جدوجہد کی ہے؟ میں آپ کو مڈل اسکول کے اساتذہ دیکھتا ہوں، میں آپ کو ہائی اسکول کے اساتذہ دیکھتا ہوں، ٹھیک ہے؟ ہم جانتے ہیں کہ یہ\nواقعی اہم مشق ہے۔ تو سارہ، کیا آپ\nہم سے اپنے نقطہ نظر یا کچھ چیزوں کے بارے میں بات کر سکتے ہیں جن کے بارے میں آپ\nکووڈ کے بعد کے سالوں کے بارے میں سوچ رہے ہیں؟ - ہاں، تو میں، میرا مطلب ہے، میں نے ایک ایسے کلاس روم میں پڑھایا\nجہاں طلباء کی حد ہوتی ہے، میں نے پڑھانے میں اپنا زیادہ تر وقت ساتویں جماعت کے کلاس روم میں پڑھایا، اور میرے پاس ایسے طلباء تھے جو\nدوسری جماعت کے پڑھنے کی سطح سے لے کر 12ویں جماعت کے پڑھنے کی سطح پر تھے۔  ،\nتمام راستے کے درمیان، مہارت کی سطح کا صرف ایک بہت وسیع دورانیہ۔ اور میرے بہت سے طلباء نے روانی اور فہم،\nیا دونوں کے مرکب کے ساتھ جدوجہد کی۔  پورے کمرے میں ہر طرح کی مختلف ضرورتیں تھیں، اور میں جانتا ہوں کہ\nہم ان طلبہ کے لیے بہترین کام کر سکتے ہیں جن کے لیے\n خاص طور پر پڑھنے کی فہمی کی مہارتوں میں فرق ہے، جسے میں\nکہوں گا کہ اپنے ساتویں جماعت کے طالب علموں کے لیے سب سے بڑا چیلنج\nتھا۔  واقعی اس بات کو یقینی بنانا، A، کہ انہیں\nگریڈ لیول کے متن تک رسائی حاصل ہے۔  بہت سارے طلباء کو کوشش کرنے کا\nموقع بھی نہیں ملتا اور، آپ جانتے ہیں،\nگریڈ لیول کے متن تک رسائی حاصل کرنے اور اسے پڑھنے کا، لیکن یہ جانتے ہوئے کہ بہت سارے\nطلباء گریڈ لیول سے نیچے ہیں، ہم کس طرح ہدایات کو سہارا دے سکتے ہیں اور ہم\nطلباء کے لیے مواقع کیسے پیدا کر سکتے ہیں؟  اس قابل ہونے کے لیے، آپ جانتے ہیں، اس کو پُر کریں کہ\nدرمیان میں کیا غائب ہے؟ اور\nایسا کرنے کے لیے کچھ بہترین حکمت عملیوں کا تعلق پری ٹیچنگ\nاور پری ریڈنگ پریپ سے ہے، جس کا مطلب ہے اور ایسا لگتا ہے جیسے\nپہلے کے علم کو چالو کرنا، \nمتن کے بارے میں کنکشن بنانا، کسی بھی اسکیما کے لیے پس منظر کا علم بنانا\n جو طالب علم\nجب متن کے بارے میں آتا ہے تو اس کی ضرورت ہوتی ہے، چاہے\nوہ افسانہ ہو یا نان فکشن، پہلے سے تدریسی درجے کے دو اور\nدرجے کے تین الفاظ، اور طلباء کو\nمشق کرنے اور ان الفاظ کو جاننے کے مواقع فراہم کرنا جن سے وہ\nناواقف ہو سکتے ہیں۔ اور پھر یقیناً ان کی حمایت کرنا جب\nپیچیدہ جملوں کو توڑنے کی بات آتی ہے، اور اس میں\n \nطلباء کی مدد کرنے اور اساتذہ کی مدد کرنے کے لیے ارد گرد AI کی موجودگی کے بارے میں واقعی ایک عمدہ چیز یہ\nہے کہ ان میں سے بہت سی چیزیں اب انتہائی آسان\nاور تیز ہو چکی ہیں۔  AI کے ساتھ کرنا۔ لہذا جب آپ سوچتے ہیں، آپ جانتے ہیں، پہلے سے علم کو چالو کرنا\nیا کنکشن بنانا، آپ کو صرف\nKhanmigo یا کسی AI ٹول پر جانے کی ضرورت ہے اور اسے\nمتن کو دیکھنے اور شناخت کرنے کے لیے، آپ جانتے ہیں، سوالات اور مختلف مصروفیات، حاصل کرنے کے لیے حکمت عملی۔\nطلباء سوچیں کہ اس متن کا ان کے لیے کیا مطلب ہے یا کیا ان کا متن میں\nتھیم یا کرداروں سے کسی قسم کا تعلق ہے۔  اس بات کی نشاندہی کرنا کہ متن کس چیز کے بارے میں ہے اور اس سے پہلے کی تعلیم کو سمجھنے کے قابل ہونے کے لیے کیا پس منظر کا\nعلم ضروری ہے، \n \nخانمیگو کو طلبہ کے لیے اس کا خلاصہ کرنا یا طلبہ سے اس بارے میں سوالات کرنا کہ وہ پہلے سے کیا جانتے ہیں\nیا کیا جاننا چاہتے ہیں، خانمیگو کو شناخت کرنا اور ان کی\nشناخت کرنا بھی ضروری ہے۔  کسی متن سے ایک\nطالب علم کو کسی چیز کو سمجھنے کے قابل ہونے کے لیے ممکنہ طور پر کون سے الفاظ کے الفاظ جاننے کی ضرورت ہے۔ \n اور پھر ہماری کچھ\nپہلے سے تیار کردہ سیکھنے کی سرگرمیاں جیسے ورڈ سفاری اور ورڈ\nآرکیٹیکٹ کا استعمال کرتے ہوئے ان میں سے کچھ مختلف الفاظ کو پڑھنے سے پہلے ہی مشق کرنا۔ اور پھر جب طالب علم درحقیقت گریڈ لیول کا متن پڑھ رہا ہوتا ہے، خان اکیڈمی میں خانمیگو کے پاس موجود ہوتا ہے تاکہ ان کی مدد کی جا سکے اگر وہ کسی ایسی چیز کا سامنا کرتے ہیں جس کا\nتجزیہ کرنا ان کے لیے واقعی پیچیدہ یا مشکل ہو، تو یہ ایک، آپ جانتے ہیں، ایک فیصلہ سے پاک ہے۔ شخص نہیں بلکہ AI to- سپورٹ۔\n- حمایت کرنے کے لیے، ہاں، اس وقت جانا جب وہ پھنس جاتے ہیں اور جب وہ واقعی نہیں جانتے، آپ جانتے ہیں، یہاں تک کہ وہ کچھ کیوں نہیں سمجھتے، وہ وہاں جا کر سوال پوچھ سکتے ہیں۔ ایک اور واقعی مددگار\nسرگرمی جس کی میں گریڈ لیول سے نیچے والے طلباء کے لیے تجویز کروں گا وہ یہ ہے کہ ہمارے پاس خانمیگو کے ساتھ ٹیچر ٹول ہے جسے ٹیکسٹ ری لیولر کہا جاتا ہے۔ اور ظاہر ہے، جیسا کہ میں نے پہلے کہا، یہ بہت اہم ہے کہ\nطلباء کو صرف وہ متن نہ ملے، جو آپ جانتے ہیں،\n پورے تعلیمی سال کے لیے گریڈ لیول سے بہت نیچے ہیں۔ یہ واقعی اہم ہے کہ\nان کے پاس گریڈ لیول کے متن تک رسائی کے مواقع ہوں۔ لہٰذا\nٹیکسٹ ریلیولر کو استعمال کرنے کا ایک بہترین طریقہ یہ ہے کہ کسی متن کو دوبارہ لیول کیا جائے جو\nطلباء کے لیے گریڈ لیول پر ہے، اسے دوبارہ لیول کرنا، آپ\nجانتے ہیں، کچھ لیولز، اور پھر Khanmigo کو کہے کہ وہ\nری لیول ٹیکسٹ لے اور  اسے دوبارہ سطح پر\nدوبارہ لے جائیں جہاں یہ پہلے تھا۔ اور پھر طلباء سے\nتینوں ورژنز کو دیکھنے کے لیے کہیں، انہیں AI کے نیچے آنے والے آسان ورژن کو دیکھنے کو کہیں، اور اس سے انہیں اس طرح کی\nبنیادی سمجھ حاصل کرنے میں مدد ملے گی کہ متن کس چیز کے بارے میں تھا، وہ \nمتعلقہ ورژن کو دیکھیں۔  ، اور پھر ان سے\nاس کا موازنہ اصل متن سے کریں اور دیکھیں کہ ہم نے کیا کھویا، آپ جانتے ہیں، جب AI نے اس متن کو لیا اور\nاسے دوبارہ مرتب کیا، کیا تبدیلی آئی، مصنف کے فن کے کون سے پہلو، یا، آپ جانتے ہیں، مختلف\nلسانی عناصر بدل گئے  ، اور اس نے\nمتن کے معنی کو کیسے متاثر کیا؟ لہذا بہت سارے\nمختلف اور تخلیقی طریقے ہیں جن سے آپ AI کو نہ صرف، آپ جانتے ہیں، طلباء کو گریڈ لیول کے مواد تک آسانی سے رسائی حاصل کرنے کے لیے استعمال کر سکتے ہیں، بلکہ طرح طرح کے تفریحی اور دل چسپ سیکھنے کے تجربات پیدا کرنے کے لیے بھی۔ - میرا مطلب ہے، آپ نے بہت کچھ کہا، سارہ، بہت سارے حیرت انگیز جواہرات، لیکن میں برناڈیٹ کے اسپن کو سننا چاہتا ہوں،\nکیونکہ برنا، آپ کا سماجی مطالعہ میں تھوڑا سا\nمختلف نقطہ نظر اور پس منظر ہے، اور سارہ کیا تھیں۔\nاشتراک الفاظ سے ہوتا ہے اور مستند متن کو دیکھنا اور اس بات کو یقینی بنانا کہ\nطلباء سخت متن تک رسائی حاصل کرنے کی صلاحیت رکھتے ہیں۔ لہذا میں آپ کے نقطہ نظر سے کچھ رنگ اور سیاق و سباق شامل کرنا پسند کروں گا کہ آپ کیسے دیکھتے ہیں کہ ہم ان خلا کو ختم کرنے میں مدد کرسکتے ہیں۔ - لہذا، جب میں سماجی علوم کے اساتذہ کے بارے میں سوچتا ہوں\n جو الفاظ کے ساتھ اور پڑھنے اور\nبنیادی ماخذ کی دستاویزات کے ساتھ بھی کافی کام کر رہے ہیں، تو کئی بار جب طلباء بنیادی\nماخذ کی دستاویزات کو دیکھ رہے ہوتے ہیں، آپ جانتے ہیں، وہ کچھ\nقدیم الفاظ کو دیکھ رہے ہیں، وہ کبھی کبھی\nایک کرسیو دستاویز کو دیکھ رہے ہیں۔ لہذا آپ ان بنیادی اور ثانوی ماخذ دستاویزات پر توجہ مرکوز کرنے کے لیے AI کا استعمال کر سکتے ہیں، \n آپ AI کو اس میں ترمیم کروا سکتے ہیں، لیکن پھر بھی وہ اصل\nدستاویز اپنے پاس موجود ہے تاکہ ایک طالب علم\nاس اصلی دستاویز کو دیکھ سکے، جو کہ اس میں کیسا لگتا ہے۔\nمختلف گریڈ لیول، لیکن ہمیشہ واپس جا کر اس اصل دستاویز تک پہنچنے کے قابل ہو، اس اصل الفاظ تک پہنچیں اور طالب علموں کو سمجھنے میں مدد کریں، آپ جانتے ہیں، \nاس اصل دستاویز میں جو باریکیاں ڈالی گئی تھیں، جیسا کہ سارہ نے کہا، ہو سکتا ہے کہ وہ چھوٹ جائے۔ جب ہمارے پاس کوئی دستاویز ہے جو نہیں ہے، تو اس میں ترمیم نہیں کی گئی ہے۔ لیکن جب ہم نظم و ضبطی ادبی\nاور سماجی علوم کو دیکھ رہے ہیں تو پوری کلید خواندگی اس بات کو یقینی بنا رہی ہے کہ طلباء اس اصل دستاویز کو دیکھ رہے ہیں، لہذا اس اصل دستاویز کو لینے کے قابل ہونا\n اور ان کو ان تصورات تک رسائی اور سمجھنے کے قابل بنانا واقعی اہم ہے کیونکہ\nتم یہ سب ایک ساتھ کھینچو۔ - آپ کا شکریہ، تو\nچیٹ میں کچھ گڑبڑ ہے کہ ہم کس چیز کے بارے میں بات کر رہے ہیں۔  مزید جاننے کے لیے میں آپ کو آخر میں ایک وسیلہ یا QR کوڈ دینے والا ہوں، لیکن چیٹ میں لنکس موجود ہیں۔ ہم اس کے بارے میں بات کر رہے ہیں، سب سے پہلے، ہم صرف\nخواندگی اور وبائی مرض کے بعد کے بارے میں ایک شاندار گفتگو کرنا چاہتے ہیں، اور\nہم AI ٹولز کا فائدہ کیسے اٹھا سکتے ہیں۔ لیکن ہمارے پاس خان اکیڈمی کے حصے کے طور پر کچھ بہت اچھے AI ٹولز ہیں جو آپ کو\n چیٹ میں لنک ملنے پر آپ بالکل مزید معلومات حاصل کر سکتے ہیں، لیکن میں چاہتا ہوں کہ ہم واقعی\nمزید پڑھنے اور لکھنے میں کھوج لگائیں، کیونکہ جیسا کہ کسی نے\nکہا، تبلیغ کریں  چیٹ، \nطالب علموں کو بامعنی تحریر میں شامل کرنے کے لیے جدوجہد کرنا۔ میرا مطلب ہے کہ میں، میرے طلباء بطور\nسابق اسپیشل ایڈ ٹیچر، انہیں\nصفحہ پر کچھ بھی ڈالنے کا خوف تھا، کیا کوئی تعلق رکھ سکتا ہے؟ ان کا ابھی آغاز ہو رہا ہے،\nآئیڈیا جنریشن نہیں ہے، اور یہ واقعی مشکل تھا\nکیونکہ میں مکمل شمولیت تھی، اس لیے میں\n چھٹی جماعت کے ELA کلاس روم میں بہت سارے طلباء کی مدد کرنے کی کوشش کر رہا تھا، اور اپنے طلباء کی مدد کرنے کی کوشش کر رہا تھا، جیسا کہ\nDiona بات کر رہی تھی، محفوظ محسوس کر رہی تھی۔  ، توثیق کا احساس۔ تو، کس طرح ذاتی رائے طالب علموں کو پڑھنے\nاور لکھنے کی صلاحیتوں کو بڑھا سکتی ہے؟ ڈیونا، آئیے\nآپ کے ساتھ شروع کریں، اور پھر ہم واپس چکر لگائیں گے۔\n- جی ہاں، بالکل.  ایک بار پھر، میں\nاس محفوظ جگہ کے بارے میں سوچتا ہوں، ٹھیک ہے؟ بس ٹھیک محسوس کرنا، آپ جانتے ہیں، سب کے سامنے بولنے کے قابل ہونا، یا جاننے کے قابل ہونا، کیا میں لکھ رہا ہوں یا میں\nصحیح جملہ لکھ رہا ہوں، یا صرف ان کو راحت پہنچا رہا ہوں۔ تو مجھے یہ حقیقت پسند ہے کہ\nہمارے پاس ہے، مثال کے طور پر، جیسے ٹیوٹر می ٹول کے ساتھ مجھے ہیومینٹیز میں ٹیوشن دے رہا ہے۔ اور اس طرح طالب علموں کو موقع ملتا ہے کہ وہ یا تو\nکچھ مہارتوں پر سوال اٹھائیں، اور پھر، یہ وہی محفوظ جگہ ہے۔ میں صرف، میں اس کی طرف جاتا رہتا ہوں کیونکہ میں جانتا ہوں کہ\nمیرے بہت سے طالب علم میرے پاس آئے تھے جن کے پاس پہلے سے زیادہ علم نہیں تھا۔ ہم نے اس کے بارے میں پہلے بھی بات کی تھی، اور اس طرح جب\nان کلاس مباحثوں کا وقت آیا، تو ان میں سے کچھ نے کیا کیا؟ ان کے راستے سے باہر برتاؤ، ٹھیک ہے؟ یا وہ صرف اس لیے بند ہو سکتے ہیں\nکیونکہ وہ نہیں چاہتے، ان کے پاس\nبات چیت میں حصہ ڈالنے کے لیے کچھ نہیں ہے۔ لہذا آپ جانتے ہیں کہ\nٹیوٹر می جیسے ٹولز ہیں، آپ جانتے ہیں کہ ہیومینٹیز میں جہاں آپ متن کے بارے میں\nوہ سوالات پوچھ سکتے ہیں، اس سے پہلے\nیا اس کے دوران بھی، آپ جانتے ہیں، بطور استاد، اگر میرے\nپاس یہ کلاس روم میں ہوتا، تو میں یقینی طور پر اس کے لیے ماڈل بناتا۔  انہیں اور ان کے لیے مواقع پیدا کریں، \nان کے لیے مواقع پیدا کریں، آپ جانتے ہیں، مخصوص سوالات کے جوابات، جائیں، آپ جانتے ہیں، خانمیگو تک پہنچیں۔ خانمیگو سے پوچھیں، آپ جانتے ہیں،\nایسا کیوں ہو رہا ہے، اور پھر یہ انہیں وہ سیاق و سباق دے گا۔ اس کے بارے میں دوسری اچھی بات ان طلباء کے لیے بھی ہے جنہیں پڑھنے میں\nاس قسم کے مسائل ہو سکتے ہیں، آپ جانتے ہیں کہ روانی سے پڑھنا ایک مسئلہ ہو سکتا ہے، خانمیگو ان سے بات کر سکتے ہیں۔ لہذا وہ اپنے ہیڈ فون رکھ سکتے ہیں، اور یہ تقریباً\nایک حقیقی گفتگو کی طرح محسوس ہوتا ہے کیونکہ جو کچھ ہوتا ہے وہ ہوتا ہے،\nیہاں تک کہ اگر، آپ جانتے ہیں، اگر ٹائپنگ میرا مضبوط سوٹ نہیں ہے،\nجیسا کہ آپ اپنے کچھ خصوصی\nتعلیم کے طالب علموں کے بارے میں بات کر رہے تھے، آپ جانتے ہیں  ، آپ خانمیگو میں بات کر سکتے ہیں اور کہہ سکتے ہیں، آپ جانتے ہیں، \"ارے،\nیہ کیوں ہو رہا ہے؟\" خانمیگو اسے تیار کرنے والا ہے، اور پھر اس میں\nاب آپ سے بات کرنے کی صلاحیت ہے۔ لہذا اگر ٹائپنگ اور پڑھنا\nطالب علم کا مضبوط نقطہ نہیں ہے، تو وہ اب زیادہ بااختیار محسوس کرنے کے قابل ہیں کیونکہ اب یہ تقریباً آپ کی طرح\nبات چیت کرنے جیسا ہے اور میں\nاس لمحے میں ان کی مدد کرنے کے لیے کر رہا ہوں، آپ جانتے ہیں، ان مہارتوں میں مضبوط بنیں۔  . - بالکل تو سارہ، اس بارے میں آپ کے کیا خیالات ہیں؟ - ہاں، تو میں نے پہلے ان\nچیزوں میں سے ایک کا ذکر کیا تھا جسے ہم نے دریافت کرنا شروع کیا تھا\nجب ہم AI پول میں انگلیوں کو ڈبو رہے تھے، مضمون کا فیڈ بیک تھا، اس لیے میں نے پڑھنا اور لکھنا دونوں سکھائے۔ جس اسکول میں میں نے پڑھایا،\nوہ الگ الگ کلاسیں تھیں اور لکھنا بہت مشکل تھا۔ میرے خیال میں پڑھنا پڑھانا\nبنیادی وجہ یہ ہے کہ فیڈ بیک ٹکڑا\nصرف اتنا ہی ایک چیلنج ہے اگر آپ کے پاس\nایک کلاس میں 20 سے زیادہ طلباء ہیں، جو میرے خیال میں زیادہ تر اساتذہ کرتے ہیں۔ اور اس طرح جس طرح سے ہم نے Khanmigo کے تعلیمی\nمضمون کی فیڈ بیک سرگرمی کو ڈیزائن کیا وہ طلباء کے لیے فوری اعلیٰ معیار کی آراء حاصل کرنے کا ایک طریقہ تھا\n جو قابل عمل اور\nمنظم تھا، آپ جانتے ہیں، مخصوص فیڈ بیک ایریا کا\nانتظار کیے بغیر، آپ جانتے ہیں، دنوں یا ہفتوں کا۔  اپنے اساتذہ سے\nکسی بھی قسم کی معلومات واپس حاصل کرنے کے لیے۔ اور اس طرح جس طرح یہ کام کرتا ہے وہ یہ ہے\nکہ ایک طالب علم اپنے مضمون کے مسودے کے ساتھ ساتھ\nمضمون کے بارے میں معلومات بھی جمع کرتا ہے جیسا کہ اسے ان کے استاد نے تفویض کیا تھا، مضمون کی صنف یا گریڈ کی سطح سے متعلق کوئی بھی چیز جس میں وہ ہیں، اور پھر ہم ڈالتے ہیں۔\nان سب کے ذریعے مقالہ انتہائی باریک بینی سے ترتیب دیا گیا اے آئی پرامپٹس جو پانچ مختلف شعبوں میں فیڈ بیک پیدا کرتا ہے،\n اور پھر طلباء ان پانچ مختلف شعبوں کے درمیان ایک طرح سے تشریف لے جا سکتے ہیں۔ اگر وہ تاثرات کے ایک ٹکڑے پر کلک کرتے ہیں، تو یہ اس مضمون کے کس حصے کے\nبارے میں بات کر رہا ہے اس پر روشنی ڈالے گا۔  اس کے بعد طالب علم\nخانمیگو کے ساتھ اس فیڈ بیک کے بارے میں بات کر سکتا ہے اور کہہ سکتا ہے، \"میں آپ کا کیا مطلب نہیں سمجھا\n، کیا آپ اس کی وضاحت کر سکتے ہیں؟\" یا، \"کیا آپ مجھے ایک\nمثال دے سکتے ہیں، آپ جانتے ہیں، آپ مجھے بتا رہے ہیں کہ میرا\nمقالہ بہت مضبوط نہیں ہے، کیا آپ مجھے ایک مثال دے سکتے ہیں کہ ایک مضبوط مقالہ کیسا لگتا ہے؟\" اور یہ ایسا کرے گا کہ\nانہیں اصل میں مضمون کے لیے کوئی تحریر دیے بغیر، اس لیے اس کا پروگرام بنایا گیا ہے تاکہ طالب علموں کو\nدھوکہ دہی کے لیے AI استعمال کرنے سے روکا جا سکے۔ اور سب سے اچھی بات یہ ہے\nکہ طلباء پھر اپنے مضمون کو اپ ڈیٹ اور نظر ثانی کر سکتے ہیں اور خانمیگو سے پوچھ سکتے ہیں، \"ارے، اب یہ کیسا لگتا ہے؟ جیسے، اب آپ کا کیا خیال ہے؟\" اور خانمیگو اس فیڈ بیک کو دیکھ سکتے ہیں کہ طالب علم کا حوالہ دیا گیا ہے\nاور اس نے جو ترمیم کی ہے اور کہے گا، ہاں، جیسے، آپ کو\nمعلوم ہے کہ آپ نے ابھی کیا کیا۔ آپ باکس کو چیک کرتے ہیں کہ یہ بہت اچھا لگتا ہے، یا یہ کہہ سکتا ہے، آپ جانتے ہیں، \"میرے خیال میں آپ کو ابھی بھی\nیہاں تھوڑا سا کام کرنے کی ضرورت ہے،\" اور یہ طلباء کے لیے فالو اپ سپورٹ حاصل کرنے کے لیے یہ محفوظ جگہ ہے،\nوہ مزید طلب کر سکتے ہیں۔  مدد۔ اور ایک استاد کے طور پر، ایک بار پھر، مجھے صرف ایک کلاس روم میں ہونے کی طرح یاد ہے\nجہاں، آپ جانتے ہیں، کبھی کبھی میں\nہوا میں ہاتھوں کے سمندر کی طرح ہوتا ہوں جہاں بچے بالکل ایسے ہوتے تھے، \"میں پھنس گیا ہوں۔\" یا ان کے پاس تھا، آپ جانتے ہیں، یہ شاید کوئی طالب علم تھا جو بالکل ایسا ہی تھا، \"کیا آپ جملہ پڑھ سکتے ہیں؟\" اور جب بھی وہ\nکوئی جملہ لکھتے تھے وہ اس طرح ہوتے تھے، \"کیا آپ جملہ پڑھ سکتے ہیں؟\" اور پھر ایسے دوسرے طلباء بھی تھے جن کا سر نیچے تھا، یا جن کو عام طور پر سب سے زیادہ\nمدد کی ضرورت ہوتی تھی ان کے ہاتھ بالکل بھی اوپر نہیں تھے۔ اور اس کے بارے میں سب سے اچھی بات یہ ہے کہ یہ طالب علموں کو یہ کرنے کا اختیار دیتا ہے کہ وہ خانمیگو سے\nمدد مانگیں جب انہیں ضرورت ہو، لیکن یہ خانمیگو کو طالب علموں کے لیے ان میں سے کچھ چیک کرنے کی بھی اجازت دیتا ہے چاہے وہ اس کے لیے نہ بھی ہوں۔ لہٰذا اب ہم جن چیزوں پر کام کر رہے ہیں ان میں سے ایک کو رائٹنگ کوچ کہا جاتا ہے، جو\nمضمون کے تاثرات کی سرگرمی کو بنیاد بناتا ہے، اور یہ دراصل طالب علموں کو مضمون کے پورے عمل سے گزرتا ہے۔ تاکہ ایک خاص طور پر\nان بچوں کو نشانہ بناتا ہے جو صرف واقعی پھنس گئے، واقعی میں منقطع محسوس کر رہے ہیں، جیسے محسوس کر رہے ہیں کہ وہ\nنہیں جانتے کہ کہاں سے شروع کرنا ہے۔ اور ہم ان\nمضمرات کے بارے میں بھی پرجوش ہیں جو تحریری کوچ کی طرف سے\n اساتذہ کو طالب علم کی تحریر کے بارے میں بہت زیادہ رپورٹ کرنے کی ہماری صلاحیت پر پڑے گی۔ ابھی، آپ جانتے ہیں، اساتذہ\nاکثر حتمی مسودہ دیکھتے ہیں، اگر وہ اس کا انتظام کر سکتے ہیں تو شاید پہلا مسودہ، لیکن اس قسم کی AI سرگرمی کے ساتھ، ہم ان بہت سے تعاملات کی ترکیب کر سکتے ہیں\n اور\nاساتذہ کو ان کی اطلاع دے سکتے ہیں، بشمول چیزیں  , \"ارے، آپ جانتے ہیں، اس طالب علم نے\nابھی 500 الفاظ چسپاں کیے ہیں۔ یہ ان کے خاکہ سے نہیں ہے جس\nپر میں ان کی مدد کرتا ہوں۔\" ہو سکتا ہے کہ آپ کو، آپ جانتے ہیں، اس پر کلک کریں اور ڈرل ڈاؤن کریں\nاور دیکھیں، دیکھیں کہ کیا ہوتا ہے، لہذا\n اس موسم خزاں کو لکھنے کے لیے خانمیگو کے بہت سے نئے فیچرز آ رہے ہیں۔ - بہت ساری نئی دلچسپ چیزیں۔ کیا ہم صرف رک کر\nاسے ایک سیکنڈ کے لیے میرینیٹ کرنے دیں؟ آپ میں سے کتنے لوگ لکھتے پڑھتے دیکھتے ہیں؟  میں شرط لگاتا ہوں کہ آپ سب کریں، کیونکہ ہم اساتذہ ہیں۔ اور کوئی بھی ELA کلاس، کوئی بھی خواندگی، اگر ہم سوچتے ہیں کہ پڑھنا سانس لے رہا ہے، لکھنا سانس لے رہا ہے۔ طلباء کو\nاپنے خیالات کی وضاحت کرنے کے قابل بنانا اور ایک ایسا آلہ حاصل کرنا جو\nطلباء کی واقعی مدد کرتا ہو۔ میرا مطلب ہے، برناڈیٹ،\nآپ کو تمام چیزوں پر کتنی بار مضامین پڑھنا پڑے؟ اور کیا ہوتا ہے اگر طالب علم\nاس کا صحیح حوالہ نہیں دیتے، یا اگر وہ حقائق کو بنانے کی کوشش کرتے ہیں؟ آپ کے خیال میں AI اس میں کس طرح مدد کر سکتا ہے؟ - تو، کچھ\nچیزیں ہیں جو ہم کر سکتے ہیں۔ سب سے پہلے، اس سے پہلے کہ ہم\nاس منظر تک پہنچ جائیں، بچوں کو یہ جاننے کے قابل ہونا چاہیے،\nآپ جانتے ہیں، ہم کہاں سے شروع کریں؟ اور اس لیے بعض اوقات کسی تاریخی شخصیت کے ساتھ چیٹنگ یا کسی ادبی شخصیت کے ساتھ چیٹنگ جیسے ٹولز کا استعمال بچوں کو\nموضوعات کے بارے میں سوچنا شروع کرنے کے بہترین طریقے ہیں۔ تو وہ کسی ادبی شخصیت یا تاریخی شخصیت سے گپ شپ کر سکتے ہیں، ان سے\nدعووں اور شواہد کے بارے میں پوچھ سکتے ہیں، ان کا کیا خیال ہے؟ اور وہ جا کر\nان دلائل کو تیار کر سکتے ہیں۔ دوسری چیز جو خانمیگو\nکرتا ہے وہ بحث کرتا ہے۔ یہ مخصوص موضوعات پر\nابتدائی، مڈل اور ہائی اسکول کی\nسطح پر مباحثے کرتا ہے۔ لہذا اگر کسی طالب علم کو دعویٰ یا\nثبوت یا دلیل معلوم کرنے میں دشواری ہو رہی ہے، تو ان میں سے کسی ایک کے ساتھ شروع کرنا اور\n ان تھیمز کو تیار کرنے کے لیے خانمیگو کے ساتھ مشق کرنا ان کے لیے تحریری عمل شروع کرنے کا ایک بہترین طریقہ ہے۔\n مجھے لگتا ہے کہ میرے\nمڈل اسکول کے بہت سے طلباء، اور، آپ جانتے ہیں، میں نے ہائی اسکول کی سطح پر جن اساتذہ کے ساتھ کام کیا ہے، وہ ہمیشہ یہی ہوتے تھے، \"ہم اپنے بچوں کو کیسے شروع کریں گے؟\" اور یہ آپ کے بچوں کو شروع کرنے کا ایک بہترین طریقہ ہے۔\n اور ایک بار پھر، اس کو\nدیکھنے کے بہت سارے طریقے ہیں جب ہم واپس آتے ہیں اور\nدیکھنا شروع کرتے ہیں، آپ جانتے ہیں، ہم یہ کیسے یقینی بناتے ہیں کہ\nوہ صحیح طریقے سے حوالہ دے رہے ہیں، ہم یہ کیسے یقینی بنائیں گے کہ ہم ایسا کر رہے ہیں؟ Khanmigo اس میں بھی مدد کر سکتا ہے، اور یہ بھی ایک اچھا چیک ہے۔ طلباء کے لیے یہ سمجھنا ضروری ہے کہ حوالہ دینا کیا ہے، سرقہ کیا ہے، آپ AI کا حوالہ کیسے دیتے ہیں؟ آپ کیسے حوالہ دیتے ہیں کہ آپ نے\nاپنے کاغذ میں AI ٹول استعمال کیا ہے؟ اور یہ ایک اہم\nٹکڑا ہے جسے کئی بار، ٹھیک ہے، آپ جانتے ہیں، اگر میں نے اسے شریک لکھا، تو آپ جانتے ہیں کہ کیا، یہ\nایک شریک مصنف ہونے جیسا ہے۔ آپ کو اسے ایک ساتھ لکھنا ہوگا اور آپ کو\nاپنے استاد کو اس کی وضاحت کرنے کے قابل ہونا ہوگا۔ لہٰذا تحریر کے\nتمام شعبوں میں ان ٹولز کو استعمال کرنے کے قابل ہونا، اور دوبارہ، دعووں اور شواہد جیسی چیزوں کو زوم ان کرنے کے قابل ہونا،\n یا دلیل کو زوم ان کرنے کے قابل ہونا اس بات پر منحصر ہے کہ وہ کس قسم کی\nتحریر کر رہے ہیں اور کیا  جس قسم کی جانچ وہ لے رہے ہیں۔ کیونکہ جب ہم اب اپنے AP اور IB اور ACE امتحانات میں سے کچھ کو بھی دیکھنا شروع کرتے ہیں، تو انہیں بھی ایسا کرنے کے قابل ہونا پڑے گا، اور یہ تمام سطحوں کے لیے بہترین مشق ہے۔ - ہاں، اور یہ گفتگو\nمجھے واپس جا کر مضامین پڑھانے پر مجبور کر رہی ہے، جس میں میں زیادہ کامیاب نہیں ہوا،\nآئیے ایماندار بنیں۔ ٹھیک ہے، تو کچھ لوگ\nچیٹ میں چیٹ کر رہے ہیں، تحریری کوچ کے بارے میں واقعی پرجوش ہیں۔ واقعی بہت پرجوش، ہاں، ہم\nہر ایک کو ریکارڈنگ بھیجنے والے ہیں، لہذا آپ ویبینار کے لیے سائن اپ کر کے ایک کیئر پیکج حاصل کر سکتے ہیں۔\n آپ کا خیرمقدم ہے، اور\nاس کیئر پیکج کا حصہ، اس پرجوش ہونے کے لیے نہیں، یہ صرف ایک ریکارڈنگ اور کچھ وسائل ہیں۔ لیکن وسائل کی بات کرتے ہوئے،\nچا کی بات کرتے ہوئے، میں واقعی تصادفی طور پر سیگو کر رہا ہوں، میں چیلنجوں، مواقعوں میں پڑنے والا ہوں۔ میں بہت سی چیزوں کے بارے میں پرجوش ہوں۔ \"کاش میں جے گیٹسبی کے\nساتھ واقعی لمبی بات چیت کر سکتا۔ \" اب آپ خانمیگو کے ذریعے کر سکتے ہیں،\nلیکن میں اس وقت واپس نہیں آ سکتا تھا، لیکن آپ کے خیال میں وہ کون سی چیزیں ہیں جن پر عمل کرنے سے لوگ گھبرائیں گے؟ ڈیونا، آپ ہمیں باہر کیوں نہیں لاتیں؟ کچھ مواقع\nیا چیلنجز۔ - ٹھیک ہے، مجھے لگتا ہے کہ بہت سی چیزوں میں سے ایک،\n جیسے کہ دیگر AI کے ساتھ،\nKhanmigo کے بارے میں اچھی بات یہ ہے کہ طلباء کو Khanmigo کے پاس جانے اور کہنے کا موقع نہیں ملتا،\n\"میرے لیے میرا مضمون لکھو۔\" خانمیگو ایک سقراطی ٹیوٹر ہے،\nاور اسی وجہ سے، خانمیگو واپس آنے والا ہے، اور میرے خیال میں خانمیگو کو\nبہترین شخصیت پسند ہے، یا اگر آپ اسے کہنا چاہتے ہیں، لیکن اس کی شخصیت تھوڑی ہے\nکیونکہ یہ کہے گا، \"ہاں،  لیکن آپ کے AI ٹیوٹر کے طور پر،\nمیں آپ کا پیپر نہیں لکھ سکتا، لیکن آئیے اس موضوع کے بارے میں سوچتے ہیں۔\" یہ ہمیشہ طالب علم کو واپس لاتا ہے، تو ایسا نہیں ہوگا، یہ\nصرف ان کے لیے کام نہیں کرے گا۔ وہ عمل، خاص طور پر تحریر میں، لکھنا ایک عمل ہے، ٹھیک ہے؟ تو، آپ جانتے ہیں، کوئی بات نہیں، آپ جانتے ہیں، طالب علموں کو اب بھی بات کرنے کے قابل ہونے کی ضرورت ہے کہ مجھے یہ خیال کیسے آیا؟ آپ جانتے ہیں، میں نے کیا ترمیم کی؟ یہ ایک بات ہے، یہ صرف\nایک دن، آپ جانتے ہیں، کل آپ\nصرف دو جملے لکھ رہے تھے، اب آج آپ پورا مقالہ کر سکتے ہیں؟ جیسا کہ، آپ جانتے ہیں، ایسا ہے تو آپ کو ابھی بھی\nطالب علم بنانا ہے، طلباء کو اب بھی\nاس سے بات کرنے کے قابل ہونے کی ضرورت ہے۔ لہذا میں سمجھتا ہوں کہ طالب علموں کو جوابدہ رکھنے کا یہ ایک بہترین موقع ہے، لیکن پھر بھی ان کے پاس ایک اسسٹنٹ موجود ہے بغیر اس کے کہ وہ ان کے لیے کام کرے۔ میرے خیال میں چیلنجوں میں سے ایک جو آپ جانتے ہیں، ہمیں یہ بھی درپیش ہے کہ وہ\nطالب علموں کو خانمیگو کے ساتھ ان بات چیت کو\nآگے پیچھے کرنے کی تربیت دیں۔ آپ جانتے ہیں، یہ کہنا ایک چیز ہے، \"مجھے سمجھ نہیں آ رہی، آپ\nجانتے ہیں، یہ مخصوص موضوع، آپ جانتے ہیں، کہ ہم پڑھ رہے ہیں،\" لیکن طلباء اب بھی اس\nطرح کی ذہنیت رکھتے ہیں کہ خانمیگو ایک سرچ\nانجن ہے، اور یہ  نہیں  یہ اور بھی ہے کہ اسے \nآسان بنانے کے لیے کہیں، اسے واضح کرنے کے لیے کہیں، آپ جانتے ہیں، آپ کے لیے واضح کریں کہ اس سے\nآپ کا کیا مطلب ہے؟ آپ جانتے ہیں،\nاس متن کا تجزیہ کرنے کا کیا مطلب ہے؟ یا، آپ جانتے ہیں کہ\nان باتوں کو آگے پیچھے کرنا ہے ، یہ آپ کو معلوم ہے، چیلنجوں میں سے ایک ہے، لیکن\nآپ کو صرف اس بات کو یقینی بنانا ہوگا کہ آپ اپنے طلباء کو کوچنگ دے رہے ہیں\nاور ان کے لیے ماڈلنگ کر رہے ہیں، آپ جانتے ہیں کہ، واپسی پر بات چیت کیسے کی جائے۔\nاور آگے خانمیگو کے ساتھ۔ یہ ایک نہیں ہے اور ہو گیا ہے۔ - درست، اور AI کا مقصد انسانی ذہانت،\nانسانی تجربے کو بڑھانا ہے، ٹھیک ہے؟ کیونکہ ہم اب بھی بات چیت کو واپس اپنے کلاس رومز میں لانا چاہتے ہیں۔ میں نے ابھی\nآپ سب کے لیے جسٹن ٹمبرلاک کا حوالہ دیا ہے۔ تو، سارہ، جب ہم\nچیلنجوں کے بارے میں سوچتے ہیں، ٹھیک ہے؟ میرا مطلب ہے، انسانی تجربے کے بارے میں سوچتے ہوئے، اس پر\n آپ کے کچھ خیالات کیا ہیں؟ - ہاں، میں اس سے اتفاق کرتا ہوں، آپ جانتے ہیں، برناڈیٹ\nاور ڈیونا جو کچھ کہہ رہے ہیں۔ مجھے ایسا لگتا ہے کہ یہ\nعام غلط فہمی ہے کہ AI چیٹ بوٹس کے برابر ہے، اور، آپ جانتے ہیں، یہ شاید\n AI کے ساتھ بات چیت کرنے کا سب سے زیادہ معروف فارمیٹ ہے جس سے اساتذہ واقف ہیں،\nلیکن مجھے نہیں لگتا کہ ہمیں\nAI کو مربوط کرنے کے بارے میں سوچنا چاہیے۔ خواندگی کے کلاس رومز میں صرف\nطلباء کے لیے AI کے ساتھ چیٹ کرنے کے مزید طریقے تلاش کرنا۔ میرا اصل میں، میرا مطلب ہے، جب میں\n اپنے پڑھنے والے کلاس رومز میں ایک استاد کی حیثیت سے بہترین لمحات کے بارے میں سوچتا ہوں، اپنے تحریری کلاس رومز میں، یہ وہ لمحات تھے جب\nہم ایک ساتھ اور ایک دوسرے کے ساتھ، اپنے\nساتھیوں اور گروپوں کے ساتھ کتابوں اور اس کے بارے میں بات کر رہے تھے۔  ،\nآپ جانتے ہیں، بڑے تھیمز، اہم کردار،\nاور ہر طرح کی طرح، آپ جانتے ہیں، صرف وہ بھرپور تجربات جو آپ کے پاس ہوتے ہیں جب آپ لکھ رہے ہوتے ہیں اور جب آپ ایک\nساتھ کچھ پڑھ رہے ہوتے ہیں۔ اور ایک چیز جس کے بارے میں میں\nچاہتا ہوں کہ لوگ اس سے دور رہیں یہ سمجھ ہے کہ AI کو خواندگی کے کلاس رومز میں لانے کا مطلب یہ نہیں ہے کہ وہ وقت نکال دیا جائے جہاں\nہم ایک دوسرے سے جڑ رہے ہوں اور ہم ایک دوسرے سے بات کر رہے ہوں، میرے خیال میں یہ ہے۔\n \nواقعی تخلیقی سیکھنے کے تجربات اور مواد تیار کرنے کے لیے بہتر ٹولز کے ساتھ اساتذہ کو فعال کرنے اور پڑھنے اور لکھنے کے مشکل حصوں میں طالب علموں کی مدد کرنے کے ساتھ بہت کچھ کرنا ہے جو اکثر\nآزادانہ طور پر تجربہ کیا جاتا ہے۔  اس لیے آپ کو معلوم ہے کہ آپ کے استاد نے ایک مقالے کو پڑھنا جس پر آپ کو\nنشان زد کیا گیا ہے، آپ جانتے ہیں کہ یہ اتنا\nالگ تھلگ کرنے والا تجربہ نہیں ہونا چاہیے، اور ہم جانتے ہیں کہ ہر استاد کے پاس\nبیٹھ کر ایسا کرنے کا وقت نہیں ہوتا۔ ہر بچے کے ساتھ وقت اور پھر پڑھنے کے ساتھ ایک ہی چیز، آپ جانتے ہیں، اکثر اوقات ایسے\nلمحات آتے ہیں جب\nآپ کچھ پڑھ رہے ہوتے ہیں، اور ہم یہ نہیں چاہتے کہ کتاب پر بحث کرنے کے اس پورے کلاس روم کے تجربے کو ختم کر دیں۔ \nاور اس کا کیا مطلب ہے، اور یہ وہ تجربات ہیں جن کے بارے میں میرے خیال میں AI بہت مدد کر سکتا ہے۔ اور پھر، اسے بہت زیادہ، اساتذہ کے لیے تخلیقی پارٹنر تک رسائی حاصل کرنا بہت آسان بناتا ہے، کسی ایسی \nچیز تک جس سے انہیں پروجیکٹ یا کلاس ڈسکشن کی منصوبہ بندی کرنے میں مدد مل سکتی ہے، طلباء کو موقع دیتے ہیں،\nجیسا کہ برناڈیٹ نے ذکر کیا، کسی ادبی کے ساتھ بات چیت کرنے کا۔\nایک کتاب کا کردار جسے وہ پڑھ رہے ہیں، لیکن پھر اس کے بارے میں ایک کلاس کے طور پر بات کریں، جیسے آپس میں گفتگو، \"ہم نے اس تجربے کے بارے میں کیا سوچا؟ جیسے، کیا یہ مستند محسوس ہوا؟ جیسے، AI کے بارے میں کیا\nلگتا ہے کہ ایسا ہو سکتا ہے  کیا آپ جانتے ہیں کہ\nمصنف نے جو کتاب لکھی تھی اس میں مصنف کا کیا ارادہ تھا، اور کیوں؟ جیسے، یہ ایک ایسے مضمون کے لیے واقعی ایک\nشاندار جمپنگ آف پوائنٹ ہے جسے وہ لکھ سکتے ہیں۔ لہذا، بہت سارے طریقے ہیں\nجن سے آپ AI کو کلاس روم کے تجربات میں ضم کر سکتے ہیں جو ضروری\nنہیں کہ آپ جانتے ہیں، طلباء کو ان کی اسکرینوں کے سامنے الگ تھلگ رکھیں۔\n میرے خیال میں سب سے بہتر استعمال کا معاملہ جس کی طرف ہم سب چل سکتے ہیں وہ وہ\nطریقے ہیں جن سے ہم AI کو درحقیقت\nسیکھنے کے مزید تجربات کی حوصلہ افزائی کے لیے کر سکتے ہیں جو باہمی تعاون پر مبنی اور\nفرقہ وارانہ ہوں، کیونکہ ایک بار پھر، میرے خیال میں وہیں سے\nتمام خوشی نکلتی ہے۔ اور میں سمجھتا ہوں کہ اگر ہم مزید طلباء تک رسائی میں مدد کرنے کے لیے AI حاصل کرنے میں کامیاب ہو جاتے ہیں، آپ جانتے ہیں، امیر اور درجے کی سطح کے مناسب متن، تو میں سمجھتا ہوں کہ ہم\n اس قسم کی کلاس\nڈسکشن اور مصروفیت کے بہت زیادہ مواقع دیکھ سکتے ہیں۔ - بالکل، اور میں\nپسند کروں گا کہ ہم ایک منٹ نکالیں، اور واقعی، ہم نے\nاپنے استاد کی ٹوپیاں پہن رکھی ہیں، لیکن میں چاہتا ہوں کہ ہم اپنے\nاستاد کی ٹوپیاں دوبارہ پہنیں، اور میں چاہتا ہوں کہ آپ اس کے بارے میں سوچیں کہ\nشاید کوئی ایسی چیز تھی جو واقعی\nآپ کے لیے چیلنج تھا جب آپ پڑھا رہے تھے، آپ جانتے ہیں، سوشل اسٹڈیز، خواندگی، میرے لیے، خصوصی تعلیم، کہ یہ ٹول\nفوری طور پر مدد کر سکتا تھا، جیسے اس درد کے نقطہ کو حل کیا جا سکتا ہے؟ برناڈیٹ، آپ کے بارے میں کیا خیال ہے؟ ایسی کیا چیز ہے جو شاید آپ کی طرح ہوتی، \"کاش میرے پاس یہ ہوتا۔\" - کاش میرے پاس یہ ہوتا، تو میں وہاں سوچتا ہوں، میرے خیال میں اس کی بہت سی سطحیں ہیں، کیونکہ خانمیگو ٹیچر ٹولز بہت متنوع اور متنوع ہیں۔ میں سمجھتا ہوں کہ\nویبنار میں واقعی ان سب کو دیکھنے کے لیے کافی وقت نہیں ہے، لیکن کچھ چیزیں\nجن کے بارے میں جب میں سوچتا ہوں، آپ جانتے ہیں، ایک استاد کے طور پر، میں ہمیشہ یہ یقینی بنانا چاہتا تھا\nکہ میرے طلباء درست تھے۔ اور یہ کہ ہم درستگی کو یقینی بنا رہے تھے۔ اور میں جانتا ہوں کہ جب میں نے پہلی بار،\nآپ جانتے ہیں، AI کے بارے میں سوچا، آپ جانتے ہیں، یہ\nجنگلی، جنگلی مغرب تھا، آپ جانتے ہیں؟ یہ AI تھا اور\nمیرے بچوں کے لیے سب کچھ لکھ رہا تھا، اور یہ\nان کا اپنا کوئی اصل کام نہیں تھا، اور یہ میرے لیے شاید سب\nسے بڑا درد اور خوف تھا جب میں نے\nAI میں سوچنا اور دیکھنا شروع کیا۔ میں\nخانمیگو اور خان اکیڈمی کے بارے میں بالکل پسند کرتا ہوں حقیقت یہ ہے کہ ایسا نہیں ہے۔ یہ آپ کے طالب علم کا اصل کام ہے۔ جب وہ\nایک مضمون کے جنریٹر کے ساتھ کام کر رہے ہوتے ہیں، طالب علموں کو\nاپنے خیالات اور نظریات کو پیش کرنا ہوتا ہے اور اپنے کرداروں کو تیار کرنا ہوتا ہے۔ Khanmigo اس کو وسعت دینے اور اپنی ذخیرہ الفاظ کو اپ ڈیٹ کرنے میں ان کی مدد کر سکتا ہے اور ان\nرسیلی جملوں اور رسیلی الفاظ کو دیکھنے میں ان کی مدد کر سکتا ہے، لیکن یہ وہ جگہیں ہیں جہاں\nجب ہم اس درستگی کو یقینی بنانے کے بارے میں بات کرنا شروع کرتے ہیں تو \nیہ طالب علم کا تخلیق کردہ کام ہے۔ ایسا نہیں ہے، \"میں نے ایک موضوع میں پھینک دیا\nاور، آپ جانتے ہیں، یہ مضمون میرے لیے تھوک دیا گیا تھا،\" اور میں سمجھتا ہوں کہ یہ واقعی، ایک استاد کے طور پر بہت اہم ہے، اور اس سے میرا خوف ہمیشہ رہتا تھا۔ میرے خیال میں دوسری چیز یہ ہے کہ\nپوری رائے کا ٹکڑا۔ آپ جانتے ہیں، جب آپ کے پاس\n20، 25، 30 یا اس سے زیادہ طلباء کی کلاس ہوتی ہے، تو آپ \nمستقل بنیادوں پر انفرادی رائے کیسے دیتے ہیں؟ میں یہ کہنا پسند کروں گا کہ میں نے ہر روز ہر ایک طالب علم کے ساتھ کیا، کوئی راستہ نہیں تھا، کوئی راستہ نہیں تھا۔ لیکن خان اکیڈمی اور\nاے آئی کے ساتھ اور خانمیگو کے ساتھ، ایک استاد اندر جا سکتا ہے اور کہہ سکتا ہے، \"ٹھیک ہے، میں چاہتا ہوں کہ آپ اپنے مضامین ڈالیں۔ میں چاہتا ہوں کہ ہر کوئی\nآپ کے اپنے تعارف کو دیکھے اور اس پر بات کرے،\" اور پھر  یہاں تک کہ ان\nفیڈ بیک کے بارے میں کلاس ڈسکشن کریں جو انہیں خانمیگو سے AI سے اس تعارف\nیا ان کے اختتام یا ان کے دعووں کے بارے میں ملا ہے، چاہے\nوہ ٹکڑے کچھ بھی ہوں۔ اور اب یہ ہے کہ ایک طالب علم کو\nوہ انفرادی کام مل رہا ہے، اور یہاں تک کہ جب وہ گھر پر ہوں، ہو سکتا ہے کہ وہ گھر پر لکھ رہے ہوں، یا ہو سکتا ہے کہ آپ کسی چھوٹے گروپ کے ساتھ کام کر رہے ہوں اور آپ کی باقی کلاس\nوہاں بیٹھی ہو،  جب آپ جسمانی طور پر ایسا نہیں کر سکتے تو یہ\nآپ کے طالب علموں کے لیے ون آن ون حاصل کرنے کا ایک موقع ہے۔\n جو بدقسمتی سے\nاساتذہ کے طور پر ختم ہوتا ہے، اور خاص طور پر اگر وہ گھر سے کام لے کر گھر سے لکھ رہے ہوں۔ آپ اس بات کو یقینی بنانا چاہتے ہیں کہ\nوہ نہیں ہیں، آپ جانتے ہیں، بس ایسا کرنے کے لیے ایک AI حاصل کر رہے ہیں، کیونکہ جب وہ\nاسے مضمون کے چیکر میں ڈالتے ہیں، تو AI اسے دیکھ کر جاتا ہے، \"ارے، آپ جانتے ہیں، کیا آپ کو یقین ہے؟ تمہیں یہ کہاں سے ملا؟\" اور یہ وہ چیز ہے جو\nایک استاد کے طور پر میرے لیے یہ جاننا ضروری ہے کہ وہاں درستگی ہے اور وہ رائے حاصل کر رہے ہیں، اور انہیں اچھی\nرائے مل رہی ہے، اور یہ ان کے کام پر ہے۔ - ہاں، پچھلی بار جب میں نے چیک کیا تھا،\nہم اب بھی اساتذہ کا کلون نہیں کر سکتے، اس لیے یہ فیڈ بیک کرنے کے قابل ہونے کا واقعی ایک اہم طریقہ ہے۔ ڈیونا، آپ کا کیا خیال ہے؟ تمہارا کیا ہوگا؟ - واہ، ایک جوڑے ہیں. ٹھیک ہے، وہاں ایک جوڑا ہے۔ روبرک جنریٹر۔ حقیقت یہ ہے کہ میں کر سکتا ہوں، آپ کو معلوم ہے،\nمیں نے بہت زیادہ وقت آن لائن\nروبرک تلاش کرنے کی کوشش میں صرف کیا تھا، آپ جانتے ہیں، جو کہ\nہم اپنے طالب علموں کے لیے کر رہے ہیں، آپ کو معلوم ہے۔ اور پھر کبھی کبھی،\nآپ جانتے ہیں، یہ پی ڈی ایف تھی، اس لیے میں اس میں جا کر\nکسی قسم کی ترمیم نہیں کر سکتا تھا۔ اور اس لیے یہ حقیقت کہ یہاں\nایک حقیقی روبرک جنریٹر ہے، آپ جانتے ہیں، مدد کرنے کے لیے، میرے طالب علموں کی تحریر میں مدد کرنا حیرت انگیز ہے۔ دوسری جو میرے سامنے آتی ہے وہ تفریحی کلاس کا خلاصہ نظم ہے۔ آپ جانتے ہیں، جب میں\nاپنے طلباء کے بارے میں سوچتا ہوں اور، آپ جانتے ہیں، آپ اس سبق کو سمیٹنے کا انتظار کرنا چاہتے ہیں، ٹھیک ہے؟  ہو سکتا ہے، آپ جانتے ہو، صرف\nمرکزی خیال کے بارے میں بات کر رہے ہیں۔ میرے طالب علم ریپ\nمیوزک کو پسند کرتے تھے، اس لیے شاعری اور ریپ، آپ جانتے ہیں، وہ ایک دوسرے کے ساتھ چلتے ہیں۔ اور اس لیے مجھے لگتا ہے کہ یہ\nبہت اچھا لگا ہوگا، کیونکہ میں ایک گیت نگار نہیں ہوں،\nمیں اس طرح کی فوری چیزیں نہیں لے سکتا، اور پھر اس میں شامل ہو\nسکتا ہے کہ وہ چیزیں بھی شامل کریں جو وہ پسند کرتے ہیں،  آپ\nجانتے ہیں، اس تفریحی کلاس میں، یہ تفریحی کلاس کا خلاصہ نظم ہے، کیونکہ طلباء کو\nآپ کو اس کے بارے میں رائے دینا ہے، \"آج ہم نے کیا سیکھا،\nمجھے کچھ آئیڈیاز دیں۔\" اور پھر یہ تخلیق کرتا ہے اور\nاس سبق کو نظم کی طرح اس عمدہ خلاصے میں سمیٹ دیتا ہے۔ اور مجھے لگتا ہے کہ، آپ جانتے ہیں، اس سبق کو بند کرنے کا یہ صرف ایک تفریحی\nطریقہ ہوتا۔ میرے لیے یہ بھی مشکل تھا، آپ\nجانتے ہیں، اگر آپ کے طلباء کہتے ہیں، \"ارے، مجھے 'فورٹناائٹ' پسند ہے، یا مجھے یہ گیم پسند ہے یا وہ گیم،\" میں صرف ان کی وجہ سے جانتا تھا،\nلیکن ابھی کچھ، قابل ہونا  ان چیزوں کو پیدا کرنا اور ان کے\nبارے میں بات کرنا بغیر\nکسی بچے کا انٹرویو کیے یا کچھ اور وقت نکالنا کہ میں خود اس پر تحقیق کرنے کی اپنی منصوبہ بندی سے دور نہیں ہوں،\n میرے لیے حیرت انگیز بات ہے۔ تو میں واقعی میں چاہتا ہوں کہ میرے پاس\nوہ روبرک جنریٹر ہوتا، اور جیسا کہ میں نے کہا، مضحکہ خیز\nکلاس کا خلاصہ نظم میرے جانے والوں میں سے ایک ہوتا۔ - یہ حیرت انگیز ہے. لہذا ہم صرف ایک\nساتھ اپنا وقت گزار رہے ہیں، لیکن میں چاہتا ہوں، میں صرف\nسارہ کے پاس آخری لفظ ہونے والا ہوں۔ آئیے 5،\n10 سال مستقبل کے بارے میں سوچتے ہیں۔  خواندگی کی تعلیم کے لیے آپ کے خواب اور امیدیں کیا ہیں\n؟ اب ہم جو کچھ جانتے ہیں اسے جان کر وہاں کیسی یوٹوپیائی دنیا ہوسکتی ہے؟ - ہاں، یہ بہت اچھا سوال ہے۔ تو، میرا مطلب ہے، میرا دماغ ان\nتمام مختلف طریقوں سے گھومنے کی طرح ہے جو\nہمارے پاس موجود موجودہ ٹولز اور ہمارے پاس موجود موجودہ ٹکنالوجی کلاس روم میں میری مدد کر سکتی تھی، اور جو گھنٹے میں نے گزارے،\nگھنٹوں اور گھنٹے اور گھنٹے وہ کام کرتے رہے جو  AI\nاب سیکنڈوں میں کر سکتا ہے۔ میرے خیال میں چیلنجوں میں سے ایک یہ ہے کہ،\nآپ جانتے ہیں، جیسے، میں نے\nیہاں خان اکیڈمی میں اپنے کردار میں سیکھا ہے کہ کس طرح کافی مہذب فوری انجینئر بننا ہے، جس کا مطلب ہے کہ میں جانتا ہوں کہ\nAI سے بات کرنے کا طریقہ مجھے دینے کے لیے  وہ چیزیں جن کی مجھے ضرورت ہے، لیکن تمام اساتذہ کے پاس وہ مہارتیں نہیں ہیں۔ اور\nKhanmigo ٹیچر ٹولز کا ایک فائدہ، جس کے لیے آپ سبھی\nابھی جا کر Khanmigo dot AI لنک پر سائن اپ کر سکتے ہیں جو میرے خیال میں ہم نے چیٹ میں ڈال دیا ہے، لیکن ان ٹولز کا ایک فائدہ یہ ہے کہ  ان میں سے بہت سی چیزوں کو کرنے کے لیے آپ کو\nایک ہنر مند فوری انجینئر بننے کی ضرورت نہیں ہے۔ لیکن آگے کے بارے میں سوچتے ہوئے، آپ جانتے ہیں، اگلے پانچ سال یا اس سے زیادہ، یہ اندازہ لگانا مشکل ہے کہ ہم کہاں جا رہے ہیں۔ لیکن میں اس سے بھی زیادہ قسم کے اپنی مرضی کے لچکدار\nٹولز کا تصور کر رہا ہوں جو خاص طور پر ELA اساتذہ کے لیے بنائے گئے ہیں۔ ہمارے خانمیگو کے بہت سارے ٹولز\nاب کسی بھی مضمون کے لیے استعمال کیے جا سکتے ہیں، لیکن میں واقعی میں کچھ چیزوں کے بارے میں بہت پرجوش ہوں\nجو ہم ہیں، ہمارے پاس\nہدایات کو پڑھنے اور سمجھنے کے لیے کام کر رہے ہیں\nجہاں اساتذہ کو اس کی ضرورت نہیں ہے، آپ جانتے ہیں  تیار کرنے کے لیے اس سامنے کا زیادہ تر کام کریں۔\n مجھے صرف اتنا یاد ہے کہ\nمجھے ایک متن تلاش کرنے میں کافی وقت لگا جسے میں استعمال کرنا چاہتا ہوں، اور\nپھر وہ متن اپنے طلباء کے لیے تیار کریں تاکہ\nوہ سہاروں اور سوالات کے ساتھ اس تک رسائی حاصل کر سکیں اور تمام مختلف\nطریقوں سے ہم اس پر گفتگو کریں گے۔ تو میں یہ بھی نہیں سوچتا کہ یہ پانچ سال ہے، میرے خیال میں یہ خان اکیڈمی سے چھ ماہ بعد کی طرح ہے،\n لیکن بالکل اسی طرح جیسے\nاساتذہ کا بہت زیادہ وقت خالی کرنا۔ اور جب میں\nطالب علم کے نقطہ نظر سے اس کے بارے میں سوچتا ہوں، تو بس اس بات کو واپس بلاتا ہوں جس کے\nبارے میں میں پہلے بات کر رہا تھا بالکل\nکلاس روم کے بھرپور تجربات کی طرح جہاں طلباء ضروری طور پر اسکرین پر کیا ہو رہا ہے اس پر توجہ نہیں دیتے ہیں،\n اور ممکن ہے کہ\nمدد فراہم کرنے کے لیے ٹیکنالوجی موجود ہو۔ جہاں انہیں اس کی ضرورت ہے، یا، آپ جانتے ہیں، طالب علموں کی حوصلہ افزائی کے لیے،\nجب انہیں ضرورت ہو تو ساتھی بنیں۔ میرے خیال میں کچھ عمدہ چیزیں ہیں جن کا ہم ابھی خواب دیکھ رہے ہیں\nجب بات آتی ہے، آپ جانتے ہیں، طالب علم کی\nمصروفیت اور گیمیفیکیشن اور طالب علم کی حوصلہ افزائی\nجس کے لیے ہم AI کا استعمال کر سکتے ہیں۔ لیکن ہاں، مجھے لگتا ہے کہ مستقبل صرف یہ ہے کہ آئیے طلبہ کو مزید اکٹھا کریں، اور آئیے اساتذہ کو لائیں، آئیے اساتذہ کو مزید بنائیں، آپ جانتے ہیں، سیکھنے کا ایک سہولت کار\nبمقابلہ ان ٹاسک ماسٹرز جنہیں بس بہت ساری چیزیں کرنے پڑتے ہیں۔ ایک ہی وقت میں عام طور پر. لہذا میں سمجھتا ہوں کہ\nواقعی بہت سارے، واقعی دلچسپ، تفریحی،\nاختراعی، سخت، مختلف تجربات ہیں\nجن کا ہم یہاں خواب دیکھ رہے ہیں جو امید ہے کہ پڑھنے اور لکھنے کی کلاسیں بنائیں گے\nجو مستقبل کے لیے بہت زیادہ طاقتور اور پرجوش ہیں۔  سیکھنے والے - اوہ، سنو، کون نہیں چاہتا کہ\nآپ کے کلاس روم میں اس سے زیادہ ہو اور کچھ وقت بچاؤ؟ کوئی، کوئی؟ یقیناً آپ کچھ وقت بچانا چاہتے ہیں۔ وقت کی بات کرتے ہوئے، بدقسمتی سے، ہمارے پاس آج کے لیے اتنا ہی وقت ہے۔ اپنے حیرت انگیز پینلسٹس کا\n ان کے کلاس روم کے تجربے سے اپنی بصیرت اور خیالات کا اشتراک کرنے کے لیے آپ کا شکریہ،\n اور میں صرف یہ بتانا چاہتا ہوں کہ ہم آپ کے ساتھ کام جاری رکھنا چاہتے ہیں۔ اگر آپ ہمارے ساتھ کام کرنا چاہتے ہیں، میرا مطلب ہے، ہم بہت کچھ پیش کرتے ہیں، آپ ابھی جا کر\nخان اکیڈمی کے لیے سائن اپ کر سکتے ہیں، لیکن اگر آپ\nگہری شراکت داری چاہتے ہیں، تو ہم\nضلعی شراکت داری کے نام سے کچھ پیش کرتے ہیں جہاں آپ کو ایک کامیاب مینیجر ملتا ہے۔ اور موزوں پیشہ ورانہ\nتعلیم جو آپ کی ضروریات کو پورا کرتی ہے۔ یہاں تک کہ ہم آپ کی\nایم ٹی ایس ایس، تمام چیزوں، ڈسٹرکٹ\nٹریکنگ بورڈز کے ڈیٹا کے تجزیہ میں بھی مدد کر سکتے ہیں، آپ اس کا نام بتائیں۔ ہمارے پاس یہ ڈیٹا موجود ہوگا جب یہ سمجھ میں آئے گا کہ آپ کے\nطلباء خان کے ساتھ کہاں ہیں۔ لیکن سب سے اہم بات، ہم\nواقعی اس بات کو یقینی بنا رہے ہیں کہ Khanmigo محفوظ اور اخلاقی ہے، اور یہ کہ بہت سارے\nمحافظ ہیں، اور ایسا نہیں ہے، اور ہم واقعی\nہر ایک دن اس کے بارے میں سوچ رہے ہیں۔ ہم اسے صرف باہر نہیں پھینک رہے ہیں\nاور صرف اسے خوفناک بنا رہے ہیں۔  جس طرح سے ہم اسے بنا رہے ہیں اس کے بارے میں ہم واقعی ذہن نشین کر رہے ہیں۔ لہذا اگر آپ مزید جاننا چاہتے ہیں، تو یہ ہماری ضلعی شراکت دار ٹیم ہے۔ ہم آپ کے ساتھ جڑنا پسند کریں گے۔ اس QR کوڈ پر کلک کریں،\nاور جب تک ہم دوبارہ نہیں ملیں گے۔ پڑھتے رہیں، لکھتے رہیں، سیکھتے رہیں۔ ہم آپ سب کی تعریف کرتے ہیں۔",
    "t_spanish": "- Hola a todos, mi nombre\nes Danielle Sullivan. Mi función en Khan Academy\nes la de gerente senior de Asociaciones del Distrito Noreste, y mi función anterior de educadora\nes ser maestra de educación especial de quinto y sexto grado\n. Enseñé ELA y matemáticas en Washington DC y en el norte del estado de Nueva York, y dejaré que Sarah siga\nadelante y se presente. - Hola a todos, bienvenidos. Soy Sara Robertson. Actualmente soy el gerente senior de productos de los equipos de alfabetización y experiencia en el aula aquí en Khan Academy. Al igual que Danielle, fui\nmaestra de aula. Enseñé ELA en la escuela secundaria y durante un breve período como profesora de historia, pero principalmente lectura y escritura. Y también vengo de otra\nempresa de tecnología educativa centrada en la alfabetización. Creo que Danielle también se unió a\nnosotros desde otra. Y se lo pasaré a, hagámoslo con Diona. - Hola a todos. Soy Diona Clingman. Soy un especialista en aprendizaje profesional\nen Khan Academy. Al igual que mis colegas que\nestán en el panel conmigo, soy un ex maestro de aula. La primaria es donde está mi corazón.  He enseñado segundo grado,\ntercer grado y quinto grado. He realizado intervención conductual. He sido director de edificio, así como director académico. He estado en todos los niveles,\ndefinitivamente entiendo y me encanta conectarme con otros educadores. Y con eso, se lo\npaso a Bernadette. - Hola, soy Bernadette Bennett. Soy un\nespecialista en contenidos de aprendizaje profesional en Khan Academy. Soy un ex maestro de escuela secundaria y supervisor de estudios sociales del distrito\nde Florida, y estoy muy emocionado de\nestar con ustedes hoy. - Genial, así es como\nfuncionará esto. Vamos a dejar de compartir mi pantalla porque la atención se\ncentrará en la conversación. Así que tendremos una conversación realmente rica e interesante sobre el papel transformador de la IA y la\nmejora de los puntajes de alfabetización, porque, como saben, estoy\nseguro de que están sintiendo esto: muchos estudiantes se han sentido\nabandonados después de COVID, especialmente en alfabetización.  . Quiero decir, yo también diría matemáticas, pero hoy nos centramos en la alfabetización. Así que queremos profundizar y tener una conversación realmente profunda sobre cómo todos pueden comenzar a pensar\nen el aprendizaje adaptativo de la IA y en la retroalimentación personalizada para ayudar a los estudiantes a mejorar sus\nhabilidades de lectura y escritura. Y en realidad, hablemos\ntambién de un poco de alegría, ¿verdad? Me encanta la alfabetización. Aunque solo estamos hablando, publique comentarios en el\nchat y preguntas en el chat. Podré verlos y\ncomenzaremos con esta pregunta. Entonces, Sarah, no se suele pensar en Khan Academy... No se suele pensar en Khan Academy\ncomo una herramienta de referencia para la instrucción y el apoyo a la alfabetización. Pero aquí estamos, estamos haciendo\nun seminario web sobre alfabetización y ELA. Entonces, ¿qué ha cambiado? - Sí, de hecho me uní a Khan Academy hace aproximadamente un año y medio, que fue justo en\nel momento en que Khan Academy se había asociado con OpenAI sobre cómo podríamos usar\ngrandes modelos de lenguaje para crear\nexperiencias de aprendizaje realmente ricas. Y así, en mi primer día en Khan Academy, mi gerente me sentó\ny me dijo: \"Por cierto, tenemos esta asociación con OpenAI, ¿has oído hablar de ChatGPT?\" Y acababa de llegar de otro producto de herramienta EdTech complementaria de alfabetización y, ya sabes, tenía la\nalfabetización en mente, estaba muy emocionado de venir\na Khan Academy sabiendo que había oportunidades para crear nuevas herramientas y\ncontenido para la alfabetización. Entonces esto fue, se sintió como una señal de que había llegado\nexactamente en el momento correcto, porque lo que estábamos viendo con muchas de nuestras diferentes exploraciones que\nestábamos haciendo con ChatGPT y los grandes\nmodelos de lenguaje que eran, con los que estábamos experimentando. fue que algunas de las mejores experiencias que los LLM podrían apoyar estaban relacionadas con la instrucción de lectura\ny escritura.  Por eso, nos sumergimos de lleno\nen las diferentes formas en que podríamos aprovechar la IA\npara crear experiencias de aprendizaje ricas y realmente innovadoras para los estudiantes en lo que respecta a\nlectura y escritura.  El primer mes que estuve aquí hicimos un hackathon, y una de las características\nque surgió de eso fue nuestra actividad actual de retroalimentación de ensayos, de la cual hablaré un\npoco más más adelante. Pero también diré que cuanto\nmás nos hemos asociado en Khan Academy con los distritos\nen los últimos años, más claro nos resulta que la demanda de recursos flexibles y de alta calidad\npara ELA es mayor que nunca. Creo, nuevamente, que recién\nsaliendo de la pandemia y entrando en\nesta era de la IA, las clases de lectura y escritura se\nhan visto interrumpidas y debemos pensar\nen formas realmente creativas e innovadoras de\nllegar a los estudiantes ahora de una manera  De esa manera, tal vez sea un\npoco diferente a, ya sabes, cuando estaba en el aula y definitivamente cuando yo\nmismo era estudiante. Así que estamos muy entusiasmados\ncon algo de eso, de esas nuevas actividades que estamos construyendo. También estamos lanzando\nnuevos cursos de ELA para la escuela intermedia y\nsecundaria, creo que ya lanzamos\nel de sexto grado, y creo que\ntambién lanzaremos el de noveno y décimo grado para esta temporada de regreso a clases. Definitivamente es una nueva era,\nuna nueva era de Khan Academy, y estamos muy entusiasmados\ncon los nuevos recursos de lectura y escritura que estamos creando. - Sí, ¿y cuántos de\nustedes que están viendo esto a veces han tenido dificultades para apoyar a sus alumnos en la escritura?  ¿ Alguien siente ese dolor? Ése sería yo. Sí, hechos, exactamente. Entonces, el objetivo es ¿cómo podemos lograr que\nnuestros estudiantes sean más reflexivos en la\nforma en que se expresan? Así que quiero pensar detenidamente, han\nsido un par de años difíciles. ¿ Puedes creer que, por cierto, estamos en el 24, 2024? Solo estamos pensando en los estudiantes que se gradúan este\naño, comenzaron en 2020, así que, vaya, han sucedido muchas cosas\nen los últimos cuatro años. Entonces, pensando en los últimos cuatro años, Diona, ¿ cómo se puede aprovechar la IA para\nabordar algunas de las brechas que estamos viendo\nexasperadas por la pandemia, u oportunidades de aprendizaje si queremos darle un giro positivo? - Si absolutamente. No solo soy educador,\nsino que soy padre, por lo que mi hija está en su último año este año, por lo que parte de ese\nimpacto personal de la pandemia no solo me ha afectado no como educador, sino\ntambién como  un padre también. Cuando pienso en la IA y en cómo podríamos usarla\npara ayudar a aprovechar algunas de esas brechas, mi mente se dirige a esa\ninstrucción específica. Ya sabes, cuanto mayores sean las brechas, más\ninstrucción específica querrás brindar a tus estudiantes, ¿verdad? Pero también sé que, ya sabes, es fácil decir instrucción específica o planes para grupos pequeños, ¿ qué quieres hacer\ncon tus grupos pequeños? Pero en realidad se trata de un\nconjunto de planificación completamente distinto, ¿verdad? Así que estoy pensando en la\nplanificación de ese grupo pequeño. Entonces, cuando pienso en\nIA, pienso en algunas de estas herramientas que tenemos, como la capacidad de\nusar Khanmigo para, por ejemplo, agregar para ayudar a agrupar a sus estudiantes. Ya sabes, te está ayudando a\nagrupar a tus estudiantes. Incluso es ser un\nasistente para usted, incluso, puede preguntarlo, ¿en qué\nnecesitan trabajar mis alumnos? Entonces, recortar ese tiempo con la\nplanificación de grupos pequeños, simplemente tener ese apoyo en el\nmomento como maestro para saber cómo agrupo a mis alumnos y cuáles son esas cosas en las que, ya sabes, deberían estar trabajando. También pienso en el\nenfoque socioemocional, ¿no? Pensar en ese niño en su totalidad\ny abordar esas necesidades. Y sabemos que una de las cosas es que si los estudiantes están seguros, se sienten seguros como\nsi no lo supiera, ¿verdad? No sé qué está pasando, por lo que los estudiantes tienen la capacidad de discutir y hacer esas\npreguntas con Khanmigo, incluso cuando están pensando\nen análisis de texto, ¿verdad? Ayúdenme a entender, tengo\nuna pregunta sobre este texto que tal vez no quieran preguntar en voz alta frente a sus compañeros, así que aprovecharlo de esa manera creo que es solo una de muchas. - Si absolutamente. Quiero decir, todo lo que dijiste,\nla instrucción en grupos pequeños, nuevamente, ¿cuántos de los que miran han tenido problemas alguna vez con la\ninstrucción en grupos pequeños?  Los veo educadores de secundaria, los veo educadores de secundaria, ¿verdad? Sabemos que esta es una\npráctica realmente importante. Entonces, Sarah, ¿puedes hablarnos\nsobre tu punto de vista o algunas cosas en las que estás pensando en los\naños posteriores a COVID? - Sí, entonces, quiero decir, enseñé en un salón de clases\ndonde los estudiantes variaban, enseñé en un salón de clases de séptimo grado durante la mayor parte de mi tiempo en la enseñanza, y tuve estudiantes que estaban desde\nun nivel de lectura de segundo grado hasta un nivel de lectura de 12º grado.  ,\nen el medio, solo una gama muy amplia de niveles de habilidad. Y muchos de mis alumnos tuvieron dificultades con la fluidez y la comprensión,\no una combinación de ambas. Había todo tipo de necesidades diferentes en todo el salón, y sé que una de las\nmejores cosas que podemos hacer específicamente para los estudiantes que tienen deficiencias en las\nhabilidades de comprensión lectora, que yo\ndiría que para mis alumnos de séptimo grado fue el mayor desafío,\nfue  realmente asegurándose, A, de que tuvieran acceso\nal texto de su nivel de grado. Demasiados estudiantes ni\nsiquiera tienen la oportunidad de probar y, ya sabes, acceder\ny leer un texto de su nivel de grado, pero sabiendo que tantos\nestudiantes están por debajo del nivel de grado, ¿ cómo podemos estructurar la instrucción y cómo podemos crear\noportunidades para los estudiantes?  ¿ Para poder, ya sabes, completar\nlo que falta en el medio? Y algunas de las mejores\nestrategias para hacerlo están relacionadas con la enseñanza previa\ny la preparación previa a la lectura, lo que significa y parece\nactivar el conocimiento previo, hacer conexiones con el tema del\ntexto, desarrollar conocimientos previos\npara cualquiera de los esquemas que el estudiante  necesita\ntener en cuanto al tema del texto, ya sea\nficción o no ficción, enseñar previamente vocabulario de nivel dos y\nnivel tres y brindar a los estudiantes\noportunidades para practicar y conocer palabras\ncon las que quizás no estén familiarizados. Y luego, por supuesto, apoyarlos cuando se trata de\ndividir oraciones complejas, y una de las\ncosas realmente interesantes de tener una presencia de IA para\nayudar a los estudiantes con esto y ayudar a los profesores con esto\nes que muchas de estas cosas ahora son extremadamente fáciles\ny rápidas.  que ver con la IA. Entonces, cuando piensas en activar conocimientos previos\no hacer conexiones, todo lo que necesitas hacer es ir\na Khanmigo o cualquier herramienta de inteligencia artificial y hacer que mire el\ntexto e identifique preguntas y diferentes compromisos, tácticas para conseguirlo.  Pida a\nlos estudiantes que piensen en lo que este texto significa para ellos o si tienen algún tipo\nde conexión con el tema o los personajes del texto. Identificar qué\nconocimientos previos son necesarios para poder comprender\nde qué trata el texto y enseñarlo previamente, hacer que\nKhanmigo lo resuma para los estudiantes o hacerles preguntas sobre lo que ya saben\no lo que quieren saber, identificar y hacer que Khanmigo\nincluso identifique.  de un texto qué palabras de vocabulario\nprobablemente necesita saber un estudiante para poder\ncomprender algo. Y luego usar algunas de nuestras\nactividades de aprendizaje prediseñadas, como safari de palabras y\narquitecto de palabras, para practicar algunas de esas palabras diferentes incluso antes de llegar a la lectura. Y luego, cuando el estudiante está leyendo un texto de su nivel de grado, teniendo a Khanmigo allí en Khan Academy para apoyarlo si se topa con algo que es realmente complicado\no difícil de analizar, es, ya sabes, libre de juicios.  . No persona, sino IA para- - Soporte.\n- Para apoyar, sí, para acudir cuando están estancados y cuando realmente no saben, ya sabes, incluso por qué no entienden algo, pueden ir allí para hacer preguntas. Otra actividad realmente útil\nque recomendaría para los estudiantes que están por debajo del nivel de grado es que tenemos esta herramienta para maestros con Khanmigo llamada renivelador de texto. Y obviamente, como dije antes, es muy importante que los\nestudiantes no reciban simplemente textos que estén\nmuy por debajo del nivel de grado durante todo un año escolar. Es realmente importante que\ntengan oportunidades de acceder a textos de su nivel de grado. Entonces, una de las mejores maneras\nde usar el renivelador de texto es renivelar un texto que está\nal nivel de grado para los estudiantes, renivelarlo hacia abajo, ya\nsabes, un par de niveles, y luego hacer que Khanmigo\ntome ese texto renivelado y  Vuelva a nivelarlo\nhasta donde estaba antes. Y luego haga que los estudiantes\nmiren las tres versiones, pídales que miren la versión más fácil que la IA volvió a nivelar, y eso les ayudará a\ntener una comprensión básica de de qué se trata el texto, pídales que miren la\nversión mejorada. y luego pídales que\nlo comparen con el texto original y observen qué perdimos, ya sabes, cuando la IA tomó este texto y\nlo volvió a nivelar, qué cambió, qué aspectos del trabajo del autor o, ya sabes, diferentes\nelementos lingüísticos cambiaron.  ¿ Y cómo afectó eso\nal significado del texto?  Por lo tanto, hay muchos tipos\ndiferentes y creativos de usar la IA no solo para que los estudiantes accedan más fácilmente a los materiales de su grado, sino también para crear experiencias de aprendizaje divertidas y atractivas. - Quiero decir, dijiste mucho, Sarah, muchas joyas realmente sorprendentes, pero quiero escuchar el giro de Bernadette\n, porque Berna, tienes una\nperspectiva un poco diferente y experiencia en estudios sociales, y algo de lo que era Sarah.\ncompartir se basa en el vocabulario y ver texto auténtico y asegurarse de que los\nestudiantes tengan la capacidad de acceder a textos rigurosos. Así que me encantaría agregar algo de color y contexto desde su punto de vista sobre cómo ven que podemos ayudar a cerrar estas brechas. - Entonces, cuando pienso en los\nprofesores de estudios sociales que también trabajan mucho con vocabulario y con lectura y\ndocumentos de fuentes primarias, muchas veces cuando los estudiantes miran\ndocumentos de fuentes primarias, ya sabes, están mirando\nvocabulario arcaico, A veces miran\nun documento en cursiva. Entonces, puede usar la IA para centrarse en esos\ndocumentos fuente primarios y secundarios, puede hacer que la IA los modifique, pero aún tener ese\ndocumento original al lado para que un estudiante pueda ver\nese documento original, cómo se ve en un\nnivel de grado diferente, pero siempre poder regresar y buscar ese documento original, buscar ese vocabulario original y ayudar a los estudiantes a comprender, ya sabes, los matices que se pusieron\nen ese documento original, como dijo Sarah, que podrían pasarse por alto cuando tenemos un documento que no lo es, que no ha sido modificado. Pero la clave cuando analizamos la alfabetización disciplinaria en literatura\ny estudios sociales es garantizar que los estudiantes estén mirando ese documento original, por lo que poder tomar\nese documento original y permitirles acceder y comprender esos conceptos es realmente importante ya que\nlo juntas todo. - Gracias, entonces hay\nalgunas conversaciones en el chat sobre de qué diablos estamos hablando. Te daré un recurso al final o un código QR para saber más, pero hay enlaces en el chat.  En primer lugar, queremos tener una\nconversación enriquecedora sobre la alfabetización y la pospandemia, y sobre cómo\npodemos aprovechar las herramientas de inteligencia artificial. Pero tenemos algunas herramientas de inteligencia artificial realmente excelentes como parte de Khan Academy de las que\npuedes descubrir más cuando encuentres el enlace en el chat, pero quiero que realmente profundicemos\nmás en la lectura y la escritura, porque, como alguien\ndijo, predica en  el chat, luchando por lograr que los\nestudiantes realmente interactúen con una escritura significativa. Quiero decir, yo, mis alumnos, como\nex profesor de educación especial, tenían miedo de poner\nalgo en la página, ¿ alguien puede identificarse? Ellos recién estaban comenzando,\nno tenían generación de ideas, y fue realmente difícil\nporque yo tenía una inclusión total, así que estaba tratando de\napoyar a tantos estudiantes en un salón de ELA de sexto grado y ayudar a mis estudiantes, como decía\nDiona, a sentirse seguros.  , sintiéndose validado. Entonces, ¿cómo podría la retroalimentación personalizada mejorar las\nhabilidades de lectura y escritura de los estudiantes? Diona, comencemos\ncontigo y luego regresaremos.\n- Si absolutamente. Nuevamente pienso en\nese espacio seguro, ¿verdad? Simplemente sentirme bien con, ya sabes, poder hablar frente a todos, o poder saber si estoy escribiendo o estoy escribiendo\nla oración correcta, o simplemente hacer que se sientan cómodos. Así que me gusta el hecho de que\ntenemos, por ejemplo, la herramienta Tutor Me que me está dando clases de humanidades. Y así los estudiantes tienen la oportunidad de ser interrogados sobre\nciertas habilidades y, nuevamente, es ese espacio seguro. Simplemente sigo con eso porque sé que muchos de\nmis estudiantes vinieron a mí sin mucho conocimiento previo. Hablamos de eso antes, y cuando llegó el momento\nde esas discusiones en clase, ¿ qué hicieron algunos de ellos? Compórtate para salir, ¿verdad? O tal vez simplemente se cierren\nporque no quieren, no tienen nada que\naportar a la conversación. Entonces, tener herramientas como\ntutoría, ya sabes, en humanidades, donde\npuedes hacer esas preguntas sobre el texto antes\no incluso durante, ya sabes, como profesor, si\nlo tuviera en mi salón de clases, definitivamente modelaría para  ellos y crear oportunidades para ellos, crear oportunidades\npara que, ya sabes, respondan preguntas específicas, vayan, ya sabes, se comuniquen con Khanmigo. Pregúntale a Khanmigo, ya sabes,\npor qué sucede esto, y eso les dará ese contexto. La otra cosa interesante es que para aquellos estudiantes que puedan\ntener ese tipo de problemas con la lectura, ya sabes, leer con fluidez puede ser un problema, Khanmigo puede hablar con ellos. Entonces pueden tener sus auriculares puestos y casi se siente como\nuna conversación real porque lo que sucede\nes que, incluso si escribir no es mi fuerte,\ncomo estabas hablando con algunos de tus\nestudiantes de educación especial, ya sabes.  , puedes hablar con Khanmigo y decirle: \"Oye, ¿\npor qué sucede esto?\" Khanmigo lo generará y ahora tendrá la capacidad\nde responderte. Entonces, si escribir y leer\nno es el punto fuerte de un estudiante, ahora puede sentirse más empoderado porque ahora es casi\ncomo tener una conversación como la que tú y yo estamos teniendo\nen este momento para ayudarlos, ya sabes, a fortalecer esas habilidades.  . - Absolutamente. Entonces Sarah, ¿qué piensas sobre esto? - Sí, mencioné antes que\nuna de las primeras cosas que comenzamos a explorar\ncuando estábamos sumergiendo los pies en el grupo de IA fue la retroalimentación de ensayos, así que enseñé tanto a leer como a escribir. En la escuela donde enseñaba,\neran clases separadas y escribir era mucho más difícil. Creo que enseñar a\nleer por la razón principal de la retroalimentación\nes un gran desafío si tienes más de\n20 estudiantes en una clase, lo cual creo que hace la mayoría de los profesores. Entonces, la forma en que diseñamos la\nactividad de retroalimentación de ensayos académicos de Khanmigo fue una manera para que los estudiantes obtuvieran\nretroalimentación instantánea de alta calidad que fuera procesable y\norganizada por, ya sabes, área de retroalimentación específica\nsin tener que esperar días o incluso semanas.\npara obtener cualquier tipo de información de sus profesores. Entonces, la forma en que funciona\nes que un estudiante envía su borrador de ensayo, así como\ninformación sobre el ensayo tal como le fue asignado por su maestro, cualquier cosa relacionada con el género del ensayo o el nivel de grado en el que se encuentra, y luego ponemos  el ensayo\na través de todas estas indicaciones de IA muy, muy meticulosamente configuradas que generan retroalimentación\nen cinco áreas diferentes, y luego los estudiantes pueden navegar entre esas cinco áreas diferentes. Si hacen clic en un comentario, se resaltará de qué parte\ndel ensayo se trata.  Luego, el estudiante\ntambién puede conversar con Khanmigo sobre ese comentario y decir: \"No entiendo lo que\nquieres decir, ¿puedes explicar esto?\" O, \"¿Puedes darme un\nejemplo de, ya sabes, me estás diciendo que mi\ntesis no es muy sólida? ¿ Puedes darme un ejemplo de cómo se ve una tesis sólida?\". Y lo hará sin\ndarles nada de lo escrito para el ensayo en sí, por lo que está programado para evitar que los estudiantes\nusen la IA para hacer trampa. Y la mejor parte también es\nque los estudiantes pueden actualizar y revisar su ensayo y preguntarle a Khanmigo: \"Oye, ¿cómo se ve ahora? ¿ Qué piensas ahora?\". Y Khanmigo puede ver los comentarios de las referencias del estudiante\ny la edición que acaba de realizar y decir, sí, ya\nsabes lo que acabas de hacer. Marcas la casilla así, se ve genial, o puede decir, ya sabes, \"Creo que todavía necesitas un\npoco de trabajo aquí\", y es este espacio seguro para que los estudiantes obtengan apoyo de seguimiento,\npueden pedir más.  ayuda. Y como maestra, nuevamente, recuerdo estar en\nun salón de clases donde, ya sabes, a veces tenía como\nun mar de manos en el aire donde los niños decían: \"Estoy estancado\". O tal vez fue un estudiante que dijo: \"¿Puedes leer la oración?\" Y cada vez que escribían\nuna oración decían: \"¿Puedes leer la oración?\" Y luego había otros estudiantes que simplemente tenían la cabeza gacha, o los que normalmente\nnecesitaban más ayuda no tenían las manos en alto. Y la mejor parte de esto es que permite a los estudiantes pedir\nayuda a Khanmigo cuando la necesitan, pero también les permite a Khanmigo hacer algunas de esas comprobaciones para los estudiantes incluso si no la piden. Entonces, una de las cosas en las que estamos trabajando ahora se llama Entrenador de escritura, que se basa en la\nactividad de retroalimentación del ensayo y, de hecho, guía a los estudiantes a través de todo el proceso del ensayo. Así que uno en particular\nrealmente se dirige a aquellos niños que simplemente se sienten realmente estancados, realmente desconectados, como si sintieran que\nno saben por dónde empezar. Y también estamos entusiasmados\ncon las implicaciones que tendrá el Entrenador de Escritura\nen nuestra capacidad de informar a los profesores mucho más sobre la escritura de los estudiantes.  En este momento, los profesores\nsuelen ver el borrador final, tal vez un primer borrador si pueden gestionarlo, pero con este tipo de actividad de IA, podemos sintetizar muchas\nde estas interacciones e informarlas al\nprofesor, incluidas cosas como \"Oye, ya sabes, este estudiante\nacaba de pegar 500 palabras. No es en su esquema en lo que le\nayudo a trabajar\". Tal vez deberías, ya sabes, hacer clic en esto y profundizar\ny ver qué sucede, por lo que habrá muchas\nfunciones nuevas y realmente interesantes de Khanmigo para escribir este otoño. - Muchas cosas nuevas y emocionantes.  ¿ Podemos simplemente hacer una pausa y dejar que\nesto se marine por un segundo?  ¿ Cuántos de los que están viendo enseñan a escribir? Apuesto a que todos ustedes lo hacen, porque somos maestros. Y en cualquier clase de ELA, cualquier alfabetización, si pensamos en leer es inhalar, escribir es exhalar. Conseguir que los estudiantes puedan\nexplicar sus pensamientos y tener una herramienta que\nrealmente les apoye. Quiero decir, Bernadette, ¿\ncuántas veces tuviste que leer ensayos sobre todas las cosas?  ¿ Y qué pasa si los estudiantes\nno lo citan correctamente o si intentan inventar hechos?  ¿ Cómo crees que la IA puede ayudar con eso? - Entonces, hay un par\nde cosas que podemos hacer.  En primer lugar, incluso antes de\nllegar a ese avistamiento, los niños deben poder saber,\nya sabes, ¿por dónde empezamos?  Por eso, a veces usar herramientas como conversar con una figura histórica o con una figura literaria son excelentes maneras de hacer que los niños\ncomiencen a pensar en temas. Para que puedan charlar con una figura literaria o histórica, preguntarles\nsobre afirmaciones y pruebas, ¿ qué piensan? Y pueden ir y\ndesarrollar esos argumentos. La otra cosa que\nhace Khanmigo es debates. Realiza debates a nivel de\nprimaria, secundaria y preparatoria\nsobre temas específicos. Entonces, si un estudiante tiene problemas para tratar de descifrar una afirmación, una\nevidencia o un argumento, comenzar con uno de estos y darle\npráctica con Khanmigo para desarrollar esos temas es una excelente manera de\niniciarlo en el proceso de escritura. Creo que muchos de mis\nestudiantes de secundaria y, ya sabes, los maestros con los que trabajé en la escuela secundaria siempre decían: \"¿Cómo podemos hacer que mis hijos comiencen?\" Y esta es una excelente manera\nde que sus hijos comiencen. Y nuevamente, hay\nmuchas maneras de ver eso cuando volvemos y\ncomenzamos a mirar, ya sabes, ¿ cómo nos aseguramos de que estén\ncitando correctamente, cómo nos aseguramos de que lo estamos haciendo? Khanmigo también puede ayudar con eso, y eso también es un buen control.  Es importante que los estudiantes comprendan qué es citar, qué es plagio y cómo se cita la IA.  ¿ Cómo cita que utilizó\nuna herramienta de inteligencia artificial en su artículo? Y esa es una\npieza importante que muchas veces, bueno, ya sabes, si la escribí, bueno, ¿sabes qué? Es\ncomo tener un coautor. Tenéis que escribirlo juntos y tenéis que poder\nexplicárselo a vuestro profesor. Entonces, poder usar\nestas herramientas en todas las áreas del escrito y, nuevamente, poder enfocar aspectos\ncomo afirmaciones y evidencia, o poder enfocar la argumentación dependiendo del tipo\nde escritura que estén haciendo y de lo que hagan.  tipo de prueba que están tomando. Porque cuando comenzamos a analizar incluso algunos de nuestros exámenes AP, IB y ACE, ellos también tienen que poder hacerlo, y esta es una excelente práctica para todos los niveles. - Sí, y esta conversación\nme hace querer volver y enseñar ensayos, algo en lo que no tuve mucho éxito\n, seamos honestos. Bueno, un par de personas\nestán hablando en el chat, muy entusiasmadas con el entrenador de escritura. Realmente emocionado, sí, enviaremos la\ngrabación a todos, para que reciban un paquete de ayuda al\nregistrarse en el seminario web. De nada, y forma parte\nde ese paquete de atención, no quiero emocionarme tanto, es solo una grabación y algunos recursos. Pero hablando de recursos,\nhablando de cha, estoy avanzando de forma muy aleatoria, voy a abordar desafíos y oportunidades. Estoy entusiasmado con muchas cosas. \"Ojalá hubiera podido tener una\nconversación realmente larga con, ya sabes, Jay Gatsby\". Ahora puedes hacerlo a través de Khanmigo,\npero yo no podía en aquel entonces, pero ¿cuáles son algunas de las cosas que crees que la gente se pondrá nerviosa por implementar? Diona, ¿por qué no nos echas? Algunas tal vez sean oportunidades\no desafíos. - Bueno, creo que una de\nlas cosas, como ocurre con otras IA, es que\nlo bueno de Khanmigo es que los estudiantes no tienen la oportunidad de ir a Khanmigo y decirle:\n\"Escribe mi ensayo por mí\". Khanmigo es un tutor socrático,\ny por eso, Khanmigo volverá, y creo que Khanmigo tiene\nla mejor personalidad, o si así es como quieres llamarlo, pero tiene un poco de personalidad\nporque dirá: \"Sí,  \"Pero como tu tutor de IA,\nno puedo escribir tu artículo, pero pensemos en este tema\". Siempre hace que el estudiante regrese, así que no será así, no\nsolo hará el trabajo por él. Ese proceso, sobre todo en la escritura, la escritura es un proceso, ¿no? Entonces, ya sabes, pase lo que pase, los estudiantes aún necesitan poder hablar sobre cómo se me ocurrió esta idea.  ¿ Sabes qué ediciones hice? Una cosa es que\nun día, ya sabes, ayer\nsolo escribías dos oraciones, ¿ ahora hoy puedes hacer una disertación completa?  Ya sabes, es así que\ntodavía tienes que hacer que los estudiantes, los estudiantes aún necesiten\npoder hablar con él. Así que creo que esta es una gran oportunidad para seguir responsabilizando a los estudiantes, pero aún así tener un asistente sin que él simplemente haga el trabajo por ellos. Creo que uno de los desafíos que también estamos encontrando\nes tener que capacitar a los estudiantes para que tengan estas conversaciones\nde ida y vuelta con Khanmigo.  Ya sabes, una cosa es decir: \"No entiendo, ya\nsabes, este tema específico que estamos estudiando\", pero los estudiantes todavía\ntienen la mentalidad de que Khanmigo es un\nmotor de búsqueda, y es  no.  Es más bien pedirle que\nsimplifique, pedirle que aclare, ya sabes, aclararte ¿\nqué quieres decir con esto?  Ya sabes, ¿qué\nsignifica analizar este texto? O, ya sabes, tener\nesas conversaciones de ida y vuelta, ese es, ya sabes, uno de los desafíos, pero\nsolo tienes que asegurarte de entrenar a tus estudiantes\ny modelarles cómo, ya sabes, tener una conversación.\ny adelante con Khanmigo. No es uno y listo. - Correcto, y la IA está destinada a mejorar la inteligencia humana, la\nexperiencia humana, ¿verdad? Porque queremos que la conversación vuelva a nuestras aulas. Acabo de hacer una referencia a Justin Timberlake\npara todos ustedes. Entonces, Sarah, cuando pensamos\nen desafíos, ¿verdad? Quiero decir, al pensar en\nla experiencia humana, ¿ qué piensas al respecto? - Sí, estoy de acuerdo con, ya sabes, todo lo que Bernadette\ny Diona han estado diciendo. Siento que existe una\nidea errónea de que la IA es igual a los chatbots y, ya sabes, es probablemente el\nformato más conocido para interactuar con la IA en este momento que los profesores conocen\n, pero no creo que debamos pensar\nen integrar la IA. en las aulas de alfabetización es simplemente encontrar más formas\npara que los estudiantes conversen con IA.  En realidad, quiero decir, cuando\npienso en los mejores momentos como profesora en mis aulas de lectura, en mis aulas de escritura, eran los momentos en los que\nhablábamos juntos y entre nosotros,\ncon nuestros compañeros y grupos sobre libros y sobre  , ya\nsabes, grandes temas, personajes importantes\ny todo tipo de cosas, ya sabes, simplemente las ricas experiencias que tienes cuando escribes y cuando lees\nalgo juntos. Y una de las cosas que\nquiero que la gente entienda es que llevar la IA a las aulas de alfabetización no significa quitarnos ese tiempo en el que\nnos conectamos y hablamos entre nosotros, creo que sí.  tiene más que ver\ncon dotar a los profesores de mejores herramientas para generar\n experiencias y materiales de aprendizaje realmente creativos, y ayudar a los estudiantes con las partes difíciles de la lectura y la escritura que,\nde todos modos, a menudo se experimentan de forma independiente. Entonces, esa experiencia de leer un trabajo que tu\nmaestro ha calificado, no tiene por qué ser\nuna experiencia tan aislante, y sabemos que todos los maestros\nno tienen tiempo para sentarse y hacer eso cada  tiempo con cada niño. Y lo mismo ocurre con la lectura, ya sabes, a menudo hay\nmomentos en los que puedes tropezar cuando\nestás leyendo algo, y no queremos que eso, ya sabes, desmantele toda esta experiencia en el aula de poder discutir\nun libro.  y lo que significa, y esas son las experiencias en las que creo que la IA puede ayudar mucho.  Y, de nuevo, hacer que sea mucho más fácil para los profesores tener acceso a un socio creativo, a\nalgo que pueda ayudarles a planificar proyectos o debates en clase, dar a los estudiantes la oportunidad\nde, como mencionó Bernadette, charlar con un experto literario.  personaje\nde un libro que están leyendo, pero luego hablan de ello como clase, como discutir entre ellos: \"¿Qué pensamos de esa experiencia? ¿ Se sintió auténtico? ¿ Qué pasa con la IA?\nParece que podría  ¿ Sabes que han ido en contra de\nlo que el autor pretendía en el libro que escribieron y por qué?\" Ese es un\npunto de partida realmente maravilloso para un ensayo que podrían escribir. Entonces, hay muchas maneras\nde integrar la IA en las experiencias del aula que\nno necesariamente mantienen a los estudiantes aislados\nfrente a sus pantallas. Creo que el mejor caso de uso que todos podemos adoptar es el de\nutilizar la IA para fomentar\nmás experiencias de aprendizaje que sean colaborativas y\ncomunitarias, porque creo que así es como\nsurge toda la alegría. Y creo que si podemos hacer que la IA ayude a más estudiantes a acceder a textos ricos y apropiados para su nivel de grado, entonces creo que podríamos ver\nmuchas más oportunidades para tener ese tipo de\ndiscusión y participación en clase. - Absolutamente, y me\nencantaría que nos tomáramos un minuto, y realmente, hemos estado\nusando nuestros sombreros de maestros, pero quiero que nos volvamos a ponernos nuestros\nsombreros de maestros, y quiero que piensen en\nlo que tal vez fue algo que fue  ¿Realmente fue un desafío\npara usted cuando enseñaba, ya sabe, estudios sociales, alfabetización, para mí, educación especial, que esta herramienta podría\nhaber ayudado de inmediato, como resolver ese problema? Bernadette, ¿y tú? ¿Qué es algo que tal vez pensaste: \"Ojalá tuviera esto\". - Ojalá tuviera esto, así que creo que hay muchos niveles, porque las herramientas para profesores de Khanmigo son muy variadas y diversas. Creo que no hay\nsuficiente tiempo en un seminario web para repasar todo eso, pero algunas de las cosas\nque cuando pienso en ello, ya sabes, como profesor, siempre quise asegurarme\nde que mis alumnos fueran precisos. y que estábamos garantizando la precisión. Y sé que cuando pensé por primera vez\nen la IA, era el\nsalvaje oeste, ¿sabes? Fue esta IA que entró y\nescribió todo para mis hijos, y no era ningún\ntrabajo original de ellos, y ese para mí fue probablemente\nel mayor dolor y miedo cuando comencé a\npensar y investigar la IA. Lo que me encanta de\nKhanmigo y Khan Academy es el hecho de que ese no es el caso. Este es el trabajo original de su estudiante. Cuando trabajan\ncon un generador de ensayos, los estudiantes tienen que expresar\nsus propios pensamientos e ideas y desarrollar sus propios personajes. Khanmigo puede ayudarlos a ampliar eso y actualizar su vocabulario y ayudarlos a ver esas\noraciones y palabras jugosas, pero esos son los lugares donde\ncuando comenzamos a hablar sobre garantizar esa precisión,\nes un trabajo generado por los estudiantes. No es: \"Introduje\nun tema y, ya sabes, me escupieron este ensayo\", y creo que eso es muy, muy importante como profesor, y ese siempre fue mi miedo con esto. Creo que la otra cosa es\ntoda esa retroalimentación.  Ya sabes, cuando\ntienes una clase de 20, 25, 30 o más estudiantes, ¿cómo puedes dar esa retroalimentación individual\nde forma regular? Me encantaría decir que hice eso todos los días con cada estudiante, no había manera, no había manera. Pero con Khan Academy,\nAI y Khanmigo, un profesor puede entrar y decir: \"Está bien, quiero que pongas tus ensayos. Quiero que todos vean\ntus propias presentaciones, lo hagan y hablen\", y luego  Incluso tener una\ndiscusión en clase sobre los comentarios que recibieron de la IA de Khanmigo con respecto a esa introducción\no su conclusión o sus afirmaciones, cualesquiera que\nsean esas piezas. Y ahora un estudiante\nrecibe ese trabajo individual, e incluso cuando está en casa, tal vez esté escribiendo en casa, o tal vez esté trabajando con un grupo pequeño y el resto de su clase\nestá sentado allí, Esta es una oportunidad\npara que sus estudiantes tengan ese contacto individual cuando usted\nfísicamente no puede hacerlo. Lo cual, lamentablemente como\ndocentes, termina sucediendo, y especialmente si se llevan el trabajo a casa y escriben desde casa. Quieres asegurarte de que\nno estén, ya sabes, simplemente consiguiendo una IA para hacerlo, porque cuando\nlo pongan en el verificador de ensayos, la IA lo mirará y dirá: \"Oye, ya sabes, ¿estás seguro?\".  ? ¿De dónde has sacado esto?\" Y eso es algo que\nes importante para mí como maestro saber que hay precisión allí y que están recibiendo retroalimentación, y que están recibiendo buena\nretroalimentación, y eso depende de su trabajo. - Sí, la última vez que lo comprobé,\ntodavía no podemos clonar profesores, así que esta es una forma realmente importante de poder hacer esa retroalimentación. Diana, ¿qué opinas?  ¿ Cuál sería tu? - Vaya, hay un par. Bien, hay un par. El generador de rúbricas. El hecho de que puedo, ya sabes,\nsolía pasar mucho tiempo en línea tratando de\nencontrar rúbricas, ya sabes, que se alinean con, ya sabes,\nla escritura que estamos haciendo, ya sabes, para mis estudiantes. Y luego, a veces, ya\nsabes, era un PDF, por lo que no podía entrar y\neditarlo. Y entonces, el hecho de que haya\nun generador de rúbricas real, ya sabes, para ayudar a mis alumnos con la escritura, es asombroso. El otro que también me viene a la mente es el divertido poema resumen de la clase.  Ya sabes, cuando pienso\nen mis alumnos y, ya sabes, quieres esperar para terminar esa lección, ¿verdad?  Es posible que hayas\nestado hablando de la idea principal.  A mis alumnos les encantaba la\nmúsica rap, así que la poesía y el rap, ya sabes, van de la mano. Y entonces creo que hubiera\nsido genial, porque no soy letrista,\nno puedo pensar en cosas rápidas como esas, y luego incluir\ntal vez incluso incorporar cosas que les gusten.  Ya\nsabes, en esta clase divertida, este es el poema resumen de la clase divertida, porque los estudiantes tienen\nque darte retroalimentación: \"¿Qué aprendimos hoy?\nDame algunas ideas\". Y luego genera y\nresume la lección en este bonito resumen como un poema. Y creo que habría sido una\nforma divertida de cerrar esa lección. Para mí también fue difícil, ya\nsabes, si tus alumnos dicen: \"Oye, me gusta 'Fortnite', o me gusta este juego o aquel juego\", solo lo sabía gracias a\nellos, pero algo ahora mismo, poder  Generar y\nhablar sobre esas cosas sin tener que\nir a entrevistar a un niño o tomarme más tiempo que no tengo de mi planificación para\ninvestigar esto por mi cuenta, para mí es increíble. Así que realmente desearía\ntener ese generador de rúbricas y, como dije, el divertido\npoema resumen de la clase habría sido uno de mis favoritos. - Eso es increíble. Así que estamos\nterminando nuestro tiempo juntos, pero quiero que\nSarah tenga la última palabra. Pensemos en 5 o\n10 años en el futuro.  ¿ Cuáles son sus sueños y esperanzas en cuanto a la\nalfabetización?  ¿ Qué clase de mundo utópico podría haber sabiendo lo que sabemos ahora? - Sí, esa es una gran pregunta. Entonces, quiero decir, mi mente está dando\nvueltas pensando en todas las diferentes formas en que\nlas herramientas actuales que tenemos y la tecnología actual que tenemos podrían haberme ayudado en el aula, y las horas que pasé,\nhoras y horas y horas haciendo cosas que  La IA\nahora puede hacerlo en segundos.  Sin embargo, creo que uno de los desafíos\nes, ya sabes, que he aprendido ahora en mi\nrol aquí en Khan Academy cómo ser un ingeniero rápido bastante decente, lo que significa que sé cómo\nhablar con la IA para que me dé  las cosas que necesito, pero no todos los profesores tienen esas habilidades. Y uno de los beneficios de\nlas herramientas para profesores de Khanmigo, en el que todos ustedes pueden\nregistrarse ahora mismo en el enlace Khanmigo dot AI que creo que hemos puesto en el chat, pero uno de los beneficios de esas herramientas es que  No es necesario\nser un ingeniero hábil y rápido para hacer muchas de estas cosas. Pero pensando en los próximos cinco años, es difícil predecir hacia dónde vamos. Pero me imagino aún más herramientas flexibles personalizadas\ndiseñadas específicamente para profesores de ELA. Muchas de nuestras herramientas Khanmigo\nahora se pueden usar en cualquier tema, pero estoy muy entusiasmado con\nalgunas de las cosas que estamos trabajando\npara la instrucción de lectura y la comprensión de lectura\ndonde los maestros no tienen que hacerlo, ya sabes.  , haz gran parte de\nese trabajo frontal para prepararte. Solo recuerdo que me tomó mucho\ntiempo encontrar un texto que quería usar y\nluego prepararlo para mis alumnos para que\npudieran acceder a él con la estructura y las preguntas y todas las diferentes\nformas en que lo discutiríamos. Así que ni siquiera creo que sean cinco años, creo que serán dentro de seis meses\nen Khan Academy, pero es como liberar\nmucho más tiempo para los maestros. Y cuando lo pienso\ndesde la perspectiva de los estudiantes, vuelvo a lo que\nestaba hablando antes con estas\nexperiencias ricas en el aula donde los estudiantes no necesariamente se concentran en lo que sucede en\nuna pantalla, y tal vez la tecnología\nesté ahí para brindar apoyo. donde lo necesiten, o, ya sabes, ser un\nsocio cuando lo necesiten, para motivar a los estudiantes. Creo que hay algunas cosas interesantes que estamos soñando\nen este momento en lo que respecta a la \nparticipación de los estudiantes, la gamificación y la motivación de los estudiantes para las que\npodemos usar la IA. Pero sí, creo que el futuro es simplemente reunir más a los estudiantes y reunir a los maestros, hacer que los maestros sean más, ya sabes, facilitadores del aprendizaje\nen lugar de estos maestros de tareas que tienen que hacer tantas cosas, todas al mismo tiempo.  normalmente al mismo tiempo. Así que creo que hay\nmuchas experiencias realmente emocionantes, divertidas,\ninnovadoras, rigurosas y diferenciadas\nque estamos soñando aquí y que, con suerte, harán que las clases de lectura y escritura sean\nmucho más poderosas y emocionantes para el futuro.  estudiantes. - Oh, oye oye, ¿ quién no quiere tener\nmás de eso en su aula y ahorrar algo de tiempo?  ¿ Alguien, alguien? Por supuesto que quieres ahorrar algo de tiempo. Hablando de tiempo, desafortunadamente, ese es todo el tiempo que tenemos para hoy. Gracias a mis increíbles panelistas\npor compartir sus ideas y pensamientos sobre su\nexperiencia en el aula, y solo quiero señalar que queremos seguir trabajando con ustedes. Si quieres trabajar con nosotros, quiero decir, mucho, ofrecemos, puedes ir ahora mismo\ne inscribirte en Khan Academy, pero si quieres tener\nuna asociación más profunda, ofrecemos algo\nllamado asociaciones de distrito donde obtienes un gerente de éxito. y aprendizaje profesional personalizado\nque satisfaga sus necesidades. Incluso podemos ayudarlo con el\nanálisis de datos para MTSS, todo,\njuntas de seguimiento de distrito, lo que sea. Lo tendremos con los datos cuando se trata de comprender dónde\nestán sus alumnos con Khan. Pero lo más importante es que\nrealmente nos estamos asegurando de que Khanmigo sea seguro y ético, y que haya muchas\nbarreras de seguridad, y no lo son, y realmente pensamos\nen esto todos los días. No lo estamos simplemente tirando\ny haciéndolo aterrador. Realmente estamos siendo conscientes de la forma en que estamos construyendo esto. Entonces, si desea obtener más información, este es nuestro equipo de asociación del distrito. Nos encantaría conectarnos con usted. Pulsa en este código QR,\ny hasta que nos volvamos a encontrar. Sigue leyendo, sigue escribiendo, sigue aprendiendo.  Los apreciamos a todos.",
    "t_arabic": "- مرحباً بالجميع، اسمي\nدانييل سوليفان. دوري في أكاديمية خان\nهو أنني المدير الأول لشراكات المنطقة الشمالية الشرقية، ودوري السابق كمعلم\nهو أنني كنت \nمدرسًا للتعليم الخاص للصف الخامس والسادس.  لقد قمت بتدريس برنامج اللغة الإنجليزية والرياضيات في واشنطن العاصمة وشمال ولاية نيويورك، وسأدع سارة تمضي\nقدماً وتقدم نفسها. - يا الجميع، مرحبا بكم. أنا سارة روبرتسون. أنا حاليًا مدير المنتج الأول لفرق محو الأمية وتجربة الفصول الدراسية هنا في أكاديمية خان. تمامًا مثل دانييل، أنا\nمعلمة صف سابقة.  قمت بتدريس اللغة الإنجليزية في المدرسة الإعدادية، وعملت لفترة قصيرة كمدرس للتاريخ، ولكن في الغالب كنت أدرس القراءة والكتابة. وأنا أيضًا قادم من\nشركة تكنولوجيا تعليمية أخرى تركز على القراءة والكتابة، وأعتقد أن دانييل انضمت\nإلينا أيضًا من شركة أخرى أيضًا. وسوف أقوم بتمريرها إلى، فلنقم بتمثيل ديونا. - أهلا بالجميع. أنا ديونا كلينجمان. أنا متخصص في التعلم المهني\nفي أكاديمية خان. تمامًا مثل زملائي\nالموجودين معي في اللجنة، فأنا مدرس سابق في الفصل الدراسي. الابتدائية هي حيث قلبي.  لقد قمت بتدريس الصف الثاني والصف\nالثالث والصف الخامس.  لقد قمت بالتدخل السلوكي.  لقد كنت مديرًا للمبنى، وكذلك مديرًا للأكاديميين. لذلك كنت في جميع المستويات،\nوأتفهم بالتأكيد وأحب التواصل مع المعلمين الآخرين. وبهذا\nسأمرر الأمر إلى برناديت. - مرحبًا، أنا برناديت بينيت. أنا\nمتخصص في المحتوى التعليمي في أكاديمية خان. أنا مدرس سابق في المدرسة الإعدادية ومشرف الدراسات الاجتماعية بالمنطقة\nمن فلوريدا، وأنا متحمس جدًا لوجودي\nمعكم يا رفاق اليوم. - عظيم، إليك كيفية\nعمل هذا. نحن، سأتوقف عن مشاركة شاشتي لأن التركيز سيكون\nعلى المحادثة. لذلك سنجري محادثة غنية ومثيرة للاهتمام حول الدور التحويلي للذكاء الاصطناعي\nوتحسين درجات القراءة والكتابة، لأنه كما تعلم، أنا\nمتأكد من أنك تشعر بهذا، فقد شعر الكثير من الطلاب بالتخلف عن الركب\nبعد فيروس كورونا، خاصة في مجال محو الأمية  . أعني، أود أن أقول الرياضيات أيضًا، لكننا اليوم نركز على معرفة القراءة والكتابة. لذلك نريد الخوض في الأمر وإجراء محادثة متعمقة حول كيفية بدء التفكير\nفي التعلم التكيفي للذكاء الاصطناعي، وردود الفعل الشخصية لمساعدة الطلاب على تحسين\nمهارات القراءة والكتابة لديهم. وفي الواقع، دعونا نتحدث\nعن القليل من الفرح أيضًا، أليس كذلك؟ أحب محو الأمية. على الرغم من أننا سنتحدث فقط، يرجى نشر التعليقات في\nالدردشة والأسئلة في الدردشة. سأكون قادرًا على رؤية ذلك، وسنبدأ \nبهذا السؤال. لذا يا سارة، لا يُنظر إلى أكاديمية خان في كثير من الأحيان... لا يُنظر إلى أكاديمية خان في كثير من الأحيان على أنها\nأداة سهلة الاستخدام لتعليم القراءة والكتابة والدعم. ولكن ها نحن هنا، نقوم بإجراء\nندوة عبر الإنترنت لمحو الأمية وتعلم اللغة الإنجليزية. إذن، ما الذي تغير؟ - نعم، لقد انضممت بالفعل إلى أكاديمية خان منذ عام ونصف تقريبًا، وكان ذلك في الوقت\nالذي عقدت فيه أكاديمية خان شراكة مع OpenAI حول كيفية استخدام\nنماذج لغوية كبيرة من أجل إنشاء\nتجارب تعليمية غنية حقًا. وهكذا في أول يوم لي في أكاديمية خان، جلس معي مديري\nوقال: \"بالمناسبة، لدينا هذه الشراكة مع OpenAI، هل سمعت عن ChatGPT؟\" وكنت قد أتيت للتو من منتج آخر لأداة EdTech التكميلية لمحو الأمية، وكنت، كما تعلمون، مهتمًا بمحو\nالأمية، وكنت متحمسًا للغاية للقدوم\nإلى أكاديمية خان مع العلم أن هناك فرصًا لبناء أدوات ومحتوى جديد\nلمحو الأمية. لقد كان هذا بمثابة علامة على أنني قد أتيت في\nالوقت المناسب تمامًا، لأن ما رأيناه في العديد من استكشافاتنا المختلفة\nكنا نقوم به باستخدام ChatGPT ونماذج اللغة الكبيرة\nالتي كنا نجربها كان أن بعضًا من أفضل التجارب التي يمكن أن يدعمها حاملو شهادة الماجستير في القانون كانت مرتبطة بتعليم القراءة\nوتعليم الكتابة. ولذا فإننا نتعمق\nفي الطرق المختلفة التي يمكننا من خلالها الاستفادة من الذكاء الاصطناعي\nلإنشاء تجارب تعليمية مبتكرة وغنية حقًا للطلاب عندما يتعلق الأمر\nبالقراءة والكتابة.  كما تعلمون، في الشهر الأول الذي كنت فيه هنا، قمنا بعمل هاكاثون، وكانت إحدى الميزات\nالتي نتجت عن ذلك هي نشاطنا الحالي للتعليق على المقالات، والذي سأتحدث\nعنه أكثر قليلاً لاحقًا. لكنني سأقول أيضًا أنه\nكلما زادت شراكتنا في أكاديمية خان مع المناطق\nعلى مدار السنوات القليلة الماضية، أصبح من الواضح لنا أن الطلب على الموارد عالية الجودة\nوالمرنة لـ ELA أعلى مما كان عليه في أي وقت مضى. أعتقد، مرة أخرى، أنه بمجرد\nالخروج من الوباء، كما تعلمون، والدخول\nفي عصر الذكاء الاصطناعي هذا، فقد تعطلت فصول القراءة والكتابة،\n ونحن بحاجة إلى التفكير\nفي طرق إبداعية ومبتكرة حقًا\nللوصول إلى الطلاب الآن في عالم  ربما تكون الطريقة\nمختلفة قليلًا عما كنت عليه عندما كنت في الفصل الدراسي وبالتأكيد عندما\nكنت طالبًا. لذلك نحن متحمسون حقًا\nلبعض هذه الأنشطة الجديدة التي نبنيها. نحن أيضًا نطلق\nدورات جديدة تمامًا لـ ELA للمدارس المتوسطة\nوالثانوية، وأعتقد أننا أطلقنا للتو\nالصف السادس الأول بالفعل، وسنطلق\nالصفين التاسع والعاشر أيضًا في موسم العودة إلى المدرسة. لذا فهو بالتأكيد عصر جديد،\nعصر جديد لأكاديمية خان، ونحن متحمسون حقًا\n لموارد القراءة والكتابة الجديدة التي نقوم ببنائها. - نعم، وكم\nمنكم ممن يشاهدون هذا قد واجه أحيانًا صعوبة في دعم طلابه كتابيًا؟  هل من أحد يشعر بهذا الألم؟ هذا سيكون أنا. نعم، الحقائق بالضبط. لذا فإن الهدف هو كيف يمكننا\nإشراك طلابنا ليكونوا أكثر تفكيرًا في\nالطريقة التي يعبرون بها عن أنفسهم؟ لذلك أريد أن أفكر مليًا، لقد\nكانت بضع سنوات صعبة، هل تصدق أنه عام 24 بالمناسبة، 2024؟ نحن نفكر فقط في الطلاب الذين سيتخرجون هذا\nالعام، لقد بدأوا في عام 2020، لذا، يا للعجب، لقد حدث الكثير\nفي السنوات الأربع الماضية. لذا، بالتفكير في السنوات الأربع الماضية، ديونا، كيف يمكن الاستفادة من الذكاء الاصطناعي\nلمعالجة بعض الفجوات التي نراها تتفاقم بسبب\nالوباء، أو فرص التعلم إذا أردنا تدويرها بطريقة إيجابية؟ - نعم على الاطلاق. أنا لست معلمة فحسب،\nبل أنا أحد الوالدين، لذا فإن ابنتي هي طالبة في السنة النهائية هذا العام، ولذا فإن بعض\nالتأثير الشخصي للوباء لم يؤثر عليّ فحسب، كما تعلمون، ليس كمعلمة، ولكن\nأيضًا  أحد الوالدين كذلك. عندما أفكر في الذكاء الاصطناعي وكيف يمكننا استخدامه للمساعدة في\nالاستفادة من بعض هذه الفجوات، فإن ذهني يتجه إلى تلك\nالتعليمات المستهدفة.  كما تعلم، كلما كانت الفجوات أكبر، كلما زادت\nالتعليمات المستهدفة التي تريد تقديمها لطلابك، أليس كذلك؟ لكنني أعلم أيضًا أنه من السهل قول تعليمات مستهدفة أو خطط مجموعات صغيرة، ماذا تريد أن تفعل\nبمجموعاتك الصغيرة؟ لكن في الواقع هذه\nمجموعة أخرى من التخطيط، أليس كذلك؟ لذلك أنا أفكر في\nذلك التخطيط للمجموعة الصغيرة. ولذا عندما أفكر في\nالذكاء الاصطناعي، أفكر في بعض هذه الأدوات التي لدينا، مثل القدرة على\nاستخدام خانميغو فقط ، فقط أضفها للمساعدة في تجميع طلابك.  كما تعلمون، إنها تساعدك\nفي تجميع طلابك.  بل إن الأمر يتعلق بكوني\nمساعدًا لك، يمكنك فقط أن تسأله، ما الذي\nيحتاج طلابي إلى العمل عليه؟ لذا، قم بتقليل هذا الوقت من خلال\nالتخطيط للمجموعات الصغيرة، فقط من خلال الحصول على\nالدعم الفوري كمعلم لمعرفة كيف أقوم بتجميع طلابي، وما هي الأشياء التي، كما تعلمون، يجب أن يعملوا عليها؟ أفكر أيضًا في\nالنهج العاطفي الاجتماعي، أليس كذلك؟ التفكير في هذا الطفل بأكمله\nوتلبية تلك الاحتياجات. ونحن نعلم أن أحد الأشياء هو أن الطلاب يشعرون بالأمان حتى، ويشعرون بشعور بالأمان كما\nلو أنني لا أعرف، أليس كذلك؟ لا أعرف ما الذي يحدث، وبالتالي فإن الطلاب لديهم تلك القدرة على مناقشة وطرح تلك\nالأسئلة مع خانميجو فقط، حتى عندما تفكر\nفي تحليل النص، أليس كذلك؟ ساعدني على الفهم، لدي\nسؤال حول هذا النص ربما لا يريدون طرحه بصوت عالٍ أمام أقرانهم، لذا فإن الاستفادة منه بهذه الطريقة أعتقد أنها مجرد واحدة من عدة طرق. - نعم على الاطلاق. أعني، كل ما قلته،\nتعليمات المجموعات الصغيرة، مرة أخرى، كم منكم شاهدوا ما عانى من\nتعليمات المجموعات الصغيرة؟ أراك يا معلمي المدارس المتوسطة، وأراكم يا معلمي المدارس الثانوية، أليس كذلك؟ نحن نعلم أن هذه\nممارسة مهمة حقًا. حسنًا يا سارة، هل يمكنك التحدث\nإلينا عن وجهة نظرك أو بعض الأشياء التي تفكرين\nفيها خلال سنوات ما بعد فيروس كورونا؟ - نعم، أعني أنني قمت بالتدريس في فصل دراسي\nحيث كان الطلاب متفاوتين، وقمت بالتدريس في فصل دراسي للصف السابع لمعظم وقتي في التدريس، وكان لدي طلاب كانوا في\nمستوى القراءة من الصف الثاني إلى مستوى القراءة من الصف الثاني عشر  ، على\nطول الطريق بينهما، مجرد نطاق واسع جدًا من مستويات المهارة.  وكان الكثير من طلابي يعانون من الطلاقة والفهم،\nأو الخلط بين الاثنين معًا. كانت هناك جميع أنواع الاحتياجات المختلفة في جميع أنحاء الغرفة بأكملها، وأنا أعلم أن أحد\nأفضل الأشياء التي يمكننا القيام بها للطلاب الذين لديهم فجوات في\nمهارات فهم القراءة على وجه التحديد، والذي أود أن أقول أنه\nبالنسبة لطلاب الصف السابع كان التحدي الأكبر،\nكان  التأكد حقًا، أ، من أن لديهم إمكانية الوصول\nإلى النص على مستوى الصف الدراسي. \nلا يحصل الكثير من الطلاب على الفرصة للمحاولة، كما تعلمون، الوصول إلى\nنص على مستوى الصف الدراسي وقراءته، ولكن مع العلم أن العديد من\nالطلاب أقل من مستوى الصف الدراسي، كيف يمكننا تعزيز التدريس وكيف يمكننا خلق\nالفرص للطلاب لتكون قادرًا على ملء\nما هو مفقود بينهما؟  وترتبط بعض أفضل\nالاستراتيجيات للقيام بذلك بالتعليم المسبق\nوالإعداد المسبق للقراءة، وهو ما يعني ويبدو وكأنه\nتنشيط المعرفة السابقة، وإجراء اتصالات مع\nموضوع النص، وبناء المعرفة الأساسية\nلأي من المخططات التي يدرسها الطالب.  يجب\nأن يمتلكها عندما يتعلق الأمر بموضوع النص، سواء\nكان خياليًا أو واقعيًا، والتدريس المسبق لمفردات المستوى الثاني والثالث\n، وإعطاء الطلاب\nفرصًا للتدرب والتعرف على الكلمات التي\nقد لا يكونون على دراية بها. ثم بالطبع دعمهم عندما يتعلق الأمر\nبتفكيك الجمل المعقدة، وأحد\nالأشياء الرائعة حقًا حول وجود الذكاء الاصطناعي\nلمساعدة الطلاب في هذا الأمر ومساعدة المعلمين في ذلك\nهو أن العديد من هذه الأشياء أصبحت الآن سهلة\nوسريعة للغاية  للقيام مع الذكاء الاصطناعي. لذا، عندما تفكر في تنشيط المعرفة السابقة\nأو إجراء اتصالات، كل ما عليك فعله هو الانتقال\nإلى Khanmigo أو أي أداة للذكاء الاصطناعي وإلقاء نظرة على\nالنص وتحديد الأسئلة والارتباطات المختلفة وتكتيكات الحصول عليها.  يجب على\nالطلاب التفكير فيما يعنيه هذا النص بالنسبة لهم أو إذا كان لديهم أي نوع\nمن الارتباطات بالموضوع أو الشخصيات الموجودة في النص. تحديد الخلفية\nالمعرفية الضرورية لتكون قادرًا على فهم موضوع\nالنص والتدريس المسبق لذلك، مع مطالبة\nخانميغو بتلخيص ذلك للطلاب أو طرح أسئلة على الطلاب حول ما يعرفونه بالفعل\nأو ما يريدون معرفته، وتحديده وجعل خانميغو\nيتعرف عليه  من النص ما هي المفردات التي من\nالمحتمل أن يحتاج الطالب إلى معرفتها حتى يتمكن من\nفهم شيء ما. ومن ثم استخدام بعض\nأنشطة التعلم المعدة مسبقًا مثل Word safari وWord\nArchitect للتدرب على بعض تلك الكلمات المختلفة قبل أن يصلوا إلى قطعة القراءة. وبعد ذلك، عندما يقرأ الطالب بالفعل نصًا على مستوى الصف الدراسي، يكون هناك خانميجو هناك في أكاديمية خان لدعمهم إذا واجهوا شيئًا معقدًا\nأو يصعب عليهم تحليله، فهو، كما تعلمون، حكم مجاني.. ليس شخصًا، ولكن الذكاء الاصطناعي لـ- - الدعم.\n- لدعمهم، نعم، للذهاب عندما يكونون عالقين وعندما لا يعرفون حقًا، كما تعلمون، حتى لماذا لا يفهمون شيئًا ما، يمكنهم الذهاب إلى هناك لطرح الأسئلة.  نشاط آخر مفيد حقًا\nأوصي به للطلاب الذين هم دون مستوى الصف الدراسي هو أن لدينا أداة المعلم هذه مع Khanmigo والتي تسمى أداة إعادة تسوية النص. ومن الواضح، كما قلت من قبل، أنه من المهم جدًا ألا\nيحصل الطلاب على نصوص\nأقل بكثير من مستوى الصف الدراسي طوال العام الدراسي بأكمله. من المهم حقًا أن\nتتاح لهم الفرص للوصول إلى النص على مستوى الصف الدراسي. لذا فإن إحدى أفضل الطرق\nلاستخدام أداة إعادة تسوية النص هي إعادة تسوية النص الموجود\nفي مستوى الصف الدراسي للطلاب، وإعادة ضبطه، كما\nتعلمون، في مستويين، ثم مطالبة خانميغو بأخذ\nنص إعادة التسوية هذا و إعادة مستواه\nمرة أخرى إلى ما كان عليه من قبل. وبعد ذلك، اطلب من الطلاب\nالاطلاع على الإصدارات الثلاثة، واطلب منهم إلقاء نظرة على الإصدار الأسهل الذي تم رفع مستوى الذكاء الاصطناعي إليه، وهذا سيساعدهم نوعًا\nما في الحصول على فهم أساسي لما يدور حوله النص، واطلب منهم إلقاء نظرة على\nالإصدار الذي تم رفع مستواه  ، ثم اطلب منهم مقارنة\nذلك بالنص الأصلي وإلقاء نظرة على ما فقدناه، كما تعلمون، عندما أخذ الذكاء الاصطناعي هذا النص وأعاد\nتسويته، ما الذي تغير، وما هي جوانب حرفة المؤلف، أو، كما تعلمون،\nالعناصر اللغوية المختلفة التي تغيرت  ، وكيف أثر ذلك على\nمعنى النص؟ لذلك هناك العديد من\nالطرق المختلفة والمبتكرة التي يمكنك من خلالها استخدام الذكاء الاصطناعي ليس فقط، كما تعلمون، لتمكين الطلاب من الوصول إلى المواد على مستوى الصف الدراسي بسهولة أكبر، ولكن أيضًا لخلق نوع من تجارب التعلم الممتعة والجذابة. - أعني أنك قلت الكثير يا سارة، الكثير من الجواهر الرائعة حقًا، لكني أريد أن أسمع\nقصة برناديت، لأن بيرنا، لديك\nمنظور مختلف قليلاً وخلفية في الدراسات الاجتماعية، وبعض ما كانت عليه سارة  تتم\nالمشاركة من المفردات ورؤية النص الأصلي والتأكد من أن\nالطلاب لديهم القدرة على الوصول إلى النص الدقيق. لذا أود أن أضيف بعض الألوان والسياق من وجهة نظرك حول كيفية رؤيتك أنه يمكننا المساعدة في سد هذه الفجوات. - لذلك، عندما أفكر في\nمعلمي الدراسات الاجتماعية الذين يعملون أيضًا كثيرًا مع المفردات والقراءة والوثائق\nالمصدرية الأساسية، في كثير من الأحيان عندما ينظر الطلاب إلى\nمستندات المصدر الأولية، كما تعلمون، فإنهم ينظرون إلى بعض\nالمفردات القديمة، إنهم ينظرون أحيانًا إلى\nمستند مخطوط. لذا، يمكنك استخدام الذكاء الاصطناعي للتركيز على\nمستندات المصدر الأولية والثانوية، ويمكنك مطالبة الذكاء الاصطناعي بتعديلها، ولكن لا يزال لديك هذا\nالمستند الأصلي بجواره مباشرةً حتى يتمكن الطالب من رؤية\nهذا المستند الأصلي، كما يبدو في\nمستوى دراسي مختلف، ولكن دائمًا ما تكون قادرًا على العودة والوصول إلى هذا المستند الأصلي، والوصول إلى تلك المفردات الأصلية ومساعدة الطلاب على فهم، كما تعلمون، الفروق الدقيقة التي تم وضعها\nفي هذا المستند الأصلي، كما قالت سارة، والتي ربما يتم تفويتها عندما يكون لدينا مستند غير موجود، فهذا يعني أنه لم يتم تعديله. لكن المفتاح الكامل عندما ننظر إلى معرفة القراءة والكتابة في\nالدراسات الأدبية والاجتماعية هو التأكد من أن الطلاب ينظرون إلى تلك الوثيقة الأصلية، لذا فإن القدرة على أخذ\nتلك الوثيقة الأصلية وجعلهم قادرين على الوصول إلى هذه المفاهيم وفهمها أمر مهم حقًا\nيمكنك سحب كل ذلك معًا. - شكرًا لك، هناك\nبعض الأحاديث في الدردشة حول ما نتحدث عنه. سأقدم لك موردًا في النهاية أو رمز الاستجابة السريعة لمعرفة المزيد، ولكن هناك روابط في الدردشة. نحن نتحدث، أولاً وقبل كل شيء، عن رغبتنا في إجراء\nمحادثة غنية وعظيمة حول محو الأمية وما بعد الوباء، وكيف\nيمكننا الاستفادة من أدوات الذكاء الاصطناعي. ولكن لدينا بعض أدوات الذكاء الاصطناعي الرائعة حقًا كجزء من أكاديمية خان والتي\nيمكنك بالتأكيد معرفة المزيد عندما تجد الرابط في الدردشة، ولكن أريد منا أن نتعمق\nأكثر في القراءة والكتابة، لأنه كما\nقال أحدهم، الوعظ في  الدردشة، وتكافح من أجل جعل\nالطلاب ينخرطون حقًا في الكتابة ذات المغزى. أعني أنني طلابي كمدرس\nسابق للتعليم الخاص، كان لديهم خوف من وضع\nأي شيء على الصفحة، هل يمكن لأي شخص أن يرتبط بذلك؟  لقد بدأوا للتو،\nولم يكن لديهم القدرة على توليد الأفكار، وكان الأمر صعبًا للغاية\nلأنني كنت مندمجًا بالكامل، لذلك كنت أحاول\nدعم العديد من الطلاب في الفصل الدراسي بمدرسة اللغة الإنجليزية للصف السادس، ومساعدة طلابي، كما كانت\nتتحدث ديونا، عن الشعور بالأمان  ، الشعور بالتحقق من صحتها. إذًا، كيف يمكن للملاحظات الشخصية أن تعزز قدرات الطلاب على القراءة\nوالكتابة؟ ديونا، دعنا نبدأ\nمعك، ومن ثم سنعود.\n- نعم على الاطلاق. مرة أخرى، أفكر في\nتلك المساحة الآمنة، أليس كذلك؟ فقط أشعر بالارتياح، كما تعلمون، لأنني قادر على التحدث أمام الجميع، أو أن أكون قادرًا على معرفة، هل أكتب أم أكتب\nالجملة الصحيحة، أم أجعلهم يشعرون بالراحة فقط. لذا فأنا أحب حقيقة أن\nلدينا، على سبيل المثال، أداة المعلم التي تستخدمها لتعليمي العلوم الإنسانية.  ولذا فإن الطلاب لديهم الفرصة إما للاختبار حول\nمهارات معينة، ومرة ​​أخرى، إنها تلك المساحة الآمنة. أنا فقط أستمر في ذلك لأنني أعرف أن الكثير من\nطلابي جاءوا إليّ دون الكثير من المعرفة المسبقة.  لقد تحدثنا عن ذلك من قبل، وعندما حان وقت\nتلك المناقشات الصفية، ماذا فعل بعضهم؟ التصرف في طريقهم للخروج، أليس كذلك؟ أو قد يتوقفون عن العمل\nلأنهم لا يريدون ذلك، وليس لديهم ما\nيساهمون به في المحادثة. لذا، فإن وجود أدوات مثل\nتعليمي، كما تعلمون، في العلوم الإنسانية حيث\nيمكنك طرح تلك الأسئلة حول النص قبل،\nأو حتى أثناء، كما تعلم، كمعلم، إذا كان\nلدي ذلك في الفصل الدراسي، فسأكون نموذجًا بالتأكيد  لهم وخلق الفرص لهم، وخلق الفرص\nلهم، كما تعلمون، للإجابة على أسئلة محددة، والذهاب، كما تعلمون، والتواصل مع خانميغو. اسأل خانميغو، كما تعلم،\nلماذا يحدث هذا، وبعد ذلك سيعطيهم هذا السياق. والشيء الرائع الآخر في هذا الأمر أيضًا هو أنه بالنسبة للطلاب الذين قد يواجهون\nهذا النوع من المشكلات في القراءة، كما تعلمون، قد تكون القراءة بطلاقة مشكلة، ويمكن لـ Khanmigo التحدث إليهم. حتى يتمكنوا من وضع سماعات الرأس الخاصة بهم، ويبدو الأمر تقريبًا وكأنه\nمحادثة فعلية لأن ما يحدث\nهو، حتى لو، كما تعلم، إذا كانت الكتابة ليست خياري القوي،\nمثلما كنت تتحدث عن بعض\nطلاب التعليم الخاص، كما تعلم يمكنك التحدث إلى خانميغو والقول، كما تعلم، \"مرحبًا،\nلماذا يحدث هذا؟\" سيقوم خانميغو بإنشائه، ومن ثم أصبح لديه القدرة\nالآن على الرد عليك. لذلك، إذا لم تكن الكتابة والقراءة هي\nنقطة قوة الطالب، فيمكنهم الآن أن يشعروا بمزيد من التمكين لأنه الآن\nيشبه تقريبًا إجراء محادثة مثلك ومثلي\nفي هذه اللحظة لمساعدتهم، كما تعلمون، على أن يصبحوا أقوى في تلك المهارات  . - قطعاً. سارة، ما هي أفكارك حول هذا؟ - نعم، لقد ذكرت سابقًا أن\nأحد الأشياء الأولى التي بدأنا استكشافها\nعندما كنا نغمس أصابعنا في مجموعة الذكاء الاصطناعي كانت التعليقات على المقالات، لذلك قمت بتدريس القراءة والكتابة. في المدرسة التي كنت أقوم بالتدريس فيها، كانت هناك\nفصول منفصلة وكانت الكتابة أصعب بكثير. أعتقد أن\nالسبب الرئيسي وراء تدريس القراءة هو أن قطعة التعليقات\nتمثل تحديًا كبيرًا إذا كان لديك أكثر من\n20 طالبًا في الفصل، وهو ما أعتقد أن معظم المعلمين يفعلونه. وبالتالي فإن الطريقة التي صممنا بها \nنشاط التعليقات على المقالات الأكاديمية في خانميغو كانت بمثابة وسيلة للطلاب للحصول على\nتعليقات فورية عالية الجودة والتي كانت قابلة للتنفيذ وتنظيمها حسب\n منطقة تعليقات محددة\nدون الحاجة إلى الانتظار، كما تعلم، لأيام أو حتى أسابيع\nللحصول على أي نوع من المعلومات من معلميهم. وبالتالي فإن الطريقة التي تعمل بها\nهي أن يرسل الطالب مسودة مقالته بالإضافة إلى\nمعلومات حول المقالة كما تم تعيينها من قبل معلمه، أو أي شيء متعلق بنوع المقالات أو مستوى الصف الذي ينتمون إليه، ثم نضع  المقال\nمن خلال كل هذه المطالبات التي تم تكوينها بدقة شديدة من الذكاء الاصطناعي والتي تولد تعليقات\nفي خمسة مجالات مختلفة، وبعد ذلك يمكن للطلاب التنقل بين تلك المجالات الخمسة المختلفة. إذا نقروا على جزء من التعليقات، فسوف يسلط الضوء على جزء\nالمقال الذي يتحدث عنه. يمكن للطالب بعد ذلك\nأيضًا الدردشة مع خانميجو حول هذه التعليقات والقول: \"لا أفهم ما\nتقصده، هل يمكنك شرح ذلك؟\" أو، \"هل يمكنك أن تعطيني\nمثالاً على أنك تخبرني أن\nأطروحتي ليست قوية جدًا، هل يمكنك أن تعطيني مثالاً لكيفية ظهور الأطروحة القوية؟\" وسوف يفعل ذلك دون\nإعطائهم فعليًا أي جزء من كتابة المقال نفسه، لذا فهو مبرمج لمنع الطلاب\nمن استخدام الذكاء الاصطناعي للغش.  وأفضل ما في الأمر أيضًا هو\nأنه يمكن للطلاب بعد ذلك تحديث ومراجعة مقالتهم وسؤال خانميجو، \"مرحبًا، كيف تبدو الآن؟ مثل، ما رأيك الآن؟\" ويمكن لـ Khanmigo أن ينظر إلى التعليقات التي أشار إليها الطالب\nوالتعديل الذي أجراه للتو ويقول، نعم، مثلًا، أنت\nتعرف ما فعلته للتو. يمكنك تحديد المربع الذي يبدو رائعًا، أو يمكنك القول، كما تعلم، \"أعتقد أنك لا تزال بحاجة إلى\nالقليل من العمل هنا،\" وهذه مساحة آمنة للطلاب للحصول على دعم المتابعة،\nويمكنهم طلب المزيد  يساعد. وكمعلمة، مرة أخرى، أتذكر أنني كنت في\nفصل دراسي حيث، كما تعلمون، أحيانًا يكون لدي\nبحر من الأيدي في الهواء حيث يقول الأطفال، \"أنا عالق\". أو كان لديهم، كما تعلمون، ربما كان الطالب يقول، \"هل يمكنك قراءة الجملة؟\" وفي كل مرة يكتبون\nجملة يقولون، \"هل يمكنك قراءة الجملة؟\" ومن ثم كان هناك طلاب آخرون مطأطئين رؤوسهم، أو أولئك الذين عادة ما يكونون في أمس\nالحاجة إلى المساعدة لم يرفعوا أيديهم على الإطلاق. وأفضل جزء في هذا هو أنه يمكّن الطلاب من القيام بطلب \nالمساعدة من خانميغو عندما يحتاجون إليها، ولكنه يسمح أيضًا لـ خانميغو بإجراء بعض هذه الفحوصات للطلاب حتى لو لم يطلبوها. لذا فإن أحد الأشياء التي نعمل عليها الآن يسمى \"مدرب الكتابة\"، والذي يعتمد على\nنشاط التعليقات على المقالات، وهو في الواقع يرشد الطلاب خلال عملية المقالة بأكملها. لذا فإن هذا على وجه الخصوص\nيستهدف حقًا هؤلاء الأطفال الذين يشعرون بأنهم عالقون حقًا، ويشعرون بالانفصال التام، مثل الشعور بأنهم\nلا يعرفون من أين يبدأون. ونحن متحمسون أيضًا\nللتأثيرات التي سيتركها برنامج Writing Coach\nعلى قدرتنا على تقديم تقارير أكثر عن كتابات الطلاب إلى المعلمين.  في الوقت الحالي، كما تعلم،\nغالبًا ما يرى المعلمون المسودة النهائية، وربما المسودة الأولى إذا تمكنوا من إدارتها، ولكن مع هذا النوع من نشاط الذكاء الاصطناعي، يمكننا تجميع الكثير\nمن هذه التفاعلات وإبلاغ\nالمعلم بها، بما في ذلك أشياء مثل  ، \"مرحبًا، كما تعلم، قام هذا الطالب\nبلصق 500 كلمة للتو. وليس من الخطوط العريضة\nالتي أساعدهم في العمل عليها.\" ربما ينبغي عليك، كما تعلم، أن تنقر على هذا وتنتقل للأسفل\nلترى ما سيحدث، فهناك الكثير من\nميزات خانميغو الجديدة والمثيرة التي ستتم كتابتها هذا الخريف. - الكثير من الأشياء الجديدة والمثيرة.  هل يمكننا أن نتوقف وندع\nهذا ينقع لثانية واحدة؟ كم منكم يشاهد تعليم الكتابة؟ أراهن أنكم جميعًا تفعلون ذلك، لأننا مدرسون. وأي فصل دراسي في برنامج ELA، وأي تعليم للقراءة والكتابة، إذا فكرنا في القراءة فهي بمثابة شهيق، والكتابة هي زفير. جعل الطلاب قادرين\nعلى شرح أفكارهم والحصول على أداة\nتدعم الطلاب حقًا. أعني، برناديت،\nكم مرة كان عليك أن تقرأي مقالات عن كل هذه الأمور؟ وماذا يحدث إذا\nلم يستشهد الطلاب به بشكل صحيح، أو إذا حاولوا اختلاق الحقائق؟ كيف تعتقد أن الذكاء الاصطناعي يمكن أن يساعد في ذلك؟ - إذن، هناك بضعة\nأشياء يمكننا القيام بها. أولاً، قبل أن نصل\nإلى تلك الرؤية، يجب أن يكون الأطفال قادرين على معرفة، كما\nتعلمون، من أين نبدأ؟ ولذا فإن استخدام أدوات مثل الدردشة مع شخصية تاريخية أو الدردشة مع شخصية أدبية يعد في بعض الأحيان طرقًا رائعة لجعل الأطفال\nيبدأون في التفكير في الموضوعات. فيمكنهم الدردشة مع شخصية أدبية أو تاريخية، وسؤالهم\nعن الادعاءات والأدلة، ما رأيهم؟ ويمكنهم الذهاب\nوتطوير تلك الحجج. الشيء الآخر الذي\nيفعله خانميغو هو أنه يقوم بالمناظرات. يقوم بإجراء مناظرات على مستوى المدارس\nالابتدائية والمتوسطة والثانوية\nحول موضوعات محددة. لذا، إذا كان الطالب يواجه مشكلة في محاولة اكتشاف ادعاء أو\nدليل أو حجة، فإن البدء بواحدة منها ومنحه\nالتدريب مع خانميغو لتطوير تلك المواضيع يعد طريقة رائعة لبدء\nعملية الكتابة تلك. أعتقد أن الكثير من\nطلابي في المدرسة الإعدادية، وكما تعلمون، المعلمين الذين عملت معهم على مستوى المدرسة الثانوية كانوا دائمًا، \"كيف نجعل أطفالي يبدأون؟\" وهذه طريقة رائعة\nلبدء أطفالك. ومرة أخرى، هناك\nطرق عديدة للنظر إلى ذلك عندما نعود ونبدأ في\nالنظر، كما تعلمون، كيف نتأكد من\nأنهم يقتبسون بشكل صحيح، كيف نتأكد من أننا نفعل ذلك؟ يمكن أن يساعد خانميغو في ذلك أيضًا، وهذا أيضًا فحص جيد.  من المهم أن يفهم الطلاب معنى الاستشهاد، وما هو الانتحال، وكيف تستشهد بالذكاء الاصطناعي؟ كيف تشير إلى أنك استخدمت\nأداة الذكاء الاصطناعي في ورقتك البحثية؟ وهذه\nقطعة مهمة، في كثير من الأحيان، حسنًا، كما تعلمون، إذا شاركت في كتابتها، حسنًا، كما تعلمون، يبدو الأمر\nمثل وجود مؤلف مشارك. يجب عليك كتابتها معًا ويجب أن تكون قادرًا على\nشرح ذلك لمعلمك. لذا فإن القدرة على استخدام\nهذه الأدوات في جميع مجالات الكتابة، ومرة ​​أخرى، القدرة على تكبير أشياء\nمثل الادعاءات والأدلة، أو القدرة على تكبير الحجج اعتمادًا على نوع\nالكتابة التي يقومون بها وما  نوع من الاختبارات التي يجرونها. لأنه عندما نبدأ الآن في النظر حتى في بعض اختبارات AP وIB وACE، يجب أن يكونوا قادرين على القيام بذلك أيضًا، وهذه ممارسة رائعة لجميع المستويات. - نعم، وهذه المحادثة\nتجعلني أرغب في العودة وتدريس المقالات، وهو الأمر الذي لم أكن ناجحًا\nفيه، لنكن صادقين. حسنًا، هناك شخصان\nيتناغمان في الدردشة، متحمسان جدًا لمدرب الكتابة. متحمس حقًا، نعم، سنرسل\nالتسجيل للجميع، حتى تحصل على حزمة رعاية من خلال\nالاشتراك في الندوة عبر الإنترنت. مرحبًا بكم، وجزء\nمن حزمة الرعاية هذه، لا داعي للإثارة، إنه مجرد تسجيل وبعض الموارد. لكن بالحديث عن الموارد،\nوبالحديث عن تشا، فأنا أقوم بالتقسيم بشكل عشوائي، وسأواجه التحديات والفرص. أنا متحمس لكثير من الأشياء. \"أتمنى لو كان بإمكاني إجراء\nمحادثة طويلة مع، كما تعلم، جاي غاتسبي.\" يمكنك الآن من خلال خانميغو،\nلكنني لم أتمكن في ذلك الوقت، ولكن ما هي بعض الأشياء التي تعتقد أن الناس سوف يتوترون عند تنفيذها؟ ديونا، لماذا لا تطردنا؟ ربما البعض الفرص\nأو التحديات. - حسنًا، أعتقد أن أحد\nالأشياء مثل الكثير، كما هو الحال مع الذكاء الاصطناعي الآخر،\nالشيء الرائع في خانميغو هو أن الطلاب ليس لديهم فرصة للذهاب إلى خانميغو والقول،\n\"اكتب مقالتي لي.\" خانميغو هو معلم سقراطي،\nولهذا السبب، سيعود خانميغو، وأعتقد أن خانميغو لديه\nأفضل شخصية، أو إذا كان هذا ما تريد أن تسميه، ولكن لديه القليل من الشخصية\nلأنه سيقول، \"نعم،  ولكن بصفتي مدرس الذكاء الاصطناعي الخاص بك،\nلا أستطيع كتابة ورقتك البحثية، ولكن دعونا نفكر في هذا الموضوع.\" إنه يعيد الطلاب دائمًا، لذلك لن يكون كذلك، ولن\nيقوم بالعمل نيابةً عنهم فحسب. تلك العملية، خاصة في الكتابة، الكتابة هي عملية، أليس كذلك؟ لذا، كما تعلمون، بغض النظر عما يحدث، لا يزال الطلاب بحاجة إلى أن يكونوا قادرين على التحدث، كيف توصلت إلى هذه الفكرة؟ هل تعلم ما هي التعديلات التي قمت بها؟ إنه شيء واحد،\nفي يوم واحد فقط، كما تعلم، بالأمس فقط كنت\nتكتب جملتين فقط، والآن يمكنك اليوم كتابة أطروحة كاملة؟ كما تعلمون، لا\nيزال يتعين عليك تكوين طلاب، ولا يزال الطلاب بحاجة إلى أن يكونوا\nقادرين على التحدث إليه. لذلك أعتقد أن هذه فرصة عظيمة لمواصلة مساءلة الطلاب، ولكن لا يزال لديهم مساعد دون أن يقوم فقط بالعمل نيابةً عنهم. أعتقد أن أحد التحديات التي نواجهها أيضًا\nهو الاضطرار إلى تدريب الطلاب على إجراء هذه المحادثات\nذهابًا وإيابًا مع خانميجو.  كما تعلمون، إنه شيء واحد أن تقول، \"أنا لا أفهم، كما\nتعلمون، هذا الموضوع المحدد الذي ندرسه،\" لكن الطلاب ما زالوا\nيمتلكون عقلية مفادها أن خانميجو هو\nمحرك بحث، وهو  لا. الأمر أكثر من ذلك، فاطلب منه\nالتبسيط، واطلب منه التوضيح، كما تعلم، يوضح لك\nماذا تقصد بهذا؟  هل تعلم ماذا\nيعني تحليل هذا النص؟ أو، كما تعلم، إجراء\nهذه المحادثات ذهابًا وإيابًا، يعد هذا أحد التحديات، ولكن\nعليك فقط التأكد من تدريب طلابك\nوتقديم نموذج لهم حول كيفية إجراء محادثة مرة أخرى\nوإيابًا مع خانميجو. انها ليست واحدة وانتهى. - صحيح، والذكاء الاصطناعي يهدف إلى تعزيز الذكاء البشري،\nوالتجربة الإنسانية، أليس كذلك؟ لأننا لا نزال نريد إعادة الحديث إلى فصولنا الدراسية. لقد قمت للتو بعمل مرجع لجوستين تيمبرليك\nلكم جميعًا. لذا يا سارة، عندما نفكر\nفي التحديات، أليس كذلك؟ أعني، عند التفكير في\nالتجربة الإنسانية، ما هي بعض أفكارك حول ذلك؟ - نعم، أنا أتفق مع كل ما\nقالته برناديت وديونا. أشعر أن هناك\nمفهومًا خاطئًا شائعًا مفاده أن الذكاء الاصطناعي يساوي روبوتات الدردشة، وكما تعلمون، ربما يكون هذا هو\nالشكل الأكثر شيوعًا للتفاعل مع الذكاء الاصطناعي في الوقت الحالي والذي يدركه المعلمون،\nلكنني لا أعتقد أننا يجب أن نفكر\nفي دمج الذكاء الاصطناعي في فصول محو الأمية مجرد إيجاد المزيد من الطرق\nللطلاب للدردشة مع الذكاء الاصطناعي.  في الواقع، أعني، عندما أفكر\nفي أفضل اللحظات كمدرس في فصول القراءة الخاصة بي، وفي فصول الكتابة، كانت تلك اللحظات التي\nكنا نتحدث فيها معًا ومع بعضنا البعض،\nمع أقراننا ومجموعاتنا حول الكتب وحولها.  كما\nتعلمون، الموضوعات الكبيرة، والشخصيات المهمة،\nوجميع أنواع التجارب الغنية التي تمر بها عندما تكتب وعندما تقرأ\nشيئًا معًا. وأحد الأشياء التي\nأريد أن يتوصل إليها الناس هو إدراك أن إدخال الذكاء الاصطناعي في الفصول الدراسية لمحو الأمية لا يعني قضاء ذلك الوقت حيث\nنتواصل مع بعضنا البعض ونتحدث مع بعضنا البعض، أعتقد ذلك  له علاقة أكبر\nبتمكين المعلمين بأدوات أفضل لإنشاء\n تجارب ومواد تعليمية إبداعية حقًا، ومساعدة الطلاب في الأجزاء الصعبة من القراءة والكتابة التي غالبًا ما يتم تجربتها\nبشكل مستقل على أي حال. لذا فإن تجربة قراءة ورقة بحثية قام\nمعلمك بترميزها، كما تعلمون، لا يجب أن تكون\nتجربة منعزلة، ونحن نعلم أن كل معلم\nليس لديه الوقت للجلوس والقيام بذلك كل يوم  الوقت مع كل طفل. ونفس الشيء بالنسبة للقراءة، كما تعلمون، في كثير من الأحيان هناك\nلحظات قد تتعثر فيها عندما\nتقرأ شيئًا ما، ولا نريد أن يؤدي ذلك، كما تعلمون، إلى تفكيك تجربة الفصل الدراسي بأكملها المتمثلة في القدرة على مناقشة\nكتاب ما  وما يعنيه، وهذه هي التجارب التي أعتقد أن الذكاء الاصطناعي يمكن أن يساعد فيها كثيرًا. ثم مرة أخرى، مجرد تسهيل الأمر كثيرًا على المعلمين للوصول إلى شريك إبداعي، إلى\nشيء يمكن أن يساعدهم في التخطيط للمشاريع أو المناقشات الصفية، وإعطاء الطلاب فرصة،\nكما ذكرت برناديت، للدردشة مع أحد الأدباء  شخصية\nمن كتاب يقرؤه، ولكن بعد ذلك يتحدثون عنها كفصل دراسي، مثل المناقشة مع بعضهم البعض، \"ما رأيك في تلك التجربة؟ هل شعرت بأنها حقيقية؟ مثل، ماذا عن الذكاء الاصطناعي\nيبدو أنه قد يكون كذلك؟  هل خالفت\nما قصده المؤلف في الكتاب الذي كتبوه، ولماذا؟ مثل، هذه\nنقطة انطلاق رائعة حقًا لمقال يمكنهم كتابته. لذا، هناك العديد من الطرق\nالتي يمكنك من خلالها دمج الذكاء الاصطناعي في تجارب الفصول الدراسية والتي\nلا تؤدي بالضرورة، كما تعلمون، إلى إبقاء الطلاب معزولين\nأمام شاشاتهم. أعتقد أن أفضل حالة استخدام يمكننا جميعًا التوجه نحوها هي\nالطرق التي يمكننا من خلالها استخدام الذكاء الاصطناعي لتشجيع\nالمزيد من تجارب التعلم التعاونية\nوالمجتمعية، لأنه مرة أخرى، أعتقد أن هذا هو المكان الذي\nتظهر فيه كل المتعة. وأعتقد أنه إذا تمكنا من جعل الذكاء الاصطناعي يساعد المزيد من الطلاب في الوصول إلى النصوص الغنية والمناسبة لمستوى الصف الدراسي، فأعتقد أنه يمكننا رؤية\nالمزيد من الفرص لإجراء هذا النوع من المناقشة والمشاركة في الفصل الدراسي.\n - بالتأكيد، وأود أن\nنتوقف دقيقة، وفي الواقع، لقد كنا\nنرتدي قبعات المعلمين لدينا، ولكن أريد منا أن نرتدي\nقبعات المعلمين مرة أخرى، وأريدك أن تفكر\nفيما كان ربما شيئًا كان  لقد كان ذلك تحديًا حقيقيًا\nبالنسبة لك عندما كنت تقوم بتدريس الدراسات الاجتماعية ومحو الأمية، وبالنسبة لي، التعليم الخاص، وكان من الممكن أن تساعد هذه الأداة\nعلى الفور، مثل حل مشكلة الألم هذه؟ برناديت، ماذا عنك؟ ما هو الشيء الذي ربما كنت مثله، \"أتمنى لو كان لدي هذا.\" - أتمنى لو كان لدي هذا، لذلك أعتقد أن هناك، أعتقد أن هناك العديد من المستويات لذلك، لأن أدوات معلم خانميغو متنوعة جدًا ومتنوعة جدًا. أعتقد أنه لا يوجد ما\nيكفي من الوقت في الندوة عبر الإنترنت لمراجعة كل هذه الأشياء، ولكن بعض الأشياء\nالتي عندما أفكر فيها، كما تعلمون، كمدرس، أردت دائمًا التأكد\nمن دقة طلابي وأننا كنا نضمن الدقة. وأنا أعلم أنه عندما فكرت لأول مرة\nفي الذكاء الاصطناعي، كما تعلمون، كان\nالغرب المتوحش، كما تعلمون؟ لقد كان هذا الذكاء الاصطناعي قد جاء\nوكتب كل شيء لأطفالي، ولم يكن هذا من\nأعمالهم الأصلية، وربما كان ذلك بالنسبة لي\nأكبر نقطة ألم وخوف عندما بدأت\nالتفكير والنظر في الذكاء الاصطناعي. ما أحبه تمامًا في\nخانميجو وأكاديمية خان هو حقيقة أن الأمر ليس كذلك. هذا هو العمل الأصلي للطالب الخاص بك. عندما يعملون\nمع منشئ المقالات، يجب على الطلاب طرح\nأفكارهم وأفكارهم الخاصة وتطوير شخصياتهم الخاصة. يمكن أن يساعدهم Khanmigo على توسيع ذلك وتحديث مفرداتهم ومساعدتهم في النظر إلى تلك\nالجمل المثيرة والكلمات المثيرة، ولكن هذه هي الأماكن التي\nعندما نبدأ الحديث فيها عن ضمان تلك الدقة،\nفهو عمل من إنتاج الطلاب. ليس الأمر، \"لقد طرحت\nموضوعًا، وكما تعلمون، تم كتابة هذا المقال من أجلي،\" وأعتقد أن هذا مهم حقًا كمعلم، وكان هذا دائمًا خوفي من هذا. أعتقد أن الشيء الآخر هو\nقطعة التعليقات الكاملة.  كما تعلمون، عندما يكون لديك\nفصل دراسي مكون من 20 أو 25 أو 30 طالبًا أو أكثر، كيف يمكنك تقديم هذه التعليقات الفردية\nبشكل منتظم؟ أود أن أقول إنني فعلت ذلك كل يوم مع كل طالب، لم تكن هناك طريقة، لم تكن هناك طريقة. لكن مع أكاديمية خان\nومع الذكاء الاصطناعي وخانميجو، يمكن للمدرس أن يدخل ويقول: \"حسنًا، أريدك أن تضع مقالاتك فيها. أريد من الجميع أن ينظروا\nإلى مقدماتك الخاصة وأن يفعلوا ذلك ويتحدثوا عنها،\" وبعد ذلك  بل قم بإجراء\nمناقشة صفية حول التعليقات التي حصلوا عليها من الذكاء الاصطناعي من خانميغو فيما يتعلق بتلك المقدمة\nأو استنتاجاتهم أو ادعاءاتهم، مهما\nكانت تلك القطع. والآن يحصل الطلاب على\nهذا العمل الفردي، وحتى عندما يكونون في المنزل، ربما يكتبون في المنزل، أو ربما تعمل مع مجموعة صغيرة وبقية طلاب فصلك\nيجلسون هناك نوعًا ما. هذه فرصة\nلطلابك للحصول على تلك الفرصة وجهًا لوجه عندما\nلا تستطيع فعل ذلك جسديًا. وهو ما يحدث للأسف كمعلمين،\n وخاصة إذا كانوا يأخذون العمل إلى المنزل ويكتبون من المنزل. تريد التأكد من\nأنهم، كما تعلمون، لا يطلبون سوى الذكاء الاصطناعي للقيام بذلك، لأنهم عندما\nيضعونه في مدقق المقالات، سينظر الذكاء الاصطناعي إليه ويقول، \"مرحبًا، كما تعلم، هل أنت متأكد\"  ؟ من اين حصلت على هذا؟\" وهذا شيء\nمهم بالنسبة لي كمدرس أن أعرف أن هناك دقة وأنهم يتلقون تعليقات، وأنهم يتلقون\nتعليقات جيدة، وهذا يتعلق بعملهم. - نعم، في المرة الأخيرة التي قمت فيها بالتحقق، ما\nزلنا غير قادرين على استنساخ المعلمين، لذا فهذه طريقة مهمة حقًا لنكون قادرين على القيام بهذه التعليقات. ديونا، ما رأيك؟ ماذا سيكون الخاص بك؟ - يا للعجب، هناك زوجين. الحق، هناك زوجين. مولد العنوان. حقيقة أنني أستطيع، كما تعلمون، أنني\nكنت أقضي الكثير من الوقت في تصفح الإنترنت محاولًا\nالعثور على نماذج تقييم، كما تعلمون، والتي تتوافق مع\nالكتابة التي نقوم بها، كما تعلمون، لطلابي.  وفي بعض الأحيان، كما\nتعلمون، كان الملف بتنسيق PDF، لذا لم أتمكن من الدخول وإجراء\nأي نوع من التعديلات عليه. ولذا فإن حقيقة وجود\nمولد فعلي لقواعد التقييم، كما تعلمون، للمساعدة في مساعدة طلابي في الكتابة، أمر مذهل. والشيء الآخر الذي يتبادر إلى ذهني أيضًا هو القصيدة الموجزة الممتعة للفصل.  كما تعلمون، عندما أفكر\nفي طلابي، كما تعلمون، تريدون الانتظار حتى أنهي هذا الدرس، أليس كذلك؟ ربما كنت، كما تعلم،\nتتحدث للتو عن الفكرة الرئيسية. كان طلابي يحبون\nموسيقى الراب، لذا فإن الشعر والراب، كما تعلمون، يسيران جنبًا إلى جنب. ولذا أعتقد أنه كان من\nالرائع جدًا، لأنني لست شاعرًا غنائيًا،\nلا أستطيع أن أتوصل إلى أشياء سريعة كهذه، ومن ثم تضمين\nربما حتى دمج الأشياء التي يحبونها،  كما\nتعلمون، في هذا الفصل الممتع، هذه هي القصيدة الموجزة للفصل الممتع، لأنه يجب على الطلاب أن\nيقدموا لك تعليقات، \"ماذا تعلمنا اليوم،\nأعطني بعض الأفكار.\" وبعد ذلك يقوم بإنشاء\nالدرس ويختتمه في هذا الملخص اللطيف مثل القصيدة.  وأعتقد أنه، كما تعلمون، كانت ستكون مجرد\nطريقة ممتعة لاختتام هذا الدرس. بالنسبة لي، كان الأمر صعبًا أيضًا، كما\nتعلم، إذا قال طلابك، \"مرحبًا، أنا أحب لعبة Fortnite، أو أحب هذه اللعبة أو تلك اللعبة،\" لم أعرف ذلك إلا بسببهم،\nولكن شيئًا ما الآن، هو أن أكون قادرًا على ذلك.  لتوليد\nهذه الأشياء والتحدث عنها دون أن أضطر إلى\nالذهاب وإجراء مقابلة مع طفل أو أخذ المزيد من الوقت الذي لا أملكه بعيدًا عن تخطيطي\nللبحث في هذا الأمر بمفردي، فهذا أمر مذهل بالنسبة لي. لذا، أتمنى حقًا لو كان\nلدي منشئ قواعد التقييم هذا، وكما قلت، فإن\nالقصيدة الموجزة المضحكة للفصل ستكون واحدة من الأشياء المفضلة لدي. - هذا مذهل. إذن نحن\nننهي وقتنا معًا، لكني أريد أن\nأجعل الكلمة الأخيرة لسارة. دعونا نفكر للأمام لمدة 5 أو\n10 سنوات في المستقبل. ما هي أحلامك وآمالك\nفي تعليم القراءة والكتابة؟ أي نوع من العالم المثالي يمكن أن يكون هناك معرفة ما نعرفه الآن؟ - نعم، هذا سؤال عظيم. لذلك، أعني أن عقلي\nيشبه الدوران بكل الطرق المختلفة التي كان من الممكن أن تساعدني بها\nالأدوات الحالية التي لدينا والتكنولوجيا الحالية التي لدينا في الفصل الدراسي، والساعات التي قضيتها،\nساعات وساعات وساعات في القيام بأشياء  يمكن للذكاء الاصطناعي\nالآن القيام بذلك في ثوانٍ. أعتقد أن أحد التحديات\nهو، كما تعلمون، أنني تعلمت الآن من خلال\nدوري هنا في أكاديمية خان كيف أكون مهندسًا سريعًا لائقًا إلى حد ما، مما يعني أنني أعرف كيفية\nالتحدث إلى الذكاء الاصطناعي للحصول على ما يمنحني إياه.  الأشياء التي أحتاجها، ولكن ليس كل المعلمين لديهم تلك المهارات. وأحد فوائد\nأدوات المعلم Khanmigo، والتي يمكنكم جميعًا الانتقال إليها\nوالاشتراك فيها الآن على رابط Khanmigo dot AI الذي أعتقد أننا وضعناه في الدردشة، ولكن إحدى فوائد هذه الأدوات هي أنه  ليس من الضروري أن\nتكون مهندسًا سريعًا ماهرًا للقيام بالعديد من هذه الأشياء. لكن بالتفكير في السنوات الخمس المقبلة أو نحو ذلك، من الصعب التنبؤ إلى أين نحن ذاهبون. لكنني أتخيل المزيد من \nالأدوات المرنة المخصصة التي تم تصميمها خصيصًا لمعلمي ELA.  يمكن الآن استخدام الكثير من أدوات خانميغو الخاصة بنا\nفي أي موضوع، لكنني متحمس حقًا لبعض\nالأشياء التي نقوم بها، والتي لدينا في أعمال\nتعليم القراءة والاستيعاب القرائي\nحيث لا يضطر المعلمون إلى ذلك، كما تعلمون  ، قم بالكثير من\nهذا العمل الأمامي للتحضير. أتذكر فقط أن الأمر استغرق وقتًا\nطويلاً بالنسبة لي للعثور على النص الذي أردت استخدامه،\nثم إعداد هذا النص لطلابي حتى\nيتمكنوا من الوصول إليه باستخدام السقالات والأسئلة وجميع\nالطرق المختلفة التي سنناقشها بها. لذلك لا أعتقد حتى أن هذه خمس سنوات، أعتقد أنها مثل ستة أشهر\nمن الآن فصاعدًا في أكاديمية خان، ولكن تمامًا مثل توفير\nالمزيد من وقت المعلم. وعندما أفكر في الأمر\nمن وجهة نظر الطالب، فإنني أرجع فقط إلى ما\nكنت أتحدث عنه سابقًا مع هذه\nالتجارب الثرية في الفصول الدراسية حيث لا يركز الطلاب بالضرورة على ما يحدث على\nالشاشة، وربما تكون التكنولوجيا\nموجودة لتقديم الدعم حيث يحتاجون إليه، أو، كما تعلم، أن يكونوا\nشريكًا عندما يحتاجون إليه، لتحفيز الطلاب. أعتقد أن هناك بعض الأشياء الرائعة التي نحلم بها\nالآن عندما يتعلق الأمر، كما تعلمون،\nبمشاركة الطلاب واللعب وتحفيز الطلاب\nوالتي يمكننا استخدام الذكاء الاصطناعي من أجلها. لكن نعم، أعتقد أن المستقبل هو فقط أن نجمع الطلاب معًا أكثر، ودعنا نجلب المعلمين، فلنجعل المعلمين أكثر، كما تعلمون، ميسرين للتعلم\nمقابل فقط أساتذة المهام الذين يتعين عليهم القيام بأشياء كثيرة، كل ذلك في  في نفس الوقت عادة. لذلك أعتقد أن هناك\nالكثير من التجارب المثيرة والممتعة والمبتكرة \nوالصارمة والمتميزة \nالتي نحلم بها هنا والتي نأمل أن تجعل، كما تعلمون، دروس القراءة والكتابة\nأكثر قوة وإثارة للمستقبل  المتعلمين. - أوه، اسمع، من لا يريد الحصول على\nالمزيد من ذلك في الفصل الدراسي الخاص بك وتوفير بعض الوقت؟ أي شخص، أي شخص؟ بالطبع تريد توفير بعض الوقت. عند الحديث عن الوقت، لسوء الحظ، هذا هو كل الوقت المتاح لدينا لهذا اليوم. شكرًا لأعضاء اللجنة الرائعين\nعلى مشاركة رؤاهم وأفكارهم من\nتجربتهم في الفصل الدراسي، وأريد فقط أن أشير إلى أننا نريد مواصلة العمل معكم. إذا كنت تريد العمل معنا، أعني أننا نقدم الكثير، يمكنك الذهاب الآن\nوالتسجيل في أكاديمية خان، ولكن إذا كنت ترغب في الحصول على\nشراكة أعمق، فنحن نقدم شيئًا\nيسمى شراكات المناطق حيث يمكنك الحصول على مدير نجاح  والتعلم المهني المصمم خصيصًا\nلتلبية احتياجاتك. يمكننا أيضًا مساعدتك في\nتحليل البيانات لنظام MTSS، وكل الأشياء،\nولوحات تتبع المنطقة، سمها ما شئت. سنحصل عليها مع البيانات عندما يتعلق الأمر بفهم مكان\nتواجد طلابك مع خان. ولكن الأهم من ذلك، أننا\nنتأكد حقًا من أن خانميغو آمن وأخلاقي، وأن هناك الكثير من\nحواجز الحماية، وهو ليس كذلك، ونحن نفكر حقًا\nفي هذا كل يوم. نحن لا\nنرميها ونجعلها مخيفة فقط. نحن حقًا ندرك الطريقة التي نبني بها هذا. لذا، إذا كنت تريد معرفة المزيد، فهذا هو فريق الشراكة الخاص بالمنطقة. نحن نحب التواصل معك. انقر على رمز الاستجابة السريعة هذا،\nوحتى نلتقي مرة أخرى. استمر في القراءة، استمر في الكتابة، استمر في التعلم. نحن نقدر لكم جميعا.",
    "t_italian": "- Ciao a tutti, mi chiamo\nDanielle Sullivan.  Il mio ruolo alla Khan Academy\nè che sono il senior manager di Northeast District Partnerships e il mio precedente\nruolo di educatore è che ero un insegnante di educazione speciale di quinta e sesta elementare\n. Ho insegnato ELA e matematica a Washington DC e nello stato di New York, e lascerò che Sarah si\npresenti. - Ciao a tutti, benvenuti. Sono Sarah Robertson. Attualmente sono il product manager senior dei team di alfabetizzazione ed esperienza in classe qui alla Khan Academy. Proprio come Danielle, sono un'ex\ninsegnante di classe. Ho insegnato ELA alla scuola media e per un breve periodo ho lavorato come insegnante di storia, ma principalmente leggendo e scrivendo. E vengo anche da un'altra\nsocietà di tecnologia ed alfabetizzazione, penso che anche Danielle si sia unita a\nnoi da un'altra. E lo passerò a, facciamo Diona. - Ciao a tutti. Sono Diona Clingman. Sono uno specialista dell'apprendimento professionale\npresso Khan Academy. Proprio come i miei colleghi che\nfanno parte del panel con me, sono un ex insegnante di classe. Elementare è dove si trova il mio cuore. Ho insegnato nelle classi seconde,\nterze e quinte. Ho fatto un intervento comportamentale. Sono stato direttore di un edificio e direttore accademico. Quindi sono stato a tutti i livelli,\ncapisco sicuramente e adoro entrare in contatto con altri educatori. E con questo\nlo passerò a Bernadette. - Ciao, sono Bernadette Bennett. Sono uno\nspecialista di contenuti di apprendimento professionale con Khan Academy. Sono un ex insegnante di scuola media e supervisore distrettuale di studi sociali\ndella Florida e sono così entusiasta di\nessere con voi ragazzi oggi. - Ottimo, ecco come\nfunzionerà. Smetterò di condividere il mio schermo perché il focus sarà\nsulla conversazione. Quindi avremo una conversazione davvero ricca e interessante sul ruolo trasformativo dell'intelligenza artificiale e sul\nmiglioramento dei punteggi di alfabetizzazione, perché come sai, sono\nsicuro che lo senti, molti studenti si sono sentiti\nlasciati indietro dopo il COVID, soprattutto nell'alfabetizzazione  . Voglio dire, direi anche matematica, ma oggi ci concentriamo sull'alfabetizzazione. Quindi vogliamo approfondire e avere una conversazione davvero approfondita su come tutti voi potete iniziare a pensare\nall'apprendimento adattivo dell'intelligenza artificiale, feedback personalizzato per aiutare gli studenti a migliorare le loro\ncapacità di lettura e scrittura. E in realtà parliamo\nanche di un po' di gioia, no? Alfabetizzazione sull'amore. Anche se stiamo solo parlando, per favore pubblica commenti nella\nchat e domande nella chat. Potrò vederli e\ninizieremo con questa domanda. Quindi, Sarah, la Khan Academy non viene spesso considerata... La Khan Academy non viene spesso\nconsiderata come uno strumento di riferimento per l'istruzione e il supporto all'alfabetizzazione. Ma eccoci qui, stiamo facendo\nun webinar sull'alfabetizzazione e sull'ELA. Allora, cosa è cambiato? - Sì, quindi in realtà sono entrato a far parte della Khan Academy circa un anno e mezzo fa, proprio nel\nperiodo in cui Khan Academy aveva collaborato con OpenAI su come utilizzare\nmodelli linguistici di grandi dimensioni per creare\nesperienze di apprendimento davvero ricche. E così, durante il mio primo giorno alla Khan Academy, il mio manager mi ha fatto sedere\ne mi ha detto: \"A proposito, abbiamo questa partnership con OpenAI, hai sentito parlare di ChatGPT?\" Ed ero appena uscito da un altro prodotto di strumenti EdTech supplementari per l'alfabetizzazione e, sai, avevo l'\nalfabetizzazione in mente, ero molto entusiasta di venire\nalla Khan Academy sapendo che c'erano opportunità per costruire nuovi strumenti e\ncontenuti per l'alfabetizzazione. Quindi questo era, sembrava un segno che ero arrivato\nesattamente al momento giusto, perché quello che stavamo vedendo con molte delle nostre diverse esplorazioni lo\nstavamo facendo con ChatGPT e i grandi\nmodelli linguistici che erano, che stavamo sperimentando era che alcune delle migliori esperienze che i LLM potevano supportare erano legate all'insegnamento della lettura\ne all'insegnamento della scrittura. E così ci siamo tuffati a capofitto\nnei diversi modi in cui avremmo potuto sfruttare l'intelligenza artificiale\nper creare esperienze di apprendimento davvero innovative e ricche per gli studenti quando si trattava di\nleggere e scrivere. Sai, proprio il primo mese che sono stato qui abbiamo fatto un hackathon, e una delle funzionalità\nche ne sono derivate è stata la nostra attuale attività di feedback sui saggi, di cui parlerò un\npo' più avanti. Ma dirò anche solo che\npiù noi della Khan Academy abbiamo collaborato con i distretti\nnegli ultimi anni, più ci è chiaro che la richiesta di risorse flessibili e di alta qualità\nper ELA è più alta che mai. Penso, ancora una volta, che appena\nusciti dalla pandemia e entrati\nin quest'era di intelligenza artificiale, le lezioni di lettura e scrittura\nsiano state interrotte e dobbiamo pensare\na modi davvero creativi e innovativi per\nraggiungere gli studenti ora in un  in un modo forse è un po'\ndiverso da quando ero effettivamente in classe e sicuramente da quando\nero uno studente anch'io. Quindi siamo davvero entusiasti\ndi ciò, di quelle nuove attività che stiamo costruendo. Stiamo anche lanciando\nnuovissimi corsi ELA per l'inizio delle scuole medie e\nsuperiori, penso che abbiamo già lanciato quello di\n6a elementare, e penso che lanceremo\nanche 9a e 10a elementare per questa stagione di ritorno a scuola. Quindi è sicuramente una nuova era,\nuna nuova era per la Khan Academy, e siamo davvero entusiasti\ndelle nuove risorse di lettura e scrittura che stiamo costruendo. - Sì, e quanti di\nvoi che stanno guardando questo video a volte hanno avuto difficoltà a supportare i propri studenti nella scrittura? Qualcuno, qualcuno sente quel dolore? Quello sarei io. Sì, i fatti, esattamente. Quindi l’obiettivo è come\npossiamo coinvolgere i nostri studenti affinché siano più attenti nel\nmodo in cui si esprimono? Quindi voglio pensarci bene, sono\nstati un paio d'anni difficili, riesci a credere che sia il '24, comunque, il 2024? Stiamo pensando solo agli studenti che si diplomano\nquest'anno, hanno iniziato nel 2020, quindi, wow, sono successe molte cose\nnegli ultimi quattro anni. Quindi, pensando agli ultimi quattro anni, Diona, come si può sfruttare l'intelligenza artificiale per\ncolmare alcune delle lacune che vediamo\nesasperate dalla pandemia, o opportunità di apprendimento se vogliamo farla girare in modo positivo? - Sì, assolutamente. Non sono solo un educatore,\nma sono un genitore, quindi mia figlia quest'anno sarà all'ultimo anno, e quindi parte dell'impatto personale\ndella pandemia non solo, sai, ha influenzato me non come educatore, ma\nanche come  anche un genitore. La mia mente, quando penso all'intelligenza artificiale e a come potremmo usarla\nper sfruttare alcune di queste lacune, la mia mente va a\nquell'istruzione mirata. Sai, più grandi sono le lacune, più\nistruzioni mirate vuoi dare ai tuoi studenti, giusto? Ma so anche che, sai, è facile dire istruzioni mirate o piani per piccoli gruppi, cosa vuoi fare\ncon i tuoi piccoli gruppi? Ma in realtà questa è tutta un'altra\npianificazione, giusto? Quindi sto pensando a\nquella pianificazione in piccoli gruppi. E quindi quando penso\nall'intelligenza artificiale, penso ad alcuni di questi strumenti che abbiamo, come la possibilità di\nusare semplicemente Khanmigo per, uno, semplicemente aggiungere per aiutare a raggruppare i tuoi studenti. Sai, ti aiuta a\nraggruppare i tuoi studenti. È anche il\ntuo assistente, puoi semplicemente chiederlo, su cosa devono\nlavorare i miei studenti? Quindi ritagliare quel tempo con\nquella pianificazione in piccoli gruppi, semplicemente avendo quel supporto in questo\nmomento come insegnante per sapere come raggruppare i miei studenti e quali sono quelle cose su cui, sai, dovrebbero lavorare? Penso anche\nall'approccio socio-emotivo, giusto? Pensare a quel bambino nella sua interezza\ne rispondere a quei bisogni. E sappiamo che una delle cose è che gli studenti sono al sicuro, provano una sensazione di sicurezza come\nse non lo sapessi, giusto? Non so cosa stia succedendo, quindi gli studenti hanno la capacità di discutere e porre quelle\ndomande con Khanmigo solo per farlo, anche quando stai pensando\nall'analisi del testo, giusto? Aiutami a capire, ho\nuna domanda su questo testo che forse non vogliono chiedere ad alta voce davanti ai loro colleghi, e quindi sfruttarlo in questo modo penso sia solo uno dei tanti. - Sì, assolutamente. Voglio dire, tutto quello che hai detto,\nle istruzioni in piccoli gruppi, ancora una volta, quanti di voi che guardano hanno mai avuto difficoltà con le\nistruzioni in piccoli gruppi?  Vi vedo insegnanti delle scuole medie, vi vedo insegnanti delle scuole superiori, giusto? Sappiamo che questa è una\npratica davvero importante. Allora Sarah, puoi parlarci\ndel tuo punto di vista o di alcune cose a cui stai pensando\ncon gli anni post-COVID? - Sì, quindi, voglio dire, ho insegnato in un'aula\nin cui gli studenti variavano, ho insegnato in un'aula di seconda media per la maggior parte del mio tempo di insegnamento e ho avuto studenti che erano dal\nlivello di lettura di seconda elementare al livello di lettura di 12a elementare  ,\nnel mezzo, solo una gamma molto ampia di livelli di abilità. E molti dei miei studenti hanno avuto problemi con la fluidità e la comprensione,\no con una combinazione di entrambi. C'erano tutti i tipi di bisogni diversi in tutta la stanza, e so che una delle\ncose migliori che possiamo fare per gli studenti che hanno lacune nelle\ncapacità di comprensione della lettura in particolare, che\ndirei per i miei alunni di seconda media è stata la sfida più grande,\nè stata  assicurandosi davvero, A, che avessero accesso\nal testo di livello scolastico. Troppi studenti\nnon hanno nemmeno l'opportunità di provare ad accedere\ne leggere un testo di livello scolastico, ma sapendo che così tanti\nstudenti sono al di sotto del livello scolastico, come possiamo supportare l'istruzione e come possiamo creare\nopportunità per gli studenti? per essere in grado, sai, di riempire\nciò che manca nel mezzo? E alcune delle migliori\nstrategie per farlo sono legate alla preparazione pre-insegnamento\ne pre-lettura, che significa e sembra\nattivare la conoscenza pregressa, creare collegamenti con\nciò di cui tratta il testo, costruire conoscenze di base\nper qualsiasi schema che lo studente  ha bisogno\ndi avere quando si tratta di cosa tratta il testo, che si tratti di\nnarrativa o saggistica, pre-insegnando il vocabolario di secondo e\nterzo livello e offrendo agli studenti\nl'opportunità di esercitarsi e conoscere parole\ncon cui potrebbero non avere familiarità. E poi ovviamente supportarli quando si tratta di\nscomporre frasi complesse, e una delle\ncose davvero interessanti di avere una presenza di intelligenza artificiale in giro per\naiutare gli studenti in questo e aiutare gli insegnanti in questo\nè che molte di queste cose ora sono estremamente facili\ne veloci  a che fare con l’intelligenza artificiale. Quindi, quando pensi, sai, ad attivare conoscenze pregresse\no a creare connessioni, tutto ciò che devi fare è andare\nsu Khanmigo o qualsiasi strumento di intelligenza artificiale e fargli guardare il\ntesto e identificare, sai, domande e diversi impegni, tattiche per ottenere\ngli studenti a pensare a cosa significa questo testo per loro o se hanno qualche tipo\ndi collegamento con il tema o con i personaggi del testo. Identificare le\nconoscenze di base necessarie per essere in grado di capire\ndi cosa tratta il testo e pre-insegnarle, facendo in modo che\nKhanmigo le riassuma per gli studenti o faccia domande agli studenti su ciò che già sanno\no su ciò che vogliono sapere, identificando e facendo\nidentificare a Khanmigo  da un testo quali parole del vocabolario uno\nstudente probabilmente ha bisogno di conoscere per poter\ncomprendere qualcosa. E poi utilizzando alcune delle nostre\nattività di apprendimento predefinite come Word Safari e Word\nArchitect per esercitarsi con alcune di quelle diverse parole prima ancora di arrivare al pezzo da leggere. E poi, quando lo studente sta effettivamente leggendo un testo di livello scolastico, avere Khanmigo lì alla Khan Academy per supportarlo se si imbatte in qualcosa che è veramente complicato\no difficile da analizzare per loro, è, sai, un giudizio libero. Non una persona, ma un'intelligenza artificiale per... - Supporto.\n- Per sostenerli, sì, a cui rivolgersi quando sono bloccati e quando davvero non sanno, sai, anche perché non capiscono qualcosa, possono andare lì per fare domande. Un'altra attività davvero utile\nche consiglierei agli studenti che sono al di sotto del livello scolastico è che abbiamo questo strumento per insegnanti con Khanmigo chiamato rilivellamento del testo. E ovviamente, come ho detto prima, è estremamente importante che\ngli studenti non ricevano solo testi che sono\nmolto al di sotto del livello scolastico per un intero anno scolastico. È davvero importante che\nabbiano l'opportunità di accedere al testo di livello scolastico. Quindi uno dei modi migliori\nper utilizzare il livellatore di testo è livellare nuovamente un testo che è\na livello di classe per gli studenti, livellarlo nuovamente verso il basso,\nsai, di un paio di livelli, e poi chiedere a Khanmigo di\nprendere quel testo di rilivello e  livellalo\nnuovamente e riportalo al punto in cui era prima. E poi chiedi agli studenti di\nguardare tutte e tre le versioni, chiedi loro di guardare la versione più semplice che l'intelligenza artificiale ha abbassato di nuovo il livello, e questo li aiuterà a\nottenere una comprensione di base di ciò di cui trattava il testo, chiedi loro di guardare la\nversione alzata di livello  , e poi chiedi loro di confrontarlo\ncon il testo originale e di guardare cosa abbiamo perso, sai, quando l'intelligenza artificiale ha preso questo testo e\nlo ha livellato di nuovo, cosa è cambiato, quali aspetti del mestiere dell'autore o, sai, diversi\nelementi linguistici sono cambiati  , e in che modo ciò ha influito sul\nsignificato del testo? Quindi ci sono molti\nmodi diversi e creativi in ​​cui puoi utilizzare l'intelligenza artificiale non solo per consentire agli studenti di accedere più facilmente ai materiali di livello scolastico, ma anche per creare esperienze di apprendimento divertenti e coinvolgenti. - Voglio dire, hai detto così tanto, Sarah, un sacco di gemme davvero straordinarie, ma voglio sentire il\npunto di vista di Bernadette, perché Berna, hai\nuna prospettiva un po' diversa e un background negli studi sociali, e in parte quello che era Sarah  la\ncondivisione parte dal vocabolario, dalla visione del testo autentico e dall'assicurarsi che\ngli studenti abbiano la possibilità di accedere a un testo rigoroso. Quindi mi piacerebbe aggiungere un po' di colore e contesto dal tuo punto di vista su come vedi che possiamo aiutare a colmare queste lacune. - Quindi, quando penso agli\ninsegnanti di studi sociali che lavorano molto con il vocabolario e con la lettura e i\ndocumenti delle fonti primarie, così tante volte quando gli studenti guardano i\ndocumenti delle fonti primarie, sai, stanno guardando un\nvocabolario arcaico,  a volte guardano\nun documento in corsivo. Quindi puoi usare l'intelligenza artificiale per concentrarti su quei\ndocumenti di origine primari e secondari, puoi fare in modo che l'intelligenza artificiale lo modifichi, ma avere comunque quel\ndocumento originale proprio lì accanto in modo che uno studente possa vedere\nquel documento originale, come appare in un primo momento\nlivello scolastico diverso, ma essere sempre in grado di tornare indietro e raggiungere quel documento originale, raggiungere quel vocabolario originale e aiutare gli studenti a capire, sai, le sfumature che sono state inserite\nin quel documento originale, come ha detto Sarah, che potrebbero semplicemente non essere colte quando abbiamo un documento che non lo è, non è stato modificato. Ma la chiave quando guardiamo \nall'alfabetizzazione disciplinare letteraria e agli studi sociali è garantire che gli studenti guardino quel documento originale, quindi essere in grado di prendere\nquel documento originale e far sì che siano in grado di accedere e comprendere quei concetti è davvero importante in quanto\nmetti tutto insieme. - Grazie, quindi\nnella chat ci sono delle chiacchiere su di cosa diavolo stiamo parlando. Alla fine ti darò una risorsa o un codice QR per saperne di più, ma ci sono dei link nella chat. Stiamo parlando, innanzitutto, di voler semplicemente avere una conversazione molto ricca\nsull'alfabetizzazione e la post-pandemia e su come\npossiamo sfruttare gli strumenti di intelligenza artificiale. Ma abbiamo degli strumenti di intelligenza artificiale davvero fantastici come parte della Khan Academy che\npuoi assolutamente scoprire di più quando trovi il collegamento nella chat, ma voglio che approfondiamo davvero di\npiù la lettura e la scrittura, perché come\nha detto qualcuno, predica in  la chat, lottando per convincere\ngli studenti a impegnarsi davvero con una scrittura significativa. Voglio dire, io, i miei studenti come\nex insegnante di educazione speciale, avevamo paura di mettere\nqualcosa sulla pagina, qualcuno può identificarsi? Erano appena all'inizio,\nnon avevano la generazione di idee, ed è stato davvero difficile\nperché ero completamente incluso, quindi stavo cercando di\nsupportare così tanti studenti in una classe ELA di prima media e aiutare i miei studenti, come\ndiceva Diona, a sentirsi al sicuro  , sentendosi convalidato. Quindi, in che modo il feedback personalizzato può migliorare le\ncapacità di lettura e scrittura degli studenti? Diona, cominciamo\ncon te e poi torniamo indietro.\n- Sì, assolutamente.  Ancora una volta, penso a\nquello spazio sicuro, giusto?  Mi sento semplicemente a posto, sai, potendo parlare davanti a tutti, o potendo sapere, sto scrivendo o sto scrivendo\nla frase corretta, o semplicemente mettendoli a loro agio. Quindi mi piace il fatto che\nabbiamo, ad esempio, lo strumento Tutor me che mi sta insegnando in discipline umanistiche. E così gli studenti hanno l'opportunità di essere interrogati su\ndeterminate abilità e, ancora una volta, è quello spazio sicuro. Semplicemente, continuo a farlo perché so che molti dei\nmiei studenti sono venuti da me con poche conoscenze pregresse.  Ne abbiamo parlato prima, quindi quando è arrivato il momento delle\ndiscussioni in classe, cosa hanno fatto alcuni di loro? Comportati come una via d'uscita, giusto? Oppure potrebbero semplicemente chiudersi\nperché non vogliono, non hanno nulla con cui\ncontribuire alla conversazione. Quindi avere strumenti come\ntutoraggio, sai, nelle discipline umanistiche in cui\npuoi porre quelle domande sul testo prima,\no anche durante, sai, come insegnante, se\nlo avessi nella mia classe, farei sicuramente da modello per  loro e creare opportunità per loro, creare opportunità\nper loro, sai, rispondere a domande specifiche, andare, sai, contattare Khanmigo. Chiedi a Khanmigo, sai,\nperché sta succedendo questo, e questo darà loro il contesto. L'altra cosa interessante è che per quegli studenti che potrebbero\navere quel tipo di problemi con la lettura che, sai, leggere fluentemente può essere un problema, Khanmigo può parlare con loro. Quindi possono mettere le cuffie e sembra quasi\nuna vera conversazione perché quello che succede\nè che, anche se, sai, se scrivere non è il mio punto forte,\ncome stavi parlando per alcuni dei tuoi\nstudenti di educazione speciale, sai  , puoi parlare a Khanmigo e dire, \"Ehi,\nperché sta succedendo questo?\" Khanmigo lo genererà e poi avrà la capacità\ndi risponderti. Quindi, se scrivere e leggere\nnon è il punto di forza di uno studente, ora può sentirsi più potente perché ora è quasi\ncome avere una conversazione come io e te stiamo facendo\nin questo momento per aiutarlo, sai, a diventare più forte in quelle abilità  . - Assolutamente. Allora Sarah, cosa ne pensi a riguardo? - Sì, quindi ho menzionato prima che\nuna delle prime cose che abbiamo iniziato a esplorare\nquando stavamo immergendo i piedi nel pool di intelligenza artificiale è stato il feedback sui saggi, quindi ho insegnato sia a leggere che a scrivere. Nella scuola dove insegnavo\nc’erano classi separate e scrivere era molto più difficile. Penso che insegnare a\nleggere per la ragione principale del feedback\nsia proprio una sfida se hai più di\n20 studenti in una classe, cosa che penso faccia la maggior parte degli insegnanti. E quindi il modo in cui abbiamo progettato l'\nattività di feedback sul saggio accademico di Khanmigo è stato un modo per gli studenti di ottenere un\nfeedback immediato di alta qualità che fosse utilizzabile e\norganizzato da, sai, area di feedback specifica\nsenza dover aspettare, sai, giorni o addirittura settimane\nottenere qualsiasi tipo di informazione dai loro insegnanti. E quindi il modo in cui funziona\nè che uno studente invia la bozza del saggio così come le\ninformazioni sul saggio così come sono state assegnate dal suo insegnante, qualsiasi cosa relativa al genere del saggio o al livello scolastico in cui si trova, e poi inseriamo  il saggio\nattraverso tutti questi suggerimenti di intelligenza artificiale configurati in modo molto, molto meticoloso che generano feedback\nin cinque diverse aree, e quindi gli studenti possono navigare tra queste cinque diverse aree. Se fanno clic su un feedback, verrà evidenziato di quale parte\ndel saggio si sta parlando. Lo studente può quindi\nanche chattare con Khanmigo riguardo a quel feedback e dire: \"Non capisco cosa\nintendi, puoi spiegarlo?\" Oppure: \"Puoi darmi un\nesempio di, sai, mi stai dicendo che la mia\ntesi non è molto forte, puoi darmi un esempio di come appare una tesi forte?\" E lo farà senza\nfornire loro alcunché della scrittura per il saggio stesso, quindi è programmato per impedire agli studenti\ndi usare l'intelligenza artificiale per imbrogliare. E la parte migliore è\nche gli studenti possono quindi aggiornare e rivedere il loro saggio e chiedere a Khanmigo: \"Ehi, che aspetto ha adesso? Tipo, cosa ne pensi adesso?\" E Khanmigo può guardare il feedback sui riferimenti degli studenti\ne sulla modifica che hanno appena apportato e dire, sì, tipo,\nsai cosa hai appena fatto. Selezionando la casella in questo modo sembra fantastico, oppure può dire, sai, \"Penso che tu abbia ancora bisogno di un\npo' di lavoro qui\", ed è questo spazio sicuro in cui gli studenti possono ottenere supporto successivo,\npossono chiedere di più  aiuto. E come insegnante, ancora una volta, ricordo come se fossi in\nun'aula dove, sai, a volte avrei come\nun mare di mani in aria dove i bambini dicevano proprio \"Sono bloccato\". Oppure avevano, sai, forse era uno studente che diceva proprio \"Riesci a leggere la frase?\" E ogni volta che scrivevano\nuna frase dicevano: \"Riesci a leggere la frase?\" E poi c'erano altri studenti che semplicemente tenevano la testa bassa, o quelli che di solito\navevano più bisogno di aiuto non avevano affatto le mani alzate. E la parte migliore di questo è che dà agli studenti il ​​potere di fare, di chiedere\naiuto a Khanmigo quando ne hanno bisogno, ma consente anche a Khanmigo di fare alcuni di questi controlli per gli studenti anche se non lo chiedono. Quindi una delle cose su cui stiamo lavorando ora si chiama Writing Coach, che si basa\nsull'attività di feedback sul saggio e accompagna gli studenti attraverso l'intero processo del saggio. Quindi quello in particolare\nsi rivolge davvero a quei ragazzi che si sentono davvero bloccati, si sentono davvero disimpegnati, come se avessero la sensazione di\nnon sapere da dove cominciare. E siamo anche entusiasti\ndelle implicazioni che Writing Coach\navrà sulla nostra capacità di riferire molto di più sulla scrittura degli studenti agli insegnanti. In questo momento, si sa, gli insegnanti\nspesso vedono la bozza finale, forse una prima bozza se riescono a gestirla, ma con questo tipo di attività di intelligenza artificiale possiamo sintetizzare molte\ndi queste interazioni e riferirle\nall'insegnante, comprese cose come  , \"Ehi, sai, questo studente ha\nappena incollato 500 parole. Non è sulla loro bozza\nche li aiuto a lavorare.\" Forse dovresti, sai, fare clic su questo e approfondire\ne vedere, vedere cosa succede, quindi ci sono un sacco di\nnuove funzionalità davvero entusiasmanti di Khanmigo in arrivo per essere scritte questo autunno. - Un sacco di nuove cose interessanti. Possiamo fermarci e lasciarlo\nmarinare per un secondo? Quanti di voi guardano insegnare a scrivere? Scommetto che lo fate tutti, perché siamo insegnanti. E in ogni corso ELA, in ogni alfabetizzazione, se pensiamo alla lettura, l'inspirazione è la scrittura, mentre la scrittura è l'espirazione. Far sì che gli studenti siano in grado\ndi spiegare i propri pensieri e di avere uno strumento che\nsupporti davvero gli studenti. Voglio dire, Bernadette,\nquante volte hai dovuto leggere saggi su tutte queste cose? E cosa succede se gli studenti\nnon lo citano correttamente o se cercano di inventare i fatti? Come pensi che l’intelligenza artificiale possa aiutarti in questo? - Quindi, ci sono un paio\ndi cose che possiamo fare. Prima di tutto, prima\nancora di arrivare a quell'avvistamento, i ragazzi devono essere in grado di sapere,\nsai, da dove cominciamo? E quindi a volte usare strumenti come chattare con una figura storica o chiacchierare con una figura letteraria è un ottimo modo per convincere i bambini a\niniziare a pensare ad alcuni argomenti. Quindi possono chattare con una figura letteraria o storica, chiedere loro\naffermazioni e prove, cosa ne pensano? E possono andare e\nsviluppare quegli argomenti. L'altra cosa che\nfa Khanmigo sono i dibattiti. Tiene dibattiti a livello di scuola\nelementare, media e superiore\nsu argomenti specifici. Quindi, se uno studente ha difficoltà a cercare di capire un'affermazione, una\nprova o un argomento, iniziare con uno di questi e fargli\npratica con Khanmigo per sviluppare quei temi è un ottimo modo per\navviarlo nel processo di scrittura. Penso che molti dei miei\nstudenti delle scuole medie e, sai, gli insegnanti con cui ho lavorato a livello di scuola superiore fossero sempre: \"Come facciamo a far iniziare i miei figli?\" E questo è un ottimo modo\nper far iniziare i tuoi figli. E ancora, ci sono\nmolti modi per vederlo quando torniamo indietro e\niniziamo a guardare, sai, come possiamo assicurarci che\nstiano citando correttamente, come possiamo assicurarci di farlo? Khanmigo può aiutarti anche in questo, e anche questo è un buon controllo. È importante che gli studenti capiscano cosa significa citare, cos'è il plagio, come si cita l'intelligenza artificiale? Come dici di aver utilizzato\nuno strumento di intelligenza artificiale nel tuo articolo? E questo è un\npezzo importante che così tante volte, beh, sai, se lo scrivo insieme, beh sai una cosa, è\ncome avere un coautore. Dovete scriverlo insieme e dovete essere in grado di\nspiegarlo al vostro insegnante. Quindi essere in grado di utilizzare\nquesti strumenti in tutte le aree del pezzo scritto e, ancora, essere in grado di ingrandire cose\ncome affermazioni e prove, o essere in grado di ingrandire l'argomentazione a seconda del tipo\ndi scrittura che stanno facendo e di cosa  tipo di test che stanno facendo. Perché quando iniziamo ora a considerare anche alcuni dei nostri esami AP, IB e ACE, devono essere in grado di farlo anche loro, e questa è un'ottima pratica per tutti i livelli. - Sì, e questa conversazione\nmi sta facendo venire voglia di tornare indietro e insegnare saggi, cosa in cui non ho avuto molto successo\n, siamo onesti. Bene, un paio di persone\nstanno intervenendo nella chat, davvero entusiaste del coach di scrittura. Davvero emozionato, sì, invieremo la\nregistrazione a tutti, quindi riceverai un pacchetto di assistenza\niscrivendoti al webinar. Sei il benvenuto e parte\ndi quel pacchetto di assistenza, per non emozionarti così tanto, è solo una registrazione e alcune risorse. Ma parlando di risorse,\nparlando di cha, sto procedendo in modo davvero casuale, mi occuperò di sfide e opportunità. Sono entusiasta di un sacco di cose. \"Vorrei poter avere una\nconversazione davvero lunga con, sai, Jay Gatsby.\" Adesso puoi attraverso Khanmigo,\nma allora non potevo, ma quali sono alcune cose che pensi che le persone saranno nervose da implementare? Diona, perché non ci dai un calcio d'inizio? Alcuni forse opportunità\no sfide. - Beh, penso che una\ndelle cose più comuni, come con altre IA, la\ncosa bella di Khanmigo è che gli studenti non hanno l'opportunità di andare a Khanmigo e dire:\n\"Scrivi il mio tema per me\". Khanmigo è un tutore socratico,\ne per questo motivo, Khanmigo tornerà, e penso che Khanmigo abbia\nla migliore personalità, o se è così che vuoi chiamarlo, ma ha un po' di personalità\nperché dirà: \"Sì,  ma come tuo tutor di intelligenza artificiale,\nnon posso scrivere il tuo articolo, ma pensiamo a questo argomento.\" Riporta sempre indietro lo studente, quindi non lo sarà, non\nfarà solo il lavoro per lui. Quel processo, specialmente nella scrittura, la scrittura è un processo, giusto? Quindi, sai, non importa cosa, sai, gli studenti devono ancora essere in grado di parlare, come mi è venuta questa idea? Sai, quali modifiche ho apportato? Una cosa è che\nin un giorno, sai, ieri\nscrivevi solo due frasi, adesso oggi puoi fare un'intera tesi? Ad esempio, sai, è così che devi\nancora creare studenti, gli studenti devono ancora\nessere in grado di parlarci. Quindi penso che questa sia una grande opportunità per ritenere gli studenti ancora responsabili, ma far loro avere comunque un assistente senza che questo faccia solo il lavoro per loro. Penso che una delle sfide che stiamo riscontrando anche noi\nsia dover istruire gli studenti ad avere queste conversazioni\navanti e indietro con Khanmigo. Sapete, una cosa è dire: \"Non capisco,\nquesto specifico argomento che stiamo studiando,\" ma gli studenti hanno ancora\nla mentalità che Khanmigo sia un\nmotore di ricerca, ed è  non.  È piuttosto chiedergli di\nsemplificare, chiedergli di chiarire, sai, chiarirti\ncosa intendi con questo? Sapete, cosa\nsignifica analizzare questo testo? Oppure, sai, avere\nquelle conversazioni avanti e indietro, questa è, sai, una delle sfide, ma\ndevi solo assicurarti di istruire i tuoi studenti\ne di modellare per loro come, sai, avere una conversazione in cambio\ne avanti con Khanmigo. Non è tutto e basta. - Esatto, e l'intelligenza artificiale ha lo scopo di migliorare l'intelligenza umana, l'\nesperienza umana, giusto? Perché vogliamo riportare ancora il dialogo nelle nostre aule. Ho appena fatto un riferimento a Justin Timberlake\nper tutti voi. Allora, Sarah, quando pensiamo\nalle sfide, giusto? Voglio dire, pensando\nall'esperienza umana, quali sono i tuoi pensieri a riguardo? - Sì, sono d'accordo con tutto quello che hanno\ndetto Bernadette e Diona. Penso che ci sia questo\nmalinteso comune secondo cui l'intelligenza artificiale equivale a chatbot e, sai, è probabilmente il\nformato più comunemente conosciuto per interagire con l'intelligenza artificiale in questo momento di cui gli insegnanti sono a conoscenza,\nma non penso che dovremmo pensare\nall'integrazione dell'intelligenza artificiale nelle aule di alfabetizzazione semplicemente trovando più modi per consentire agli\nstudenti di chattare con l'intelligenza artificiale.  In realtà, voglio dire, quando\nripenso ai momenti migliori come insegnante nelle mie aule di lettura, nelle mie aule di scrittura, erano i momenti in cui\nparlavamo insieme e tra di noi,\ncon i nostri colleghi e gruppi di libri e di  ,\nsai, grandi temi, personaggi importanti\ne ogni genere di cose simili, sai, proprio le ricche esperienze che hai quando scrivi e quando leggi\nqualcosa insieme. E una delle cose che\nvoglio che le persone se ne vadano è la comprensione che portare l'intelligenza artificiale nelle aule di alfabetizzazione non significa togliere quel tempo in cui\nci connettiamo e parliamo, penso che sia così.  ha più a che fare\ncon il fornire agli insegnanti strumenti migliori per generare\n esperienze e materiali di apprendimento davvero creativi e con l'aiutare gli studenti con le parti difficili della lettura e della scrittura che spesso vengono\ncomunque vissute in modo indipendente. Quindi l'esperienza di leggere un documento su cui il tuo\ninsegnante ha annotato, non deve essere\nun'esperienza così isolante, e sappiamo che ogni insegnante\nnon ha il tempo di sedersi e farlo ogni  tempo con ogni bambino. E poi la stessa cosa con la lettura, sai, spesso ci sono\nmomenti in cui potresti inciampare mentre\nstai leggendo qualcosa, e non vogliamo che questo, sai, smantelli tutta l'esperienza in classe di poter discutere di\nun libro  e cosa significa, e queste sono le esperienze in cui penso che l'intelligenza artificiale possa aiutare molto. E poi ancora, rendendo molto più semplice per gli insegnanti avere accesso a un partner creativo, a\nqualcosa che possa aiutarli a pianificare progetti o discussioni in classe, dare agli studenti l'opportunità\n, come ha detto Bernadette, di chiacchierare con un letterato  personaggio\ndi un libro che stanno leggendo, ma poi ne parlano in classe, ad esempio discutendo tra loro: \"Cosa abbiamo pensato di quell'esperienza? Tipo, sembrava autentico? Tipo, che dire dell'intelligenza artificiale\nsembra che potrebbe  sono andati contro\nciò che l'autore intendeva nel libro che hanno scritto, e perché?\" Ad esempio, è davvero un\nmeraviglioso punto di partenza per un saggio che potrebbero scrivere. Quindi, ci sono così tanti modi\nin cui puoi integrare l'intelligenza artificiale nelle esperienze di classe che\nnon necessariamente tengono gli studenti isolati\ndavanti ai loro schermi. Penso che il miglior caso d'uso verso cui tutti possiamo orientarci sia il\nmodo in cui possiamo utilizzare l'intelligenza artificiale per incoraggiare effettivamente\npiù esperienze di apprendimento collaborative e\ncomunitarie, perché ancora una volta, penso che sia così che\nviene fuori tutta la gioia. E penso che se siamo in grado di fare in modo che l'intelligenza artificiale aiuti più studenti ad accedere, sai, a testi ricchi e appropriati a livello scolastico, allora penso che potremmo vedere\nmolte più opportunità per avere quel tipo di\ndiscussione e coinvolgimento in classe. - Assolutamente, e mi\npiacerebbe se ci prendessimo un minuto, e davvero, abbiamo\nindossato i nostri cappelli da insegnanti, ma voglio che ci rimettiamo i nostri\ncappelli da insegnanti, e voglio che tu pensi a\nquello che forse era qualcosa che era  davvero impegnativo\nper te quando insegnavi, sai, studi sociali, alfabetizzazione, per me, educazione speciale, che questo strumento avrebbe potuto\naiutarti immediatamente, come risolvere quel punto dolente? Bernadette, e tu? Qual è la cosa che forse hai pensato: \"Vorrei avere questo\". - Vorrei averlo, quindi penso che ci siano così tanti livelli, perché gli strumenti per insegnanti di Khanmigo sono così vari e diversificati. Penso che non ci sia\nabbastanza tempo in un webinar per esaminarli tutti, ma alcune delle cose\nche quando ci penso, sai, come insegnante, ho sempre voluto assicurarmi\nche i miei studenti fossero accurati e che stavamo garantendo l'accuratezza. E so che quando ho pensato per la prima volta\nall'intelligenza artificiale, sai, era il\nselvaggio, selvaggio west, sai? Era questa intelligenza artificiale che entrava e\nscriveva tutto per i miei figli, e non era niente del\nloro lavoro originale, e questo per me è stato probabilmente\nil punto dolente e la paura più grande quando ho iniziato a\npensare e ad esaminare l'intelligenza artificiale. Ciò che adoro di\nKhanmigo e della Khan Academy è il fatto che non è così. Questo è il lavoro originale del tuo studente. Quando lavorano\ncon un generatore di saggi, gli studenti devono inserire i\npropri pensieri e idee e sviluppare i propri personaggi. Khanmigo può aiutarli ad espanderlo e ad aggiornare il loro vocabolario e aiutarli a guardare quelle\nfrasi succose e quelle parole succose, ma quelli sono i luoghi in cui\nquando iniziamo a parlare di garantire tale accuratezza,\nè un lavoro generato dagli studenti. Non è \"Ho inserito\nun argomento e, sai, questo tema mi è stato sputato\" e penso che sia davvero, davvero importante come insegnante, e questa è sempre stata la mia paura al riguardo. Penso che l'altra cosa sia\nl'intero feedback. Sai, quando\nhai una classe di 20, 25, 30 o più studenti, come dai regolarmente quel feedback individuale\n? Mi piacerebbe dire che l'ho fatto ogni giorno con ogni singolo studente, non c'era modo, non c'era modo. Ma con Khan Academy,\ncon AI e con Khanmigo, un insegnante può entrare e dire: \"Okay, voglio che tu inserisca i tuoi temi. Voglio che tutti guardino le\ntue presentazioni, lo facciano e parlino\", e poi  hanno anche una\ndiscussione in classe sul feedback che hanno ricevuto dall'IA di Khanmigo riguardo a quell'introduzione\no alla loro conclusione o alle loro affermazioni, qualunque\nsiano quei pezzi. Ed è ora che uno studente sta\nsvolgendo quel lavoro individuale, e anche quando sono a casa, forse stanno scrivendo a casa, o forse stai lavorando con un piccolo gruppo e il resto della classe\nè seduto lì, questa è un'opportunità\nper i tuoi studenti di ottenerlo uno contro uno quando\nfisicamente non puoi farlo. Il che, purtroppo per\ngli insegnanti, finisce per accadere, soprattutto se si portano il lavoro a casa e scrivono da casa. Vuoi assicurarti che\nnon stiano semplicemente chiedendo a un'intelligenza artificiale di farlo, perché quando\nlo inseriscono nel controllo del saggio, l' intelligenza artificiale lo guarderà e dirà: \"Ehi, sai, sei sicuro?\"  ? Dove lo hai preso?\" Ed è qualcosa di\nimportante per me come insegnante sapere che c'è precisione lì e che stanno ricevendo feedback, e stanno ottenendo un buon\nfeedback, e questo riguarda il loro lavoro. - Sì, l'ultima volta che ho controllato,\nnon possiamo ancora clonare gli insegnanti, quindi questo è un modo davvero importante per poter fornire quel feedback. Diona, cosa ne pensi? Quale sarebbe il tuo? - Wow, ce ne sono un paio. Giusto, ce ne sono un paio. Il generatore di rubriche. Il fatto che posso, sai,\npassavo così tanto tempo online cercando di\ntrovare rubriche, sai, che si allineino, sai,\nalla scrittura che stiamo facendo, sai, per i miei studenti. E poi a volte,\nsai, era un PDF, quindi non potevo entrare e apportarvi\nalcun tipo di modifica. E quindi il fatto che ci sia\nun vero generatore di rubriche, sai, per aiutare i miei studenti a scrivere è sorprendente. L'altra che mi viene in mente è la divertente poesia riassuntiva della lezione. Sai, quando penso\nai miei studenti e, sai, vuoi aspettare per concludere quella lezione, giusto? Potresti\naver appena parlato dell'idea principale.  I miei studenti adoravano la\nmusica rap, quindi poesia e rap, sai, vanno di pari passo. E quindi penso che sarebbe\nstato fantastico, perché non sono un paroliere,\nnon riesco a inventare cose veloci del genere, e poi includere\nmagari anche incorporando cose che gli piacciono,\nsai, in questa lezione divertente, questa è la poesia riassuntiva della lezione divertente, perché gli studenti\ndevono darti un feedback del tipo: \"Cosa abbiamo imparato oggi,\ndammi qualche idea\". E poi genera e\nracchiude la lezione in questo bel riassunto come una poesia. E penso che, sai, sarebbe stato semplicemente un\nmodo divertente per concludere quella lezione. Per me era anche difficile,\nsai, se i tuoi studenti dicevano: \"Ehi, mi piace 'Fortnite', o mi piace questo o quel gioco\", lo sapevo solo grazie a\nloro, ma qualcosa in questo momento, essendo in grado  generare e\nparlare di queste cose senza dover\nandare a intervistare un ragazzo o prendermi un po' più di tempo che non ho a disposizione per fare\nricerche per conto mio, per me è fantastico. Quindi vorrei davvero\navere quel generatore di rubriche e, come ho detto, la divertente\npoesia riassuntiva della lezione sarebbe stata una delle mie preferite. - È stupefacente. Quindi stiamo giusto\nconcludendo il nostro tempo insieme, ma voglio che sia\nSarah ad avere l'ultima parola. Pensiamo avanti a 5,\n10 anni nel futuro. Quali sono i tuoi sogni e le tue speranze\nper l’alfabetizzazione? Che tipo di mondo utopico potrebbe esserci sapendo ciò che sappiamo adesso? - Sì, è un'ottima domanda. Quindi, voglio dire, la mia mente\ngira pensando a tutti i diversi modi in cui\ngli attuali strumenti di cui disponiamo e l'attuale tecnologia di cui disponiamo avrebbero potuto aiutarmi in classe, e le ore che ho trascorso,\nore e ore e ore a fare cose che  L’intelligenza artificiale\nora può fare in pochi secondi. Penso che una delle sfide\nsia, sai, che ora, nel mio\nruolo qui alla Khan Academy, ho imparato come essere un ingegnere tempestivo abbastanza decente, il che significa che so come\nparlare con l'intelligenza artificiale per farmi dare  le cose di cui ho bisogno, ma non tutti gli insegnanti hanno queste competenze. E uno dei vantaggi\ndegli strumenti per insegnanti di Khanmigo, a cui tutti voi potete\niscrivervi subito sul collegamento Khanmigo dot AI che penso abbiamo inserito nella chat, ma uno dei vantaggi di questi strumenti è che  non è necessario\nessere un ingegnere esperto per fare molte di queste cose. Ma pensando ai prossimi cinque anni circa, è difficile prevedere dove stiamo andando. Ma sto immaginando strumenti ancora più flessibili e personalizzati\nprogettati specificamente per gli insegnanti ELA. Molti dei nostri strumenti Khanmigo\nora possono essere utilizzati da qualsiasi materia, ma sono davvero entusiasta di\nalcune delle cose che abbiamo in cantiere\nper l'insegnamento della lettura e la comprensione della lettura\ndove gli insegnanti non devono farlo, sai  , fai gran parte di\nquel lavoro frontale per prepararti. Ricordo solo che\nmi ci è voluto così tanto tempo per trovare un testo che volevo utilizzare, e\npoi prepararlo per i miei studenti in modo\nche potessero accedervi con le impalcature, le domande e tutti i diversi\nmodi in cui ne avremmo discusso. Quindi non penso nemmeno che siano cinque anni, penso che siano circa sei mesi\nda adesso in poi alla Khan Academy, ma è proprio come liberare\nmolto più tempo per gli insegnanti. E quando ci penso\ndal punto di vista degli studenti, torno a ciò di cui\nparlavo prima con queste\nesperienze di classe ricche di contenuti in cui gli studenti non sono necessariamente concentrati su ciò che accade sullo\nschermo e forse la tecnologia\nè lì per fornire supporto dove ne hanno bisogno, o, sai, essere un\npartner quando ne hanno bisogno, per motivare gli studenti. Penso che ci siano alcune cose interessanti che stiamo sognando\nin questo momento quando si tratta, sai, del\ncoinvolgimento e della ludicizzazione degli studenti e della motivazione degli studenti\nper cui possiamo usare l'intelligenza artificiale. Ma sì, penso che il futuro sia semplicemente: riuniamo di più gli studenti e riuniamo gli insegnanti, facciamo in modo che gli insegnanti diventino più facilitatori dell'apprendimento\ninvece che semplici maestri di compiti che devono fare così tante cose, tutte allo stesso tempo.  alla stessa ora di solito. Quindi penso che ci siano un\nsacco di esperienze davvero, davvero entusiasmanti, divertenti,\ninnovative, rigorose e differenziate\nche stiamo sognando qui e che, si spera, renderanno le lezioni di lettura e scrittura\nmolto più potenti ed entusiasmanti per il futuro.  studenti. - Oh, udite udite, chi non vorrebbe averne di\npiù nella propria classe e risparmiare tempo? Qualcuno, qualcuno? Ovviamente vuoi risparmiare tempo. Parlando di tempo, sfortunatamente, questo è tutto il tempo che abbiamo per oggi. Grazie ai miei fantastici relatori\nper aver condiviso le loro intuizioni e pensieri dalla loro\nesperienza in classe, e voglio solo sottolineare che vogliamo continuare a lavorare con voi. Se vuoi lavorare con noi, voglio dire, molto, ti offriamo, puoi andare subito\ne iscriverti alla Khan Academy, ma se vuoi avere\nuna partnership più profonda, offriamo qualcosa\nchiamato partnership distrettuale in cui ottieni un manager di successo e un apprendimento professionale su misura\nche soddisfi le tue esigenze. Possiamo anche aiutarti con l'\nanalisi dei dati per MTSS, tutte le cose,\nschede di monitoraggio distrettuale, come lo chiami. Lo avremo con i dati quando si tratterà di capire a che punto\nsono i tuoi studenti con Khan. Ma, cosa più importante, ci\nstiamo davvero assicurando che Khanmigo sia sicuro ed etico, e che ci siano molti\nguardrail, e non lo sono, e ci pensiamo davvero\nogni singolo giorno. Non lo stiamo semplicemente buttando via per\nrenderlo spaventoso. Siamo davvero consapevoli del modo in cui lo stiamo costruendo. Quindi, se vuoi saperne di più, questo è il nostro team di partenariato distrettuale. Ci piacerebbe entrare in contatto con te. Fai clic su questo codice QR\ne finché non ci incontreremo di nuovo. Continua a leggere, continua a scrivere, continua a imparare. Vi apprezziamo tutti."
}