{
    "source": "VmN3i4HW5l0",
    "youtubelink": "https://www.youtube.com/watch?v=VmN3i4HW5l0",
    "t_english": "- [Instructor] Take a look at these beautiful pictures from the Hubble Space Telescope. One of the reasons why it's beautiful is because of these nice streaks that you get for all the stars. But why do you get them? Now if you're thinking that this effect happens because you're taking a photo in space, well, let's think again because I tried at home. This is the video that I'm taking from my balcony and you can see some of these streetlights over here. Now I put the MOS kit in it and what do you find? Similar streaks. You can also see this effect if you squint your eyes. So what's going on over here? To get to the bottom of this, we need to explore what happens when light hits an obstacle. That's it. That's the goal of this video. And it might sound pretty straightforward, but as we'll see, it's pretty interesting and involved. So let's figure this out. So what happens when light hits an obstacle? Well, imagine we have a flashlight, and we keep some objects as some kind of a coin in front of it. Then we know what's going to happen. It's going to cast a shadow over here. We're gonna get a shadow of the coin over here and we're gonna see the light somewhere over here if this was a wall like this, which means if you're to draw the rays of light, then the obstacle just blocks the light over there, and everywhere else the light just travels straight. That's what happens, right? Right? Well this is true if you have very big objects, but would it be the same if we have very tiny objects in front of, you know, a source of light? Well, let's do an experiment to figure this out. Here, my friend has a green laser light and we're gonna point it to the wall. What do we see? Well, we see a big dot as we would expect, but now let's put a hair strand in front of it. A hair strand has a very tiny thickness. So what will we now see in front of it? Well, my expectation would be the same dot as before, but maybe with the shadow of the hair in between. Okay, let's look at it. (laughs) We don't see that. Oh my god, what do we see over here? We, first of all, notice the same dot in the center, but now we also see some streaks over here. It looks like light is somehow spreading out. How does it make any sense? What's going on? Why does light behave so differently when we have very tiny objects? Well, to answer this question, we need to recall that light is a wave, and if you use a wave model, maybe it'll all make sense. But since we don't have any experience with light as a wave, let's use water. So here's a Google map image of some waves, water waves entering or hitting islands below. So waves are coming down. Now let's look at what happens once the waves hit and what the waves look like over here. So let me unhide this. What do you notice? You notice some circular ripples over here. That is very interesting. Can you see that? The reason why it's interesting is because if you draw the incoming waves, it's kind of horizontal. You can see it, right? So here's the horizontal waves. My expectation was that when the waves hit the island, well, below the island, there should be no waves and over here the waves should just pass through. So this is what I thought should happen. But that doesn't happen. You still see some waves over here. Let me show them. We still see some waves over here. We have some waves over here. Why do we have those waves over there? Why are waves over here? How does it make any sense? Well, let's think about it. Let's think about it. What are waves actually? Waves are disturbances that gets propagated from one set of particles to another, right? Now, if you have particles over here, they go up and down and then they go up and down, they make the particles next to them go up and down, right? Now there are no more water particles over here for them to go up and down so there'll be no water waves over there, right? But look at what happens when a wave... Look at how what happens when a particle of this particular wavefront goes up and down. When it does that, not only will it make a particle in front of it go up and down, but it'll also make a particle somewhere over here go up and down because it's in contact with that particle. It's putting a force on the particle in its vicinity. And that's why waves will not just go like this straight down. The waves will kind of bend around the obstacle. The same thing will happen over here. The waves will kind of bend around the obstacle, okay? In fact, if I were to show the direction in which the waves are traveling, lemme do that. So here is how the waves are coming in. They're coming in, remember, the direction of the waves is perpendicular to the direction of the wavefront, okay? We expect the waves to just go like this, but that's not all they do. The waves that I will here kind of bend inwards. So we have this inward bending that's happening, okay? So this phenomena where, you know, the waves bend around the obstacles, we got a name to it, we call it diffraction. This sounds very similar to refraction, which also is a bending of wave, but it's very different. Refraction was bending of waves when they change medium, because when change medium, the speed changes and that's what causes the bending of the wavefronts. This is different. This is diffraction with a D. Here, the waves are bending, not because they're changing medium, there's no changing in medium, there's no change in speed, but they're hitting an obstacle. Whenever waves hit an obstacle, they will bend around the obstacle. That phenomenon is what we call diffraction, and it's a wave phenomenon. It applies to any waves hitting any obstacles. So if it applies to water waves, it should also apply to sound waves and it'll apply to light waves. But wait, if light also shows diffraction, which means light also bends around the obstacles, then we shouldn't be seeing shadows, right? I mean, if this was light waves, this was light waves coming from the top, and there was some obstacles over here, this would be the region of the shadow. From our daily experience, we know that. This would the shadow, but according to diffraction, light should bend and enter into the region of the shadows, which means we shouldn't be seeing shadows. But we do. This doesn't seem to happen in our daily life. Why is that? That's an interesting question. For that, let's see how the size of the obstacle plays a role over here. So we have some incoming light waves over here. Imagine plane waves moving to the right. Now, if we keep some small obstacle in between, we would expect to get a shadow over here and the waves just passed it like this, but we saw that doesn't happen. Waves will bend, they will diffract, and so the waves will look kind of like this, okay? And so if you were to draw the rays of light, they would bend like this, which means if this was light then and if we kept a screen or some kind of a wall over here, we should get something like this. And this is what I was talking about. So because of diffraction, light should enter into the region where we would get a shadow. And so we should get a very tiny shadow, right? But that doesn't happen. Why is that? Well, that's because over here, look at the length of the object. The length of the object is comparable to the wave length of the waves right? Now, what would've happened if this object was much bigger? Well, the bending would still look the same because waves don't care about like how big the object is. However, if we now keep a much bigger object, you can see that the wave still bend, the wave still diffract the same amount. But now the shadow size is much more comparable to the size of the object itself. Not as dramatic as we saw over here. Now even here you can see the length is kind of like, I dunno, maybe 15 times bigger than the wavelength. What if this object was a thousand times bigger than the wavelength? (laughs) Then this shadow size would be almost the same size as this one. This bending would be almost inconsequential, and that's what happens in our daily life. You see, the wavelength of light is of the order of 0.5 micrometers, that's 10 to the power minus six. And the objects that we're dealing with in our daily life are like tens of thousand times bigger, so big that we can completely neglect the diffraction, the consequences of diffraction. And that's why we don't think about it most of the times. So when objects are much bigger than the wavelength of light, well the effects of diffraction are negligible. But if they're small enough, like when you consider a hair strand, a hair strand is still, of course, bigger than the wavelength of light. But it's much more considerable compared to the wavelength of light. Now we will see the effects of diffraction. So here's the green laser that my friend was using. Now if we keep a small obstacle, imagine this is the hair strand. You can imagine like you know this, you're looking at the hair strand from the top. So this is the diameter of the hair strand, you can imagine, okay? So if you had kept the hair strand over here, this is what we would expect if we didn't think about diffraction. But now we know that incoming waves would bend over here downwards, and the incoming waves over here would bend upwards, which means you would now understand that this ray would actually bend down, this ray would bend up. So you get something that looks like this. And so now if we had a screen very close to the hair strand, then we would still see some shadow over here. We would still see some light over here. But what happens if I keep the screen far, far away? If I keep the screen far enough, eventually, now I'll find that the waves have spread out. I will see that laser spreading out over the wall. And that's exactly what we saw. Look, when my friend keeps the paper very close to the laser, the spreading out is not that much, but as she takes the paper farther, and farther and farther away, now the spreading out is much more pronounced and eventually on the wall it just spreads out a lot. Now this is the pattern that we get because of the vertical hair strand. Light falls onto it and gets bent around giving you horizontal streaks. So the vertical hair strand gives you horizontal streaks like this, okay? And you can see the gaps in between. We'll talk about that in a second. But what happens if I had another hair strand? A horizontal hair strand like this? Well then that would gimme vertical streaks along with the horizontal streaks. So if that had happened, then I would've gotten another vertical streaks like this. And look, this is the same shape as we saw earlier. And now it makes sense as to why the mosquito net, which has cross hairs like this, gives you that streaks that we saw earlier. What about the Hubble images? Well, Hubble images gets the streaks because if you look at the... Well, the Hubble Space Telescope, here's a schematic of it. It has two mirrors. It has a primary mirror on which all the light gets reflected and it gets focused on a secondary mirror. This is how the telescope, or this is called it reflecting telescope. Now the secondary mirror has to be held in space over here, right? It can't just hover over there to keep it over there to support it. We have these struts and look at the shape of the struts. It's kind of like the cross hair of the mosquito net, sorry, (laughs) that we had and that causes the streaks. This cross hair will cause a streak like this. And this one, this stretch will cross a streak like this. Beautiful, right? But the final question is why did we see, if I were to carefully, why did we see some dark spaces in between? Why do we see that? For that, let's go back to the laser, and this time let's draw the wavefronts because we really need to look at the waves now. So since the laser is moving to the right, the wave is moving to the right, the wavefronts are parallel this way. They don't just end like this. The wavefront actually continues, but then the intensity becomes much lower as you go farther away so it kind of like fades out. That's how you can think about it. And now if you keep an object over here, the waves will bend and becomes side of circular, as we saw with the eye lens over there. So something similar happens over here so let me draw that. So the wave from the top bends down like this, kind of bending down, and the waves at the bottom bend up. And when they do that, look, they mix with each other, they interfere with each other and something very interesting here happens. Now in order to do that, I have only drawn wave crests over here. But in between wave to wave crests, we will also see wave troughs. So let's also draw wave troughs over here, and I've drawn that with dotted lines. And I know it looks like a complete mess right now but if you zoom in and we focus over here, we'll now see some interesting regions of intersection. Look over here first. You can see crests are meeting up with other crests and troughs are meeting up with other troughs. What happens over here? You get much bigger wave, you get a much bigger crest and you get a much bigger trough. Peaks on peaks, valleys on valleys gives you bigger peaks and bigger valleys, we call them constructive interference. So over here, the light intensity would be much higher along this region, but this is not the only region where we'll get it. Let me actually draw all the regions where we'll get constructive interference. In fact, along this region, you can see constructions happening. Again, over here you can see trough on trough, crest on crest, trough on trough, crest on crest. You'll get constructive interferences. So these are the regions where you get bright spots. But in between constructive interferences, you will also see regions where the peaks line up with the valleys. Peaks line up with the valleys, peaks line up with the valleys. Can you see that? Dotted lines and the non dotted lines meet each other? So these are the regions where they destroy each other. When peaks and valleys meet each other, they destroy each other, you get almost no light intensity and that causes the darkness in between, and you can find that in between over here as well. You can actually see it over here. You can see over here, here. So again, let me draw all the regions where you see darkness. This is what we would get. So the red lines are where you get darknesses, and the green ones are where you get the brightest spots. And so if I had to keep a wall over here, this is what you would get. You would get bright spots over here, and then you would get dark spots, sorry, dark spots in between where the red line is there. And of course, as you go farther away from the center, the intensity just decreases because you're going farther and farther away from the light source and therefore, you have the maximum intensity at the center and the light just gets dimmer and dimmer, and that explains the dark bands over here. So the complete pattern is because of both diffraction, which makes the light spread out and due to interference of light. Now of course, there are a lot of waves interfering, so things are actually much more interesting. But you can kind of sort of now see why wherever destructive interference happens, you'll get these dark spots.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر]\n ہبل اسپیس ٹیلی سکوپ سے ان خوبصورت تصاویر پر ایک نظر ڈالیں۔ اس کے خوبصورت ہونے کی ایک وجہ ان اچھی لکیروں کی وجہ سے ہے جو آپ کو تمام ستاروں کے لیے ملتی ہیں۔ لیکن آپ انہیں کیوں حاصل کرتے ہیں؟ اب اگر آپ سوچ رہے ہیں\nکہ یہ اثر اس لیے ہوتا ہے کہ آپ خلا میں تصویر لے رہے ہیں، تو آئیے دوبارہ سوچتے ہیں\nکیونکہ میں نے گھر پر کوشش کی۔ یہ وہ ویڈیو ہے جو\nمیں اپنی بالکونی سے لے رہا ہوں اور آپ یہاں ان میں سے کچھ اسٹریٹ لائٹس دیکھ سکتے ہیں۔\n اب میں نے اس میں ایم او ایس کٹ ڈال دی\nاور آپ کو کیا ملا؟ اسی طرح کی لکیریں۔  اگر آپ اپنی آنکھیں بھیک لیں تو آپ یہ اثر بھی دیکھ سکتے ہیں۔\n تو یہاں پر کیا ہو رہا ہے؟  اس کی تہہ تک پہنچنے کے لیے،\nہمیں یہ دریافت کرنے کی ضرورت ہے کہ جب روشنی کسی رکاوٹ سے ٹکراتی ہے تو کیا ہوتا ہے۔ یہی ہے۔  اس ویڈیو کا مقصد یہی ہے۔ اور یہ بہت سیدھا لگ سکتا ہے، لیکن جیسا کہ ہم دیکھیں گے، یہ کافی\nدلچسپ اور شامل ہے۔ تو آئیے اس کا پتہ لگائیں۔ تو کیا ہوتا ہے جب\nروشنی کسی رکاوٹ سے ٹکرا جاتی ہے؟ ٹھیک ہے، تصور کریں کہ ہمارے پاس ایک ٹارچ ہے، اور ہم اس کے سامنے کچھ چیزوں کو ایک سکے کی طرح رکھتے ہیں۔ پھر ہم جانتے ہیں کہ کیا ہونے والا ہے۔ یہ یہاں پر سایہ ڈالنے والا ہے۔ ہمیں\nیہاں پر سکے کا سایہ ملے گا اور ہمیں\nیہاں کہیں روشنی نظر آنے والی ہے اگر یہ دیوار ایسی ہوتی، جس کا مطلب ہے کہ اگر آپ روشنی کی کرنوں کو کھینچنا چاہتے ہیں، تو رکاوٹ صرف اس کو\nروکتی ہے۔  وہاں روشنی، اور ہر جگہ\nروشنی صرف سیدھی سفر کرتی ہے۔ ایسا ہی ہوتا ہے، ٹھیک ہے؟  ٹھیک ہے؟ ٹھیک ہے اگر آپ کے\nپاس بہت بڑی چیزیں ہیں تو یہ سچ ہے، لیکن کیا ایسا ہی ہوگا اگر\nہمارے سامنے بہت چھوٹی چیزیں ہوں، آپ جانتے ہیں، روشنی کا ایک ذریعہ؟ ٹھیک ہے، آئیے\nاس کا پتہ لگانے کے لیے ایک تجربہ کرتے ہیں۔ یہاں، میرے دوست کے پاس سبز لیزر لائٹ ہے اور ہم اسے دیوار کی طرف اشارہ کرنے والے ہیں۔ ہم کیا دیکھتے ہیں؟ ٹھیک ہے، ہمیں ایک بڑا نقطہ نظر آتا ہے جیسا کہ ہم توقع کرتے ہیں، لیکن اب اس کے سامنے بالوں کا ایک پٹا لگاتے ہیں۔\n بالوں کے اسٹرینڈ کی موٹائی بہت چھوٹی ہوتی ہے۔ تو اب ہم اس کے سامنے کیا دیکھیں گے؟ ویسے میری توقع\nپہلے کی طرح ہی نقطے کی ہوگی لیکن شاید\nدرمیان میں بالوں کے سائے سے۔ ٹھیک ہے، آئیے اسے دیکھتے ہیں۔ (ہنستے ہوئے) ہم اسے نہیں دیکھتے۔ اوہ میرے خدا، ہم یہاں کیا دیکھتے ہیں؟ ہم، سب سے پہلے،\nمرکز میں ایک ہی نقطے کو دیکھتے ہیں، لیکن اب ہمیں\nیہاں کچھ لکیریں بھی نظر آتی ہیں۔  ایسا لگتا ہے کہ روشنی\nکسی طرح پھیل رہی ہے۔ اس کا کوئی\nمطلب کیسے ہے؟  کیا ہو رہا ہے؟ جب ہمارے پاس بہت چھوٹی چیزیں ہیں تو روشنی اتنا مختلف کیوں کرتی ہے؟ ٹھیک ہے، اس سوال کا جواب دینے کے لیے، ہمیں یہ یاد کرنے کی ضرورت ہے کہ روشنی ایک لہر ہے، اور اگر آپ لہر کا ماڈل استعمال کرتے ہیں، تو\nشاید یہ سب کچھ سمجھ میں آجائے۔ لیکن چونکہ ہمیں\nروشنی کی لہر کا کوئی تجربہ نہیں ہے، چلو پانی کا استعمال کرتے ہیں۔ تو یہاں\nکچھ لہروں کی گوگل میپ کی تصویر ہے، پانی کی لہریں\nنیچے جزیروں میں داخل ہوتی ہیں یا ٹکراتی ہیں۔ تو لہریں اتر رہی ہیں۔ اب دیکھتے ہیں کہ\nلہروں کے ٹکرانے کے بعد کیا ہوتا ہے اور یہاں لہریں کیسی نظر آتی ہیں۔ تو مجھے یہ چھپانے دو۔  آپ کیا نوٹس کرتے ہیں؟ آپ نے یہاں کچھ سرکلر لہریں دیکھیں۔\n یہ بہت دلچسپ ہے۔\nکیا آپ اسے دیکھ سکتے ہیں؟ اس کے دلچسپ ہونے کی وجہ یہ ہے کہ اگر آپ آنے والی\nلہروں کو کھینچتے ہیں تو یہ افقی قسم کی ہوتی ہے۔ آپ اسے دیکھ سکتے ہیں، ٹھیک ہے؟  تو\nیہاں افقی لہریں ہیں۔ میری توقع یہ تھی کہ جب\nلہریں جزیرے سے ٹکرائیں، ٹھیک ہے، جزیرے کے نیچے، وہاں کوئی لہریں نہیں ہونی چاہئیں اور یہاں سے لہریں\nگزر جائیں۔ تو میں نے سوچا کہ ایسا ہی ہونا چاہیے۔ لیکن ایسا نہیں ہوتا۔ آپ اب بھی یہاں کچھ لہریں دیکھتے ہیں۔\nمیں انہیں دکھاتا ہوں۔ ہم اب بھی یہاں کچھ لہریں دیکھتے ہیں۔ ہمارے یہاں کچھ لہریں ہیں۔ ہمارے پاس وہ لہریں کیوں ہیں؟ یہاں لہریں کیوں ہیں؟\nاس کا کوئی مطلب کیسے ہے؟ ٹھیک ہے، چلو اس کے بارے میں سوچتے ہیں\n.  آئیے اس کے بارے میں سوچتے ہیں۔ لہریں اصل میں کیا ہیں؟ لہریں وہ خلل ہیں\nجو ذرات کے ایک سیٹ سے\nدوسرے میں پھیلتی ہیں، ٹھیک ہے؟ اب، اگر آپ کے پاس یہاں ذرات ہیں، وہ اوپر اور نیچے جاتے ہیں اور\nپھر وہ اوپر اور نیچے جاتے ہیں، وہ اپنے ساتھ والے ذرات کو\nاوپر اور نیچے جاتے ہیں، ٹھیک ہے؟ اب\nیہاں پانی کے ذرات نہیں ہیں کہ وہ اوپر اور نیچے جائیں تو\nوہاں پانی کی لہریں نہیں ہوں گی، ٹھیک ہے؟ لیکن دیکھیں کہ جب ایک لہر ہوتی ہے تو کیا ہوتا ہے... دیکھیں کہ جب اس مخصوص\nویو فرنٹ کا ایک ذرہ اوپر نیچے ہوتا ہے تو کیا ہوتا ہے۔ جب یہ ایسا کرتا ہے، تو نہ صرف یہ کہ\n اس کے سامنے کا ایک ذرہ اوپر اور نیچے جائے گا، بلکہ یہ ایک ذرہ بھی بنا دے گا کہ\nیہاں کہیں اوپر اور نیچے جاتا ہے کیونکہ وہ\nاس ذرے کے ساتھ رابطے میں ہے۔ یہ اس کے آس پاس کے ذرہ پر ایک طاقت ڈال رہا ہے۔\n اور یہی وجہ ہے کہ لہریں اس طرح سیدھی نیچے نہیں جائیں گی۔ لہریں\nرکاوٹ کے ارد گرد جھک جائیں گی۔ یہاں بھی ایسا ہی ہوگا۔ لہریں\nرکاوٹ کے ارد گرد جھک جائیں گی، ٹھیک ہے؟ درحقیقت، اگر میں وہ سمت دکھاؤں جس میں لہریں\nسفر کر رہی ہیں، تو ایسا کریں۔  تو یہ ہے کہ لہریں کیسے اندر آرہی ہیں۔ \n \n ہم توقع کرتے ہیں کہ لہریں اسی طرح چلیں گی، لیکن بس اتنا ہی نہیں ہے۔ لہریں جو میں\nیہاں ایک طرح سے اندر کی طرف جھکتی ہوں گی۔ تو ہمارے پاس یہ اندرونی موڑ ہے\nجو ہو رہا ہے، ٹھیک ہے؟ تو یہ مظاہر جہاں،\nآپ جانتے ہیں، لہریں رکاوٹوں کے گرد جھکتی ہیں، ہمیں اس کا نام ملا، ہم اسے تفریق کہتے ہیں۔ یہ اپورتن سے بہت ملتا جلتا لگتا ہے، جو لہر کا موڑنے والا بھی ہے،\nلیکن یہ بہت مختلف ہے۔ اضطراری لہروں کا موڑنا تھا\nجب وہ میڈیم بدلتی ہیں، کیونکہ جب\nمیڈیم بدلتی ہے تو رفتار بدل جاتی ہے اور یہی\nلہروں کے موڑنے کا سبب بنتا ہے۔ یہ الگ بات ہے۔  یہ\nD کے ساتھ تفریق ہے۔ یہاں، لہریں موڑ رہی ہیں، اس لیے نہیں کہ وہ میڈیم بدل رہی ہیں، میڈیم میں کوئی تبدیلی نہیں،\nرفتار میں کوئی تبدیلی نہیں ہے، لیکن وہ کسی رکاوٹ کو ٹکراتی ہیں۔ جب بھی لہریں کسی رکاوٹ سے ٹکراتی ہیں تو وہ رکاوٹ کے گرد جھک جاتی ہیں۔ اس رجحان کو\nہم تفاوت کہتے ہیں، اور یہ ایک لہر کا رجحان ہے۔ یہ\nکسی بھی رکاوٹ کو مارنے والی کسی بھی لہر پر لاگو ہوتا ہے۔ لہذا اگر یہ پانی کی لہروں پر لاگو ہوتا ہے، تو\nاس کا اطلاق آواز کی لہروں پر بھی ہونا چاہیے اور یہ\nروشنی کی لہروں پر بھی لاگو ہوگا۔ لیکن انتظار کرو، اگر روشنی بھی تفاوت دکھاتی ہے، جس کا مطلب ہے کہ روشنی بھی\nرکاوٹوں کے گرد جھکتی ہے، تو ہمیں\nسائے نہیں دیکھنا چاہیے، ٹھیک ہے؟ میرا مطلب ہے، اگر یہ ہلکی لہریں تھیں، یہ اوپر سے آنے والی ہلکی لہریں تھیں، اور یہاں کچھ رکاوٹیں تھیں، یہ سائے کا علاقہ ہوگا۔ اپنے روزمرہ کے تجربے سے ہم یہ جانتے ہیں۔ یہ سایہ ہوگا، لیکن\nپھیلاؤ کے مطابق، روشنی کو جھکنا چاہیے اور\nسائے کے علاقے میں داخل ہونا چاہیے، جس کا مطلب ہے کہ ہمیں\nسائے نہیں دیکھنا چاہیے۔ لیکن ہم کرتے ہیں۔ ایسا\nہماری روزمرہ کی زندگی میں ہوتا نظر نہیں آتا۔ ایسا کیوں ہے؟  یہ ایک\nدلچسپ سوال ہے۔ اس کے لیے، آئیے دیکھتے ہیں کہ رکاوٹ کا سائز یہاں کس طرح ایک کردار ادا کرتا ہے۔ تو ہمارے یہاں کچھ آنے والی\nروشنی کی لہریں ہیں۔ تصور کریں کہ ہوائی جہاز کی لہریں دائیں طرف بڑھ رہی ہیں۔ اب اگر ہم\nدرمیان میں کوئی چھوٹی رکاوٹ رکھیں تو ہم یہاں پر سایہ کی توقع کریں گے اور لہریں اسے یوں ہی گزریں گی، لیکن ہم نے دیکھا کہ ایسا نہیں ہوتا۔ لہریں جھک جائیں گی، وہ الگ ہو جائیں گی، اور اس طرح لہریں اس طرح نظر آئیں گی\n، ٹھیک ہے؟ اور اس طرح اگر آپ\nروشنی کی شعاعوں کو کھینچیں گے تو وہ اس طرح جھک جائیں گی، جس کا مطلب ہے کہ اگر یہ روشنی تھی\nاور اگر ہم یہاں پر سکرین یا کسی قسم کی دیوار رکھیں تو ہمیں کچھ ایسا ملنا چاہیے۔ اور یہ وہی ہے جس کے بارے میں میں بات کر رہا تھا۔ اس لیے تفاوت کی وجہ سے روشنی کو اس خطے میں داخل ہونا چاہیے جہاں ہمیں سایہ ملے گا۔ اور اس لیے ہمیں ایک\nبہت ہی چھوٹا سا سایہ ملنا چاہیے، ٹھیک ہے؟ لیکن ایسا نہیں ہوتا۔  ایسا کیوں ہے؟ ٹھیک ہے، اس کی وجہ یہ ہے کہ یہاں، آبجیکٹ کی لمبائی کو دیکھیں۔ آبجیکٹ کی لمبائی \nلہروں کی موج کی لمبائی سے موازنہ ہے ٹھیک ہے؟ اب، اگر\nیہ اعتراض بہت بڑا ہوتا تو کیا ہوتا؟ ٹھیک ہے، موڑنا\nاب بھی ویسا ہی نظر آئے گا کیونکہ لہریں اس بات کی پرواہ نہیں کرتی ہیں کہ\nشے کتنی بڑی ہے۔ تاہم، اگر اب ہم\nایک بہت بڑی چیز رکھتے ہیں، تو آپ دیکھ سکتے ہیں کہ لہر اب بھی جھکتی ہے، لہر اب بھی اسی مقدار میں مختلف ہوتی ہے۔ لیکن اب سائے کا سائز\n خود آبجیکٹ کے سائز سے کہیں زیادہ موازنہ ہے۔ اتنا ڈرامائی نہیں جتنا ہم نے یہاں دیکھا۔ اب یہاں بھی آپ دیکھ سکتے ہیں کہ\nلمبائی اس طرح کی ہے، مجھے نہیں معلوم،\nطول موج سے شاید 15 گنا بڑی ہے۔ اگر یہ چیز\n طول موج سے ہزار گنا بڑی ہوتی تو کیا ہوتا؟  (ہنستا ہے) پھر اس شیڈو کا سائز تقریباً اس جیسا ہی ہوگا۔ یہ موڑنا\nتقریباً غیر ضروری ہوگا، اور یہی ہماری روزمرہ کی زندگی میں ہوتا ہے۔ آپ دیکھتے ہیں، روشنی کی طول موج 0.5 مائیکرو میٹر کے آرڈر کی ہے، جو کہ 10 سے پاور مائنس چھ ہے۔ اور جن چیزوں سے ہم اپنی روزمرہ کی زندگی میں نمٹ رہے ہیں وہ\nدسیوں ہزار گنا بڑی ہیں، اتنی بڑی ہیں کہ ہم تفاوت کو مکمل طور پر نظر انداز کر سکتے ہیں،\n تفاوت کے نتائج۔ اور یہی وجہ ہے کہ ہم\nاکثر اوقات اس کے بارے میں نہیں سوچتے۔ لہٰذا جب اشیاء روشنی کی طول موج سے کہیں زیادہ بڑی ہوتی ہیں، تب بھی پھیلاؤ کے اثرات\nنہ ہونے کے برابر ہوتے ہیں۔ لیکن اگر وہ کافی چھوٹے ہیں، جیسے کہ جب آپ بالوں کے اسٹرینڈ پر غور کرتے ہیں، تو بالوں کا اسٹرینڈ یقیناً روشنی کی طول موج سے بڑا ہوتا ہے۔ لیکن یہ روشنی کی طول موج کے مقابلے میں بہت زیادہ قابل غور ہے۔ اب ہم\nتفریق کے اثرات دیکھیں گے۔ تو یہاں سبز لیزر ہے\nجو میرا دوست استعمال کر رہا تھا۔ اب اگر ہم ایک چھوٹی سی رکاوٹ رکھتے ہیں، تو تصور کریں کہ یہ بالوں کا اسٹرینڈ ہے۔ آپ تصور کر سکتے ہیں جیسے آپ یہ جانتے ہیں، آپ\nاوپر سے بالوں کے اسٹرینڈ کو دیکھ رہے ہیں۔ تو یہ\nبالوں کے اسٹرینڈ کا قطر ہے، آپ تصور کر سکتے ہیں، ٹھیک ہے؟ لہذا اگر آپ نے\nبالوں کے اسٹرینڈ کو یہاں رکھا ہوتا، تو ہم یہی توقع کریں گے اگر ہم تفاوت کے بارے میں نہیں سوچتے۔ لیکن اب ہم جانتے ہیں کہ آنے والی لہریں یہاں سے نیچے کی طرف جھک جائیں گی، اور یہاں سے آنے والی لہریں اوپر کی\nطرف جھک جائیں گی، جس کا مطلب ہے کہ اب آپ سمجھیں گے کہ یہ شعاع دراصل نیچے کی طرف مڑی گی، یہ شعاع اوپر کی طرف مڑی گی۔ تو آپ کو کچھ ملتا ہے جو اس طرح لگتا ہے۔ اور اس لیے اب اگر ہمارے پاس\nبالوں کے اسٹرینڈ کے بالکل قریب اسکرین ہوتی، تب بھی ہمیں\nیہاں کچھ سایہ نظر آتا۔ ہم اب بھی یہاں کچھ روشنی دیکھیں گے. لیکن کیا ہوتا ہے اگر میں\nاسکرین کو بہت دور رکھتا ہوں؟ اگر میں اسکرین کو\nکافی دور رکھتا ہوں، آخر کار، اب مجھے معلوم ہوگا کہ\nلہریں پھیل چکی ہیں۔ میں اس لیزر کو\nدیوار پر پھیلتا ہوا دیکھوں گا۔ اور بالکل وہی جو ہم نے دیکھا۔ دیکھو، جب میرا دوست کاغذ کو لیزر کے بہت قریب رکھتا ہے، تو اس کا پھیلاؤ اتنا زیادہ نہیں ہوتا، لیکن جیسے جیسے وہ کاغذ کو دور تک لے جاتی ہے، اور دور دور تک جاتی ہے، اب اس کا پھیلاؤ\nبہت زیادہ واضح ہوتا ہے اور آخر کار دیوار پر۔\nصرف بہت پھیلا ہوا ہے. اب یہ وہ نمونہ ہے جو ہمیں عمودی بالوں کے اسٹرینڈ کی وجہ سے ملتا ہے۔ روشنی اس پر گرتی ہے اور آپ کو افقی لکیریں دینے کے ارد گرد جھک جاتی ہے۔\n تو عمودی بالوں کا اسٹرینڈ آپ کو اس طرح افقی لکیریں دیتا ہے، ٹھیک ہے؟ اور آپ درمیان میں فرق دیکھ سکتے ہیں۔ ہم اس کے بارے میں ایک سیکنڈ میں بات کریں گے۔ لیکن کیا ہوگا اگر میرے پاس\nبالوں کا ایک اور اسٹرینڈ ہوتا؟ اس طرح ایک افقی بال اسٹرینڈ؟ ٹھیک ہے پھر یہ افقی لکیروں کے ساتھ\nعمودی لکیریں بھی دے گا۔ تو اگر ایسا ہوتا، تو میں اس طرح کی ایک اور عمودی لکیریں حاصل کر لیتا۔\n اور دیکھو یہ وہی\nشکل ہے جو ہم نے پہلے دیکھی تھی۔ اور اب یہ سمجھ میں آتا ہے کہ\nمچھروں کا جال، جس میں اس طرح کے کراس بال ہوتے ہیں، آپ کو وہ لکیریں کیوں دیتی ہیں\nجو ہم نے پہلے دیکھی تھیں۔ ہبل امیجز کے بارے میں کیا خیال ہے؟ ٹھیک ہے، ہبل امیجز کو لکیریں ملتی ہیں کیونکہ اگر آپ دیکھیں... ٹھیک ہے، ہبل اسپیس ٹیلی سکوپ،\nیہاں اس کی ایک منصوبہ بندی ہے۔ اس کے دو آئینے ہیں۔ اس میں ایک بنیادی آئینہ ہے\nجس پر تمام روشنی منعکس ہوتی ہے اور یہ\nثانوی آئینے پر مرکوز ہو جاتی ہے۔ اس طرح دوربین، یا اسے منعکس کرنے والی دوربین کہتے ہیں۔ اب ثانوی آئینہ کو یہاں خلا میں رکھنا ہے، ٹھیک ہے؟ یہ صرف اس کی حمایت کرنے کے لئے اسے وہاں رکھنے کے لئے وہاں پر منڈلا نہیں سکتا۔ ہمارے پاس یہ سٹرٹس ہیں اور\nسٹرٹس کی شکل کو دیکھتے ہیں۔ یہ مچھر کے جال کے کراس بال کی طرح ہے، معذرت، (ہنستے ہوئے) جو ہمارے پاس تھا اور اس کی وجہ سے لکیریں بنتی ہیں۔ یہ کراس بال\nاس طرح کی لکیر کا سبب بنے گا۔ اور یہ ایک، یہ اسٹریچ\nاس طرح ایک لکیر کو عبور کرے گا۔ خوبصورت، ٹھیک ہے؟ لیکن آخری سوال یہ ہے کہ ہم نے کیوں دیکھا، اگر میں غور سے دیکھوں تو ہمیں\nدرمیان میں کچھ تاریک جگہیں کیوں نظر آئیں؟ ہم اسے کیوں دیکھتے ہیں؟ اس کے لیے، آئیے لیزر کی طرف واپس چلتے ہیں، اور اس بار ہم لہروں کو کھینچتے ہیں کیونکہ ہمیں واقعی\nاب لہروں کو دیکھنے کی ضرورت ہے۔ لہذا چونکہ لیزر دائیں طرف بڑھ رہا ہے، لہر دائیں طرف بڑھ رہی ہے، اس طرح ویو فرنٹ متوازی ہیں۔ وہ صرف اس طرح ختم نہیں ہوتے ہیں۔ ویو فرنٹ درحقیقت جاری رہتا ہے، لیکن پھر جیسے جیسے آپ دور جاتے ہیں اس کی شدت بہت کم ہوتی جاتی ہے تو\nیہ اس طرح ختم ہو جاتا ہے۔ اس طرح آپ اس کے بارے میں سوچ سکتے ہیں۔ اور اب اگر آپ کسی چیز کو\nیہاں رکھیں گے تو لہریں جھک جائیں گی اور سرکلر ہو جائیں گی، جیسا کہ ہم نے آنکھوں کے عینک سے دیکھا تھا۔ تو یہاں بھی کچھ ایسا ہی ہوتا ہے\nتو میں اسے کھینچتا ہوں۔ تو اوپر سے لہر\nاس طرح نیچے جھکتی ہے، نیچے کی طرح جھکتی ہے، اور\nنیچے کی لہریں اوپر جھکتی ہیں۔ اور جب وہ ایسا کرتے ہیں، دیکھو،\nوہ ایک دوسرے کے ساتھ گھل مل جاتے ہیں، وہ ایک دوسرے کے ساتھ مداخلت کرتے ہیں اور یہاں کچھ بہت\nدلچسپ ہوتا ہے۔ اب ایسا کرنے کے لیے، میں نے یہاں پر صرف لہروں کے نشان بنائے ہیں۔ لیکن لہر سے لہروں کے درمیان، ہم لہر گرتیں بھی دیکھیں گے۔ تو آئیے یہاں بھی لہر گرتیں کھینچتے ہیں، اور میں نے اسے نقطے والی لکیروں کے ساتھ کھینچا ہے۔ اور میں جانتا ہوں کہ یہ\nابھی ایک مکمل گڑبڑ کی طرح لگتا ہے لیکن اگر آپ زوم ان کریں اور ہم یہاں پر توجہ مرکوز کریں تو اب ہم چوراہے کے کچھ دلچسپ علاقے دیکھیں گے۔\n پہلے ادھر دیکھو۔ آپ دیکھ سکتے ہیں کہ crests\nدوسرے crests کے ساتھ مل رہے ہیں اور troughs\nدوسرے گرتوں کے ساتھ مل رہے ہیں۔ یہاں کیا ہوتا ہے؟ آپ کو بہت بڑی لہر ملتی ہے،\nآپ کو بہت بڑا کرسٹ ملتا ہے اور آپ کو بہت بڑا گرت ملتا ہے۔ چوٹیوں پر چوٹیاں، وادیوں پر وادیاں\nآپ کو بڑی چوٹیاں اور بڑی وادیاں دیتی ہیں، ہم انہیں تعمیری مداخلت کہتے ہیں۔ تو یہاں، روشنی کی شدت اس خطے کے ساتھ بہت زیادہ ہوگی، لیکن یہ واحد خطہ نہیں ہے\nجہاں ہم اسے حاصل کریں گے۔ مجھے اصل میں ان تمام خطوں کو کھینچنے دو جہاں ہمیں تعمیری مداخلت حاصل ہوگی۔ درحقیقت، اس خطے کے ساتھ ساتھ، آپ تعمیرات ہوتے دیکھ سکتے ہیں۔ ایک بار پھر، یہاں آپ\nگرت پر گرت، کریسٹ پر کرسٹ، گرت پر گرت\n، کرسٹ پر کرسٹ دیکھ سکتے ہیں۔ آپ کو تعمیری مداخلت ملے گی۔ تو یہ وہ علاقے ہیں\nجہاں آپ کو روشن دھبے ملتے ہیں۔ لیکن تعمیری مداخلتوں کے درمیان، آپ کو وہ علاقے بھی نظر آئیں گے\nجہاں چوٹیاں وادیوں کے ساتھ ملتی ہیں۔ چوٹیاں وادیوں کے ساتھ لگتی ہیں، چوٹیاں وادیوں کے ساتھ لگتی ہیں۔ کیا آپ اسے دیکھ سکتے ہیں؟ نقطے والی لکیریں اور نان\nڈاٹڈ لائنیں ایک دوسرے سے ملتی ہیں؟ تو یہ وہ علاقے ہیں\nجہاں وہ ایک دوسرے کو تباہ کرتے ہیں۔ جب چوٹیاں اور وادیاں ایک دوسرے سے ملتی ہیں، تو وہ ایک دوسرے کو تباہ کر دیتی ہیں، آپ کو روشنی کی شدت تقریباً نہیں ملتی اور اس کی وجہ سے درمیان میں اندھیرا چھا جاتا ہے، اور آپ اسے یہاں پر بھی تلاش کر سکتے ہیں۔\n آپ اصل میں اسے یہاں دیکھ سکتے ہیں۔ آپ یہاں، یہاں دیکھ سکتے ہیں۔ تو پھر، میں ان تمام خطوں کو کھینچتا ہوں جہاں آپ کو اندھیرا نظر آتا ہے۔ یہ وہی ہے جو ہمیں ملے گا۔ لہذا سرخ لکیریں وہ ہیں\nجہاں آپ کو اندھیرے ملتے ہیں، اور سبز وہ ہیں جہاں\nآپ کو روشن ترین مقامات ملتے ہیں۔ اور اس لیے اگر مجھے یہاں دیوار لگانی پڑی تو آپ کو یہی ملے گا۔ آپ کو یہاں پر روشن دھبے ملیں گے، اور پھر آپ کو سیاہ دھبے ملیں گے، معذرت، جہاں سرخ لکیر ہے اس کے درمیان سیاہ دھبے۔\n اور بلاشبہ، جیسے جیسے آپ\nمرکز سے دور جاتے ہیں، شدت کم ہوتی جاتی ہے کیونکہ آپ\n روشنی کے منبع سے دور اور دور جا رہے ہوتے ہیں اور اس وجہ سے، آپ کے مرکز میں زیادہ سے زیادہ\nشدت ہوتی ہے اور روشنی صرف مدھم ہوتی جاتی ہے، اور یہ\nیہاں تاریک بینڈ کی وضاحت کرتا ہے۔ لہذا مکمل نمونہ\nدونوں کے تفاوت کی وجہ سے ہے، جس کی وجہ سے روشنی پھیل جاتی ہے اور روشنی کی مداخلت کی وجہ سے۔ اب یقیناً، وہاں\nبہت سی لہریں مداخلت کر رہی ہیں، لہذا چیزیں درحقیقت\nبہت زیادہ دلچسپ ہیں۔ لیکن اب آپ ایک طرح سے دیکھ سکتے ہیں کہ جہاں بھی تباہ کن مداخلت ہوتی ہے، آپ کو یہ سیاہ دھبے ملیں گے۔",
    "t_spanish": "- [Instructor] Echa un vistazo\na estas hermosas imágenes tomadas por el Telescopio Espacial Hubble. Una de las razones por las que es hermoso es por esas lindas rayas que obtienes con todas las estrellas.  ¿ Pero por qué los obtienes? Ahora bien, si estás pensando\nque este efecto ocurre porque estás tomando una foto en el espacio, bueno, pensemos de nuevo\nporque lo intenté en casa. Este es el video que\nestoy tomando desde mi balcón y puedes ver algunas de\nestas farolas aquí. Ahora le pongo el kit MOS\ny ¿qué encuentras? Rachas similares. También puedes ver este efecto\nsi entrecierras los ojos. Entonces, ¿qué está pasando aquí? Para llegar al fondo de\nesto, necesitamos explorar qué sucede cuando la luz choca con un obstáculo. Eso es todo.  Ese es el objetivo de este vídeo. Y puede parecer bastante sencillo, pero como veremos, es bastante\ninteresante y complicado. Así que averigüemos esto. Entonces, ¿qué sucede cuando\nla luz choca contra un obstáculo? Bueno, imagina que tenemos una linterna y guardamos algunos objetos como una especie de moneda frente a ella. Entonces sabemos lo que va a pasar. Va a proyectar una sombra aquí. Tendremos una sombra\nde la moneda por aquí y veremos la\nluz en algún lugar por aquí si esto fuera una pared como esta, lo que significa que si vas a dibujar los rayos de luz, entonces el obstáculo simplemente\nbloquea el  la luz allí, y en todos los demás lugares la\nluz viaja en línea recta. Eso es lo que pasa, ¿verdad?  ¿Bien? Bueno, esto es cierto si\ntienes objetos muy grandes, pero ¿sería lo mismo si\ntenemos objetos muy pequeños frente a, ya sabes, una fuente de luz? Bueno, hagamos un experimento\npara resolver esto. Aquí, mi amigo tiene una luz láser verde y la apuntaremos hacia la pared.  ¿ Qué vemos? Bueno, vemos un punto grande como es de esperar, pero ahora pongamos un\nmechón de cabello delante. Un mechón de cabello tiene un grosor muy pequeño. Entonces, ¿qué veremos ahora frente a él? Bueno, mi expectativa\nsería el mismo punto que antes, pero tal vez con la sombra\ndel cabello en el medio. Bien, veámoslo. (risas) No vemos eso. Dios mío, ¿qué vemos por aquí? Primero que nada, notamos\nel mismo punto en el centro, pero ahora también vemos\nalgunas rayas por aquí. Parece que la luz\nde alguna manera se está extendiendo.  ¿ Cómo tiene\nsentido?  ¿Qué está sucediendo?  ¿ Por qué la luz se comporta de manera tan diferente cuando tenemos objetos muy pequeños? Bueno, para responder a esta pregunta, debemos recordar que la luz es una onda, y si usas un modelo ondulatorio,\ntal vez todo tenga sentido. Pero como no tenemos\nexperiencia con la luz como onda, usemos agua. Así que aquí hay una imagen de un mapa de Google\nde algunas olas, olas de agua que entran o\ngolpean las islas de abajo. Entonces las olas están bajando. Ahora veamos lo que\nsucede una vez que las olas golpean y cómo se ven aquí. Así que déjame mostrar esto.  ¿Que notaste? Notas algunas\nondas circulares por aquí. Eso es muy interesante.  ¿\nPuedes ver eso? La razón por la que es interesante es porque si dibujas las\nondas entrantes, son algo horizontales. Puedes verlo, ¿verdad?  Así que\naquí están las ondas horizontales. Mi expectativa era que cuando\nlas olas golpearan la isla, bueno, debajo de la isla, no debería haber olas y por aquí las olas\nsimplemente pasarían. Entonces esto es lo que pensé que debería suceder. Pero eso no sucede. Todavía se ven algunas olas\npor aquí.  Déjame mostrárselos. Todavía vemos algunas olas por aquí. Tenemos algunas olas por aquí.  ¿ Por qué tenemos esas olas allí?  ¿ Por qué hay olas aquí?  ¿\nCómo tiene sentido? Bueno, pensemos en\nello.  Vamos a pensarlo.  ¿ Qué son realmente las olas? Las ondas son perturbaciones\nque se propagan de un conjunto de partículas\na otro, ¿verdad? Ahora, si tienes partículas aquí, suben y bajan y\nluego suben y bajan, hacen que las partículas a\nsu lado suban y bajen, ¿verdad? Ahora ya no hay más\npartículas de agua aquí para que suban y bajen, así que no habrá\nondas de agua allí, ¿verdad? Pero miren lo que sucede cuando una onda... Miren lo que sucede cuando una partícula de este\nfrente de onda en particular sube y baja. Cuando hace eso, no sólo\nhará que una partícula frente a ella suba y baje, sino que también hará que una\npartícula en algún lugar de aquí suba y baje porque está\nen contacto con esa partícula. Está ejerciendo una fuerza sobre la\npartícula en su vecindad. Y es por eso que las olas no caerán así sin más. Las olas se\ndoblarán alrededor del obstáculo. Lo mismo pasará por aquí. Las olas se doblarán\nalrededor del obstáculo, ¿vale? De hecho, si tuviera que mostrar la dirección en la que viajan las ondas\n, déjame hacerlo. Así es como entran las ondas. Recuerden,\nla dirección de las ondas es perpendicular a la\ndirección del frente de onda, ¿de acuerdo? Esperamos que las olas se muevan así, pero eso no es todo lo que hacen. Las ondas que mostraré\naquí se curvan hacia adentro. Entonces tenemos esta flexión hacia adentro\nque está sucediendo, ¿de acuerdo? Entonces, a este fenómeno en el que\nlas ondas rodean los obstáculos le pusimos un nombre: lo llamamos difracción. Esto suena muy similar a la refracción, que también es una curvatura de una\nonda, pero es muy diferente. La refracción era la curvatura de las\nondas cuando cambian de medio, porque cuando cambian de\nmedio, la velocidad cambia y eso es lo que provoca la\ncurvatura de los frentes de onda. Esto es diferente.  Esto\nes difracción con una D. Aquí, las ondas se doblan, no porque estén cambiando de medio, no hay cambio de medio,\nno hay cambio de velocidad, sino que están chocando con un obstáculo. Cada vez que las olas chocan contra un obstáculo, lo rodean. Ese fenómeno es lo que\nllamamos difracción y es un fenómeno ondulatorio.  Se aplica a cualquier ola que\ngolpee cualquier obstáculo. Entonces, si se aplica a las\nondas de agua, también debería aplicarse a las ondas de sonido y se\naplicará a las ondas de luz. Pero espera, si la luz también muestra difracción, lo que significa que la luz también\nrodea los obstáculos, entonces no deberíamos\nver sombras, ¿verdad? Quiero decir, si se tratara de ondas de luz, fueran ondas de luz que vinieran desde arriba y hubiera algunos obstáculos aquí, esta sería la región de la sombra. Por nuestra experiencia diaria, lo sabemos. Esta sería la sombra, pero\nsegún la difracción, la luz debería curvarse y entrar\nen la región de las sombras, lo que significa que no deberíamos\nver sombras. Pero lo hacemos. Esto no parece\nsuceder en nuestra vida diaria.  ¿ Porqué es eso?  Esa es una\npregunta interesante. Para ello, veamos cómo influye aquí el tamaño del obstáculo. Entonces tenemos algunas\nondas de luz entrantes por aquí. Imagine ondas planas moviéndose hacia la derecha. Ahora, si mantenemos algún\npequeño obstáculo en el medio, esperaríamos tener una sombra por aquí y las olas simplemente la pasarían así, pero vimos que eso no sucede. Las ondas se doblarán, se difractarán, por lo que se verán\nasí, ¿de acuerdo? Y entonces, si\ndibujaras los rayos de luz, se curvarían así, lo que significa que si esto fuera luz\nen ese entonces y si mantuviéramos una pantalla o algún tipo de pared aquí, deberíamos obtener algo como esto. Y esto es de lo que estaba hablando. Entonces, debido a la difracción, la luz debería entrar en la región donde obtendríamos una sombra. Entonces deberíamos obtener una\nsombra muy pequeña, ¿verdad? Pero eso no sucede.  ¿Porqué es eso? Bueno, eso es porque aquí, mira la longitud del objeto. La longitud del objeto es comparable a la\nlongitud de onda de las ondas, ¿verdad? Ahora bien, ¿qué hubiera pasado si\neste objeto fuera mucho más grande? Bueno, la curvatura\nseguiría siendo la misma porque a las ondas no les importa el\ntamaño del objeto. Sin embargo, si ahora mantenemos\nun objeto mucho más grande, se puede ver que la onda aún se curva y la onda aún se difracta en la misma cantidad. Pero ahora el tamaño de la sombra\nes mucho más comparable al tamaño del objeto mismo. No es tan dramático como vimos aquí. Ahora incluso aquí se puede ver que\nla longitud es como, no sé, tal vez 15 veces\nmayor que la longitud de onda. ¿Y si este objeto fuera\nmil veces más grande que la longitud de onda?  (risas) Entonces el tamaño de esta sombra sería casi del mismo tamaño que esta. Esta flexión sería\ncasi intrascendente, y eso es lo que sucede en nuestra vida diaria. Verá, la longitud de onda de la luz es del orden de 0,5 micrómetros, es decir, 10 elevado a menos seis. Y los objetos con los que tratamos en nuestra vida diaria son\ndecenas de miles de veces más grandes, tan grandes que podemos ignorar por completo\nla difracción, las consecuencias de la difracción. Y es por eso que no pensamos\nen ello la mayoría de las veces. Entonces, cuando los objetos son mucho más grandes que la longitud de onda de la luz, los efectos de la\ndifracción son insignificantes. Pero si son lo suficientemente pequeños, como cuando consideramos un mechón de cabello, un mechón de cabello sigue siendo, por supuesto, más grande que la longitud de onda de la luz. Pero es mucho más considerable en comparación con la longitud de onda de la luz. Ahora veremos los\nefectos de la difracción. Aquí está el láser verde\nque estaba usando mi amigo. Ahora bien, si nos quedamos con un pequeño obstáculo, imagina que este es el mechón de pelo. Puedes imaginar que sabes esto: estás mirando el\nmechón de cabello desde arriba. Así que este es el diámetro\ndel mechón de cabello, te lo puedes imaginar, ¿de acuerdo? Entonces, si hubieras dejado el\nmechón de cabello aquí, esto es lo que esperaríamos si no pensáramos en la difracción. Pero ahora sabemos que las ondas entrantes se curvarían aquí hacia abajo, y las ondas entrantes\naquí se curvarían hacia arriba, lo que significa que ahora entenderían que este rayo en realidad se curvaría hacia abajo, este rayo se curvaría hacia arriba. Entonces obtienes algo que se parece a esto. Y ahora, si tuviéramos una pantalla\nmuy cerca del mechón de cabello, todavía veríamos\nalgo de sombra aquí. Todavía veríamos algo de luz por aquí. Pero ¿qué pasa si mantengo\nla pantalla muy, muy lejos? Si mantengo la pantalla lo\nsuficientemente alejada, eventualmente encontraré que las\nondas se han extendido. Veré ese láser\nextendiéndose sobre la pared. Y eso es exactamente lo que vimos. Mira, cuando mi amiga mantiene el papel muy cerca del láser, la extensión no es tanta, pero a medida que lleva el papel más y más lejos, ahora la extensión\nes mucho más pronunciada y finalmente en la pared\nse  simplemente se extiende mucho. Este es el patrón que obtenemos debido al mechón de cabello vertical. La luz cae sobre él y se dobla dándole\nrayas horizontales. Entonces el mechón de cabello vertical te da mechas horizontales como esta, ¿de acuerdo? Y puedes ver las brechas intermedias. Hablaremos de eso en un segundo.  ¿ Pero qué pasa si me\nqueda otro mechón de pelo?  ¿ Un mechón de pelo horizontal como este? Bueno, entonces eso\ndaría rayas verticales junto con las rayas horizontales. Entonces, si eso hubiera sucedido, habría tenido otras\nrayas verticales como esta. Y mira, esta es la misma\nforma que vimos antes. Y ahora tiene sentido\npor qué el mosquitero, que tiene un punto de mira como este, te da esas rayas\nque vimos antes.  ¿ Qué pasa con las imágenes del Hubble? Bueno, las imágenes del Hubble tienen rayas porque si miras el... Bueno, el Telescopio Espacial Hubble,\naquí hay un esquema. Tiene dos espejos. Dispone de un espejo primario\nen el que se refleja toda la luz y se\nenfoca en un espejo secundario. Así es como funciona el telescopio, o así se le llama telescopio reflector. Ahora el espejo secundario tiene que mantenerse en el espacio por aquí, ¿verdad? No puede simplemente flotar allí para mantenerlo allí y sostenerlo. Tenemos estos puntales y observamos\nla forma de los puntales. Es como la cruz del mosquitero, perdón, (risas) que teníamos y eso provoca las rayas. Esta cruz\nprovocará una raya como esta.  Y éste, este tramo\ncruzará una racha como ésta. Hermosa, ¿verdad? Pero la pregunta final es ¿por qué vimos, si fuera cuidadoso, por qué vimos algunos\nespacios oscuros en el medio?  ¿ Por qué vemos eso? Para eso, volvamos al láser y esta vez dibujemos los frentes de onda porque ahora realmente necesitamos\nmirar las ondas. Entonces, como el láser se mueve hacia la derecha, la onda se mueve hacia la derecha, los frentes de onda son paralelos de esta manera. No terminan así simplemente. El frente de onda en realidad continúa, pero luego la intensidad se vuelve mucho menor a medida que te alejas, por lo que en\ncierto modo se desvanece. Así es como puedes pensar en ello. Y ahora, si mantienes un objeto\naquí, las ondas se doblarán y se volverán circulares, como vimos con la lente del ojo de allí. Algo similar sucede\naquí, así que déjenme dibujarlo. Entonces la ola de arriba se\ndobla hacia abajo así, como si se dobla hacia abajo, y las\nolas de abajo se doblan hacia arriba. Y cuando hacen eso, mira, se\nmezclan, se interfieren y\naquí pasa algo muy interesante. Ahora, para hacer eso, solo he dibujado crestas de olas aquí. Pero entre las crestas de una ola y otra, también veremos valles de olas. Así que también dibujemos valles de ondas aquí, y los he dibujado con líneas de puntos. Y sé que parece\nun completo desastre en este momento, pero si nos acercamos y nos enfocamos aquí, ahora veremos algunas\nregiones de intersección interesantes. Mira aquí primero. Puedes ver que las crestas se\nencuentran con otras crestas y los valles se\nencuentran con otros valles.  ¿ Qué pasa por aquí? Obtienes una ola mucho más grande,\nuna cresta mucho más grande y un valle mucho más grande. Picos sobre picos, valles sobre\nvalles dan picos y valles más grandes; los llamamos interferencia constructiva. Aquí, la intensidad de la luz sería mucho mayor en esta región, pero no es la única\nregión donde la obtendremos.  De hecho, permítanme dibujar todas las regiones en las que tendremos una interferencia constructiva. De hecho, a lo largo de esta región se pueden ver construcciones. Nuevamente, aquí se puede\nver valle sobre valle, cresta sobre cresta, valle sobre\nvalle, cresta sobre cresta. Obtendrás interferencias constructivas. Estas son las regiones\ndonde se obtienen puntos brillantes. Pero entre interferencias constructivas, también verás regiones\ndonde los picos se alinean con los valles. Los picos se alinean con los valles, los picos se alinean con los valles.  ¿ Puedes ver eso?  ¿Las líneas de puntos y las\nlíneas sin puntos se encuentran? Estas son las regiones\ndonde se destruyen unos a otros. Cuando los picos y los valles se encuentran, se destruyen entre sí, casi no hay intensidad de luz y eso causa la oscuridad en el medio, y eso también se puede encontrar\naquí.  De hecho puedes verlo aquí. Puedes ver por aquí, aquí. De nuevo, déjame dibujar todas las regiones donde ves oscuridad. Esto es lo que obtendríamos. Entonces, las líneas rojas son\ndonde se obtienen las oscuridades, y las verdes son donde se\nobtienen los puntos más brillantes. Y si tuviera que mantener un muro aquí, esto es lo que obtendrías. Obtendríamos puntos brillantes aquí, y luego obtendríamos puntos oscuros, lo siento, puntos oscuros entre donde\nestá la línea roja. Y, por supuesto, a medida que te\nalejas del centro, la intensidad simplemente disminuye porque te\nalejas cada vez más de la fuente de luz y, por lo tanto, tienes la\nintensidad máxima en el centro y la luz se vuelve cada vez más tenue. y eso explica las\nbandas oscuras por aquí. Entonces, el patrón completo se\ndebe tanto a la difracción, que hace que la luz se disperse, como a la interferencia de la luz. Ahora, por supuesto, hay\nmuchas ondas interfiriendo, por lo que las cosas son\nmucho más interesantes. Pero ahora podemos ver por qué dondequiera que ocurra una interferencia destructiva, aparecerán estos puntos oscuros.",
    "t_arabic": "- [المدرس] ألقِ نظرة\nعلى هذه الصور الجميلة من تلسكوب هابل الفضائي. أحد أسباب جمالها هو تلك الخطوط الجميلة التي تحصل عليها لجميع النجوم. لكن لماذا تحصل عليهم؟ الآن إذا كنت تعتقد\nأن هذا التأثير يحدث لأنك تلتقط صورة في الفضاء، فلنفكر مرة أخرى\nلأنني حاولت في المنزل. هذا هو الفيديو الذي\nألتقطه من شرفتي ويمكنك رؤية بعض\nمصابيح الشوارع هنا. الآن وضعت مجموعة MOS\nفيها وماذا تجد؟ خطوط مماثلة. يمكنك أيضًا رؤية هذا التأثير\nإذا أغمضت عينيك. إذن ما الذي يحدث هنا؟ للوصول إلى الجزء السفلي من\nهذا، نحتاج إلى استكشاف ما يحدث عندما يصطدم الضوء بعائق ما. هذا كل شيء.  وهذا هو الهدف من هذا الفيديو. وقد يبدو الأمر واضحًا ومباشرًا، ولكن كما سنرى، فهو\nمثير للاهتمام ومتضمن جدًا. لذلك دعونا معرفة ذلك. إذًا ماذا يحدث عندما\nيصطدم الضوء بعائق؟ حسنًا، تخيل أن لدينا مصباحًا يدويًا، ونحتفظ ببعض الأشياء كنوع من العملة المعدنية أمامه. ثم نعرف ما سيحدث. سوف يلقي بظلاله هنا. سنحصل على ظل\nللعملة هنا وسنرى\nالضوء في مكان ما هنا إذا كان هذا جدارًا مثل هذا، مما يعني أنه إذا كنت تريد رسم أشعة الضوء، فإن العائق\nسيحجب فقط  الضوء هناك، وفي كل مكان آخر\nينتقل الضوء بشكل مستقيم. هذا ما يحدث، أليس كذلك؟  يمين؟ حسنًا، هذا صحيح إذا كان\nلديك أجسام كبيرة جدًا، ولكن هل سيكون الأمر نفسه إذا كان\nلدينا أجسام صغيرة جدًا أمام مصدر للضوء؟ حسنًا، لنقم بتجربة\nلمعرفة ذلك. هنا، صديقي لديه ضوء ليزر أخضر وسوف نقوم بتوجيهه إلى الحائط. ماذا نرى؟ حسنًا، نرى نقطة كبيرة كما نتوقع، لكن الآن دعونا نضع\nخصلة شعر أمامها. خصلة الشعر لها سمك صغير جدًا. فماذا سنرى الآن أمامه؟ حسنًا، توقعاتي\nستكون نفس النقطة كما كانت من قبل، ولكن ربما مع ظل\nالشعر بينهما. حسنا، دعونا ننظر في الأمر. (يضحك) نحن لا نرى ذلك. يا إلهي ماذا نرى هنا؟ أولًا، نلاحظ\nنفس النقطة في المنتصف، ولكننا الآن نرى أيضًا\nبعض الخطوط هنا. يبدو أن الضوء\nينتشر بطريقة ما. كيف يكون له أي\nمعنى؟  ماذا يحدث هنا؟ لماذا يتصرف الضوء بشكل مختلف عندما يكون لدينا أجسام صغيرة جدًا؟ حسنًا، للإجابة على هذا السؤال، علينا أن نتذكر أن الضوء عبارة عن موجة، وإذا استخدمت نموذجًا موجيًا،\nفربما يكون كل ذلك منطقيًا. لكن بما أننا لا نمتلك أي\nخبرة في التعامل مع الضوء كموجة، فلنستخدم الماء. إليكم صورة خريطة جوجل\nلبعض الأمواج، أمواج مائية تدخل أو\nتضرب الجزر أدناه. لذلك تنزل الأمواج. الآن دعونا نلقي نظرة على ما\nيحدث عندما تضرب الأمواج وكيف تبدو الأمواج هنا. لذلك اسمحوا لي أن أظهر هذا.  ماذا تلاحظ؟ لاحظت بعض\nالتموجات الدائرية هنا. هذا شيء مشوق.  هل\nيمكنك ان ترى ذلك؟ السبب وراء كونها مثيرة للاهتمام هو أنك إذا قمت برسم\nالموجات القادمة، فهي أفقية نوعًا ما. يمكنك رؤيته، أليس كذلك؟  إذن\nها هي الموجات الأفقية. كانت توقعاتي أنه عندما\nتضرب الأمواج الجزيرة، حسنًا، أسفل الجزيرة، لن تكون هناك أمواج، وهنا\nيجب أن تمر الأمواج فقط. لذلك هذا ما اعتقدت أنه يجب أن يحدث. لكن هذا لا يحدث. لا تزال ترى بعض الأمواج\nهنا.  اسمحوا لي أن أظهر لهم.  ما زلنا نرى بعض الموجات هنا. لدينا بعض الموجات هنا. لماذا لدينا تلك الموجات هناك؟ لماذا الأمواج هنا؟\nكيف يكون له أي معنى؟ حسنًا، دعونا نفكر في\nالأمر.  دعونا نفكر في ذلك. ما هي الموجات في الواقع؟ الموجات هي اضطرابات\nتنتشر من مجموعة من الجسيمات\nإلى أخرى، أليس كذلك؟ الآن، إذا كان لديك جسيمات هنا، فإنها ترتفع وتنخفض\nثم ترتفع وتنخفض، وتجعل الجسيمات المجاورة\nلها ترتفع وتنخفض، أليس كذلك؟ الآن لم يعد هناك المزيد من\nجزيئات الماء هنا لتتمكن من الصعود والهبوط، لذلك لن تكون هناك\nموجات ماء هناك، أليس كذلك؟ لكن انظر إلى ما يحدث عند ظهور موجة... انظر إلى ما يحدث عندما يتحرك جسيم من\nواجهة الموجة هذه لأعلى ولأسفل. عندما يفعل ذلك، لن\nيجعل الجسيم الذي أمامه يرتفع ويهبط فحسب، بل سيجعل\nالجسيم في مكان ما هنا يتحرك لأعلى ولأسفل لأنه على\nاتصال بهذا الجسيم. إنها تضع قوة على\nالجسيم الموجود في المنطقة المجاورة لها. ولهذا السبب لن تتجه الأمواج بهذه الطريقة نحو الأسفل. سوف تنحني الأمواج نوعًا ما\nحول العائق. نفس الشيء سيحدث هنا سوف تنحني الأمواج\nحول العائق نوعًا ما، حسنًا؟ في الواقع، إذا أردت توضيح الاتجاه الذي تتحرك فيه الأمواج\n، فسأفعل ذلك. إذن، هذه هي الطريقة التي تأتي بها الموجات. إنها تأتي، تذكر،\nاتجاه الموجات عمودي على\nاتجاه واجهة الموجة، حسنًا؟ نتوقع أن تسير الأمواج على هذا النحو، لكن هذا ليس كل ما تفعله. الأمواج التي سأرسمها\nهنا تنحني إلى الداخل نوعًا ما. إذًا لدينا هذا الانحناء الداخلي\nالذي يحدث، حسنًا؟ إذن هذه الظاهرة حيث، كما\nتعلمون، تنحني الأمواج حول العوائق، أطلقنا عليها اسمًا، نطلق عليه الحيود. يبدو هذا مشابهًا جدًا للانكسار، وهو أيضًا انحناء\nللموجة، لكنه مختلف تمامًا. الانكسار هو انحناء\nالموجات عندما يتغير الوسط، لأنه عند تغير\nالوسط تتغير السرعة وهذا ما يسبب\nانحناء مقدمات الموجة. هذا مختلف.  هذا\nهو الحيود مع D. هنا، الأمواج تنحني، ليس لأنها تغير الوسط، لا يوجد تغير في الوسط،\nلا يوجد تغير في السرعة، لكنها تصطدم بعائق. عندما تصطدم الأمواج بأي عائق، فإنها تنحني حول العائق. هذه الظاهرة هي ما\nنسميه الحيود، وهي ظاهرة موجية. وينطبق ذلك على أي موجات\nتصطدم بأي عقبات. لذا، إذا كان الأمر ينطبق على\nموجات الماء، فيجب أن ينطبق أيضًا على الموجات الصوتية،\nوينطبق على موجات الضوء. لكن مهلا، إذا أظهر الضوء أيضًا حيودًا، مما يعني أن الضوء\nينحني أيضًا حول العوائق، فلا ينبغي لنا أن\nنرى الظلال، أليس كذلك؟ أعني، إذا كانت هذه موجات ضوئية، كانت هذه موجات ضوئية قادمة من الأعلى، وكانت هناك بعض العوائق هنا، فستكون هذه منطقة الظل. ومن تجربتنا اليومية نعرف ذلك. هذا من شأنه أن يكون الظل، ولكن\nوفقًا للحيود، يجب أن ينحني الضوء ويدخل\nإلى منطقة الظل، مما يعني أننا لا ينبغي أن\nنرى الظلال. لكن نحن فعلنا. يبدو أن هذا لا\nيحدث في حياتنا اليومية. لماذا هذا؟  هذا\nسؤال مثير للاهتمام. لذلك، دعونا نرى كيف يلعب حجم العائق دورًا هنا. إذن لدينا بعض\nموجات الضوء الواردة هنا. تخيل موجات الطائرة تتحرك إلى اليمين. الآن، إذا أبقينا بعض\nالعوائق الصغيرة بينهما، نتوقع أن نحصل على ظل هنا وقد مرت الأمواج عليه هكذا، لكننا رأينا أن ذلك لم يحدث. سوف تنحني الموجات، وسوف تنحرف، وبالتالي ستبدو الموجات\nهكذا، حسنًا؟ وبالتالي، إذا قمت\nبرسم أشعة الضوء، فسوف تنحني بهذا الشكل، مما يعني أنه إذا كان هذا ضوءًا،\nوإذا احتفظنا بشاشة أو جدار ما هنا، فيجب أن نحصل على شيء كهذا. وهذا ما كنت أتحدث عنه. لذا، بسبب الحيود، يجب أن يدخل الضوء إلى المنطقة التي سنحصل فيها على الظل. لذا يجب أن نحصل على\nظل صغير جدًا، أليس كذلك؟ لكن هذا لا يحدث.  لماذا هذا؟ حسنًا، هذا لأنه هنا، انظر إلى طول الجسم. طول الجسم مشابه\nللطول الموجي للموجات، أليس كذلك؟ الآن، ماذا كان سيحدث لو\nكان هذا الجسم أكبر بكثير؟ حسنًا، سيظل الانحناء كما هو\n لأن الموجات لا تهتم\nبحجم الجسم. ومع ذلك، إذا احتفظنا الآن\nبجسم أكبر بكثير، يمكنك أن ترى أن الموجة لا تزال تنحني، ولا تزال الموجة تحيد بنفس المقدار. ولكن الآن أصبح حجم الظل\nأكثر قابلية للمقارنة بحجم الكائن نفسه. ليست درامية كما رأينا هنا. الآن، حتى هنا يمكنك أن ترى أن\nالطول، لا أعلم، ربما أكبر بـ 15 مرة\nمن الطول الموجي. ماذا لو كان هذا الجسم\nأكبر بألف مرة من الطول الموجي؟  (يضحك) سيكون حجم الظل هذا بنفس حجم هذا الظل تقريبًا. سيكون هذا الانحناء\nغير مهم تقريبًا، وهذا ما يحدث في حياتنا اليومية.  كما ترون، الطول الموجي للضوء هو في حدود 0.5 ميكرومتر، أي 10 أس ناقص ستة. والأشياء التي نتعامل معها في حياتنا اليومية هي\nأكبر بعشرات الآلاف من المرات، كبيرة جدًا بحيث يمكننا\nإهمال الحيود تمامًا، وعواقب الحيود. ولهذا السبب لا نفكر\nفي الأمر في معظم الأوقات. لذلك عندما تكون الأجسام أكبر بكثير من الطول الموجي للضوء، تكون تأثيرات\nالحيود ضئيلة. ولكن إذا كانت صغيرة بما فيه الكفاية، كما هو الحال عندما تفكر في خصلة شعر، فإن خصلة الشعر تظل بالطبع أكبر من الطول الموجي للضوء. لكنه أكثر أهمية بكثير مقارنة بالطول الموجي للضوء. الآن سوف نرى\nآثار الحيود. إذن هذا هو الليزر الأخضر\nالذي كان صديقي يستخدمه. الآن، إذا احتفظنا بعائق صغير، تخيل أن هذه هي خصلة الشعر. يمكنك أن تتخيل وكأنك تعرف ذلك، فأنت تنظر إلى\nخصلة الشعر من الأعلى. هذا هو قطر\nخصلة الشعر، يمكنك أن تتخيل، حسنًا؟ لذا، إذا كنت قد احتفظت\nبخصلة الشعر هنا، فهذا ما كنا نتوقعه إذا لم نفكر في الحيود. لكننا نعلم الآن أن الموجات الواردة سوف تنحني هنا لأسفل، والموجات الواردة\nهنا ستنحني لأعلى، وهو ما يعني أنك ستفهم الآن أن هذا الشعاع سينحني للأسفل، وهذا الشعاع سينحني لأعلى. حتى تحصل على شيء يبدو مثل هذا. والآن، إذا كانت لدينا شاشة\nقريبة جدًا من خصلة الشعر، فسنظل نرى\nبعض الظل هنا.  ما زلنا نرى بعض الضوء هنا. ولكن ماذا يحدث إذا أبقيت\nالشاشة بعيدًا جدًا؟ إذا أبقيت الشاشة\nبعيدة بما فيه الكفاية، في النهاية، سأجد الآن أن\nالموجات قد انتشرت. سأرى أن الليزر\nينتشر على الحائط. وهذا بالضبط ما رأيناه. انظر، عندما تبقي صديقتي الورقة قريبة جدًا من الليزر، فإن الانتشار ليس كثيرًا، ولكن عندما تأخذ الورقة أبعد وأبعد وأبعد، \nيصبح الانتشار أكثر وضوحًا وفي النهاية على الحائط\nينتشر فقط كثيرا. الآن هذا هو النمط الذي حصلنا عليه بسبب خصلة الشعر العمودية. يسقط الضوء عليه وينحني مما يمنحك\nخطوطًا أفقية. إذًا خصلة الشعر العمودية تعطيك خطوطًا أفقية كهذه، حسنًا؟ ويمكنك رؤية الفجوات بينهما. سنتحدث عن ذلك في الثانية. ولكن ماذا يحدث لو كان\nلدي خصلة شعر أخرى؟ خصلة شعر أفقية كهذه؟ حسنًا، من شأن ذلك أن\nيمنح خطوطًا رأسية جنبًا إلى جنب مع الخطوط الأفقية. فإذا حدث ذلك، كنت سأحصل على\nخطوط عمودية أخرى كهذه. وانظر، هذا هو\nالشكل نفسه الذي رأيناه سابقًا. والآن أصبح من المنطقي\nمعرفة لماذا تعطيك الناموسية، التي تحتوي على شعيرات متقاطعة مثل هذه، تلك الخطوط\nالتي رأيناها سابقًا. ماذا عن صور هابل؟ حسنًا، صور هابل تظهر الخطوط لأنك إذا نظرت إلى... حسنًا، تلسكوب هابل الفضائي،\nإليك مخططًا تخطيطيًا له. لها مرآتان. تحتوي على مرآة أساسية ينعكس\nعليها كل الضوء ويتم\nتركيزه على مرآة ثانوية. وهكذا يكون التلسكوب، أو هذا ما يسمى بالتلسكوب العاكس. الآن المرآة الثانوية يجب أن تكون موجودة في الفضاء هنا، أليس كذلك؟ لا يمكن أن يحوم هناك فقط لإبقائه هناك لدعمه. لدينا هذه الدعامات وننظر\nإلى شكل الدعامات. إنه يشبه إلى حد ما الشعر المتقاطع للناموسية، آسف، (يضحك) الذي كان لدينا والذي يسبب الخطوط. سيؤدي هذا الشعر المتقاطع إلى\nظهور خط كهذا. وهذا الامتداد\nسوف يعبر خطًا كهذا. جميلة، أليس كذلك؟ لكن السؤال الأخير هو لماذا رأينا، إذا كنت يجب أن أدقق، لماذا رأينا بعض\nالمساحات المظلمة بينهما؟ لماذا نرى ذلك؟ لذلك، دعونا نعود إلى الليزر، وهذه المرة دعونا نرسم مقدمات الموجات لأننا نحتاج حقًا\nإلى النظر إلى الموجات الآن. وبما أن الليزر يتحرك إلى اليمين، فإن الموجة تتحرك إلى اليمين، وتكون مقدمات الموجة متوازية بهذه الطريقة. إنهم لا ينتهون بهذه الطريقة. تستمر جبهة الموجة في الواقع، ولكن بعد ذلك تصبح الشدة أقل بكثير كلما ابتعدت أكثر، لذا\nيبدو الأمر وكأنه يتلاشى. هذه هي الطريقة التي يمكنك التفكير في الأمر. والآن إذا احتفظت بجسم ما\nهنا، فسوف تنحني الموجات وتصبح دائرية، كما رأينا مع عدسة العين هناك. لذا يحدث شيء مشابه\nهنا، لذا دعوني أرسم ذلك. لذا فإن الموجة من الأعلى\nتنحني للأسفل بهذا الشكل، نوعًا من الانحناء للأسفل،\nوالموجات الموجودة في الأسفل تنحني للأعلى. وعندما يفعلون ذلك، انظروا،\nيختلطون مع بعضهم البعض، ويتداخلون مع بعضهم البعض ويحدث شيء\nمثير للاهتمام هنا. وللقيام بذلك، قمت فقط برسم قمم الأمواج هنا. ولكن بين قمم الموجات، سنرى أيضًا قيعان الأمواج. لذا دعونا أيضًا نرسم قيعان الموجة هنا، وقد رسمت ذلك بخطوط منقطة. وأنا أعلم أن الأمر يبدو وكأنه\nفوضى كاملة الآن ولكن إذا قمت بتكبير الصورة وركزنا هنا، فسنرى الآن بعض\nمناطق التقاطع المثيرة للاهتمام. انظر هنا أولا. يمكنك أن ترى القمم\nتلتقي مع قمم أخرى وقيعان تلتقي\nمع قيعان أخرى. ماذا يحدث هنا؟ تحصل على موجة أكبر بكثير،\nوتحصل على قمة أكبر بكثير، وتحصل على قاع أكبر بكثير. القمم على القمم، والوديان على\nالوديان تعطيك قمم أكبر وأودية أكبر، ونحن نسميها التدخل البناء. لذا هنا، ستكون شدة الضوء أعلى بكثير على طول هذه المنطقة، لكن هذه ليست\nالمنطقة الوحيدة التي سنحصل عليها. اسمحوا لي أن أرسم جميع المناطق التي سنحصل فيها على تدخل بناء. في الواقع، على طول هذه المنطقة، يمكنك رؤية الإنشاءات تحدث. مرة أخرى، هنا يمكنك\nرؤية القاع على القاع، والقمة على القمة، والحوض على\nالقاع، والقمة على القمة.  سوف تحصل على تدخلات بناءة. إذن هذه هي المناطق\nالتي تحصل فيها على نقاط مضيئة. ولكن بين التداخلات البناءة، سترى أيضًا مناطق تصطف\nفيها القمم مع الوديان. تصطف القمم مع الوديان، وتصطف القمم مع الوديان.  هل يمكنك ان ترى ذلك؟ الخطوط المنقطة والخطوط غير\nالمنقطة تلتقيان؟ إذن هذه هي المناطق\nالتي يدمرون فيها بعضهم البعض. عندما تلتقي القمم والوديان ببعضها البعض، فإنها تدمر بعضها البعض، ولا تحصل على أي شدة للضوء تقريبًا وهذا يسبب الظلام بينهما، ويمكنك أن تجد ذلك\nهنا أيضًا. يمكنك في الواقع رؤيتها هنا. يمكنك أن ترى هنا، هنا.  مرة أخرى، اسمحوا لي أن أرسم جميع المناطق التي ترى فيها الظلام. هذا ما سوف نحصل عليه. الخطوط الحمراء هي\nالمكان الذي تحصل فيه على الظلام، والخطوط الخضراء هي المكان الذي\nتحصل فيه على النقاط الأكثر سطوعًا. لذا، إذا اضطررت إلى الاحتفاظ بجدار هنا، فهذا ما ستحصل عليه. ستحصل على نقاط مضيئة هنا، ثم ستحصل على بقع داكنة، آسف، بقع داكنة بين حيث\nيوجد الخط الأحمر. وبالطبع، عندما\nتبتعد عن المركز، تقل الشدة لأنك تبتعد\nأكثر فأكثر عن مصدر الضوء، وبالتالي، يكون لديك الحد الأقصى من\nالشدة في المركز ويصبح الضوء خافتًا أكثر فأكثر، وهذا ما يفسر\nالعصابات المظلمة هنا. لذا فإن النمط الكامل هو\nبسبب كل من الحيود، الذي يجعل الضوء ينتشر، وبسبب تداخل الضوء. الآن بالطبع، هناك\nالكثير من الموجات المتداخلة، لذا فإن الأمور في الواقع\nأكثر إثارة للاهتمام. لكن يمكنك الآن أن ترى لماذا أينما حدث تدخل مدمر، ستحصل على هذه البقع السوداء.",
    "t_italian": "- [Istruttore] Dai un'occhiata\na queste bellissime immagini dal telescopio spaziale Hubble. Uno dei motivi per cui è bello è per queste belle striature che ottieni per tutte le stelle. Ma perché li prendi? Ora, se stai pensando\nche questo effetto si verifica perché stai scattando una foto nello spazio, beh, ripensaci\nperché ci ho provato a casa. Questo è il video che\nsto girando dal mio balcone e potete vedere alcuni di\nquesti lampioni qui. Adesso ci metto dentro il kit MOS\ne cosa trovi? Strisce simili. Puoi anche vedere questo effetto\nse strizzi gli occhi. Allora cosa sta succedendo qui? Per andare a fondo di\nquesto problema, dobbiamo esplorare cosa succede quando la luce colpisce un ostacolo. Questo è tutto.  Questo è l'obiettivo di questo video. E potrebbe sembrare piuttosto semplice, ma come vedremo, è piuttosto\ninteressante e coinvolgente. Quindi scopriamolo. Cosa succede allora quando\nla luce colpisce un ostacolo? Bene, immagina di avere una torcia elettrica e di tenere davanti ad essa alcuni oggetti come una specie di moneta. Allora sapremo cosa succederà. Proietterà un'ombra qui. Avremo un'ombra\ndella moneta qui e vedremo la\nluce da qualche parte qui se questo fosse un muro come questo, il che significa che se devi attirare i raggi di luce, allora l'ostacolo\nbloccherà semplicemente il  la luce laggiù, e ovunque la\nluce viaggia semplicemente dritta.  E' quello che succede, vero?  Giusto? Ebbene questo è vero se\nabbiamo oggetti molto grandi, ma sarebbe lo stesso se\navessimo oggetti molto piccoli davanti a una fonte di luce? Bene, facciamo un esperimento\nper capirlo. Ecco, il mio amico ha una luce laser verde e la punteremo verso il muro. Cosa vediamo? Bene, vediamo un grande punto come ci aspetteremmo, ma ora mettiamoci una\nciocca di capelli davanti. Una ciocca di capelli ha uno spessore molto piccolo. Quindi cosa vedremo ora di fronte ad esso? Bene, la mia aspettativa\nsarebbe lo stesso punto di prima, ma forse con l'ombra\ndei capelli in mezzo. Ok, diamo un'occhiata. (ride) Non lo vediamo. Oh mio Dio, cosa vediamo qui? Notiamo innanzitutto\nlo stesso punto al centro, ma ora vediamo anche\ndelle strisce qui. Sembra che la luce si stia\nin qualche modo diffondendo. Che\nsenso ha?  Cosa sta succedendo? Perché la luce si comporta in modo così diverso quando abbiamo oggetti molto piccoli? Bene, per rispondere a questa domanda, dobbiamo ricordare che la luce è un'onda e, se utilizzi un modello ondulatorio,\nforse tutto avrà senso. Ma poiché non abbiamo alcuna\nesperienza con la luce come onda, usiamo l'acqua. Quindi ecco un'immagine della mappa Google\ndi alcune onde, onde d'acqua che entrano o\ncolpiscono le isole sottostanti. Quindi le onde stanno scendendo. Ora diamo un'occhiata a cosa\nsuccede quando le onde si infrangono e come appaiono le onde qui. Quindi permettimi di svelarlo.  Cosa noti? Noti alcune\nincrespature circolari qui. È molto interessante.\nPuoi vedere che? Il motivo per cui è interessante è perché se disegni le onde in arrivo\n, sono orizzontali. Puoi vederlo, vero?  Quindi\necco le onde orizzontali. La mia aspettativa era che quando\nle onde colpissero l'isola, beh, sotto l'isola, non ci sarebbero state onde e da qui le onde\navrebbero dovuto semplicemente passare. Quindi questo è ciò che pensavo dovesse accadere. Ma ciò non accade. Vedi ancora delle onde\nqui.  Lascia che glielo mostri. Vediamo ancora alcune onde qui. Abbiamo delle onde qui. Perché abbiamo quelle onde laggiù? Perché le onde sono qui?\nChe senso ha? Bene, pensiamoci\n.  Pensiamoci. Cosa sono realmente le onde? Le onde sono disturbi\nche si propagano da un insieme di particelle\na un altro, giusto? Ora, se ci sono delle particelle qui, vanno su e giù e\npoi vanno su e giù, fanno\nandare su e giù le particelle accanto a loro, giusto? Ora non ci sono più\nparticelle d'acqua qui che possano andare su e giù, quindi non ci saranno\nonde d'acqua laggiù, giusto? Ma guarda cosa succede quando un'onda... Guarda come cosa succede quando una particella di questo particolare\nfronte d'onda va su e giù. Quando lo fa, non solo\nfarà andare su e giù una particella davanti a sé, ma farà anche\n andare su e giù una particella da qualche parte qui perché è\nin contatto con quella particella. Sta esercitando una forza sulla\nparticella nelle sue vicinanze. Ed è per questo che le onde non andranno semplicemente così dritte verso il basso. Le onde si\npiegheranno attorno all'ostacolo. La stessa cosa accadrà qui. Le onde si piegheranno\nattorno all'ostacolo, ok? Infatti, se dovessi mostrare la direzione in cui viaggiano le onde\n, permettetemi di farlo. Quindi ecco come arrivano le onde. Stanno arrivando, ricorda,\nla direzione delle onde è perpendicolare alla\ndirezione del fronte d'onda, ok? Ci aspettiamo che le onde vadano così, ma non è tutto ciò che fanno. Le onde che incontrerò\nqui si piegano verso l'interno. Quindi abbiamo questa flessione verso l'interno\nche sta accadendo, ok? Quindi questo fenomeno per cui,\nsai, le onde si piegano attorno agli ostacoli, gli abbiamo dato un nome, lo chiamiamo diffrazione. Sembra molto simile alla rifrazione, che è anch'essa una curvatura\ndell'onda, ma è molto diversa. La rifrazione era la curvatura delle\nonde quando cambiano mezzo, perché quando cambia\nmezzo, cambia la velocità e questo è ciò che provoca la\ncurvatura dei fronti d'onda. Questo è diverso.  Questa\nè diffrazione con una D. Qui, le onde si piegano, non perché stanno cambiando il mezzo, non c'è cambiamento nel mezzo,\nnon c'è cambiamento nella velocità, ma stanno colpendo un ostacolo. Ogni volta che le onde colpiscono un ostacolo, si piegheranno attorno all'ostacolo. Questo fenomeno è ciò che\nchiamiamo diffrazione, ed è un fenomeno ondulatorio.  Si applica a qualsiasi onda\nche colpisca qualsiasi ostacolo. Quindi se si applica alle\nonde dell'acqua, dovrebbe applicarsi anche alle onde sonore e si\napplicherà anche alle onde luminose. Ma aspetta, se la luce mostra anche diffrazione, il che significa che anche la luce si\npiega attorno agli ostacoli, allora non dovremmo\nvedere ombre, giusto? Voglio dire, se queste fossero onde luminose, queste fossero onde luminose che provengono dall'alto, e ci fossero degli ostacoli qui, questa sarebbe la regione dell'ombra. Dalla nostra esperienza quotidiana, lo sappiamo. Questa sarebbe l'ombra, ma\nsecondo la diffrazione la luce dovrebbe piegarsi ed entrare\nnella regione delle ombre, il che significa che non dovremmo\nvedere ombre. Ma lo facciamo. Questo non sembra\naccadere nella nostra vita quotidiana. Perché?  Questa è una\ndomanda interessante. Per questo, vediamo come gioca un ruolo la dimensione dell'ostacolo qui. Quindi qui abbiamo alcune\nonde luminose in arrivo. Immagina che le onde piane si muovano verso destra. Ora, se manteniamo qualche\npiccolo ostacolo in mezzo, ci aspetteremmo di avere un'ombra qui e che le onde la oltrepassino in questo modo, ma abbiamo visto che ciò non accade.  Le onde si piegheranno, si diffrangeranno e quindi appariranno\npiù o meno così, ok? E quindi se dovessi\ndisegnare i raggi di luce, si piegherebbero in questo modo, il che significa che se allora ci fosse luce\ne se tenessimo uno schermo o una specie di muro qui, dovremmo ottenere qualcosa del genere. Ed è di questo che stavo parlando. Quindi, a causa della diffrazione, la luce dovrebbe entrare nella regione in cui otterremmo un'ombra. E quindi dovremmo ottenere\nun'ombra molto piccola, giusto? Ma ciò non accade.  Perché? Beh, è ​​perché qui, guarda la lunghezza dell'oggetto. La lunghezza dell'oggetto è paragonabile alla\nlunghezza d'onda delle onde, giusto? Ora, cosa sarebbe successo se\nquesto oggetto fosse stato molto più grande? Bene, la flessione\nsembrerebbe sempre la stessa perché alle onde non interessa\nquanto è grande l'oggetto. Tuttavia, se ora teniamo\nun oggetto molto più grande, puoi vedere che l'onda si piega ancora e si diffrange ancora nella stessa misura. Ma ora la dimensione dell'ombra\nè molto più paragonabile alla dimensione dell'oggetto stesso. Non così drammatico come abbiamo visto qui. Ora, anche qui potete vedere che\nla lunghezza è, non so, forse 15 volte più\ngrande della lunghezza d'onda.  E se questo oggetto fosse\nmille volte più grande della lunghezza d'onda?  (ride) Allora la dimensione dell'ombra sarebbe quasi la stessa di questa. Questa flessione sarebbe\nquasi irrilevante, ed è ciò che accade nella nostra vita quotidiana. Vedete, la lunghezza d'onda della luce è dell'ordine di 0,5 micrometri, ovvero 10 elevato meno sei. E gli oggetti con cui abbiamo a che fare nella nostra vita quotidiana sono\ndecine di migliaia di volte più grandi, così grandi che possiamo\ntrascurare completamente la diffrazione, le conseguenze della diffrazione. Ed è per questo che la\nmaggior parte delle volte non ci pensiamo. Quindi, quando gli oggetti sono molto più grandi della lunghezza d'onda della luce, gli effetti della\ndiffrazione sono trascurabili. Ma se sono abbastanza piccoli, come quando si considera una ciocca di capelli, una ciocca di capelli è ancora, ovviamente, più grande della lunghezza d'onda della luce. Ma è molto più considerevole rispetto alla lunghezza d'onda della luce. Ora vedremo gli\neffetti della diffrazione. Quindi ecco il laser verde\nche stava usando il mio amico. Ora, se manteniamo un piccolo ostacolo, immaginiamo che questa sia la ciocca di capelli. Puoi immaginare, come se lo sapessi, di guardare la\nciocca di capelli dall'alto. Quindi questo è il diametro\ndella ciocca di capelli, puoi immaginare, ok? Quindi se avessi tenuto la\nciocca di capelli qui, questo è quello che ci aspetteremmo se non pensassimo alla diffrazione. Ma ora sappiamo che le onde in arrivo si piegherebbero qui verso il basso, e le onde in arrivo\nqui si piegherebbero verso l'alto, il che significa che ora capiresti che questo raggio in realtà si piegherebbe verso il basso, questo raggio si piegherebbe verso l'alto. Quindi ottieni qualcosa che assomiglia a questo. E quindi ora se avessimo uno schermo\nmolto vicino alla ciocca di capelli, vedremmo ancora\nqualche ombra qui. Vedremmo ancora un po' di luce da queste parti. Ma cosa succede se tengo\nlo schermo molto, molto lontano? Se tengo lo schermo\nabbastanza lontano, prima o poi, scoprirò che le\nonde si sono allargate. Vedrò quel laser\ndiffondersi sul muro. Ed è esattamente quello che abbiamo visto. Guarda, quando la mia amica tiene la carta molto vicina al laser, l'allargamento non è molto, ma man mano che porta la carta sempre più lontano, ora l'allargamento\nè molto più pronunciato e alla fine sulla parete\nappare  semplicemente si espande molto. Ora questo è lo schema che otteniamo grazie alla ciocca di capelli verticale. La luce cade su di esso e si piega creando\nstrisce orizzontali. Quindi la ciocca di capelli verticale ti dà delle mèches orizzontali come queste, ok? E puoi vedere le lacune nel mezzo. Ne parleremo tra un secondo. Ma cosa succede se\navessi un'altra ciocca di capelli? Una ciocca di capelli orizzontale come questa? Bene, allora questo\nmi darebbe delle strisce verticali insieme a quelle orizzontali. Quindi se fosse successo, avrei ottenuto altre\nstrisce verticali come questa. E guarda, questa è la stessa\nforma che abbiamo visto prima. E ora è chiaro il motivo\nper cui la zanzariera, che ha un mirino come questo, dà quelle strisce\nche abbiamo visto prima.  E le immagini di Hubble? Bene, le immagini di Hubble hanno le strisce perché se guardate... beh, il telescopio spaziale Hubble,\neccone uno schema. Ha due specchi. Ha uno specchio primario\nsul quale viene riflessa tutta la luce e viene\nfocalizzata su uno specchio secondario. Ecco come funziona il telescopio, o come viene chiamato telescopio riflettente. Ora lo specchio secondario deve essere tenuto nello spazio qui, giusto? Non può semplicemente restare librato laggiù per mantenerlo lì a sostenerlo. Abbiamo questi montanti e osserviamo\nla forma dei montanti. È un po' come il mirino della zanzariera, scusa, (ride) che avevamo e che provoca le striature. Questo mirino\ncauserà una striscia come questa. E questo, questo tratto\nincrocerà una serie di vittorie come questa. Bello, vero? Ma la domanda finale è: perché abbiamo visto, se dovessi fare attenzione, perché abbiamo visto degli\nspazi oscuri nel mezzo? Perché lo vediamo? Per questo, torniamo al laser, e questa volta disegniamo i fronti d'onda perché adesso dobbiamo davvero\nguardare le onde. Quindi, poiché il laser si muove verso destra, l'onda si muove verso destra, i fronti d'onda sono paralleli in questo modo. Non finiscono così. Il fronte d'onda in realtà continua, ma poi l'intensità diventa molto più bassa man mano che ci si allontana, quindi in\nun certo senso svanisce. Ecco come puoi pensarci. E ora se tieni un oggetto\nqui, le onde si piegheranno e diventeranno un lato circolare, come abbiamo visto con la lente dell'occhio laggiù. Quindi succede qualcosa di simile\nqui, quindi lasciatemelo disegnare. Quindi l'onda dall'alto si\npiega in questo modo, come se si piegasse verso il basso, e le\nonde sul fondo si piegano verso l'alto. E quando lo fanno, guardate,\nsi mescolano tra loro, interferiscono tra loro e\nqui accade qualcosa di molto interessante. Ora, per fare ciò, ho disegnato qui solo le creste delle onde. Ma tra le creste delle onde, vedremo anche le depressioni delle onde. Quindi disegniamo anche le depressioni delle onde qui, e l'ho disegnato con linee tratteggiate. E so che in questo\nmomento sembra un disastro completo, ma se ingrandiamo e ci concentriamo qui, ora vedremo alcune interessanti\nregioni di intersezione. Prima guarda qui. Puoi vedere che le creste si\nincontrano con altre creste e le depressioni si\nincontrano con altre depressioni. Cosa succede qui? Ottieni un'onda molto più grande,\nottieni una cresta molto più grande e ottieni una depressione molto più grande. Picchi su picchi, valli su\nvalli danno picchi e valli più grandi, le chiamiamo interferenze costruttive. Quindi qui, l'intensità della luce sarebbe molto più alta lungo questa regione, ma questa non è l'unica\nregione dove la otterremo. Lasciatemi disegnare tutte le regioni in cui otterremo un'interferenza costruttiva. Infatti, lungo questa regione, si possono vedere delle costruzioni in corso. Ancora una volta, qui potete\nvedere avvallamento su avvallamento, cresta su cresta, avvallamento su avvallamento\n, cresta su cresta. Otterrai interferenze costruttive. Quindi queste sono le regioni\nin cui si ottengono punti luminosi. Ma tra le interferenze costruttive, vedrai anche regioni\nin cui i picchi si allineano con le valli.  I picchi si allineano con le valli, i picchi si allineano con le valli. Puoi vedere che?  Le linee tratteggiate e le\nlinee non tratteggiate si incontrano? Quindi queste sono le regioni\nin cui si distruggono a vicenda. Quando i picchi e le valli si incontrano, si distruggono a vicenda, non si ottiene quasi alcuna intensità di luce e questo causa l'oscurità nel mezzo, e puoi trovarla nel\nmezzo anche qui. Puoi effettivamente vederlo qui. Puoi vedere qui, qui. Quindi, ancora una volta, lasciami disegnare tutte le regioni in cui vedi l'oscurità. Questo è ciò che otterremmo. Quindi le linee rosse sono\ndove si ottengono le tenebre, e quelle verdi sono dove si\nottengono i punti più luminosi. E quindi se dovessi mantenere un muro qui, ecco cosa otterreste. Si otterrebbero dei punti luminosi qui, e poi si otterrebbero dei punti scuri, scusate, dei punti scuri nel mezzo, dove\nc'è la linea rossa. E ovviamente, man mano che ti\nallontani dal centro, l'intensità diminuisce perché ti allontani sempre più\n dalla sorgente luminosa e quindi hai la massima\nintensità al centro e la luce diventa sempre più fioca, e questo spiega le\nbande scure qui. Quindi lo schema completo è\ndovuto sia alla diffrazione, che fa diffondere la luce, sia all'interferenza della luce. Ora, ovviamente, ci sono\nmolte onde che interferiscono, quindi le cose sono in realtà\nmolto più interessanti. Ma ora potete più o meno capire perché ovunque si verifichino interferenze distruttive, si ottengono questi punti oscuri."
}