{
    "source": "WlM3oJW_Bb0",
    "youtubelink": "https://www.youtube.com/watch?v=WlM3oJW_Bb0",
    "t_english": "- Sal Khan here from Khan Academy. Now some of y'all or hopefully many of y'all are familiar with Khan Academy. We're a not-for-profit with a mission of providing a free world-class education for anyone, anywhere. But one area that people are probably less familiar with, but it might be one of the coolest parts of what we do is Khan Academy Kids. Khan Academy Kids is an app that covers all subject areas from pre-school through second grade. We have efficacy studies that show that in as little as 10 weeks, students are showing the benefits of one-on-one tutoring. And we know how important it is, especially as we're going into second or third grade, for students to get fluency in skills like reading, skills like numeracy. A big part that we're focused on is making sure that it can be used to support you in a school district setting. As a principal, as a district leader, you can get reports on what is happening. Feel confident that your students are making progress towards their standards. And when we work with districts, we are trying to make it as affordable and as accessible as possible. The cost, which we've tried to keep as low as possible, is $5.00 per student per year. I hope you take a serious look. Anyone who plays with Khan Academy Kids will see that it is a very joyful app, very interactive, somewhat magical, and it works. \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- سال خان یہاں خان اکیڈمی سے۔ اب آپ میں سے کچھ یا\nامید ہے کہ آپ سب میں سے بہت سے خان اکیڈمی سے واقف ہیں۔ ہم کسی کے لیے بھی، کہیں بھی مفت عالمی معیار کی تعلیم فراہم کرنے کے مشن کے ساتھ غیر منافع بخش ہیں۔ لیکن ایک ایسا شعبہ جس سے لوگ\nشاید کم واقف ہیں، لیکن یہ\nہمارے کام کے بہترین حصوں میں سے ایک ہے خان اکیڈمی کڈز۔ خان اکیڈمی کڈز ایک ایسی ایپ ہے\nجو پری اسکول سے لے کر دوسری جماعت تک کے تمام مضامین کا احاطہ کرتی ہے۔ ہمارے پاس افادیت کے مطالعے ہیں جو یہ ظاہر کرتے ہیں کہ کم از کم 10 ہفتوں میں، طلباء\nون آن ون ٹیوشن کے فوائد دکھا رہے ہیں۔ اور ہم جانتے ہیں کہ یہ کتنا اہم ہے، خاص طور پر جب ہم\nدوسرے یا تیسرے درجے میں جا رہے ہیں، طلباء کے لیے\nپڑھنے جیسی مہارتوں میں روانی حاصل کرنا، ہندسوں جیسی مہارتیں۔ ایک بڑا حصہ جس\nپر ہماری توجہ مرکوز ہے اس بات کو یقینی بنانا ہے کہ اسے اسکول کے ضلع کی ترتیب میں آپ کی مدد کے لیے استعمال کیا جا سکتا ہے۔ ایک پرنسپل کے طور پر، ایک ضلعی رہنما کے طور پر، آپ رپورٹیں حاصل کر سکتے ہیں کہ کیا ہو رہا ہے۔ پراعتماد محسوس کریں کہ آپ کے\nطلباء اپنے معیار کی طرف ترقی کر رہے ہیں۔ اور جب ہم اضلاع کے ساتھ کام کرتے ہیں، تو ہم اسے ہر ممکن حد تک سستی اور قابل رسائی بنانے کی کوشش کرتے ہیں۔ لاگت، جسے ہم نے\nممکنہ حد تک کم رکھنے کی کوشش کی ہے، فی طالب علم فی سال $5.00 ہے۔ مجھے امید ہے کہ آپ سنجیدگی سے دیکھیں گے۔ جو کوئی بھی\nخان اکیڈمی کڈز کے ساتھ کھیلتا ہے وہ دیکھے گا کہ یہ ایک بہت خوش کن ایپ ہے، بہت انٹرایکٹو، کسی حد تک\nجادوئی، اور یہ کام کرتی ہے۔",
    "t_spanish": "- Aquí Sal Khan de Khan Academy. Ahora algunos de ustedes, o\ncon suerte muchos de ustedes, están familiarizados con Khan Academy. Somos una organización sin fines de lucro con la misión de brindar educación gratuita de primer nivel para cualquier persona, en cualquier lugar. Pero un área con la que la gente\nprobablemente esté menos familiarizada, pero que podría ser una de las\nmejores partes de lo que hacemos, es Khan Academy Kids. Khan Academy Kids es una aplicación\nque cubre todas las materias desde preescolar hasta segundo grado. Contamos con estudios de eficacia que muestran que en tan solo 10 semanas, los estudiantes muestran los\nbeneficios de la tutoría individual. Y sabemos lo importante que es, especialmente ahora que estamos\nen segundo o tercer grado, que los estudiantes adquieran fluidez\nen habilidades como la lectura y la aritmética. Una gran parte en la que nos\nenfocamos es en asegurarnos de que pueda usarse para brindarle apoyo en el entorno del distrito escolar. Como director, como líder de distrito, usted puede obtener informes sobre lo que está sucediendo. Siéntase seguro de que sus\nestudiantes están progresando hacia sus estándares. Y cuando trabajamos con los distritos, intentamos que sea lo más asequible y accesible posible. El costo, que hemos tratado\nde mantener lo más bajo posible, es de $5.00 por estudiante por año. Espero que le eches un vistazo serio. Cualquiera que juegue con\nKhan Academy Kids verá que es una aplicación muy divertida, muy interactiva, algo\nmágica y que funciona.",
    "t_arabic": "- سال خان هنا من أكاديمية خان. الآن بعضكم أو\nربما الكثير منكم على دراية بأكاديمية خان. نحن مؤسسة غير ربحية تتمثل مهمتنا في توفير تعليم مجاني على مستوى عالمي لأي شخص في أي مكان. ولكن هناك مجال واحد ربما يكون الناس\nأقل دراية به، ولكنه قد يكون واحدًا من\nأروع الأجزاء في ما نقوم به وهو أكاديمية خان للأطفال. Khan Academy Kids هو تطبيق\nيغطي جميع المجالات الدراسية من مرحلة ما قبل المدرسة حتى الصف الثاني. لدينا دراسات الفعالية التي تظهر أنه في أقل من 10 أسابيع، يظهر الطلاب\nفوائد التدريس الفردي. ونحن نعلم مدى أهمية ذلك، خاصة ونحن\nفي الصف الثاني أو الثالث، أن يتقن الطلاب\nمهارات مثل القراءة، ومهارات مثل الحساب. الجزء الكبير الذي\nنركز عليه هو التأكد من إمكانية استخدامه لدعمك في بيئة المنطقة التعليمية. كمدير، كقائد للمنطقة، يمكنك الحصول على تقارير حول ما يحدث. اشعر بالثقة بأن\nطلابك يحرزون تقدمًا نحو معاييرهم. وعندما نعمل مع المناطق، فإننا نحاول أن نجعلها ميسورة التكلفة ويمكن الوصول إليها قدر الإمكان. التكلفة، التي حاولنا\nإبقاءها منخفضة قدر الإمكان، هي 5.00 دولارات لكل طالب سنويًا. أتمنى أن تنظروا بجدية. أي شخص يلعب مع\nKhan Academy Kids سيرى أنه تطبيق ممتع للغاية، وتفاعلي للغاية، وساحر إلى حد ما\n، وهو يعمل.",
    "t_italian": "- Sono Sal Khan della Khan Academy. Ora alcuni di voi, o\nsi spera molti di voi, hanno familiarità con Khan Academy. Siamo un'organizzazione no-profit con la missione di fornire un'istruzione gratuita di livello mondiale a chiunque, ovunque. Ma un'area con cui le persone\nprobabilmente hanno meno familiarità, ma che potrebbe essere una delle\nparti più interessanti di ciò che facciamo, è Khan Academy Kids. Khan Academy Kids è un'app\nche copre tutte le aree tematiche, dalla scuola materna fino alla seconda elementare. Disponiamo di studi sull'efficacia che dimostrano che in appena 10 settimane gli studenti mostrano i\nvantaggi del tutoraggio individuale. E sappiamo quanto sia importante, soprattutto ora che stiamo entrando nella\nseconda o terza elementare, che gli studenti acquisiscano fluidità\nin abilità come la lettura, abilità come il calcolo. Una parte importante su cui ci\nconcentriamo è garantire che possa essere utilizzato per supportarti in un contesto scolastico. In qualità di preside, in qualità di leader distrettuale, puoi ricevere rapporti su ciò che sta accadendo. Abbi fiducia che i tuoi\nstudenti stiano facendo progressi verso i loro standard. E quando lavoriamo con i distretti, cerchiamo di renderlo il più conveniente e accessibile possibile. Il costo, che abbiamo cercato\ndi mantenere il più basso possibile, è di $ 5,00 per studente all'anno. Spero che tu dia un'occhiata seria. Chiunque giochi con\nKhan Academy Kids vedrà che è un'app molto gioiosa, molto interattiva, un po'\nmagica e funziona."
}