{
    "source": "WUoCSkSW4cs",
    "youtubelink": "https://www.youtube.com/watch?v=WUoCSkSW4cs",
    "t_english": "- Debugging is just a fancy term for fixing errors in programs. It's the process of removing bugs. So we call it, debug. Since it's something we'll be doing often, let's learn how to work together with our IDE to track down and fix bugs in our programs. Here's a program I've been working on to calculate office expenses over the course of a month. You'll notice that there's a linter error over here, so that's probably already a good hint that I have a syntax error somewhere in my program. But before I get too far ahead of myself, lemme just hit run and see what happens. All right, suspicion confirmed. The console says, we have a syntax error. Remember that a syntax error means that our code is invalid Python. The first part of this message is what's called, a stack trace. A stack trace traces or identifies the location in the program where the error originated. The computer's telling us that the error's coming from a file called, \"main.py.\" As we can see over here, this is the name of the file that we're working in. This part then tells us that the error's coming from line two of that file. For our convenience, it copies line two into the stack trace, but we can also go over here in the code editor and look and see, ah, this is line two. This little caret in the stack trace is pointing to this quotation mark character. Same thing with the linter, it's kind of pointing toward the end of the line here. The last line of the error message is the most important, this is where the computer tells you what type of error it is, in this case, a syntax error, and then it makes its best guess at what the cause of the bug is. Now, that guess is not always a 100% correct. You'll have to use your judgment here, but it's usually a good starting place. This error message says, unterminated string literal, naturally error messages tend to be worded in kind of obscure computer speak. So let's try and translate what this means. If you're not familiar with a particular error, sometimes the easiest thing to do is copy and paste that last line of the error message into a search engine and see what other people say. Okay, so I'm looking up unterminated string literal Python, and I see here someone explain it as, when you forget to close the string with a matching quote. Ah, okay, that makes sense. This little caret here is pointing at this quotation mark character, and that's next to another quotation mark character. And so why do I have two? I have mismatched quotation marks, so if I just delete this, then I have a string and then, let me try running it again. Boom, okay, that error message went away and so did the linter error, but now, I have a new error. Let's try debugging this one. Now, this error message just says, invalid syntax. So that means the computer doesn't really have a best guess at what's going on. It says, perhaps I forgot a comma, I don't really understand, why would I want a comma here? I don't know, lemme try putting one in and writing it, that still seems wrong. Okay, I'm gonna undo that. I'm a little stumped on this one and the computer's not really offering much help. So one strategy I can use is to comment this line out. We know that the computer doesn't execute lines of code that are comments. I don't wanna just delete this line 'cause I do wanna fix it at some point, but maybe, I'll come back to it later. So what I can do is stick a comment character, this little hashtag in front of this line to turn it into a comment, and that means when the computer runs the program, it'll now ignore that line of code. Okay, now that I've commented out that line, the linter error jumps to line 14, the lint message says, unexpected token indent. Hmm, okay, that probably means there's something going wrong with my indentation. Lemme just run the program and make sure. Great, okay, the error message agrees there's an indentation error on line 14. Ah, okay, there's a space here. That's what the little red squiggly, the linter is underlining, and there shouldn't be. Everything needs to be lined up with the left margin. So let me just delete this space real quick. Now, I'm seeing a runtime error. I know it's a runtime error because the output from the first few print functions is showing up in the console. That means that the computer started running my program 'cause it ran these first few lines, and it only got stuck when it got to line seven. This is another one where I'm not really sure what this error message means, so I'm gonna try looking it up again. If I browse around for a bit, I'm still not really understanding what people are saying is wrong. Maybe, I just don't have the necessary background context yet. Let me try a different approach then. I'm gonna take a step back and think about what I wanted this line of code to do. Based on the comment above, it seems like I'm trying to add the price of the birthday cake and the price of the keyboard together. Hmm, okay, then I should be adding 34 plus 22.44, but I have kind of two print functions in here, so something is weird. Okay, I need the expression that adds those two floats together to be inside the parentheses and then have a single print function that prints the result of that expression. Got it. Awesome, okay. It looks like my program is now running without an error, but I did comment out that one line before, so let me go back and try and figure that syntax error out. Hmm, okay, now that I'm looking at it again, I noticed that there's something going on with the syntax highlighting, week two expenses is black and it should be green 'cause it should be a string, right? Because I'm trying to print out a string. Ooh, okay, I need quotation marks around this thing. Amazing, okay, I think I have fixed all of the syntax errors and runtime errors. Am I done debugging? Nope, I haven't checked for logic errors yet. Let me step through this output and make sure that the results all make sense to me. Okay, I'm printing out a heading for the report. Then I have miscellaneous expenses, 56, 44, that seems within reason. Week one, expenses, that number seems within reason. Week two, expenses, why are there three decimal places here, that's not a legal price value. Lemme go to the line of the program that's calculating that sum. Ooh, interesting, I have the price, 18.412 here, what is that number supposed to be? Looking back at the utility bill for that week, it looks like that number's supposed to be $184.12 so let me just fix that. Cool, let's continue checking the rest of the output for logic errors. We have week three expenses, and that number looks good, and that's it. My program finally works. Next time though, I should probably remember to run my program as I go. So I never end up with that many errors all at once. Happy debugging. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- پروگراموں میں غلطیوں کو ٹھیک کرنے کے لیے ڈیبگنگ صرف ایک فینسی اصطلاح ہے۔ یہ کیڑے کو دور کرنے کا عمل ہے۔ تو ہم اسے کہتے ہیں، ڈیبگ. چونکہ یہ وہ کام ہے جو ہم اکثر کرتے رہتے ہیں، آئیے سیکھتے ہیں کہ اپنے پروگراموں میں کیڑے کو ٹریک کرنے اور ان کو ٹھیک کرنے کے لیے\nاپنے IDE کے ساتھ مل کر کیسے کام کریں۔ \n یہ ایک پروگرام ہے جس پر میں ایک ماہ کے دوران دفتری اخراجات کا\nحساب لگانے کے لیے کام کر رہا ہوں۔ \n آپ دیکھیں گے کہ\nیہاں ایک لنٹر کی خرابی ہے، لہذا یہ شاید پہلے سے ہی ایک اچھا اشارہ ہے کہ\nمیرے پروگرام میں کہیں نحو کی خرابی ہے۔ لیکن اس سے پہلے کہ میں خود سے بہت آگے نکل جاؤں، لیمے بس دوڑیں اور دیکھیں کہ کیا ہوتا ہے۔ ٹھیک ہے، شک کی تصدیق ہوگئی۔ کنسول کہتا ہے، ہمارے پاس نحو کی خرابی ہے۔ یاد رکھیں کہ نحوی غلطی کا مطلب ہے کہ ہمارا کوڈ غلط Python ہے۔ اس پیغام کا پہلا حصہ وہی ہے جسے کہا جاتا ہے، ایک اسٹیک ٹریس۔ ایک اسٹیک ٹریس پروگرام میں اس جگہ کا سراغ لگاتا ہے یا اس کی نشاندہی کرتا ہے جہاں غلطی کی ابتدا ہوئی تھی۔ کمپیوٹر ہمیں بتا رہا ہے کہ غلطی \"main.py\" نامی فائل سے آ رہی ہے۔ جیسا کہ ہم یہاں دیکھ سکتے ہیں، یہ اس فائل کا نام ہے جس میں ہم کام کر رہے ہیں۔ یہ حصہ پھر ہمیں بتاتا ہے کہ غلطی اس فائل کی لائن دو سے آ رہی ہے۔ ہماری سہولت کے لیے،\nیہ لائن دو کو اسٹیک ٹریس میں کاپی کرتا ہے، لیکن ہم\nیہاں کوڈ ایڈیٹر میں بھی جا سکتے ہیں اور دیکھ سکتے ہیں، آہ، یہ لائن دو ہے۔  اسٹیک ٹریس میں یہ چھوٹا کیریٹ\n اس کوٹیشن مارک کیریکٹر کی طرف اشارہ کر رہا ہے۔ لنٹر کے ساتھ ایک ہی چیز،\nیہ یہاں لائن کے آخر کی طرف اشارہ کرنے کی طرح ہے۔ ایرر میسج کی آخری سطر سب سے اہم ہے، یہ وہ جگہ ہے جہاں کمپیوٹر آپ کو بتاتا ہے کہ یہ\nکس قسم کی خرابی ہے، اس صورت میں، ایک نحوی غلطی ہے، اور پھر وہ اپنا بہترین اندازہ لگاتا ہے کہ بگ کی وجہ کیا ہے۔ اب، یہ اندازہ\nہمیشہ 100% درست نہیں ہوتا۔ آپ کو یہاں اپنا فیصلہ استعمال کرنا پڑے گا، لیکن یہ عام طور پر ایک اچھی شروعات کی جگہ ہے۔ یہ ایرر میسج کہتا ہے،\nغیر ختم شدہ سٹرنگ لٹریل، فطری طور پر ایرر میسجز کو غیر واضح کمپیوٹر اسپیک کے الفاظ میں لکھا جاتا ہے۔ تو آئیے\nاس کا ترجمہ کرنے کی کوشش کریں۔ اگر آپ\nکسی خاص خامی سے واقف نہیں ہیں، تو بعض اوقات سب سے آسان کام یہ ہے کہ غلطی کے پیغام کی آخری سطر کو\n سرچ انجن میں کاپی اور پیسٹ کریں اور دیکھیں کہ دوسرے لوگ کیا کہتے ہیں۔ ٹھیک ہے، تو میں\nغیر ختم شدہ سٹرنگ لٹریل Python تلاش کر رہا ہوں، اور میں دیکھ رہا ہوں کہ یہاں کوئی اس کی وضاحت کرتا ہے، جب آپ سٹرنگ کو مماثل اقتباس کے ساتھ بند کرنا بھول جاتے ہیں۔ آہ، ٹھیک ہے، یہ سمجھ میں آتا ہے. یہاں یہ چھوٹا کیریٹ اس کوٹیشن مارک کریکٹر کی طرف اشارہ کر رہا ہے، اور یہ ایک اور کوٹیشن مارک کریکٹر کے آگے ہے۔ اور تو میرے پاس دو کیوں ہیں؟ میرے پاس کوٹیشن مارکس سے مماثل نہیں ہے، لہذا اگر میں اسے صرف حذف کردوں،\nتو میرے پاس ایک تار ہے اور پھر، مجھے اسے دوبارہ چلانے کی کوشش کرنے دیں۔ بوم، ٹھیک ہے، وہ ایرر میسج چلا گیا اور اسی طرح لنٹر کی خرابی، لیکن اب، میرے پاس ایک نئی خرابی ہے۔ آئیے اس کو ڈیبگ کرنے کی کوشش کریں۔ اب، یہ غلطی کا پیغام\nصرف یہ کہتا ہے، غلط نحو۔ تو اس کا مطلب ہے کہ کمپیوٹر کے پاس واقعی اس کا بہترین اندازہ نہیں ہے کہ کیا ہو رہا ہے۔ یہ کہتا ہے، شاید میں کوما بھول گیا ہوں، میں واقعی میں نہیں سمجھتا، میں یہاں کوما کیوں چاہوں گا؟ مجھے نہیں معلوم، ایک کو ڈال کر لکھنے کی کوشش کریں، یہ اب بھی غلط لگتا ہے۔ ٹھیک ہے، میں اسے کالعدم کرنے والا ہوں۔ میں اس پر تھوڑا سا اسٹمپڈ ہوں اور کمپیوٹر\nواقعی زیادہ مدد کی پیشکش نہیں کر رہا ہے۔ تو ایک حکمت عملی جو میں استعمال کرسکتا ہوں وہ ہے\nاس لائن پر تبصرہ کرنا۔ ہم جانتے ہیں کہ کمپیوٹر کوڈ کی\nلائنوں پر عمل نہیں کرتا جو تبصرے ہیں۔ میں صرف اس لائن کو حذف نہیں کرنا چاہتا کیونکہ میں اسے کسی وقت ٹھیک کرنا چاہتا ہوں، لیکن شاید، میں بعد میں اس پر واپس آؤں گا۔ تو میں کیا کر سکتا ہوں\nایک تبصرہ کریکٹر، اس لائن کے سامنے یہ چھوٹا ہیش ٹیگ اس کو ایک تبصرہ میں تبدیل کرنے کے لیے، اور اس کا مطلب ہے کہ جب\nکمپیوٹر پروگرام چلاتا ہے، اب وہ کوڈ کی اس لائن کو نظر انداز کر دے گا۔ ٹھیک ہے، اب جب کہ میں نے\nاس لائن پر تبصرہ کیا ہے، لنٹر کی خرابی لائن 14 پر چھلانگ لگاتی ہے، لنٹ میسج کہتا ہے، غیر متوقع ٹوکن انڈینٹ۔ ہمم، ٹھیک ہے، اس کا شاید مطلب ہے کہ میرے انڈینٹیشن میں کچھ غلط ہو رہا ہے۔ بس پروگرام چلائیں اور یقینی بنائیں۔ بہت اچھا، ٹھیک ہے، غلطی کا پیغام اس بات سے اتفاق کرتا ہے کہ لائن 14 پر انڈینٹیشن کی خرابی ہے۔ آہ، ٹھیک ہے، یہاں ایک جگہ ہے۔ یہ وہی ہے جو تھوڑا سا سرخ squiggly، لنٹر انڈر لائن کر رہا ہے،\nاور وہاں نہیں ہونا چاہئے. ہر چیز کو\nبائیں مارجن کے ساتھ ترتیب دینے کی ضرورت ہے۔ تو مجھے\nاس جگہ کو فوری ڈیلیٹ کرنے دیں۔ اب، میں رن ٹائم کی خرابی دیکھ رہا ہوں۔ میں جانتا ہوں کہ یہ رن ٹائم کی\nغلطی ہے کیونکہ پہلے چند پرنٹ فنکشنز کا آؤٹ پٹ کنسول میں ظاہر ہو رہا ہے۔ اس کا مطلب یہ ہے کہ\nکمپیوٹر نے میرا پروگرام چلانا شروع کیا کیونکہ اس نے\nیہ پہلی چند لائنیں چلائیں، اور یہ صرف اس وقت پھنس گیا\nجب اس کی لائن سات ہوگئی۔ یہ ایک اور ہے\nجہاں مجھے واقعی یقین نہیں ہے کہ اس غلطی کے پیغام کا کیا مطلب ہے، لہذا میں اسے دوبارہ تلاش کرنے کی کوشش کروں گا۔ اگر میں تھوڑی دیر کے لئے ارد گرد براؤز کرتا ہوں، میں اب بھی واقعی نہیں سمجھ رہا ہوں کہ لوگ کیا کہہ رہے ہیں غلط ہے۔ ہو سکتا ہے، میرے پاس ابھی تک پس منظر کا ضروری سیاق و سباق نہیں ہے۔ پھر مجھے ایک مختلف طریقہ آزمانے دو۔ میں ایک قدم پیچھے ہٹوں گا اور سوچوں گا کہ میں اس لائن آف کوڈ سے کیا کرنا چاہتا تھا۔ اوپر دیئے گئے تبصرے کی بنیاد پر، ایسا لگتا ہے کہ میں سالگرہ کے کیک کی قیمت اور کی بورڈ کی قیمت کو ایک ساتھ شامل کرنے کی کوشش کر رہا ہوں۔ ہمم، ٹھیک ہے، پھر مجھے\n34 جمع 22.44 کا اضافہ کرنا چاہیے، لیکن میرے پاس\nیہاں دو قسم کے پرنٹ فنکشنز ہیں، تو کچھ عجیب ہے۔ ٹھیک ہے، مجھے اس\nاظہار کی ضرورت ہے جو قوسین کے اندر ان دو فلوٹس کو ایک ساتھ جوڑ دے\n اور پھر ایک ہی پرنٹ فنکشن ہو جو اس اظہار کے نتیجے کو پرنٹ کرے۔ یہ مل گیا۔ بہت اچھا، ٹھیک ہے.  ایسا لگتا ہے کہ میرا پروگرام اب بغیر کسی غلطی کے چل رہا ہے، لیکن میں نے اس سے پہلے ایک لائن پر تبصرہ کیا تھا، لہذا\nمجھے واپس جانے دیں اور کوشش کریں اور اس نحوی غلطی کا پتہ لگائیں۔ ہمم، ٹھیک ہے، اب جب میں\nاسے دوبارہ دیکھ رہا ہوں، میں نے محسوس کیا کہ نحو کو نمایاں کرنے کے ساتھ کچھ چل رہا ہے، ہفتے کے دو اخراجات سیاہ ہیں\nاور اسے سبز ہونا چاہیے کیونکہ یہ ایک تار ہونا چاہیے، ٹھیک ہے؟ کیونکہ میں ایک تار پرنٹ کرنے کی کوشش کر رہا ہوں۔ اوہ، ٹھیک ہے، مجھے\nاس چیز کے ارد گرد کوٹیشن مارکس کی ضرورت ہے۔ حیرت انگیز، ٹھیک ہے، مجھے لگتا ہے کہ میں نے نحو کی تمام خرابیاں اور رن ٹائم کی خرابیاں ٹھیک کر دی ہیں۔ کیا میں نے ڈیبگنگ کر لی ہے؟ نہیں، میں نے\nابھی تک منطق کی غلطیوں کی جانچ نہیں کی ہے۔ مجھے اس آؤٹ پٹ کے ذریعے قدم اٹھانے دیں\nاور اس بات کو یقینی بنائیں کہ تمام نتائج میرے لیے معنی خیز ہیں۔ ٹھیک ہے، میں\nرپورٹ کے لیے ایک سرخی پرنٹ کر رہا ہوں۔ پھر میرے پاس متفرق اخراجات ہیں، 56، 44، جو کہ عقل کے مطابق لگتا ہے۔ پہلا ہفتہ، اخراجات، یہ\nتعداد وجہ کے اندر نظر آتی ہے۔ ہفتہ دو، اخراجات، یہاں\nتین اعشاریہ کیوں ہیں ، یہ\nقانونی قیمت نہیں ہے۔ Lemme پروگرام کی لائن پر جائیں جو اس رقم کا حساب لگا رہا ہے۔ اوہ، دلچسپ، میرے پاس قیمت ہے، یہاں 18.412، وہ\nنمبر کیا ہونا چاہیے؟ \nاس ہفتے کے یوٹیلیٹی بل پر نظر ڈالتے ہوئے، ایسا لگتا ہے کہ یہ نمبر $184.12 ہونا چاہیے، لہذا مجھے اسے ٹھیک کرنے دیں۔ اچھا، آئیے منطقی غلطیوں کے لیے باقی آؤٹ پٹ کو چیک کرتے رہیں۔ ہمارے پاس ہفتے کے تین اخراجات ہیں، اور وہ نمبر اچھا لگتا ہے، اور بس۔ میرا پروگرام آخر کار کام کرتا ہے۔ اگرچہ اگلی بار، مجھے\nشاید اپنے پروگرام کو چلانا یاد رکھنا چاہیے جیسے میں جاتا ہوں۔ لہذا میں کبھی بھی اتنی\nساری غلطیوں کو ایک ساتھ ختم نہیں کرتا ہوں۔ ڈیبگنگ مبارک ہو۔",
    "t_spanish": "- Depurar es sólo un término elegante para corregir errores en los programas. Es el proceso de eliminar errores. Por eso lo llamamos depuración. Dado que es algo que haremos con frecuencia, aprendamos cómo trabajar\njunto con nuestro IDE para localizar y corregir\nerrores en nuestros programas. Aquí hay un programa en el que he estado\ntrabajando para calcular los gastos de oficina en\nel transcurso de un mes. Notarás que hay\nun error de linter aquí, por lo que probablemente ya sea un buen indicio de que tengo un error de sintaxis en\nalguna parte de mi programa. Pero antes de adelantarme demasiado, déjame presionar correr y ver qué pasa. Muy bien, se confirmó la sospecha. La consola dice que tenemos un error de sintaxis. Recuerde que un error de sintaxis significa que nuestro código Python no es válido. La primera parte de este mensaje es lo que se llama un seguimiento de pila. Un seguimiento de pila rastrea o identifica la ubicación en el programa donde se originó el error. La computadora nos dice que el error proviene de un archivo llamado \"main.py\". Como podemos ver aquí, este es el nombre del archivo en el que estamos trabajando. Esta parte nos dice que el error proviene de la línea dos de ese archivo. Para nuestra comodidad,\ncopia la línea dos en el seguimiento de la pila, pero\ntambién podemos ir aquí en el editor de código y mirar y ver, ah, esta es la línea dos. Este pequeño signo de intercalación en el\nseguimiento de la pila apunta a este carácter de comillas.  Lo mismo ocurre con el linter,\n aquí apunta hacia el final de la línea. La última línea del mensaje de error es la más importante, aquí es donde la computadora le dice\nqué tipo de error es, en este caso, un error de sintaxis, y luego adivina cuál es la causa del error. Ahora bien, esa suposición no\nsiempre es 100% correcta. Tendrás que usar tu criterio aquí, pero suele ser un buen punto de partida. Este mensaje de error dice,\nliteral de cadena sin terminar, naturalmente los mensajes de error tienden a estar redactados en una especie de lenguaje informático oscuro. Así que intentemos\ntraducir lo que esto significa. Si no está familiarizado\ncon un error en particular, a veces lo más fácil es copiar y pegar la última línea\ndel mensaje de error en un motor de búsqueda y ver lo que dicen otras personas. Bien, estoy\nbuscando Python literal de cadena sin terminar , y veo aquí que alguien lo explica como cuando te olvidas de cerrar la cadena con una comilla coincidente. Ah, está bien, eso tiene sentido. Este pequeño signo de intercalación aquí apunta a este carácter de comillas, y está al lado de otro carácter de comillas.  ¿ Y entonces por qué tengo dos? Tengo comillas que no coinciden, así que si simplemente elimino esto,\nentonces tengo una cadena y luego, déjame intentar ejecutarla nuevamente. Boom, está bien, ese mensaje de error desapareció y también el error de linter, pero ahora tengo un nuevo error. Intentemos depurar este. Ahora, este mensaje de error\nsimplemente dice sintaxis no válida. Eso significa que la computadora realmente no tiene una mejor idea de lo que está sucediendo. Dice, tal vez olvidé una coma, realmente no entiendo, ¿ por qué querría una coma aquí?  No lo sé, déjame intentar poner uno y escribirlo, todavía parece incorrecto. Bien, voy a deshacer eso. Estoy un poco perplejo con esto y la computadora\nrealmente no ofrece mucha ayuda. Entonces, una estrategia que puedo usar\nes comentar esta línea. Sabemos que la computadora\nno ejecuta líneas de código que sean comentarios. No quiero simplemente eliminar esta línea porque quiero arreglarla en algún momento, pero tal vez volveré a ella más tarde. Entonces, lo que puedo hacer es colocar\nun carácter de comentario, este pequeño hashtag delante de esta línea para convertirlo en un comentario, y eso significa que cuando la\ncomputadora ejecute el programa, ahora ignorará esa línea de código. Bien, ahora que he\ncomentado esa línea, el error de linter salta a la línea 14, el mensaje de pelusa dice sangría de token inesperada. Hmm, está bien, eso probablemente significa que algo anda mal con mi sangría. Déjame ejecutar el programa y asegurarte. Genial, está bien, el mensaje de error indica que hay un error de sangría en la línea 14. Ah, está bien, hay un espacio aquí. Eso es lo que subraya el pequeño garabato rojo, la linter,\ny no debería haberlo. Todo debe estar\nalineado con el margen izquierdo. Así que déjame borrar\neste espacio muy rápido. Ahora veo un error de tiempo de ejecución. Sé que es un error de tiempo de ejecución\nporque el resultado de las primeras funciones de impresión aparece en la consola. Eso significa que la\ncomputadora comenzó a ejecutar mi programa porque ejecutó\nestas primeras líneas y solo se atascó\ncuando llegó a la línea siete. Este es otro caso\nen el que no estoy muy seguro de lo que significa este mensaje de error, así que intentaré buscarlo nuevamente. Si busco un poco, todavía no entiendo lo que la gente dice que está mal. Quizás todavía no tengo el contexto necesario. Entonces déjame probar un enfoque diferente. Voy a dar un paso atrás y pensar en lo que quería que hiciera esta línea de código. Según el comentario anterior, parece que estoy intentando sumar el precio del pastel de cumpleaños y el precio del teclado. Hmm, está bien, entonces debería\nagregar 34 más 22,44, pero tengo dos\nfunciones de impresión aquí, así que algo es extraño. Bien, necesito que la\nexpresión que suma esos dos flotantes\nesté dentro del paréntesis y luego tenga una única función de impresión que imprima el resultado de esa expresión. Entiendo. Impresionante, está bien. Parece que mi programa ahora se está ejecutando sin errores, pero comenté esa línea antes, así que\ndéjenme regresar e intentar resolver ese error de sintaxis. Hmm, está bien, ahora que\nlo estoy mirando de nuevo, noté que algo está sucediendo con el resaltado de sintaxis, los gastos de la semana dos son negros\ny deberían ser verdes porque debería ser una cadena, ¿verdad? Porque estoy intentando imprimir una cadena. Oh, está bien, necesito\ncomillas alrededor de esto. Increíble, está bien, creo que he solucionado todos los errores de sintaxis y de tiempo de ejecución.  ¿ Terminé de depurar? No, todavía no he comprobado si hay\nerrores lógicos. Permítanme revisar este\nresultado y asegurarme de que todos los resultados tengan sentido para mí. Bien, estoy imprimiendo un\nencabezado para el informe. Luego tengo gastos varios, 56, 44, que parecen dentro de lo razonable. Semana uno, gastos, ese\nnúmero parece estar dentro de lo razonable. Semana dos, gastos, por qué aquí hay\ntres decimales , ese no es\nun valor de precio legal. Déjame ir a la línea del programa que calcula esa suma. Ooh, interesante, tengo el precio, 18.412 aquí, ¿cuál se\nsupone que es ese número? Mirando hacia atrás en la\nfactura de servicios públicos de esa semana, parece que se supone que ese número es de $184,12, así que déjame arreglar eso. Genial, sigamos comprobando el resto del resultado en busca de errores lógicos. Tenemos gastos de la semana tres y ese número se ve bien, y eso es todo. Mi programa finalmente funciona.  Sin embargo, la próxima vez\nprobablemente debería acordarme de ejecutar mi programa sobre la marcha. Así que nunca termino con\ntantos errores a la vez. Feliz depuración.",
    "t_arabic": "- تصحيح الأخطاء هو مجرد مصطلح فاخر لإصلاح الأخطاء في البرامج. إنها عملية إزالة الأخطاء. لذلك نسميها تصحيح الأخطاء. نظرًا لأنه شيء سنفعله كثيرًا، فلنتعلم كيفية العمل\nمع IDE الخاص بنا لتعقب\nالأخطاء وإصلاحها في برامجنا. إليك برنامج كنت\nأعمل عليه لحساب نفقات المكتب على\nمدار شهر. ستلاحظ وجود\nخطأ في برنامج linter هنا، لذلك ربما يكون هذا بالفعل تلميحًا جيدًا بأن لدي خطأ في بناء الجملة في\nمكان ما في برنامجي. لكن قبل أن أتقدم كثيرًا على نفسي، دعني أركض وأرى ما سيحدث. حسنًا، تم تأكيد الشكوك. تقول وحدة التحكم، لدينا خطأ في بناء الجملة. تذكر أن وجود خطأ في بناء الجملة يعني أن الكود الخاص بنا غير صالح لـ Python. الجزء الأول من هذه الرسالة هو ما يسمى بتتبع المكدس.  يقوم تتبع المكدس بتتبع أو تحديد الموقع في البرنامج الذي نشأ فيه الخطأ. يخبرنا الكمبيوتر أن الخطأ يأتي من ملف يسمى \"main.py\". كما نرى هنا، هذا هو اسم الملف الذي نعمل فيه. يخبرنا هذا الجزء أن الخطأ يأتي من السطر الثاني من هذا الملف. من أجل راحتنا،\nفإنه ينسخ السطر الثاني في تتبع المكدس، ولكن\nيمكننا أيضًا الانتقال هنا في محرر التعليمات البرمجية وننظر ونرى، آه، هذا هو السطر الثاني.  تشير علامة الإقحام الصغيرة هذه في\nتتبع المكدس إلى حرف علامة الاقتباس هذا. نفس الشيء مع اللينتر،\nفهو يشير نوعًا ما نحو نهاية السطر هنا. السطر الأخير من رسالة الخطأ هو الأكثر أهمية، حيث يخبرك الكمبيوتر\nبنوع الخطأ، في هذه الحالة، خطأ في بناء الجملة، ثم يقوم بأفضل تخمين لسبب الخطأ. الآن، هذا التخمين ليس\nدائمًا صحيحًا بنسبة 100%. سيتعين عليك استخدام حكمك هنا، لكنه عادةً ما يكون مكانًا جيدًا للبدء. تقول رسالة الخطأ هذه،\nسلسلة حرفية غير منتهية، ومن الطبيعي أن تتم صياغة رسائل الخطأ بطريقة غامضة في الكمبيوتر. لذلك دعونا نحاول\nترجمة ما يعنيه هذا. إذا لم تكن على دراية\nبخطأ معين، فإن أسهل ما يمكنك فعله في بعض الأحيان هو نسخ السطر الأخير\nمن رسالة الخطأ ولصقه في محرك بحث ومعرفة ما يقوله الآخرون. حسنًا، أنا أبحث عن\nسلسلة Python الحرفية غير المنتهية ، وأرى هنا شخصًا يشرح ذلك، عندما تنسى إغلاق السلسلة باقتباس مطابق. اه، حسنا، هذا منطقي. تشير علامة الإقحام الصغيرة هذه إلى حرف علامة الاقتباس هذا، بجوار حرف علامة الاقتباس الأخرى. فلماذا لدي اثنين؟ لدي علامات اقتباس غير متطابقة، لذا إذا قمت بحذف هذا فقط،\nفسيكون لدي سلسلة وبعد ذلك، دعني أحاول تشغيلها مرة أخرى. حسنًا، لقد اختفت رسالة الخطأ هذه وكذلك خطأ linter، ولكن الآن، لدي خطأ جديد. دعونا نحاول تصحيح هذا واحد. الآن، تقول رسالة الخطأ هذه أن\nبناء الجملة غير صالح. وهذا يعني أن الكمبيوتر ليس لديه أفضل تخمين لما يحدث. تقول، ربما نسيت فاصلة، لا أفهم حقًا، لماذا أريد فاصلة هنا؟ لا أعرف، دعني أحاول إدخال واحدة وكتابتها، لا يزال هذا يبدو خاطئًا. حسنًا، سأقوم بالتراجع عن ذلك. أنا في حيرة من أمري بشأن هذا الأمر ولا\nيقدم الكمبيوتر الكثير من المساعدة حقًا. لذا، إحدى الاستراتيجيات التي يمكنني استخدامها\nهي التعليق على هذا السطر. نحن نعلم أن الكمبيوتر\nلا ينفذ أسطرًا من التعليمات البرمجية التي تكون عبارة عن تعليقات. لا أريد حذف هذا السطر فقط لأنني أريد إصلاحه في وقت ما، لكن ربما سأعود إليه لاحقًا. إذن ما يمكنني فعله هو لصق\nحرف التعليق، هذا الهاشتاج الصغير الموجود أمام هذا السطر لتحويله إلى تعليق، وهذا يعني أنه عندما يقوم\nالكمبيوتر بتشغيل البرنامج، فإنه سيتجاهل الآن هذا السطر من التعليمات البرمجية. حسنًا، الآن بعد أن قمت\nبالتعليق على هذا السطر، ينتقل خطأ الوبر إلى السطر 14، كما تقول رسالة الوبر، مسافة بادئة رمزية غير متوقعة. حسنًا، هذا على الأرجح يعني أن هناك خطأً ما في المسافة البادئة الخاصة بي. Lemme فقط قم بتشغيل البرنامج وتأكد. عظيم، حسنًا، رسالة الخطأ تشير إلى وجود خطأ في المسافة البادئة في السطر 14. آه، حسنًا، هناك مسافة هنا. هذا ما يؤكده الخط الأحمر الصغير المتعرج، \nولا ينبغي أن يكون هناك. كل شيء يجب أن\nيصطف مع الهامش الأيسر. لذلك اسمحوا لي أن أحذف\nهذه المساحة بسرعة كبيرة. الآن، أرى خطأ في وقت التشغيل. أعلم أنه خطأ في وقت التشغيل\nلأن الإخراج من وظائف الطباعة القليلة الأولى يظهر في وحدة التحكم. هذا يعني أن\nالكمبيوتر بدأ تشغيل برنامجي لأنه شغل\nهذه الأسطر القليلة الأولى، ولم يعلق إلا\nعندما وصل إلى السطر السابع. هذه مشكلة أخرى\nلست متأكدًا حقًا مما تعنيه رسالة الخطأ هذه، لذا سأحاول البحث عنها مرة أخرى. إذا قمت بالتصفح قليلاً، فأنا ما زلت لا أفهم حقًا ما يقوله الناس إنه خطأ. ربما، ليس لدي سياق الخلفية اللازم حتى الآن. اسمحوا لي أن أجرب نهجا مختلفا بعد ذلك. سأعود خطوة إلى الوراء وأفكر فيما أردت أن يفعله هذا السطر من التعليمات البرمجية. بناءً على التعليق أعلاه، يبدو أنني أحاول جمع سعر كعكة عيد الميلاد وسعر لوحة المفاتيح معًا. حسنًا، يجب أن أقوم\nبإضافة 34 زائد 22.44، لكن لدي نوعين من\nوظيفتي الطباعة هنا، لذا هناك شيء غريب. حسنًا، أحتاج إلى\nالتعبير الذي يجمع هذين العنصرين معًا\nليكون داخل الأقواس ثم يكون لديه وظيفة طباعة واحدة تطبع نتيجة هذا التعبير. فهمتها. رائع، حسنًا. يبدو أن برنامجي يعمل الآن بدون خطأ، لكنني قمت بالتعليق على هذا السطر من قبل، لذا\nدعني أعود وأحاول اكتشاف هذا الخطأ النحوي. حسنًا، الآن بعد أن\nنظرت إليها مرة أخرى، لاحظت أن هناك شيئًا ما يحدث في تسليط الضوء على بناء الجملة، نفقات الأسبوع الثاني سوداء\nويجب أن تكون خضراء لأنها يجب أن تكون سلسلة، أليس كذلك؟ لأنني أحاول طباعة سلسلة. أوه، حسنًا، أحتاج إلى\nعلامات الاقتباس حول هذا الشيء. مذهل، حسنًا، أعتقد أنني أصلحت جميع الأخطاء النحوية وأخطاء وقت التشغيل.  هل انتهيت من التصحيح؟ كلا، لم أتحقق\nمن الأخطاء المنطقية بعد. اسمحوا لي أن أتطرق إلى هذا\nالناتج وأتأكد من أن النتائج كلها منطقية بالنسبة لي. حسنًا، أنا أطبع\nعنوانًا للتقرير. ثم لدي نفقات متنوعة، 56، 44، والتي تبدو في حدود المعقول. الأسبوع الأول، النفقات،\nيبدو هذا الرقم في حدود المعقول. الأسبوع الثاني، النفقات، لماذا\nتوجد ثلاث منازل عشرية هنا، هذه ليست\nقيمة سعرية قانونية. دعني أذهب إلى سطر البرنامج الذي يحسب هذا المبلغ. أوه، مثير للاهتمام، لدي السعر هنا، 18.412، ما هو هذا\nالرقم المفترض؟ بالنظر إلى\nفاتورة الخدمات لهذا الأسبوع، يبدو أن هذا الرقم من المفترض أن يكون 184.12 دولارًا، لذا دعني أصلح ذلك. رائع، فلنواصل التحقق من بقية النتائج بحثًا عن الأخطاء المنطقية. لدينا نفقات الأسبوع الثالث، وهذا الرقم يبدو جيدًا، وهذا كل شيء. برنامجي يعمل أخيرا. ومع ذلك، في المرة القادمة،\nربما ينبغي لي أن أتذكر تشغيل برنامجي أثناء تقدمي. لذلك لا ينتهي بي الأمر أبدًا إلى ارتكاب\nالعديد من الأخطاء مرة واحدة. تصحيح الأخطاء سعيد.",
    "t_italian": "- Debug è solo un termine elegante per correggere gli errori nei programmi. È il processo di rimozione dei bug. Quindi lo chiamiamo debug. Dato che è qualcosa che faremo spesso, impariamo come lavorare\ninsieme al nostro IDE per rintracciare e correggere i\nbug nei nostri programmi. Ecco un programma\nsu cui ho lavorato per calcolare le spese d'ufficio nel\ncorso di un mese. Noterai che c'è\nun errore di linter qui, quindi probabilmente è già un buon indizio che ho un errore di sintassi\nda qualche parte nel mio programma. Ma prima di andare troppo avanti, lasciami premere \"Corri\" e vedere cosa succede. Va bene, il sospetto è confermato. La console dice che abbiamo un errore di sintassi. Ricorda che un errore di sintassi significa che il nostro codice non è Python valido. La prima parte di questo messaggio è quella che viene chiamata analisi dello stack.  Un'analisi dello stack traccia o identifica la posizione nel programma in cui ha avuto origine l'errore. Il computer ci dice che l'errore proviene da un file chiamato \"main.py\". Come possiamo vedere qui, questo è il nome del file su cui stiamo lavorando. Questa parte poi ci dice che l'errore proviene dalla riga due di quel file. Per nostra comodità,\ncopia la riga due nello stack trace, ma\npossiamo anche andare qui nell'editor del codice e guardare e vedere, ah, questa è la riga due. Questo piccolo cursore nell'analisi dello\nstack punta a questo carattere di virgoletta. Stessa cosa con il linter, qui\npunta verso la fine della riga. L'ultima riga del messaggio di errore è la più importante, è qui che il computer ti dice di\nche tipo di errore si tratta, in questo caso un errore di sintassi, e poi fa la sua ipotesi migliore su quale sia la causa del bug. Ora, questa ipotesi non è\nsempre corretta al 100%. Dovrai usare il tuo giudizio qui, ma di solito è un buon punto di partenza. Questo messaggio di errore dice,\nstringa letterale senza terminazione, naturalmente i messaggi di errore tendono ad essere formulati in una sorta di oscuro linguaggio informatico. Allora proviamo a\ntradurre cosa significa. Se non hai familiarità\ncon un errore particolare, a volte la cosa più semplice da fare è copiare e incollare l'ultima riga\ndel messaggio di errore in un motore di ricerca e vedere cosa dicono gli altri. Ok, quindi sto\ncercando Python letterale di stringa senza terminazione , e vedo qui qualcuno che lo spiega come, quando ti dimentichi di chiudere la stringa con una virgoletta corrispondente. Ah, ok, ha senso. Questo piccolo segno qui punta a questo carattere virgoletta, che è accanto a un altro carattere virgoletta. E allora perché ne ho due? Ho virgolette non corrispondenti, quindi se lo elimino,\nho una stringa e quindi provo a eseguirla di nuovo. Boom, okay, il messaggio di errore è scomparso, così come l'errore linter, ma ora ho un nuovo errore. Proviamo a eseguire il debug di questo. Ora, questo messaggio di errore\ndice semplicemente: sintassi non valida. Ciò significa che il computer non ha la migliore ipotesi su cosa sta succedendo. Dice, forse ho dimenticato una virgola, non capisco davvero, perché dovrei volere una virgola qui?  Non lo so, provo a inserirne uno e a scriverlo, mi sembra comunque sbagliato. Ok, lo annullerò. Sono un po' perplesso su questo e il computer non\noffre molto aiuto. Quindi una strategia che posso usare\nè commentare questa riga. Sappiamo che il computer\nnon esegue righe di codice che siano commenti. Non voglio semplicemente cancellare questa riga perché voglio sistemarla prima o poi, ma forse ci tornerò più tardi. Quindi quello che posso fare è inserire\nun carattere di commento, questo piccolo hashtag davanti a questa riga per trasformarlo in un commento, e ciò significa che quando il\ncomputer esegue il programma, ignorerà quella riga di codice. Ok, ora che ho\ncommentato quella riga, l'errore linter passa alla riga 14, il messaggio lint dice, rientro del token inaspettato. Hmm, okay, probabilmente significa che c'è qualcosa che non va con il mio rientro. Fammi solo eseguire il programma e assicurati. Ottimo, ok, il messaggio di errore concorda che c'è un errore di rientro sulla riga 14. Ah, ok, c'è uno spazio qui. Questo è ciò che il piccolo segno rosso, la lanugine sottolinea,\ne non dovrebbe esserci. Tutto deve essere\nallineato con il margine sinistro. Quindi permettimi di eliminare\nquesto spazio molto velocemente. Ora vedo un errore di runtime. So che si tratta di un\nerrore di runtime perché l'output delle prime funzioni di stampa viene visualizzato nella console. Ciò significa che il\ncomputer ha iniziato a eseguire il mio programma perché eseguiva\nqueste prime righe e si è bloccato solo\nquando è arrivato alla riga sette. Questo è un altro caso\nin cui non sono sicuro del significato del messaggio di errore, quindi proverò a cercarlo di nuovo. Se giro un po' in giro, non riesco ancora a capire cosa la gente dice che è sbagliato. Forse semplicemente non ho ancora il contesto di base necessario. Allora provo un approccio diverso. Farò un passo indietro e penserò a cosa volevo che facesse questa riga di codice. Sulla base del commento sopra, sembra che io stia cercando di sommare insieme il prezzo della torta di compleanno e il prezzo della tastiera. Hmm, okay, allora dovrei\naggiungere 34 più 22,44, ma ho due\nfunzioni di stampa qui, quindi c'è qualcosa di strano. Ok, ho bisogno che l'\nespressione che somma questi due numeri in virgola mobile\nsia racchiusa tra parentesi e quindi avere un'unica funzione di stampa che stampi il risultato di quell'espressione. Fatto. Fantastico, ok. Sembra che il mio programma ora sia in esecuzione senza errori, ma ho già commentato quella riga, quindi\nlasciami tornare indietro e provare a capire l'errore di sintassi. Hmm, okay, ora che\nlo guardo di nuovo, ho notato che c'è qualcosa che non va con l'evidenziazione della sintassi, le spese della seconda settimana sono nere\ne dovrebbero essere verdi perché dovrebbe essere una stringa, giusto? Perché sto cercando di stampare una stringa. Ooh, okay, ho bisogno di\nvirgolette attorno a questa cosa. Incredibile, okay, penso di aver corretto tutti gli errori di sintassi e di runtime. Ho finito il debug? No, non ho\nancora controllato gli errori logici. Vorrei esaminare questo\noutput e assicurarmi che tutti i risultati abbiano senso per me. Ok, sto stampando l'\nintestazione del rapporto. Poi ho spese varie, 56, 44, che sembrano ragionevoli. Settimana uno, spese, quel\nnumero sembra ragionevole. Settimana due, spese, perché qui ci\nsono tre cifre decimali , non è\nun valore di prezzo legale. Andiamo alla riga del programma che calcola quella somma. Ooh, interessante, ho il prezzo, 18.412 qui, quale\ndovrebbe essere quel numero? Ripensando alla\nbolletta di quella settimana, sembra che quella cifra dovrebbe essere $ 184,12, quindi lasciami aggiustare il problema. Bene, continuiamo a controllare il resto dell'output per eventuali errori logici. Abbiamo le spese della terza settimana e quel numero sembra buono, e questo è tutto.  Il mio programma finalmente funziona.  La prossima volta, però,\nprobabilmente dovrei ricordarmi di eseguire il mio programma mentre procedo. Quindi non finisco mai con così\ntanti errori tutti in una volta. Buon debugging."
}