{
    "source": "Yn7ICU3Q4mE",
    "youtubelink": "https://www.youtube.com/watch?v=Yn7ICU3Q4mE",
    "t_english": "- [Instructor] Our Earth's surface temperature is somewhere close to 15 degrees Celsius, nice, cozy, and warm for us living beings. But what keeps us so warm? Well, my instinctive answer is that it's the sun, right? But it actually gets more interesting. Our atmosphere has these gases called the greenhouse gases. There's nothing green about them, okay? The name has just stuck. And they have something called the greenhouse effect on our planet. And turns out that if we didn't have these gases, then even with the sun shining as much as it does, the temperature on our Earth would have been way below zero degrees Celsius. So along with the sun, we have to thank the greenhouse gases because they're the ones that warm up our planet. But how do they do that? What exactly is the greenhouse effect? Well, let's find out. Let's start by thinking about what would be our temperature if there was no atmosphere and there was no sun, then the Earth would have the coldest temperature we can think of, very close to absolute zero, which is -273 degrees Celsius. But now if you put the sun, the light shining on the Earth gets absorbed by the Earth, the energy from the light gets converted into thermal energy, and now the Earth will start warming up. But does that mean its temperature will now keep rising indefinitely because there's continuous light that's shining on the Earth? No, because every object that has any temperature will start radiating light. We call this thermal radiation, and that way it starts losing energy, but at very low temperatures. The thermal radiation is not much. So the Earth is not losing a lot of energy per second. It's still gaining a lot more energy per second, which means its temperature will keep rising for some time, but as its temperature rises, it'll start losing even more energy to thermal radiation. So you can see where you're going with this, at some particular temperature, the Earth's thermal radiation will be so high that the energy that lost will be exactly equal to energy gained, and we will now have thermal equilibrium, the temperature will no longer rise. And by the way, this would be the average temperature because the side that's facing the sun would be much hotter, and the side that's away from the sun would be much colder, the spinning, so it's a dynamic system, but on an average, that temperature will be very, very low without an atmosphere. And by the way, don't think that Earth is only radiating on this side, Earth is radiating all around. It's just a way, it's just a depiction. But now that brings us to the question, what happens when we add an atmosphere along with the greenhouse gases? What do they do? Well, they have very interesting effect on both the incoming and the outgoing light. But before we get into the nitty gritty, let's oversimplify a little bit so that we can get the big picture idea of what's really going on. Then we'll dive into the details. The big thing to understand is that the greenhouse gases are mostly sensitive to infrared radiation. So the incoming light from the sun is pretty much visible light. Therefore, the greenhouse gases have pretty much no effect on it so nothing changes over here. However, the light that is being radiated by the Earth is infrared radiation. Why is that? Well, that's because thermal radiation purely depends on the temperature. At very low temperatures, like what we'd have over here, the radiation would be pretty much all infrared. And now the greenhouse gases, they will absorb these thermal radiations. And what do they do when they absorb? Well, just like how an atom absorbs, the radiation gets excited and then it'll re-emit it, just like that, these greenhouse gases will re-emit these radiations, but in all the directions, that's the key idea. And so some of the radiation will go back into space like before, but some of the radiation will come back to the Earth. And as a result, look at what has happened. Because of this, the outgoing radiation now has reduced, as a result, it's no longer in equilibrium. Now the Earth and the atmosphere, the whole system is gaining more energy than it is losing, and that's how the temperature of the planet will start rising. But again, will it keep rising indefinitely? No, just like before, as the temperature rises, Earth will start radiating even more infrared radiation and eventually at some particular temperature, again, the outgoing radiation will equal the incoming radiation per second, and we'll have a new equilibrium, but that new equilibrium will be at a much higher temperature, and that temperature happens to be at where we are. And that's how the greenhouse gases warm the globe by trapping the infrared radiation. So that's how they cause global warming, which is a good thing because we want our Earth to be warm. But now the big question is, what happens if we add even more greenhouse gases due to human activity? What will that do? Does it significantly affect the climate anymore? Well, to answer that question, we now have to dig into the details. So let's do that. A couple of details that we wanna talk about is, first of all, what really happens to the incoming radiation? How does it interact with the atmosphere? Why do the greenhouse gases absorb infrared radiation in the first place? And then finally, we'll try to understand what would happen if we were to increase the greenhouse gases, like what we've been doing due to human activity. Our first over simplification was assuming that the light, all the light that reaches the Earth, warms up the Earth. But that's not true at all because a lot of light actually interacts with the atmosphere. And just to help us see that, here is the spectrum of the sunlight, at the top of our atmosphere you can see that it nicely follows, it's very close to the black body radiation spectrum that we talked about in one of our previous videos. So you can see that a lot of light is in the visible region. Some of it is in the UV and some of it is in the infrared region as well. But now let's look at the spectrum of the light that eventually reaches the ground. You ready? Here goes. Look at that, it's not the same spectrum. There's a lot of light that has been absorbed. So let's look at some of them. First of all, let's look at the light that is absorbed in the visible region. Who's absorbing it? Where is it going? Well, most of the light is actually being scattered by our atmosphere. And because of scattering, a lot of light goes back into space, which doesn't reach the ground. And some of that light does reach the ground, which is why we see the the sky to be blue. We see the clouds to be white, they also scatter light. So a lot of light is actually lost to scattering. The second part we can see is there is a lot of light that's being absorbed in the UV region. Which one is that? You can probably guess it. That's our ozone. Ozone absorbs a lot of high frequency, high energy UV light and ensures it doesn't reaches the ground, which is great, otherwise that will be bad for us. And then in the infrared region also, you can see a lot of sharp absorptions happening. Who's causing that? All these are the greenhouse gases. We said that they are very sensitive and they absorb infared radiation. Well, incoming light also has some infrared radiation, and so they absorb them as well. And so look, a lot of light has already been absorbed, which has not reached the ground. But even there, not all of that light will warm up the Earth because some of the light will be reflected back into space by the clouds itself. And that's why you can see the cloud from space itself. And then of the rest of the light that reaches the ground, again, some of that light will be reflected by the Earth's surface. The surface is covered with ice or snow, they are highly reflective. We say there are high albedo surfaces. They will not absorb a lot of light, they'll just reflect a lot of light back into space. Okay, what about the remaining light that falls on the low albedo surfaces which are less reflective? There, it gets absorbed. What happens there? Well, even there, not all of it is used up in warming up the Earth. Some of it that falls on the water, for example, is used up in evaporating the water. And so the energy is carried away by the evaporating water. Some of it which falls on the greenery is photosynthesized and gets converted into chemical energy. And finally, the rest of the light that reaches the ground, which is not absorbed, not reflected, not scattered, which is not photosynthesized, which is not used in evaporation, it's finally that portion of light that heats up the Earth. This detail, as we will see, will be important for us in understanding how climate may change. But anyways, because of Earth's temperature, it gives out thermal radiation. And at this temperature, thermal radiation is primarily in the infrared region. And now if there were no greenhouse gases, this would've escaped to Earth, sorry, escaped to space, and the Earth would've cooled down pretty quickly. But because we have greenhouse gases, they absorb a lot of these radiation, not all of them, remember, it's all wavelength dependent, some of the wavelengths do escape back into space, but a lot of these will be absorbed by the greenhouse gases. And then when they re-emit it, a lot of that actually gets redirected back to Earth. And as we discussed earlier, that's basically how the greenhouse gases heat up the Earth. But now comes the big question. Why do they absorb infrared radiation? What's so special about them? Well, there's actually nothing special about them. It's just that because they're made up of different bonds and these bonds can vibrate, these atoms can wiggle in different ways. For example, this is a water molecule. Here are some ways in which the molecule can wiggle, it can wiggle by stretching, it can wiggle by stretching this way, asymmetrically, it can also wiggle when the bonds bend. And it turns out that the wiggling frequency of most of these molecules lie in the infrared region, it just happens to be that. And therefore, when light of that specific frequency, the light which has the frequency which is equal to the wiggling frequency, happens to fall on them, they will absorb it and wiggle and eventually rerelease that radiation. But wait a second, wait a second. What about oxygen and nitrogen molecules? Even they should be able to wiggle, right? But why doesn't the infrared radiation make them wiggle? Ah, here's the thing. All electromagnetic waves are made of electric and magnetic fields. And if you want to interact with these fields, you need to have some kind of charges. But where are the charges anywhere? They're all neutral molecules, right? Yes, but because the greenhouse gases are, these molecules are made of atoms, different atoms bonded, the electrons are shared not equally between them. And as a result, they will have some charge separation. For example, when it comes to water, oxygen pulls the electrons, the shared electrons more towards itself compared to the hydrogen, and therefore they have, the oxygen side will have slight negative charge compared to the hydrogen. We call such molecules dipoles. Now, in some cases, like in the water molecule, this is a permanent effect. While in some other cases, like in the methane or carbon dioxide, the effect is temporary and only appears while wiggling. But the point is, because there's a charge separation, they can interact, electric fields can interact with these molecules, and that's why they can absorb the infrared radiation. But oxygen and nitrogen molecules are made of the same atoms. So the electrons are shared perfectly symmetrically between them, and therefore they will not have any charge separation, even when they're wiggling, and that's why they'll not be able to observe infrared radiation and it just goes straight through. This is why 99% of our atmosphere does not cause greenhouse effect. And so what I find now fascinating is that this means because some of the molecules in our atmosphere, less than 1% of the molecules because they share the electrons asymmetrically between the atoms, is eventually what's responsible for global warming. That is unreal if you think about it. Oh my God. But that is what it is, is it? It all boils down to this. That finally brings up the question, what would happen if we add even more greenhouse gases? This is not a hypothetical scenario at all. Since the industrialization, there is evidence that the greenhouse gases concentration has increased. So what's the effect of that? Well, at first, the answer sounds pretty obvious. If there are more greenhouse gases, there'll be more absorption, and as a result, the Earth will heat up even more. But the question is how much? And just to give you a glimpse of how complicated the system is and how so many variables are involved, think about this. Let's say the Earth heats up slightly, but as a result of that slight heating up from the direct addition of more greenhouses, some of the ice can melt, that can reduce the high albedo surface that we have, and that could now increase the amount of sunlight that we absorb, further increasing the temperature of the Earth. That could also increase the amount of evaporation that happens, increasing the amount of water molecules, increasing the amount of greenhouse gases even more, which further will heat up the Earth. And there can be now a runaway effect. So you see what I'm talking about? The runaway effect not only dramatically can increase the temperature of the planet, but it can dramatically change climates. It can dramatically change your ecosystem, which could be catastrophic. So the big question would be, at what levels of concentration these runaway effects will start kicking in? And I don't think we should try and find out the hard way. Of course, on one hand, we should try and do as much theoretical calculations as we can. But on the other hand, prevention is the best cure. And that's why we should try and prevent it as much as possible and that's why we talk about reducing our carbon footprint. A few ways of doing that could be slowly transitioning from burning fossil fuels to maybe using solar power, wind energy, and of course using nuclear power. Other ways could be making our transportation and our other processes more efficient. Now, of course, there are a ton of challenges, economical, technological, even political. And so I don't think we can solve this problem just by being extremists over here. We have to be smart about it. We need to have critical debates around it, because at the end of the day, we are talking about the future of our species.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "t_urdu": "- [انسٹرکٹر] ہماری زمین کی\nسطح کا درجہ حرارت کہیں 15 ڈگری سیلسیس کے قریب ہے، ہمارے جانداروں کے لیے اچھا، آرام دہ اور گرم ہے۔ لیکن کیا چیز ہمیں اتنی گرم رکھتی ہے؟ ٹھیک ہے، میرا فطری جواب یہ ہے\nکہ یہ سورج ہے، ٹھیک ہے؟ لیکن یہ اصل میں زیادہ دلچسپ ہو جاتا ہے. ہمارے ماحول میں یہ گیسیں ہیں جنہیں\nگرین ہاؤس گیسز کہتے ہیں۔ ان کے بارے میں کچھ بھی سبز نہیں ہے، ٹھیک ہے؟ نام تو ابھی اٹک گیا ہے۔ اور ان کے پاس ہمارے سیارے پر\nگرین ہاؤس اثر کہتے ہیں۔ اور پتہ چلا کہ اگر ہمارے\nپاس یہ گیسیں نہ ہوتیں تو سورج\nجتنا چمکتا ہے تب بھی ہماری زمین کا درجہ حرارت\n صفر ڈگری سینٹی گریڈ سے نیچے ہوتا۔ لہذا سورج کے ساتھ ساتھ، ہمیں\nگرین ہاؤس گیسوں کا شکریہ ادا کرنا ہوگا کیونکہ یہ وہی ہیں\nجو ہمارے سیارے کو گرم کرتی ہیں۔ لیکن وہ ایسا کیسے کرتے ہیں؟ گرین ہاؤس اثر بالکل کیا ہے\n؟  اچھا، آئیے معلوم کرتے ہیں۔ آئیے یہ سوچ کر شروع کریں کہ\n اگر ماحول نہ ہو\nاور سورج نہ ہو تو ہمارا درجہ حرارت کیا ہوگا، تو زمین کا\nسرد ترین درجہ حرارت ہوگا جس کے بارے میں ہم سوچ سکتے ہیں،\nمطلق صفر کے بالکل قریب، جو کہ -273 ڈگری سیلسیس ہے۔ لیکن اب اگر آپ سورج کو لگاتے ہیں تو زمین پر چمکنے والی روشنی\nزمین سے جذب ہو جاتی ہے، روشنی سے حاصل ہونے والی توانائی تھرمل انرجی میں تبدیل ہو جاتی ہے اور اب زمین گرم ہونا شروع ہو جائے گی۔ لیکن کیا اس کا مطلب یہ ہے کہ اب اس کا\nدرجہ حرارت غیر معینہ مدت تک بڑھتا رہے گا کیونکہ\n زمین پر مسلسل روشنی چمک رہی ہے؟ نہیں، کیونکہ ہر وہ شے جس کا کوئی بھی درجہ حرارت ہو\nروشنی پھیلنا شروع کر دے گی۔ ہم اسے تھرمل ریڈی ایشن کہتے ہیں، اور اس طرح یہ توانائی کھونے لگتا ہے، لیکن بہت کم درجہ حرارت پر۔ تھرمل تابکاری زیادہ نہیں ہے۔ لہذا زمین\nفی سیکنڈ بہت زیادہ توانائی نہیں کھو رہی ہے۔ یہ اب بھی\nفی سیکنڈ بہت زیادہ توانائی حاصل کر رہا ہے، جس کا مطلب ہے کہ اس کا درجہ حرارت\nکچھ وقت کے لیے بڑھتا رہے گا، لیکن جیسے جیسے اس کا درجہ حرارت بڑھتا جائے گا، یہ تھرمل ریڈی ایشن کے لیے اور بھی زیادہ توانائی کھونے لگے گا۔\n لہذا آپ دیکھ سکتے ہیں کہ\nآپ اس کے ساتھ کہاں جا رہے ہیں، کسی خاص درجہ حرارت پر، زمین کی حرارتی\nتابکاری اتنی زیادہ ہوگی کہ ضائع ہونے والی توانائی بالکل حاصل شدہ توانائی کے برابر ہوگی، اور اب ہمارے پاس تھرمل توازن ہوگا، درجہ حرارت کم ہوگا۔  طویل اضافہ. اور ویسے، یہ\nاوسط درجہ حرارت ہوگا کیونکہ سورج کی طرف جس طرف کا سامنا ہے وہ\nبہت زیادہ گرم ہو گا، اور وہ طرف جو سورج سے دور ہے\nزیادہ ٹھنڈا ہو گا، گھوم رہا ہے، اس لیے یہ ایک متحرک نظام ہے، لیکن اوسطاً،  وہ\nدرجہ حرارت ماحول کے بغیر بہت، بہت کم ہوگا۔ اور ویسے یہ مت سوچیں کہ زمین صرف اس طرف شعاعیں کر رہی ہے، زمین چاروں طرف پھیل رہی ہے۔ یہ صرف ایک طریقہ ہے، یہ صرف ایک عکاسی ہے۔ لیکن اب یہ ہمیں اس سوال کی طرف لاتا ہے کہ جب ہم گرین ہاؤس گیسوں کے ساتھ ماحول کو شامل کرتے ہیں تو کیا ہوتا ہے ؟ جو کچھ وہ کیا کرتے ہیں؟ ٹھیک ہے، وہ\nآنے والی اور باہر جانے والی روشنی دونوں پر بہت دلچسپ اثر رکھتے ہیں۔ لیکن اس سے پہلے کہ ہم نفاست پسندی میں پڑیں، آئیے تھوڑا سا آسان بنائیں تاکہ ہم واقعی کیا ہو رہا ہے اس کی بڑی تصویر کا خیال حاصل کر سکیں۔ پھر ہم تفصیلات میں غوطہ لگائیں گے۔ سمجھنے کی بڑی بات یہ ہے کہ گرین ہاؤس گیسیں\nزیادہ تر انفراریڈ تابکاری کے لیے حساس ہوتی ہیں۔ لہذا سورج سے آنے والی روشنی بہت زیادہ نظر آنے والی روشنی ہے۔ لہذا، گرین ہاؤس گیسوں کا اس پر کوئی اثر نہیں ہوتا ہے لہذا یہاں کچھ بھی تبدیل نہیں ہوتا ہے۔ تاہم، زمین سے جو روشنی پھیل رہی ہے وہ انفراریڈ ریڈی ایشن ہے۔ ایسا کیوں ہے؟ ٹھیک ہے، اس کی وجہ یہ ہے کہ تھرمل تابکاری خالصتاً درجہ حرارت پر منحصر ہے۔ بہت کم درجہ حرارت پر،\nجیسا کہ ہمارے پاس یہاں ہے، تابکاری\nبہت زیادہ اورکت ہوگی۔ اور اب گرین ہاؤس گیسیں، وہ ان تھرمل شعاعوں کو جذب کر لیں گی۔ اور جب وہ جذب کرتے ہیں تو کیا کرتے ہیں؟ ٹھیک ہے، جس طرح ایک ایٹم جذب کرتا ہے، تابکاری پرجوش ہو جاتی ہے اور پھر وہ اسے دوبارہ خارج کرے گی، بالکل اسی طرح، یہ گرین ہاؤس گیسیں\nان شعاعوں کو دوبارہ خارج کریں گی، لیکن تمام سمتوں میں،\nیہی اہم خیال ہے۔ اور اس طرح کچھ شعاعیں پہلے کی طرح\nخلا میں واپس چلی جائیں گی، لیکن کچھ تابکاری زمین پر واپس آ جائیں گی۔ اور نتیجتاً دیکھیں کہ\nکیا ہوا ہے۔ اس کی وجہ سے، باہر جانے والی\nتابکاری اب کم ہو گئی ہے، نتیجے کے طور پر، یہ\nاب توازن میں نہیں ہے۔ اب زمین اور ماحول، پورا نظام\nکھونے سے زیادہ توانائی حاصل کر رہا ہے، اور یوں کرہ\nارض کا درجہ حرارت بڑھنا شروع ہو جائے گا۔ لیکن پھر، کیا یہ\nغیر معینہ مدت تک بڑھتا رہے گا؟ نہیں، بالکل پہلے کی طرح، جیسے جیسے\nدرجہ حرارت بڑھتا ہے، زمین\nاور بھی زیادہ انفراریڈ شعاعیں خارج کرنا شروع کر دے گی اور آخر کار کسی\nخاص درجہ حرارت پر، ایک بار پھر، باہر جانے والی تابکاری آنے والی\nتابکاری فی سیکنڈ کے برابر ہو جائے گی، اور ہمارے پاس ایک نیا توازن ہو گا، لیکن وہ  نیا توازن بہت زیادہ درجہ حرارت پر ہوگا، اور وہ درجہ حرارت وہاں ہوگا\nجہاں ہم ہیں۔ اور اس طرح گرین ہاؤس\nگیسیں اورکت شعاعوں کو پھنس کر دنیا کو گرم کرتی ہیں۔  اس طرح وہ گلوبل وارمنگ کا سبب بنتے ہیں، جو کہ اچھی بات ہے کیونکہ ہم چاہتے ہیں کہ ہماری زمین گرم رہے۔ لیکن اب بڑا سوال یہ ہے کہ اگر ہم\n انسانی سرگرمیوں کی وجہ سے گرین ہاؤس گیسوں میں مزید اضافہ کریں تو کیا ہوگا؟ وہ کیا کرے گا؟  کیا \nاب یہ آب و ہوا کو نمایاں طور پر متاثر کرتا ہے؟ ٹھیک ہے، اس سوال کا جواب دینے کے لئے، ہمیں اب تفصیلات میں کھودنا ہوگا. تو آئیے ایسا کرتے ہیں۔ کچھ تفصیلات جن کے بارے میں\nہم بات کرنا چاہتے ہیں، سب سے پہلے،\nآنے والی تابکاری کا واقعی کیا ہوتا ہے؟ یہ ماحول کے ساتھ کیسے تعامل کرتا ہے؟ گرین ہاؤس گیسیں پہلی جگہ\nاورکت شعاعوں کو کیوں جذب کرتی ہیں ؟ اور پھر آخر میں، ہم یہ سمجھنے کی کوشش کریں گے کہ اگر ہم گرین ہاؤس گیسوں میں اضافہ کریں گے تو کیا ہوگا، جیسا کہ ہم\nانسانی سرگرمیوں کی وجہ سے کر رہے ہیں۔ ہماری پہلی اوور سادگی یہ\nفرض کر رہی تھی کہ روشنی، تمام روشنی جو\nزمین تک پہنچتی ہے، زمین کو گرم کرتی ہے۔ لیکن یہ بالکل درست نہیں ہے کیونکہ بہت ساری روشنی دراصل ماحول کے ساتھ تعامل کرتی ہے۔ اور صرف یہ دیکھنے میں ہماری مدد کرنے کے لیے، یہاں سورج کی روشنی کا سپیکٹرم ہے، ہمارے ماحول کے اوپری حصے میں آپ دیکھ سکتے ہیں کہ یہ اچھی طرح سے پیروی کرتا ہے، یہ بلیک\nباڈی ریڈی ایشن سپیکٹرم کے بہت قریب ہے جس کے بارے میں ہم نے\nاپنی پچھلی ویڈیوز میں سے ایک میں بات کی تھی۔ تو آپ دیکھ سکتے ہیں کہ نظر آنے والے علاقے میں بہت زیادہ روشنی ہے۔  اس میں سے کچھ UV میں ہے اور اس میں سے کچھ\nاورکت والے خطے میں بھی ہے۔ لیکن اب\nروشنی کے اس سپیکٹرم کو دیکھتے ہیں جو آخر کار زمین تک پہنچتا ہے۔ تم تیار ہو؟  یہ لو۔ اسے دیکھو، یہ ایک ہی سپیکٹرم نہیں ہے۔ بہت سی روشنی ہے\nجو جذب ہو چکی ہے۔ تو آئیے ان میں سے کچھ کو دیکھتے ہیں۔ سب سے پہلے اس روشنی کو دیکھتے ہیں جو نظر آنے والے خطے میں جذب ہوتی ہے۔ اسے کون جذب کر رہا ہے؟  یہ کہاں جا رہا ہے؟ ٹھیک ہے، زیادہ تر روشنی\nدراصل ہمارے ماحول سے بکھر رہی ہے۔ اور بکھرنے کی وجہ سے بہت سی روشنی خلا میں واپس چلی جاتی ہے جو زمین تک نہیں پہنچ پاتی۔ اور اس میں سے کچھ روشنی\nزمین تک پہنچ جاتی ہے، جس کی وجہ سے ہم\nآسمان کو نیلا دیکھتے ہیں۔ ہم بادلوں کو سفید ہوتے دیکھتے ہیں،\nوہ روشنی بھی بکھیرتے ہیں۔ تو بہت سی روشنی\nدراصل بکھرنے سے ضائع ہو جاتی ہے۔ دوسرا حصہ جو ہم دیکھ سکتے ہیں وہ یہ ہے کہ\nبہت ساری روشنی ہے جو UV خطے میں جذب ہو رہی ہے۔  وہ کون سا ہے؟  آپ\nشاید اس کا اندازہ لگا سکتے ہیں۔ یہ ہمارا اوزون ہے۔ اوزون بہت زیادہ ہائی\nفریکوئنسی، ہائی انرجی UV لائٹ جذب کرتا ہے اور اس بات کو یقینی بناتا ہے کہ یہ زمین تک نہ پہنچے،\nجو کہ بہت اچھا ہے، ورنہ یہ ہمارے لیے برا ہوگا۔ اور پھر انفراریڈ خطے میں بھی، آپ بہت زیادہ تیز جذب ہوتے دیکھ سکتے ہیں۔\n اس کا سبب کون ہے؟  یہ سب\nگرین ہاؤس گیسیں ہیں۔ ہم نے کہا کہ وہ بہت حساس ہوتے ہیں اور وہ infared تابکاری کو جذب کرتے ہیں۔ ٹھیک ہے، آنے والی روشنی میں بھی\nکچھ اورکت شعاعیں ہوتی ہیں، اور اس لیے وہ انہیں بھی جذب کرتی ہیں۔ اور تو دیکھو، بہت سی روشنی\nپہلے ہی جذب ہو چکی ہے، جو زمین تک نہیں پہنچی ہے۔ لیکن وہاں بھی، وہ ساری\nروشنی زمین کو گرم نہیں کرے گی کیونکہ کچھ روشنی خود بادلوں کے ذریعے\nخلا میں منعکس ہو جائے گی۔ اور اسی لیے آپ\nبادل کو خلا سے ہی دیکھ سکتے ہیں۔ اور پھر باقی\nروشنی جو زمین تک پہنچتی ہے، اس میں سے کچھ\nروشنی زمین کی سطح سے منعکس ہو گی۔ سطح برف یا برف سے ڈھکی ہوئی ہے، وہ انتہائی عکاس ہیں۔ ہم کہتے ہیں کہ ہائی البیڈو سطحیں ہیں۔ وہ بہت زیادہ روشنی کو جذب نہیں کریں گے، وہ صرف بہت ساری\nروشنی کو خلا میں واپس منعکس کریں گے۔ ٹھیک ہے، باقی روشنی کا کیا ہوگا جو کم البیڈو سطحوں پر پڑتی ہے جو کم عکاس ہوتی ہیں؟ وہاں، یہ جذب ہو جاتا ہے.\nوہاں کیا ہوتا ہے؟ ٹھیک ہے، یہاں تک کہ، یہ سب\nزمین کو گرم کرنے میں استعمال نہیں ہوتا ہے۔  اس میں سے کچھ جو پانی پر گرتا ہے،\nمثال کے طور پر، پانی کو بخارات بنانے میں استعمال ہوتا ہے۔ اور یوں توانائی\nبخارات بنتے ہوئے پانی سے بہہ جاتی ہے۔  اس میں سے کچھ جو ہریالی پر گرتا ہے\nفوٹو سنتھیسائز ہوتا ہے اور کیمیائی توانائی میں تبدیل ہو جاتا ہے۔ اور آخر کار، باقی\nروشنی جو زمین تک پہنچتی ہے، جو جذب نہیں ہوتی،\nمنعکس نہیں ہوتی، بکھری نہیں ہوتی، جو فوٹو سنتھیسائز نہیں ہوتی، جو بخارات میں استعمال نہیں ہوتی، یہ روشنی کا وہ حصہ ہے\nجو زمین کو گرم کرتا ہے۔ یہ تفصیل، جیسا کہ ہم دیکھیں گے،\nہمارے لیے یہ سمجھنے میں اہم ہو گا کہ موسم کیسے بدل سکتا ہے۔ لیکن ویسے بھی،\nزمین کے درجہ حرارت کی وجہ سے، یہ تھرمل ریڈی ایشن دیتا ہے۔ اور اس درجہ حرارت پر تھرمل تابکاری بنیادی طور پر\nاورکت والے خطے میں ہوتی ہے۔ اور اب اگر گرین ہاؤس گیسیں نہ ہوتیں تو یہ زمین کی طرف فرار ہو جاتی،\nافسوس، خلا میں فرار ہو جاتی، اور زمین\nبہت تیزی سے ٹھنڈی ہو جاتی۔ لیکن چونکہ ہمارے پاس گرین ہاؤس گیسیں ہیں، وہ ان میں سے بہت سی تابکاری کو جذب کرتی ہیں، ان میں سے سبھی نہیں، یاد رکھیں،\nیہ تمام طول موج پر منحصر ہے، کچھ طول موجیں\nواپس خلا میں فرار ہو جاتی ہیں، لیکن ان میں سے بہت ساری\nگرین ہاؤس گیسیں جذب ہو جائیں گی۔ اور پھر جب وہ اسے دوبارہ خارج کرتے ہیں، تو اس میں سے بہت کچھ دراصل\nزمین پر واپس چلا جاتا ہے۔ اور جیسا کہ ہم نے پہلے بات کی ہے، بنیادی طور پر یہ ہے کہ\nگرین ہاؤس گیسیں زمین کو کس طرح گرم کرتی ہیں۔ لیکن اب بڑا سوال آتا ہے۔ وہ انفراریڈ تابکاری کیوں جذب کرتے ہیں؟ ان میں کیا خاص بات ہے؟ ٹھیک ہے، اصل میں\nان کے بارے میں کچھ خاص نہیں ہے. یہ صرف اتنا ہے کہ وہ\nمختلف بانڈز سے بنے ہیں اور یہ بانڈز ہل سکتے ہیں، یہ ایٹم مختلف طریقوں سے ہل سکتے ہیں۔ مثال کے طور پر، یہ پانی کا مالیکیول ہے۔ یہ کچھ طریقے ہیں جن میں\nمالیکیول ہل سکتا ہے، یہ کھینچ کر ہل سکتا ہے، یہ\nاس طرح کھینچ کر ہل سکتا ہے، غیر متناسب طور پر، جب بانڈز موڑتے ہیں تو یہ بھی ہل سکتا ہے۔ اور یہ پتہ چلتا ہے کہ ان میں سے زیادہ تر مالیکیولز کی\nہلتی ہوئی فریکوئنسی انفراریڈ خطے میں ہوتی ہے،\nبس ایسا ہی ہوتا ہے۔ اور اس وجہ سے، جب\nاس مخصوص فریکوئنسی کی روشنی، وہ روشنی جس کی فریکوئنسی جو ہلنے والی فریکوئنسی کے برابر ہوتی ہے، ان پر گرتی ہے، تو وہ\nاسے جذب کر لیتے ہیں اور ہل جائیں گے اور آخر کار اس تابکاری کو دوبارہ چھوڑ دیں گے۔ لیکن ایک سیکنڈ انتظار کرو، ایک سیکنڈ انتظار کرو. آکسیجن اور نائٹروجن مالیکیولز کے بارے میں کیا خیال ہے؟ یہاں تک کہ انہیں ہلنے کے قابل ہونا چاہئے، ٹھیک ہے؟ لیکن انفراریڈ\nتابکاری انہیں ہلچل کیوں نہیں دیتی؟ آہ، بات یہ ہے۔ تمام برقی مقناطیسی لہریں\nبرقی اور مقناطیسی شعبوں سے بنی ہیں۔ اور اگر آپ\nان شعبوں کے ساتھ تعامل کرنا چاہتے ہیں، تو آپ کو کچھ قسم کے چارجز لینے کی ضرورت ہے۔ لیکن الزامات کہاں ہیں؟ وہ تمام غیر جانبدار مالیکیولز ہیں، ٹھیک ہے؟ ہاں، لیکن چونکہ گرین ہاؤس گیسیں ہیں، یہ مالیکیول ایٹموں سے بنے ہیں، مختلف ایٹموں سے جڑے ہوئے ہیں، الیکٹران ان کے\nدرمیان برابر نہیں ہیں۔ اور نتیجے کے طور پر، ان کے\nپاس کچھ چارج علیحدگی ہوگی. مثال کے طور پر، جب پانی کی بات آتی ہے، آکسیجن الیکٹرانوں کو کھینچتی ہے، مشترکہ الیکٹران ہائیڈروجن کے مقابلے میں اپنی طرف زیادہ ہوتے ہیں، اور اس لیے ان کے پاس آکسیجن کی طرف ہائیڈروجن کے مقابلے میں\nمعمولی منفی چارج ہوگا۔ ہم ایسے مالیکیولز کو ڈوپول کہتے ہیں۔ اب، کچھ معاملات میں، جیسے\nپانی کے مالیکیول میں، یہ ایک مستقل اثر ہے۔ جبکہ کچھ دیگر\nمعاملات میں، جیسے میتھین یا کاربن ڈائی آکسائیڈ میں، اثر عارضی ہوتا ہے اور صرف ہلتے ہوئے ظاہر ہوتا ہے۔ لیکن بات یہ ہے کہ چونکہ چارج کی\nعلیحدگی ہے، وہ تعامل کر سکتے ہیں، برقی میدان\nان مالیکیولز کے ساتھ تعامل کر سکتے ہیں، اور اسی وجہ سے وہ\nانفراریڈ تابکاری کو جذب کر سکتے ہیں۔ لیکن آکسیجن اور نائٹروجن کے مالیکیول ایک ہی ایٹم سے بنے ہیں۔ لہذا الیکٹران ان کے درمیان بالکل ہم آہنگی کے ساتھ اشتراک کیے جاتے ہیں، اور اس وجہ سے ان میں\nچارج کی علیحدگی نہیں ہوگی، یہاں تک کہ جب وہ ہل رہے ہوں، اور اسی وجہ سے وہ انفراریڈ تابکاری کا مشاہدہ نہیں کر پائیں گے اور یہ سیدھے راستے سے گزرتا ہے۔ یہی وجہ ہے کہ ہماری فضا کا 99 فیصد حصہ گرین ہاؤس اثر کا سبب نہیں بنتا۔ اور اس لیے مجھے اب جو چیز\nدلچسپ لگتی ہے وہ یہ ہے کہ اس کا مطلب ہے کہ\nہماری فضا میں کچھ مالیکیولز، مالیکیولز کا 1% سے بھی کم اس لیے کہ وہ ایٹموں کے درمیان\nالیکٹران کو غیر متناسب طور پر بانٹتے ہیں، آخر کار\nگلوبل وارمنگ کا ذمہ دار ہے۔ اگر آپ\nاس کے بارے میں سوچتے ہیں تو یہ غیر حقیقی ہے۔  یا الله۔ لیکن یہ وہی ہے، کیا\nیہ ہے؟  یہ سب اس پر ابلتا ہے۔ اس سے آخر کار سوال پیدا ہوتا ہے، اگر ہم\nمزید گرین ہاؤس گیسیں شامل کریں تو کیا ہوگا؟ یہ بالکل فرضی منظرنامہ نہیں ہے۔\n صنعت کاری کے بعد سے، اس بات کا ثبوت موجود ہے کہ گرین ہاؤس گیسوں کی\nتعداد میں اضافہ ہوا ہے۔ تو اس کا اثر کیا ہے؟ ٹھیک ہے، سب سے پہلے، جواب\nبہت واضح لگتا ہے. اگر گرین ہاؤس گیسیں زیادہ ہوں گی، تو زیادہ جذب ہو جائے گا، اور اس کے نتیجے میں، زمین\nاور زیادہ گرم ہو جائے گی۔ لیکن سوال یہ ہے کہ کتنا؟ اور صرف آپ کو یہ بتانے کے لیے کہ نظام کتنا پیچیدہ ہے اور کتنے متغیرات شامل ہیں، اس کے بارے میں سوچیں۔ ہم کہتے ہیں کہ زمین قدرے گرم ہوتی ہے، لیکن مزید گرین ہاؤسز کے براہ راست اضافے سے اس ہلکی گرمی کے نتیجے میں، \n کچھ برف پگھل سکتی ہے، جو\nہمارے پاس موجود اونچی البیڈو سطح کو کم کر سکتی ہے، اور اب اس کی مقدار میں اضافہ ہو سکتا ہے۔  سورج کی روشنی جسے ہم جذب کرتے ہیں، \nزمین کے درجہ حرارت میں مزید اضافہ کرتے ہیں۔ اس سے بخارات کی مقدار میں بھی اضافہ ہوسکتا ہے\n جو ہوتا ہے،\nپانی کے مالیکیولز کی مقدار میں اضافہ، \nگرین ہاؤس گیسوں کی مقدار میں مزید اضافہ، جو زمین کو مزید گرم کردے گی۔ اور اب ایک بھگوڑا اثر ہوسکتا ہے۔ تو آپ دیکھ رہے ہیں کہ میں کس کے بارے میں بات کر رہا ہوں؟ بھاگنے کا اثر نہ صرف\nڈرامائی طور پر کرہ ارض کے درجہ حرارت کو بڑھا سکتا ہے بلکہ یہ آب و ہوا کو ڈرامائی طور پر تبدیل کر سکتا ہے۔ یہ آپ کے ماحولیاتی نظام کو ڈرامائی طور پر تبدیل کر سکتا ہے، جو تباہ کن ہو سکتا ہے۔ تو بڑا سوال یہ ہوگا کہ ارتکاز کی کس سطح پر\nیہ بھاگنے والے اثرات شروع ہو جائیں گے؟ اور مجھے نہیں لگتا کہ ہمیں\nکوشش کرنی چاہیے اور مشکل راستہ تلاش کرنا چاہیے۔ بلاشبہ، ایک طرف، ہمیں کوشش کرنی چاہیے اور جتنا\nہو سکے نظریاتی حساب کتاب کرنا چاہیے۔ لیکن دوسری طرف،\nروک تھام بہترین علاج ہے۔ اور اسی لیے ہمیں کوشش کرنی چاہیے اور اسے ہر ممکن حد تک روکنا چاہیے اور اسی لیے ہم\nاپنے کاربن فوٹ پرنٹ کو کم کرنے کی بات کرتے ہیں۔ ایسا کرنے کے چند طریقے\n جیواشم ایندھن کو جلانے سے\nشاید شمسی توانائی، ہوا کی توانائی، اور یقیناً\nجوہری توانائی کے استعمال کی طرف منتقل ہو سکتے ہیں۔ دوسرے طریقے\nہماری نقل و حمل اور ہمارے دوسرے عمل کو زیادہ موثر بنا سکتے ہیں۔ اب، یقیناً، بہت\nسارے چیلنجز ہیں، اقتصادی، تکنیکی، یہاں تک کہ سیاسی۔ اور اس لیے مجھے نہیں لگتا کہ ہم یہاں صرف انتہاپسند ہو کر\nاس مسئلے کو حل کر سکتے ہیں۔ ہمیں اس کے بارے میں ہوشیار رہنا ہوگا۔ ہمیں\nاس کے ارد گرد تنقیدی بحثیں کرنے کی ضرورت ہے، کیونکہ دن کے اختتام پر، ہم\nاپنی نسل کے مستقبل کے بارے میں بات کر رہے ہیں۔",
    "t_spanish": "- [Instructor] La temperatura de la superficie de nuestra Tierra\n ronda los 15 grados centígrados, agradable, acogedora y cálida para nosotros los seres vivos.  ¿ Pero qué nos mantiene tan calientes? Bueno, mi respuesta instintiva\nes que es el sol, ¿verdad? Pero en realidad se vuelve más interesante. Nuestra atmósfera tiene estos gases\nllamados gases de efecto invernadero. No tienen nada de verde, ¿vale? El nombre simplemente se quedó. Y tienen algo\nllamado efecto invernadero en nuestro planeta. Y resulta que si\nno tuviéramos estos gases, incluso con el sol\nbrillando tanto, la temperatura en nuestra\nTierra habría sido muy inferior a cero grados Celsius. Entonces, junto con el sol, tenemos\nque agradecer a los gases de efecto invernadero porque son los\nque calientan nuestro planeta.  ¿ Pero cómo hacen eso?  ¿ Qué es exactamente el\nefecto invernadero?  Bueno, averigüémoslo. Empecemos pensando en\ncuál sería nuestra temperatura si no hubiera atmósfera\ny no hubiera sol, entonces la Tierra tendría\nla temperatura más fría que podamos imaginar, muy\ncercana al cero absoluto que es -273 grados centígrados. Pero ahora, si pones el sol, la luz que brilla sobre la Tierra\nes absorbida por la Tierra, la energía de la luz se convierte en energía térmica y ahora la Tierra comenzará a calentarse. Pero, ¿eso significa que su\ntemperatura seguirá aumentando indefinidamente porque\nhay luz continua brillando sobre la Tierra? No, porque todo objeto que tenga cualquier temperatura\nempezará a irradiar luz.  A esto lo llamamos radiación térmica, y así empieza a perder energía, pero a temperaturas muy bajas. La radiación térmica no es mucha. Entonces la Tierra no pierde\nmucha energía por segundo. Todavía está ganando mucha\nmás energía por segundo, lo que significa que su temperatura\nseguirá aumentando durante algún tiempo, pero a medida que suba, comenzará a perder aún más\nenergía debido a la radiación térmica. Entonces puedes ver a dónde\nvas con esto, a una temperatura particular, la radiación térmica de la Tierra\nserá tan alta que la energía perdida será exactamente igual a la energía ganada, y ahora tendremos equilibrio térmico, la temperatura no  subida más larga. Y por cierto, esta\nsería la temperatura promedio porque el lado que mira hacia\nel sol sería mucho más caliente, y el lado que está alejado del\nsol sería mucho más frío, el giro, por lo que es un sistema dinámico, pero en promedio,  esa\ntemperatura será muy, muy baja sin atmósfera. Y, por cierto, no crean que la Tierra sólo está irradiando de este lado, la Tierra está irradiando por todos lados. Es sólo una manera, es sólo una representación. Pero ahora eso nos lleva a la pregunta: ¿ qué sucede cuando añadimos una atmósfera junto con los gases de efecto invernadero?  ¿ Qué hacen? Bueno, tienen un efecto muy interesante\ntanto en la luz entrante como en la saliente. Pero antes de entrar en el meollo de la cuestión, simplifiquemos un poco para que podamos tener una idea general de lo que realmente está sucediendo. Luego profundizaremos en los detalles. Lo más importante que hay que entender es que los gases de efecto invernadero\nson en su mayoría sensibles a la radiación infrarroja. Entonces, la luz entrante del sol es prácticamente luz visible. Por lo tanto, los gases de efecto invernadero prácticamente no tienen ningún efecto sobre él, por lo que nada cambia aquí. Sin embargo, la luz que irradia la Tierra es radiación infrarroja.  ¿ Porqué es eso? Bueno, eso se debe a que la radiación térmica depende puramente de la temperatura. A temperaturas muy bajas,\ncomo las que tendríamos aquí, la radiación sería\nprácticamente toda infrarroja. Y ahora los gases de efecto invernadero absorberán estas radiaciones térmicas.  ¿ Y qué hacen cuando absorben? Bueno, así como un átomo absorbe, la radiación se excita y luego la reemite, así como así, estos gases de efecto invernadero\nreemitirán estas radiaciones, pero en todas las direcciones,\nesa es la idea clave. Y entonces parte de la radiación\nregresará al espacio como antes, pero parte de la radiación regresará a la Tierra. Y como resultado, mira\nlo que ha sucedido. Debido a esto, la\nradiación saliente ahora se ha reducido y, como resultado, ya no está\nen equilibrio. Ahora la Tierra y la atmósfera, todo el sistema, está ganando\nmás energía de la que pierde, y así es como la\ntemperatura del planeta empezará a subir. Pero, de nuevo, ¿seguirá\naumentando indefinidamente? No, al igual que antes, a medida que\nla temperatura aumenta, la Tierra comenzará a irradiar\naún más radiación infrarroja y eventualmente a una\ntemperatura particular, nuevamente, la radiación saliente será igual a la\nradiación entrante por segundo, y tendremos un nuevo equilibrio, pero eso  El nuevo equilibrio estará a una temperatura mucho más alta, y esa temperatura resulta\nestar donde estamos. Y así es como los gases de efecto invernadero\ncalientan el planeta al atrapar la radiación infrarroja.  Así es como causan el calentamiento global, lo cual es bueno porque queremos que nuestra Tierra esté caliente. Pero ahora la gran pregunta es: ¿ qué pasa si añadimos\naún más gases de efecto invernadero debido a la actividad humana?  ¿ Qué hará eso?  ¿ \nAfecta significativamente al clima? Bueno, para responder a esa pregunta, ahora tenemos que profundizar en los detalles. Así que hagamos eso. Un par de detalles de los que\nqueremos hablar son, en primer lugar, ¿qué sucede realmente\ncon la radiación entrante?  ¿ Cómo interactúa con la atmósfera?  ¿ Por qué los gases de efecto invernadero\nabsorben radiación infrarroja ? Y finalmente, intentaremos comprender qué pasaría si incrementáramos los gases de efecto invernadero, como lo que hemos estado haciendo\ndebido a la actividad humana. Nuestra primera simplificación excesiva\nfue suponer que la luz, toda la luz que llega a\nla Tierra, calienta la Tierra. Pero eso no es del todo cierto porque mucha luz interactúa con la atmósfera. Y solo para ayudarnos a ver eso, aquí está el espectro de la luz solar, en la parte superior de nuestra atmósfera pueden ver que sigue muy bien, está muy cerca del\nespectro de radiación del cuerpo negro del que hablamos en\nuno de nuestros videos anteriores. Entonces puedes ver que hay mucha luz en la región visible. Parte está en los rayos ultravioleta y otra parte también en la\nregión infrarroja. Pero ahora miremos\nel espectro de la luz que eventualmente llega al suelo.  ¿ Estás listo?  Aquí va. Mira eso, no es el mismo espectro. Hay mucha luz\nque ha sido absorbida. Así que veamos algunos de ellos.  En primer lugar, observemos la luz que se absorbe en la región visible.  ¿ Quién lo está absorbiendo?  ¿A dónde va? Bueno, la mayor parte de la luz en\nrealidad es dispersada por nuestra atmósfera. Y debido a la dispersión, mucha luz regresa al espacio y no llega al suelo. Y parte de esa luz\nllega al suelo, razón por la cual vemos\nel cielo azul. Vemos que las nubes son blancas y\ntambién dispersan la luz.  Por lo tanto, en\nrealidad se pierde mucha luz debido a la dispersión. La segunda parte que podemos ver\nes que hay mucha luz absorbida en la región ultravioleta.  ¿ Cual es ese?\nProbablemente puedas adivinarlo. Ese es nuestro ozono.  El ozono absorbe una gran cantidad de\nluz ultravioleta de alta frecuencia y alta energía y garantiza que no llegue\nal suelo, lo cual es fantástico; de lo contrario, será perjudicial para nosotros. Y luego, también en la región infrarroja, se pueden ver muchas\nabsorciones nítidas.  ¿ Quién está causando eso?  Todos estos\nson los gases de efecto invernadero. Dijimos que son muy sensibles y absorben la radiación infrarroja. Bueno, la luz entrante también\ntiene algo de radiación infrarroja, por lo que también la absorben.  Y mira, ya se ha absorbido mucha luz\n que no ha llegado al suelo. Pero incluso allí, no toda esa\nluz calentará la Tierra porque parte de la luz\nserá reflejada de regreso al espacio por las propias nubes. Y es por eso que puedes ver\nla nube desde el mismo espacio. Y luego, del resto de la\nluz que llega al suelo, parte de esa\nluz será reflejada por la superficie de la Tierra. La superficie está cubierta de hielo o nieve, son muy reflectantes. Decimos que hay superficies de alto albedo. No absorberán mucha luz, solo reflejarán mucha\nluz hacia el espacio. Bien, ¿qué pasa con la luz restante que cae sobre las superficies de bajo albedo que son menos reflectantes? Allí se absorbe.  ¿\nQué pasa allí? Bueno, incluso allí, no todo se utiliza\npara calentar la Tierra. Una parte que cae sobre\nel agua, por ejemplo, se utiliza para evaporar el agua. Y así la energía es\narrastrada por el agua que se evapora. Una parte que cae sobre la\nvegetación se fotosintetiza y se convierte en energía química. Y finalmente, el resto de la\nluz que llega al suelo, que no se absorbe, no se\nrefleja, no se dispersa, no se fotosintetiza, no se utiliza en la evaporación, es finalmente esa porción de\nluz que calienta la Tierra. Este detalle, como veremos,\nserá importante para comprender cómo puede cambiar el clima. Pero de todos modos, debido\na la temperatura de la Tierra, emite radiación térmica. Y a esta temperatura, la radiación térmica se produce principalmente\nen la región infrarroja. Y ahora, si no hubiera gases de efecto invernadero, esto habría escapado a la\nTierra, lo siento, habría escapado al espacio, y la Tierra se habría\nenfriado bastante rápido. Pero debido a que tenemos gases de efecto invernadero, absorben mucha de esta radiación, no toda, recuerden,\ntodo depende de la longitud de onda, algunas de las longitudes de onda\nescapan de regreso al espacio, pero muchas de ellas serán\nabsorbidas por los gases de efecto invernadero. Y luego, cuando lo reemiten, gran parte de él es\nredirigido de regreso a la Tierra. Y como comentamos anteriormente, así es básicamente como los\ngases de efecto invernadero calientan la Tierra. Pero ahora viene la gran pregunta.  ¿ Por qué absorben la radiación infrarroja?  ¿ Qué tienen de especial? Bueno, en realidad\nno tienen nada de especial. Es sólo que debido a que están\nformados por diferentes enlaces y estos enlaces pueden vibrar, estos átomos pueden moverse de diferentes maneras. Por ejemplo, esta es una molécula de agua. Aquí hay algunas formas en las que\nla molécula puede moverse, puede moverse estirándose, puede moverse estirándose de\nesta manera, asimétricamente, también puede moverse cuando los enlaces se doblan. Y resulta que\nla frecuencia de movimiento de la mayoría de estas moléculas se encuentra en la región infrarroja,\nsimplemente resulta ser eso. Y por lo tanto, cuando la luz\nde esa frecuencia específica, la luz que tiene la frecuencia que es igual a la frecuencia de movimiento, cae sobre ellos,\nla absorberán, se moverán y eventualmente volverán a liberar esa radiación. Pero espera un segundo, espera un segundo.  ¿ Qué pasa con las moléculas de oxígeno y nitrógeno? Incluso ellos deberían poder moverse, ¿verdad? Pero ¿por qué la radiación infrarroja no\nlos hace moverse? Ah, aquí está la cosa. Todas las ondas electromagnéticas\nestán formadas por campos eléctricos y magnéticos. Y si quieres\ninteractuar con estos campos, necesitas tener algún tipo de cargos.  ¿ Pero dónde están los cargos? Todas son moléculas neutras, ¿verdad? Sí, pero debido a que los gases de efecto invernadero son, estas moléculas están hechas de átomos, diferentes átomos están unidos, los electrones\nno se comparten por igual entre ellos. Y como resultado,\ntendrán cierta separación de cargas. Por ejemplo, cuando se trata de agua, el oxígeno atrae los electrones, los electrones compartidos más hacia sí mismos en comparación con el hidrógeno y, por lo tanto, el lado del oxígeno tendrá una\nligera carga negativa en comparación con el hidrógeno.  A estas moléculas las llamamos dipolos. Ahora bien, en algunos casos, como\nen la molécula de agua, este es un efecto permanente. Mientras que en algunos otros\ncasos, como en el metano o el dióxido de carbono, el efecto es temporal y sólo aparece mientras se contonea. Pero el punto es que, debido a que hay una\nseparación de carga, pueden interactuar, los campos eléctricos pueden interactuar\ncon estas moléculas y es por eso que pueden\nabsorber la radiación infrarroja. Pero las moléculas de oxígeno y nitrógeno están formadas por los mismos átomos. Entonces, los electrones se comparten perfectamente simétricamente entre ellos y, por lo tanto, no\ntendrán ninguna separación de carga, incluso cuando se estén moviendo, y es por eso que no podrán observar la radiación infrarroja y simplemente pasará directamente a través de ellos.  Por eso el 99% de nuestra atmósfera no provoca efecto invernadero. Y lo que ahora encuentro\nfascinante es que esto significa que algunas de las\nmoléculas en nuestra atmósfera, menos del 1% de las moléculas porque comparten los\nelectrones asimétricamente entre los átomos, son eventualmente las\nresponsables del calentamiento global. Eso es irreal si lo\npiensas.  Ay dios mío. Pero eso es lo que es, ¿\nverdad?  Todo se reduce a esto. Eso finalmente plantea la pregunta: ¿ qué pasaría si añadimos\naún más gases de efecto invernadero? Este no es un\nescenario hipotético en absoluto. Desde la industrialización, hay evidencia de que la concentración de gases de efecto invernadero\nha aumentado. Entonces, ¿cuál es el efecto de eso? Bueno, al principio la respuesta\nparece bastante obvia. Si hay más gases de efecto invernadero, habrá más absorción y, como resultado, la Tierra se\ncalentará aún más. Pero la pregunta es ¿cuánto? Y sólo para darle una idea de lo complicado que es el sistema y cuántas variables están involucradas, piense en esto. Digamos que la Tierra se calienta ligeramente, pero como resultado de ese ligero calentamiento por la adición directa\nde más invernaderos, parte del hielo puede derretirse, lo que puede reducir la\nsuperficie de alto albedo que tenemos, y eso ahora podría aumentar la cantidad.  de luz solar que absorbemos, aumentando aún más la\ntemperatura de la Tierra. Eso también podría aumentar\nla cantidad de evaporación que ocurre, aumentando la\ncantidad de moléculas de agua, aumentando aún más la cantidad de\ngases de efecto invernadero, lo que calentará aún más la Tierra. Y ahora puede haber un efecto desbocado.  ¿ Ves entonces de lo que estoy hablando? El efecto desbocado no sólo\npuede aumentar dramáticamente la temperatura del planeta, sino que también puede cambiar dramáticamente los climas. Puede cambiar drásticamente su ecosistema, lo que podría ser catastrófico. Entonces, la gran pregunta sería: ¿ a qué niveles de concentración comenzarán a aparecer\nestos efectos desbocados ? Y no creo que debamos\nintentar descubrirlo por las malas. Por supuesto, por un lado, deberíamos intentar hacer tantos\ncálculos teóricos como podamos. Pero por otro lado, la\nprevención es la mejor cura. Y por eso deberíamos intentar prevenirlo en la medida de lo posible y por eso hablamos de\nreducir nuestra huella de carbono. Algunas formas de hacerlo\npodrían ser pasar lentamente de la quema de combustibles fósiles\nal uso de energía solar, energía eólica y, por supuesto,\nenergía nuclear. Otras formas podrían ser\nhacer que nuestro transporte y otros procesos sean más eficientes. Ahora, por supuesto, hay\nmuchísimos desafíos, económicos, tecnológicos e incluso políticos.  Por eso no creo que\npodamos resolver este problema simplemente siendo extremistas aquí. Tenemos que ser inteligentes al respecto. Necesitamos tener\ndebates críticos al respecto, porque al final del día, estamos hablando del\nfuturo de nuestra especie.",
    "t_arabic": "- [المدرس]\nدرجة حرارة سطح الأرض تقترب من 15 درجة مئوية، وهي لطيفة ومريحة ودافئة بالنسبة لنا نحن الكائنات الحية. لكن ما الذي يبقينا دافئين إلى هذا الحد؟ حسنًا، جوابي الغريزي\nهو أنها الشمس، أليس كذلك؟ لكنها في الواقع تصبح أكثر إثارة للاهتمام. يحتوي غلافنا الجوي على هذه الغازات التي\nتسمى الغازات الدفيئة. لا يوجد شيء أخضر فيها، حسنًا؟ الاسم عالق للتو. ولديهم ما\nيسمى بظاهرة الاحتباس الحراري على كوكبنا. وتبين أنه إذا\nلم يكن لدينا هذه الغازات، فحتى مع\nسطوع الشمس بنفس القدر، لكانت درجة الحرارة على أرضنا\n أقل بكثير من الصفر درجة مئوية. لذا، جنبًا إلى جنب مع الشمس، علينا\nأن نشكر الغازات الدفيئة لأنها هي التي تعمل على\nتدفئة كوكبنا. ولكن كيف يفعلون ذلك؟ ما هو بالضبط تأثير الاحتباس الحراري\n؟  حسنا، دعونا معرفة ذلك. لنبدأ بالتفكير في\nدرجة الحرارة التي ستكون عليها درجة حرارتنا إذا لم يكن هناك غلاف جوي ولم\nتكن هناك شمس، فستكون للأرض\nأبرد درجة حرارة يمكن أن نفكر فيها،\nقريبة جدًا من الصفر المطلق، وهو -273 درجة مئوية. لكن الآن إذا وضعت الشمس، فإن الأرض تمتص الضوء الساطع على\nالأرض، وتتحول الطاقة الصادرة عن الضوء إلى طاقة حرارية، والآن ستبدأ الأرض في التسخين. لكن هل هذا يعني أن\nدرجة حرارته ستستمر في الارتفاع إلى أجل غير مسمى بسبب\nوجود ضوء مستمر يسطع على الأرض؟ لا، لأن كل جسم له أي درجة حرارة\nسيبدأ في إشعاع الضوء. نحن نسمي هذا الإشعاع الحراري، وبهذه الطريقة يبدأ بفقدان الطاقة، ولكن عند درجات حرارة منخفضة جدًا. الإشعاع الحراري ليس كثيرا. وبالتالي فإن الأرض لا تفقد\nالكثير من الطاقة في الثانية الواحدة. لا يزال يكتسب الكثير\nمن الطاقة في الثانية، مما يعني أن درجة حرارته\nستستمر في الارتفاع لبعض الوقت، ولكن مع ارتفاع درجة حرارته، سيبدأ في فقدان المزيد من\nالطاقة بسبب الإشعاع الحراري. لذا يمكنك أن ترى إلى أين\nستتجه بهذا، عند درجة حرارة معينة، \nسيكون الإشعاع الحراري للأرض مرتفعًا جدًا بحيث تكون الطاقة المفقودة مساوية تمامًا للطاقة المكتسبة، وسيكون لدينا الآن توازن حراري، ولن تكون درجة الحرارة  ارتفاع أطول. وبالمناسبة، هذا\nسيكون متوسط ​​درجة الحرارة لأن الجانب الذي يواجه\nالشمس سيكون أكثر سخونة، والجانب البعيد عن\nالشمس سيكون أكثر برودة، الدوران، لذا فهو نظام ديناميكي، ولكن في المتوسط،\nستكون درجة الحرارة هذه منخفضة جدًا جدًا بدون غلاف جوي. وبالمناسبة، لا تظن أن الأرض تشع على هذا الجانب فقط، فالأرض تشع في كل مكان. إنها مجرد طريقة، إنها مجرد تصوير. لكن الآن يقودنا هذا إلى السؤال، ماذا يحدث عندما نضيف الغلاف الجوي مع الغازات الدفيئة؟ ماذا يعملون؟ حسنا، لديهم تأثير مثير للاهتمام\nعلى كل من الضوء الوارد والصادر. ولكن قبل أن ندخل في التفاصيل الجوهرية، دعونا نبالغ في التبسيط قليلاً حتى نتمكن من الحصول على فكرة الصورة الكبيرة لما يحدث بالفعل. ثم سنغوص في التفاصيل. الشيء المهم الذي يجب فهمه هو أن غازات الدفيئة\nحساسة في الغالب للأشعة تحت الحمراء. لذا فإن الضوء القادم من الشمس هو ضوء مرئي إلى حد كبير. ولذلك، فإن الغازات الدفيئة ليس لها أي تأثير تقريبًا، لذا لا يتغير شيء هنا. ومع ذلك، فإن الضوء الذي تشعه الأرض هو الأشعة تحت الحمراء. لماذا هذا؟ حسنًا، ذلك لأن الإشعاع الحراري يعتمد تمامًا على درجة الحرارة. في درجات حرارة منخفضة جدًا،\nمثل ما لدينا هنا، سيكون الإشعاع\nبالكامل تقريبًا تحت الحمراء. والآن الغازات الدفيئة، سوف تمتص هذه الإشعاعات الحرارية. وماذا يفعلون عندما يمتصون؟ حسنًا، تمامًا كما تمتص الذرة، يتم إثارة الإشعاع ومن ثم ستعيد إصداره، تمامًا مثل هذه الغازات الدفيئة\nستعيد إصدار هذه الإشعاعات، ولكن في جميع الاتجاهات،\nهذه هي الفكرة الأساسية.  وبالتالي فإن بعض الإشعاع\nسيعود إلى الفضاء كما كان من قبل، لكن بعض الإشعاع سيعود إلى الأرض. ونتيجة لذلك، انظر\nإلى ما حدث. وبسبب هذا،\nانخفض الإشعاع الصادر الآن، ونتيجة لذلك، لم يعد\nفي حالة توازن. الآن، الأرض والغلاف الجوي، يكتسب النظام بأكمله\nطاقة أكثر مما يفقده، وهكذا ستبدأ\nدرجة حرارة الكوكب في الارتفاع. ولكن مرة أخرى، هل سيستمر في\nالارتفاع إلى أجل غير مسمى؟ لا، تمامًا كما كان من قبل، مع\nارتفاع درجة الحرارة، ستبدأ الأرض في إشعاع\nالمزيد من الأشعة تحت الحمراء وفي النهاية عند\nدرجة حرارة معينة، ومرة ​​أخرى، سوف يساوي الإشعاع الصادر \nالإشعاع الوارد في الثانية، وسيكون لدينا توازن جديد، ولكن ذلك  التوازن الجديد سيكون عند درجة حرارة أعلى بكثير، ويصادف أن درجة الحرارة هذه\nستكون عند ما نحن فيه. وهذه هي الطريقة التي تعمل بها\nالغازات الدفيئة على تسخين الكرة الأرضية عن طريق محاصرة الأشعة تحت الحمراء. إذن هذه هي الطريقة التي تسبب بها ظاهرة الاحتباس الحراري، وهو أمر جيد لأننا نريد أن تكون أرضنا دافئة. لكن السؤال الكبير الآن هو: ماذا يحدث إذا أضفنا\nالمزيد من الغازات الدفيئة بسبب النشاط البشري؟ ماذا سيفعل ذلك؟ هل يؤثر بشكل كبير على\nالمناخ بعد الآن؟ حسنًا، للإجابة على هذا السؤال، علينا الآن أن نتعمق في التفاصيل. لذلك دعونا نفعل ذلك.  هناك بعض التفاصيل التي\nنريد التحدث عنها، أولًا، ما الذي يحدث بالفعل\nللإشعاع القادم؟ وكيف يتفاعل مع الجو؟ لماذا تمتص الغازات الدفيئة\nالأشعة تحت الحمراء في المقام الأول؟ وفي النهاية، سنحاول أن نفهم ما الذي سيحدث إذا قمنا بزيادة غازات الدفيئة، مثل ما كنا نفعله\nبسبب النشاط البشري. أول تبسيط قمنا به\nكان افتراض أن الضوء، كل الضوء الذي يصل إلى\nالأرض، يسخن الأرض. لكن هذا ليس صحيحًا على الإطلاق لأن الكثير من الضوء يتفاعل فعليًا مع الغلاف الجوي. ولمساعدتنا فقط على رؤية ذلك، هذا هو طيف ضوء الشمس، في الجزء العلوي من غلافنا الجوي، يمكنك أن ترى أنه يتبعه بشكل جيد، وهو قريب جدًا من\nطيف إشعاع الجسم الأسود الذي تحدثنا عنه في\nأحد مقاطع الفيديو السابقة. لذا يمكنك أن ترى أن هناك قدرًا كبيرًا من الضوء موجودًا في المنطقة المرئية. بعضها موجود في الأشعة فوق البنفسجية وبعضها موجود في\nمنطقة الأشعة تحت الحمراء أيضًا. لكن الآن دعونا نلقي نظرة على\nطيف الضوء الذي يصل في النهاية إلى الأرض.  هل انت مستعد؟  هنا يذهب. انظر إلى ذلك، إنه ليس نفس الطيف. هناك الكثير من الضوء\nالذي تم امتصاصه. لذلك دعونا ننظر إلى بعض منهم. أولًا، دعونا نلقي نظرة على الضوء الذي يتم امتصاصه في المنطقة المرئية. ومن يمتصها؟  أين هو ذاهب؟ حسنًا، معظم الضوء\nينثر في الواقع بواسطة غلافنا الجوي. وبسبب التشتت، يعود الكثير من الضوء إلى الفضاء، ولا يصل إلى الأرض. وبعض هذا الضوء\nيصل إلى الأرض، ولهذا نرى\nالسماء زرقاء. نرى السحب بيضاء اللون،\nكما أنها تشتت الضوء. لذا، يتم فقدان الكثير من الضوء\nفعليًا بسبب التشتت. الجزء الثاني الذي يمكننا رؤيته\nهو أن هناك الكثير من الضوء الذي يتم امتصاصه في منطقة الأشعة فوق البنفسجية. أي واحدة منها؟\nربما يمكنك تخمين ذلك. هذا هو الأوزون لدينا. يمتص الأوزون الكثير من\nالأشعة فوق البنفسجية ذات التردد العالي والطاقة العالية ويضمن عدم وصولها إلى\nالأرض، وهو أمر رائع، وإلا فسيكون ذلك سيئًا بالنسبة لنا. ومن ثم في منطقة الأشعة تحت الحمراء أيضًا، يمكنك رؤية حدوث الكثير من\nالامتصاصات الحادة. من يسبب ذلك؟  كل هذه\nهي غازات الدفيئة. قلنا أنهم حساسون للغاية ويمتصون الأشعة تحت الحمراء. حسنًا، يحتوي الضوء الوارد أيضًا على\nبعض الأشعة تحت الحمراء، ولذلك فهو يمتصها أيضًا. وانظر، لقد تم بالفعل امتصاص قدر كبير من الضوء\n، والذي لم يصل إلى الأرض. ولكن حتى هناك، لن يؤدي كل هذا\nالضوء إلى تدفئة الأرض لأن بعض الضوء سوف\nينعكس مرة أخرى إلى الفضاء بواسطة السحب نفسها. ولهذا السبب يمكنك رؤية\nالسحابة من الفضاء نفسه. ومن ثم بقية\nالضوء الذي يصل إلى الأرض، مرة أخرى،\nسوف ينعكس بعض هذا الضوء على سطح الأرض. السطح مغطى بالجليد أو الثلج، فهو عاكس للغاية. نقول أن هناك أسطح عالية البياض. لن تمتص الكثير من الضوء، بل ستعكس الكثير\nمن الضوء إلى الفضاء. حسنًا، ماذا عن الضوء المتبقي الذي يسقط على أسطح البياض المنخفضة الأقل انعكاسًا؟ وهناك، يتم امتصاصه.\nماذا يحدث هناك؟ حسنًا، حتى هناك، لا يتم استخدام كل ذلك\nفي تدفئة الأرض. فبعضه الذي يسقط على\nالماء مثلاً يستخدم في تبخير الماء. وهكذا يتم نقل الطاقة\nبعيدًا بواسطة الماء المتبخر. وبعضه مما يسقط على\nالخضرة يتم تركيبه ضوئياً ويتحول إلى طاقة كيميائية. وأخيرًا، بقية\nالضوء الذي يصل إلى الأرض، والذي لا يمتص، ولا\nينعكس، ولا يتشتت، والذي لا يتم تركيبه ضوئيًا، والذي لا يستخدم في التبخر، هو أخيرًا ذلك الجزء من\nالضوء الذي يسخن الأرض.  وهذه التفاصيل، كما سنرى،\nستكون مهمة بالنسبة لنا في فهم كيفية تغير المناخ. لكن على أية حال، بسبب\nدرجة حرارة الأرض، فإنها تصدر إشعاعًا حراريًا. وعند درجة الحرارة هذه، يكون الإشعاع الحراري في المقام الأول\nفي منطقة الأشعة تحت الحمراء. والآن، لو لم تكن هناك غازات دفيئة، لكان هذا قد هرب إلى\nالأرض، آسف، هرب إلى الفضاء، وكانت الأرض\nستبرد بسرعة كبيرة. لكن نظرًا لوجود غازات دفيئة، فإنها تمتص الكثير من هذه الإشعاعات، وليس جميعها، تذكر، أن\nالأمر كله يعتمد على الطول الموجي، فبعض الأطوال الموجية\nتفلت عائدة إلى الفضاء، لكن الكثير منها ستمتصه\nالغازات الدفيئة. وبعد ذلك عندما يعيدون إطلاقه، يتم \nإعادة توجيه الكثير منه إلى الأرض. وكما ناقشنا سابقًا، هذه هي الطريقة التي تعمل بها\nالغازات الدفيئة على تسخين الأرض. ولكن الآن يأتي السؤال الكبير. لماذا يمتصون الأشعة تحت الحمراء؟ ما الذي يميزهم؟ حسنًا، في الواقع\nلا يوجد شيء خاص بهم. إنه فقط لأنها\nمكونة من روابط مختلفة وهذه الروابط يمكن أن تهتز، يمكن لهذه الذرات أن تهتز بطرق مختلفة. على سبيل المثال، هذا هو جزيء الماء. فيما يلي بعض الطرق التي\nيمكن للجزيء أن يهتز بها، يمكنه أن يهتز عن طريق التمدد، ويمكن أن يهتز عن طريق التمدد\nبهذه الطريقة، بشكل غير متماثل، ويمكنه أيضًا أن يهتز عندما تنحني الروابط. وقد تبين أن\nالتردد المتذبذب لمعظم هذه الجزيئات يقع في منطقة الأشعة تحت الحمراء،\nوهو ما حدث بالفعل. وبالتالي، عندما يسقط عليهم ضوء\nبهذا التردد المحدد، الضوء الذي له تردد يساوي تردد الاهتزاز، \nفسوف يمتصونه ويهتز ويطلقون هذا الإشعاع في النهاية. لكن انتظر ثانية، انتظر ثانية. ماذا عن جزيئات الأكسجين والنيتروجين؟ حتى أنهم يجب أن يكونوا قادرين على التذبذب، أليس كذلك؟ لكن لماذا لا\nتجعلها الأشعة تحت الحمراء تهتز؟ اه، هذا هو الشيء.  تتكون جميع الموجات الكهرومغناطيسية\nمن مجالات كهربائية ومغناطيسية. وإذا كنت تريد\nالتفاعل مع هذه المجالات، فيجب أن يكون لديك نوع من الرسوم. ولكن أين هي الاتهامات في أي مكان؟ جميعها جزيئات محايدة، أليس كذلك؟ نعم، ولكن بسبب وجود الغازات الدفيئة، فإن هذه الجزيئات مكونة من ذرات، وتترابط ذرات مختلفة، ولا يتم تقاسم الإلكترونات فيما\nبينها بالتساوي. ونتيجة لذلك، سيكون\nلديهم بعض فصل الشحنة. على سبيل المثال، عندما يتعلق الأمر بالمياه، فإن الأكسجين يسحب الإلكترونات، والإلكترونات المشتركة أكثر تجاه نفسها مقارنة بالهيدروجين، وبالتالي فإن جانب الأكسجين سيكون له\nشحنة سالبة طفيفة مقارنة بالهيدروجين. نحن نسمي هذه الجزيئات ثنائيات القطب. الآن، في بعض الحالات، كما هو الحال\nفي جزيء الماء، يكون هذا تأثيرًا دائمًا. بينما في بعض\nالحالات الأخرى، كما هو الحال في الميثان أو ثاني أكسيد الكربون، يكون التأثير مؤقتًا ولا يظهر إلا أثناء الاهتزاز. لكن النقطة المهمة هي أنه نظرًا لوجود\nفصل للشحنات، فإنها يمكن أن تتفاعل، ويمكن للمجالات الكهربائية أن تتفاعل\nمع هذه الجزيئات، ولهذا السبب يمكنها\nامتصاص الأشعة تحت الحمراء. لكن جزيئات الأكسجين والنيتروجين مصنوعة من نفس الذرات. لذلك يتم مشاركة الإلكترونات بشكل متماثل تمامًا فيما بينها، وبالتالي لن\nيكون هناك أي فصل للشحنة، حتى عندما تهتز، ولهذا السبب لن يتمكنوا من مراقبة الأشعة تحت الحمراء ويمر عبرها مباشرة. ولهذا السبب فإن 99% من غلافنا الجوي لا يسبب ظاهرة الاحتباس الحراري. ولذا فإن ما أجده الآن\nرائعًا هو أن هذا يعني أن بعض\nالجزيئات الموجودة في غلافنا الجوي، أقل من 1% من الجزيئات لأنها تتقاسم\nالإلكترونات بشكل غير متماثل بين الذرات، هي في النهاية\nالمسؤولة عن ظاهرة الاحتباس الحراري. هذا غير واقعي إذا\nفكرت في ذلك.  يا إلهي. ولكن هذا هو ما هو عليه،\nأليس كذلك؟  كل شيء يتمحور عن هذا. وهذا يطرح أخيرًا السؤال، ماذا سيحدث إذا أضفنا\nالمزيد من الغازات الدفيئة؟ هذا ليس\nسيناريو افتراضيا على الإطلاق. منذ عصر التصنيع، هناك أدلة على\nزيادة تركيز غازات الدفيئة. إذن ما هو تأثير ذلك؟ حسنًا، للوهلة الأولى،\nتبدو الإجابة واضحة جدًا. إذا كان هناك المزيد من الغازات الدفيئة، فسيكون هناك المزيد من الامتصاص، ونتيجة لذلك،\nستسخن الأرض أكثر. ولكن السؤال هو كم؟ وفقط لإعطائك لمحة عن مدى تعقيد النظام وعدد المتغيرات المتضمنة، فكر في هذا. لنفترض أن الأرض تسخن قليلاً، ولكن نتيجة لهذا التسخين الطفيف الناتج عن الإضافة المباشرة\nلمزيد من البيوت الزجاجية، يمكن لبعض الجليد أن يذوب، مما يمكن أن يقلل من\nسطح البياض المرتفع الذي لدينا، ويمكن أن يؤدي ذلك الآن إلى زيادة الكمية  من ضوء الشمس الذي نمتصه، مما يزيد من\nدرجة حرارة الأرض. ويمكن أن يؤدي ذلك أيضًا إلى زيادة\nكمية التبخر التي تحدث، مما يزيد من\nكمية جزيئات الماء، ويزيد من كمية\nالغازات الدفيئة بشكل أكبر، مما سيؤدي إلى زيادة حرارة الأرض. ويمكن أن يكون هناك الآن تأثير هارب. إذن هل ترى ما أتحدث عنه؟ لا يؤدي التأثير الجامح إلى\nزيادة درجة حرارة الكوكب بشكل كبير فحسب، بل يمكنه أيضًا تغيير المناخات بشكل كبير. يمكن أن يغير نظامك البيئي بشكل كبير، الأمر الذي قد يكون كارثيًا. لذا فإن السؤال الكبير هو: في أي مستويات التركيز ستبدأ\nهذه التأثيرات الجامحة في الظهور؟ ولا أعتقد أننا يجب أن نحاول\nاكتشاف ذلك بالطريقة الصعبة. وبطبيعة الحال، من ناحية، ينبغي لنا أن نحاول القيام بأكبر قدر\nممكن من الحسابات النظرية. لكن في المقابل\nالوقاية خير علاج. ولهذا السبب يجب أن نحاول منع ذلك قدر الإمكان، ولهذا السبب نتحدث عن\nتقليل بصمتنا الكربونية.  هناك بعض الطرق للقيام بذلك والتي\nيمكن أن تكون الانتقال ببطء من حرق الوقود الأحفوري\nإلى استخدام الطاقة الشمسية وطاقة الرياح وبالطبع\nاستخدام الطاقة النووية.  هناك طرق أخرى يمكن أن\nتجعل وسائل النقل لدينا وعملياتنا الأخرى أكثر كفاءة. والآن، بالطبع، هناك\nالكثير من التحديات، الاقتصادية والتكنولوجية وحتى السياسية. ولذلك لا أعتقد أننا\nنستطيع حل هذه المشكلة بمجرد كوننا متطرفين هنا. علينا أن نكون أذكياء حيال ذلك. نحن بحاجة إلى إجراء\nمناقشات نقدية حول هذا الموضوع، لأننا في نهاية المطاف، نتحدث عن\nمستقبل جنسنا البشري.",
    "t_italian": "- [Istruttore] La temperatura della superficie della nostra Terra\n è vicina ai 15 gradi Celsius, gradevole, accogliente e calda per noi esseri viventi. Ma cosa ci tiene così al caldo? Beh, la mia risposta istintiva\nè che è il sole, giusto? Ma in realtà diventa più interessante. La nostra atmosfera contiene questi gas\nchiamati gas serra.  Non c'è niente di verde in loro, ok? Il nome è appena rimasto. E hanno qualcosa\nchiamato effetto serra sul nostro pianeta. E si scopre che se\nnon avessimo questi gas, anche con il sole che\nsplende così tanto, la temperatura sulla nostra\nTerra sarebbe molto inferiore a zero gradi Celsius. Quindi, insieme al sole,\ndobbiamo ringraziare i gas serra perché sono loro\nche riscaldano il nostro pianeta. Ma come fanno? Cos’è esattamente l’\neffetto serra?  Bene, scopriamolo. Cominciamo pensando a\nquale sarebbe la nostra temperatura se non ci fosse l'atmosfera\ne non ci fosse il sole, allora la Terra avrebbe\nla temperatura più fredda a cui possiamo pensare, molto\nvicina allo zero assoluto, ovvero -273 gradi Celsius. Ma ora se metti il ​​sole, la luce che splende sulla Terra\nviene assorbita dalla Terra, l'energia della luce viene convertita in energia termica, e ora la Terra inizierà a riscaldarsi. Ma questo significa forse che la sua\ntemperatura continuerà ad aumentare indefinitamente perché\nc’è una luce continua che splende sulla Terra? No, perché ogni oggetto che ha una certa temperatura\ninizierà a irradiare luce. Chiamiamo questa radiazione termica e in questo modo inizia a perdere energia, ma a temperature molto basse. La radiazione termica non è molta. Quindi la Terra non perde\nmolta energia al secondo. Sta ancora guadagnando molta\npiù energia al secondo, il che significa che la sua temperatura\ncontinuerà ad aumentare per un po' di tempo, ma man mano che la sua temperatura aumenta, inizierà a perdere ancora più\nenergia a causa della radiazione termica. Quindi puoi vedere dove\nstai andando, ad una temperatura particolare, la radiazione termica della Terra\nsarà così alta che l'energia persa sarà esattamente uguale all'energia guadagnata, e ora avremo l'equilibrio termico, la temperatura non cambierà  aumento più lungo. E comunque, questa\nsarebbe la temperatura media perché il lato rivolto verso\nil sole sarebbe molto più caldo, e il lato lontano dal\nsole sarebbe molto più freddo, il lato rotante, quindi è un sistema dinamico, ma in media,  quella\ntemperatura sarà molto, molto bassa senza atmosfera. E comunque, non pensare che la Terra si irradi solo da questo lato, la Terra si irradia tutt'intorno. È solo un modo, è solo una rappresentazione. Ma ora questo ci porta alla domanda: cosa succede quando aggiungiamo un’atmosfera insieme ai gas serra? Cosa fanno? Bene, hanno effetti molto interessanti\nsia sulla luce in entrata che su quella in uscita. Ma prima di entrare nel nocciolo della questione, semplifichiamo un po' in modo da poter avere un'idea generale di ciò che sta realmente accadendo. Poi entreremo nei dettagli. La cosa importante da capire è che i gas serra\nsono per lo più sensibili alla radiazione infrarossa. Quindi la luce in arrivo dal sole è praticamente luce visibile. Pertanto, i gas serra non hanno praticamente alcun effetto su di esso, quindi qui non cambia nulla. Tuttavia, la luce irradiata dalla Terra è radiazione infrarossa. Perché? Ebbene, questo perché la radiazione termica dipende esclusivamente dalla temperatura. A temperature molto basse,\ncome quelle che abbiamo qui, la radiazione sarebbe\npraticamente tutta infrarossa. E ora i gas serra assorbiranno queste radiazioni termiche. E cosa fanno quando assorbono? Beh, proprio come un atomo assorbe, la radiazione si eccita e poi la riemette, proprio così, questi gas serra\nriemettono queste radiazioni, ma in tutte le direzioni,\nquesta è l'idea chiave. E quindi una parte della radiazione\ntornerà nello spazio come prima, ma una parte della radiazione tornerà sulla Terra. E di conseguenza, guarda\ncosa è successo. Per questo motivo la radiazione in uscita\nora si è ridotta e di conseguenza non è\npiù in equilibrio. Adesso la Terra e l'atmosfera, l'intero sistema stanno guadagnando\npiù energia di quanta ne perdono, ed è così che la\ntemperatura del pianeta inizierà ad aumentare. Ma ancora una volta, continuerà a\ncrescere indefinitamente? No, proprio come prima, man mano che\nla temperatura aumenta, la Terra inizierà a irradiare\nancora più radiazioni infrarosse e alla fine, ad una\ntemperatura particolare, ancora una volta, la radiazione in uscita sarà uguale alla radiazione in entrata\nal secondo, e avremo un nuovo equilibrio, ma quello  il nuovo equilibrio sarà a una temperatura molto più alta, e quella temperatura sembra\nessere quella in cui ci troviamo noi. Ed è così che i\ngas serra riscaldano il globo intrappolando la radiazione infrarossa. Ecco perché causano il riscaldamento globale, il che è positivo perché vogliamo che la nostra Terra sia calda. Ma ora la grande domanda è: cosa succede se aggiungiamo\nancora più gas serra dovuti alle attività umane? Cosa farà? \nInfluisce più in modo significativo sul clima? Ebbene, per rispondere a questa domanda, dobbiamo ora entrare nei dettagli. Quindi facciamolo. Un paio di dettagli di cui\nvogliamo parlare sono, prima di tutto, cosa succede realmente\nalle radiazioni in arrivo? Come interagisce con l'atmosfera?  Innanzitutto perché i gas serra\nassorbono la radiazione infrarossa ? E infine, cercheremo di capire cosa accadrebbe se aumentassimo i gas serra, come stiamo facendo a\ncausa dell'attività umana. La nostra prima semplificazione eccessiva\nè stata quella di presupporre che la luce, tutta la luce che raggiunge\nla Terra, riscaldi la Terra. Ma questo non è affatto vero perché molta luce interagisce effettivamente con l'atmosfera. E giusto per aiutarci a vederlo, ecco lo spettro della luce solare, nella parte superiore della nostra atmosfera potete vedere che segue bene, è molto vicino allo\nspettro della radiazione del corpo nero di cui abbiamo parlato in\nuno dei nostri video precedenti. Quindi puoi vedere che molta luce è nella regione visibile. Una parte si trova nella regione degli UV e un'altra parte si trova\nanche nella regione dell'infrarosso. Ma ora diamo un'occhiata\nallo spettro della luce che eventualmente raggiunge il suolo. Sei pronto?  Ecco qui. Guarda, non è lo stesso spettro. C'è molta luce\nche è stata assorbita. Quindi diamo un'occhiata ad alcuni di essi. Prima di tutto, osserviamo la luce che viene assorbita nella regione visibile. Chi lo sta assorbendo?  Dove sta andando? Bene, la maggior parte della luce\nviene effettivamente diffusa dalla nostra atmosfera. E a causa della dispersione, molta luce ritorna nello spazio, senza però raggiungere il suolo. E parte di quella luce\nraggiunge il suolo, motivo per cui vediamo\nil cielo essere blu. Vediamo che le nuvole sono bianche, ma\ndiffondono anche la luce. Quindi molta luce viene\neffettivamente persa a causa della dispersione. La seconda cosa che possiamo vedere\nè che c'è molta luce che viene assorbita nella regione UV. Quale è quello?\nProbabilmente puoi indovinarlo. Questo è il nostro ozono. L'ozono assorbe molta\nluce UV ad alta frequenza e ad alta energia e garantisce che non raggiunga\nil suolo, il che è fantastico, altrimenti sarebbe dannoso per noi. E poi anche nella regione degli infrarossi potete vedere molti forti\nassorbimenti. Chi lo sta causando?  Tutti questi\nsono i gas serra. Abbiamo detto che sono molto sensibili e assorbono la radiazione infrarossa. Ebbene, la luce in arrivo\ncontiene anche alcune radiazioni infrarosse, quindi assorbono anche quelle. E quindi guarda,\nè già stata assorbita molta luce, che non è arrivata al suolo. Ma anche lì, non tutta quella\nluce riscalderà la Terra perché parte della luce\nverrà riflessa nello spazio dalle nuvole stesse. Ed è per questo che puoi vedere\nla nuvola dallo spazio stesso. E poi, del resto della\nluce che raggiunge il suolo, parte di quella\nluce verrà riflessa dalla superficie terrestre. La superficie è ricoperta di ghiaccio o neve, sono altamente riflettenti. Diciamo che ci sono superfici ad albedo elevato. Non assorbiranno molta luce, rifletteranno semplicemente molta\nluce nello spazio. Ok, che dire della luce rimanente che cade sulle superfici a bassa albedo che sono meno riflettenti? Lì viene assorbito.\nCosa succede lì? Ebbene, anche lì, non tutto viene utilizzato\nper riscaldare la Terra. Una parte di ciò che cade\nsull'acqua, ad esempio, viene utilizzata per far evaporare l'acqua. E così l'energia viene portata\nvia dall'acqua che evapora. Una parte di essa che cade sul\nverde viene fotosintetizzata e convertita in energia chimica. E infine, il resto della\nluce che raggiunge il suolo, che non viene assorbita, non\nriflessa, non dispersa, che non viene fotosintetizzata, che non viene utilizzata nell'evaporazione, è infine quella porzione di\nluce che riscalda la Terra. Questo dettaglio, come vedremo,\nsarà per noi importante per capire come il clima potrebbe cambiare. Ma comunque, a causa\ndella temperatura terrestre, emette radiazioni termiche. E a questa temperatura, la radiazione termica si trova principalmente\nnella regione degli infrarossi. E ora se non ci fossero stati i gas serra, questi sarebbero fuggiti sulla\nTerra, scusate, sarebbero fuggiti nello spazio, e la Terra si sarebbe\nraffreddata abbastanza rapidamente. Ma poiché abbiamo gas serra, assorbono molte di queste radiazioni, non tutte, ricordate,\ndipende tutto dalla lunghezza d'onda, alcune lunghezze d'onda\nsfuggono nello spazio, ma molte di queste verranno\nassorbite dai gas serra. E poi quando lo riemettono, gran parte di esso viene effettivamente\nreindirizzato sulla Terra. E come abbiamo discusso in precedenza, è sostanzialmente così che i\ngas serra riscaldano la Terra. Ma ora arriva la grande domanda. Perché assorbono la radiazione infrarossa? Cosa hanno di così speciale? Beh, in realtà\nnon c'è niente di speciale in loro. È solo che, poiché sono\ncostituiti da legami diversi e questi legami possono vibrare, questi atomi possono oscillare in modi diversi. Ad esempio, questa è una molecola d'acqua. Ecco alcuni modi in cui\nla molecola può oscillare, può oscillare allungandosi, può oscillare allungandosi in\nquesto modo, in modo asimmetrico, può anche oscillare quando i legami si piegano. E si scopre che\nla frequenza di oscillazione della maggior parte di queste molecole si trova nella regione dell'infrarosso, guarda caso\nè proprio quella. E quindi, quando la luce\ndi quella frequenza specifica, la luce che ha la frequenza uguale alla frequenza di oscillazione, cade su di loro,\nla assorbiranno, si muoveranno e alla fine rilasceranno quella radiazione. Ma aspetta un secondo, aspetta un secondo.  E le molecole di ossigeno e azoto? Anche loro dovrebbero essere in grado di muoversi, giusto? Ma perché la radiazione infrarossa non\nli fa muovere? Ah, ecco il punto. Tutte le onde elettromagnetiche\nsono costituite da campi elettrici e magnetici. E se vuoi\ninteragire con questi campi, devi avere qualche tipo di addebito. Ma dove sono le accuse? Sono tutte molecole neutre, giusto? Sì, ma poiché i gas serra sono, queste molecole sono fatte di atomi, atomi diversi legati, gli elettroni non sono condivisi\nequamente tra loro. Di conseguenza,\navranno una certa separazione di carica. Ad esempio, quando si tratta di acqua, l' ossigeno attira gli elettroni, gli elettroni condivisi più verso se stesso rispetto all'idrogeno, e quindi hanno, il lato dell'ossigeno avrà una\nleggera carica negativa rispetto all'idrogeno. Chiamiamo tali molecole dipoli. Ora, in alcuni casi, come\nnella molecola dell'acqua, questo è un effetto permanente. Mentre in altri\ncasi, come nel caso del metano o dell'anidride carbonica, l'effetto è temporaneo e si manifesta solo dimenandosi. Ma il punto è che, poiché c'è una\nseparazione di carica, possono interagire, i campi elettrici possono interagire\ncon queste molecole, ed è per questo che possono\nassorbire la radiazione infrarossa. Ma le molecole di ossigeno e azoto sono costituite dagli stessi atomi. Quindi gli elettroni sono condivisi in modo perfettamente simmetrico tra loro, e quindi non\navranno alcuna separazione di carica, anche quando oscillano, ed è per questo che non saranno in grado di osservare la radiazione infrarossa e questa passerà direttamente attraverso. Ecco perché il 99% della nostra atmosfera non provoca l’effetto serra. E quindi quello che trovo\naffascinante è che questo significa che alcune delle\nmolecole nella nostra atmosfera, meno dell'1% delle molecole perché condividono gli\nelettroni in modo asimmetrico tra gli atomi, sono alla fine\nresponsabili del riscaldamento globale. È irreale se ci\npensi.  Dio mio. Ma è proprio questo,\nvero?  Tutto si riduce a questo. Ciò solleva infine la domanda: cosa accadrebbe se aggiungessimo\nancora più gas serra? Questo non è\naffatto uno scenario ipotetico. A partire dall’industrializzazione, è dimostrato che la concentrazione di gas serra\nè aumentata. Allora qual è l'effetto di ciò? Beh, a prima vista, la risposta\nsembra abbastanza ovvia. Se ci fossero più gas serra, ci sarà un maggiore assorbimento e, di conseguenza, la Terra si\nriscalderà ancora di più. Ma la domanda è: quanto? E giusto per darvi un'idea di quanto sia complicato il sistema e di quante variabili siano coinvolte, pensate a questo. Diciamo che la Terra si riscalda leggermente, ma come risultato di quel leggero riscaldamento dovuto all'aggiunta diretta\ndi più serre, parte del ghiaccio può sciogliersi, il che può ridurre l'elevata\nsuperficie di albedo che abbiamo, e che ora potrebbe aumentare la quantità  di luce solare che assorbiamo, aumentando ulteriormente la\ntemperatura della Terra. Ciò potrebbe anche aumentare\nla quantità di evaporazione che avviene, aumentando la\nquantità di molecole d’acqua, aumentando\nancora di più la quantità di gas serra, che riscalderanno ulteriormente la Terra. E ora può esserci un effetto fuori controllo. Quindi capisci di cosa sto parlando? L’effetto fuori controllo non solo\npuò aumentare drasticamente la temperatura del pianeta, ma può cambiare radicalmente il clima. Può cambiare radicalmente il tuo ecosistema, il che potrebbe essere catastrofico. Quindi la grande domanda sarebbe: a quali livelli di concentrazione\nquesti effetti galoppanti inizieranno a manifestarsi? E non penso che dovremmo\ncercare di scoprirlo nel modo più duro. Naturalmente, da un lato, dovremmo cercare di fare quanti più\ncalcoli teorici possibile. Ma d’altronde la\nprevenzione è la cura migliore. Ed è per questo che dovremmo cercare di prevenirlo il più possibile ed è per questo che parliamo di\nridurre la nostra impronta di carbonio. Alcuni modi per farlo\npotrebbero essere la transizione lenta dal consumo di combustibili fossili all’utilizzo\ndell’energia solare, dell’energia eolica e, naturalmente,\ndell’energia nucleare. Altri modi potrebbero\nrendere i nostri trasporti e gli altri processi più efficienti. Ora, ovviamente, ci sono\ntantissime sfide, economiche, tecnologiche e persino politiche. E quindi non penso che\npossiamo risolvere questo problema semplicemente essendo estremisti qui. Dobbiamo essere intelligenti al riguardo. Dobbiamo avviare\ndibattiti critici al riguardo, perché in fin dei conti stiamo parlando del\nfuturo della nostra specie."
}